{"alquran":{"no":10,"name":"Yunus","arab":"يونس","start":1364,"count":109,"rukku":11,"type":"mecca","description":"Surat Yunus terdiri atas 109 ayat, termasuk golongan surat-surat Makkiyyah kecuali ayat 40, 94, 95, yang diturunkan pada masa Nabi Muhmmad s.a.w. berada di Madinah. Surat ini dinamai <i>surat Yunus</i> karena dalam surat ini terutama ditampilkan kisah Nabi Yunus a.s. dan pengikut-pengikutnya yang teguh imannya."},"surah":[{"no":1,"arab":" الر ۚ تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ","latin":"alif-laam-raa tilka aayaatu alkitaabi alhakiimi","translate":{"id":"Alif laam raa . Inilah ayat-ayat Al Qur'an yang mengandung hikmah.\n","en":"Alif Lam. Ra. THESE ARE MESSAGES of the divine writ, full of wisdom."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1365","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1365.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1365.mp3"]}},{"no":2,"arab":"أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَا إِلَىٰ رَجُلٍ مِنْهُمْ أَنْ أَنْذِرِ النَّاسَ وَبَشِّرِ الَّذِينَ آمَنُوا أَنَّ لَهُمْ قَدَمَ صِدْقٍ عِنْدَ رَبِّهِمْ ۗ قَالَ الْكَافِرُونَ إِنَّ هَٰذَا لَسَاحِرٌ مُبِينٌ","latin":"akaana lilnnaasi 'ajaban an awhaynaa ilaa rajulin minhum an andziri alnnaasa wabasysyiri alladziina aamanuu anna lahum qadama shidqin 'inda rabbihim qaala alkaafiruuna inna haadzaa lasaahirun mubiinun","translate":{"id":"Patutkah menjadi keheranan bagi manusia bahwa Kami mewahyukan kepada seorang laki-laki di antara mereka: \"Berilah peringatan kepada manusia dan gembirakanlah orang-orang beriman bahwa mereka mempunyai kedudukan yang tinggi di sisi Tuhan mereka\". Orang-orang kafir berkata: \"Sesungguhnya orang ini (Muhammad) benar-benar adalah tukang sihir yang nyata\".\n","en":"Do people deem it strange that We should have inspired a man from their own midst [with this Our message]: \"Warn all mankind, and give unto those who have attained to faith the glad tiding that in their Sustainer's sight they surpass all others in that they are completely sincere-? [Only] they who deny the truth say, \"Behold. he is clearly but a spellbinder!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1366","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1366.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1366.mp3"]}},{"no":3,"arab":"إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ يُدَبِّرُ الْأَمْرَ ۖ مَا مِنْ شَفِيعٍ إِلَّا مِنْ بَعْدِ إِذْنِهِ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ فَاعْبُدُوهُ ۚ أَفَلَا تَذَكَّرُونَ","latin":"inna rabbakumu allaahu alladzii khalaqa alssamaawaati waal-ardha fii sittati ayyaamin tsumma istawaa 'alaa al'arsyi yudabbiru al-amra maa min syafii'in illaa min ba'di idznihi dzaalikumu allaahu rabbukum fau'buduuhu afalaa tadzakkaruuna","translate":{"id":"Sesungguhnya Tuhan kamu ialah Allah Yang menciptakan langit dan bumi dalam enam masa, kemudian Dia bersemayam di atas 'Arsy untuk mengatur segala urusan. Tiada seorangpun yang akan memberi syafa'at kecuali sesudah ada izin-Nya. (Dzat) yang demikian itulah Allah, Tuhan kamu, maka sembahlah Dia.Maka apakah kamu tidak mengambil pelajaran?\n","en":"VERILY, your Sustainer is God, who has created the heavens and the earth in six aeons, and is established on the throne of His almightiness, governing all that exists. There is none that could intercede with Him unless He grants leave therefor. Thus is God, your Sustainer: worship, therefore, Him [alone]: will you not, then, keep this in mind?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1367","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1367.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1367.mp3"]}},{"no":4,"arab":"إِلَيْهِ مَرْجِعُكُمْ جَمِيعًا ۖ وَعْدَ اللَّهِ حَقًّا ۚ إِنَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ لِيَجْزِيَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ بِالْقِسْطِ ۚ وَالَّذِينَ كَفَرُوا لَهُمْ شَرَابٌ مِنْ حَمِيمٍ وَعَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْفُرُونَ","latin":"ilayhi marji'ukum jamii'an wa'da allaahi haqqan innahu yabdau alkhalqa tsumma yu'iiduhu liyajziya alladziina aamanuu wa'amiluu alshshaalihaati bialqisthi waalladziina kafaruu lahum syaraabun min hamiimin wa'adzaabun aliimun bimaa kaanuu yakfuruuna","translate":{"id":"Hanya kepadaNyalah kamu semuanya akan kembali; sebagai janji yang benar daripada Allah, sesungguhnya Allah menciptakan makhluk pada permulaannya kemudian mengulanginya (menghidupkannya) kembali (sesudah berbangkit), agar Dia memberi pembalasan kepada orang-orang yang beriman dan yang mengerjakan amal saleh dengan adil. Dan untuk orang-orang kafir disediakan minuman air yang panas dan azab yang pedih disebabkan kekafiran mereka.\n","en":"Unto Him you all must return: this is, in truth, God's promise-for, behold, He creates [man] in the first instance, and then brings him forth anew to the end that He may reward with equity all who attain to faith and do righteous deeds; whereas for those who are bent on denying the truth there is in store a draught of burning despair and grievous suffering because of their persistent refusal to acknowledge the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1368","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1368.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1368.mp3"]}},{"no":5,"arab":"هُوَ الَّذِي جَعَلَ الشَّمْسَ ضِيَاءً وَالْقَمَرَ نُورًا وَقَدَّرَهُ مَنَازِلَ لِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ مَا خَلَقَ اللَّهُ ذَٰلِكَ إِلَّا بِالْحَقِّ ۚ يُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ","latin":"huwa alladzii ja'ala alsysyamsa dhiyaa-an waalqamara nuuran waqaddarahu manaazila lita'lamuu 'adada alssiniina waalhisaaba maa khalaqa allaahu dzaalika illaa bialhaqqi yufashshilu al-aayaati liqawmin ya'lamuuna","translate":{"id":"Dia-lah yang menjadikan matahari bersinar dan bulan bercahaya dan ditetapkan-Nya manzilah-manzilah (tempat-tempat) bagi perjalanan bulan itu, supaya kamu mengetahui bilangan tahun dan perhitungan (waktu). Allah tidak menciptakan yang demikian itu melainkan dengan hak . Dia menjelaskan tanda-tanda (kebesaran-Nya) kepada orang-orang yang mengetahui.\n","en":"He it is who has made the sun a [source of] radiant light and the moon a light [reflected], and has determined for it phases so that you might know how to compute the years and to measure [time]. None of this has God created without [an inner] truth. Clearly does He spell out these messages unto people of [innate] knowledge:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1369","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1369.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1369.mp3"]}},{"no":6,"arab":"إِنَّ فِي اخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا خَلَقَ اللَّهُ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِقَوْمٍ يَتَّقُونَ","latin":"inna fii ikhtilaafi allayli waalnnahaari wamaa khalaqa allaahu fii alssamaawaati waal-ardhi laaayaatin liqawmin yattaquuna","translate":{"id":"Sesungguhnya pada pertukaran malam dan siang itu dan pada apa yang diciptakan Allah di langit dan di bumi, benar-benar terdapat tanda-tanda (kekuasaan-Nya) bagi orang- orang yang bertakwa.\n","en":"for, verily, in the alternating of night and day, and in all that God has created in the heavens and on earth there are messages indeed for people who are conscious of Him!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1370","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1370.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1370.mp3"]}},{"no":7,"arab":"إِنَّ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا وَرَضُوا بِالْحَيَاةِ الدُّنْيَا وَاطْمَأَنُّوا بِهَا وَالَّذِينَ هُمْ عَنْ آيَاتِنَا غَافِلُونَ","latin":"inna alladziina laa yarjuuna liqaa-anaa waradhuu bialhayaati alddunyaa waithma-annuu bihaa waalladziina hum 'an aayaatinaa ghaafiluuna","translate":{"id":"Sesungguhnya orang-orang yang tidak mengharapkan (tidak percaya akan) pertemuan dengan Kami, dan merasa puas dengan kehidupan dunia serta merasa tenteram dengan kehidupan itu dan orang-orang yang melalaikan ayat-ayat Kami,\n","en":"Verily, as for those who do not believe that they are destined to meet Us, but content themselves with the life of this world and do not look beyond it, and are heedless of Our messages -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1371","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1371.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1371.mp3"]}},{"no":8,"arab":"أُولَٰئِكَ مَأْوَاهُمُ النَّارُ بِمَا كَانُوا يَكْسِبُونَ","latin":"ulaa-ika ma/waahumu alnnaaru bimaa kaanuu yaksibuuna","translate":{"id":"mereka itu tempatnya ialah neraka, disebabkan apa yang selalu mereka kerjakan.\n","en":"their goal is the fire in return for all [the evil] that they were wont to do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1372","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1372.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1372.mp3"]}},{"no":9,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ يَهْدِيهِمْ رَبُّهُمْ بِإِيمَانِهِمْ ۖ تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهَارُ فِي جَنَّاتِ النَّعِيمِ","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati yahdiihim rabbuhum bi-iimaanihim tajrii min tahtihimu al-anhaaru fii jannaati alnna'iimi","translate":{"id":"Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh, mereka diberi petunjuk oleh Tuhan mereka karena keimanannya , di bawah mereka mengalir sungai-sungai di dalam syurga yang penuh keni'matan.\n","en":"[But,] verily, as for those who have attained to faith and do righteous deeds - their Sustainer guides them aright by means of their faith. [In the life to come,] running waters will flow at their feet in gardens of bliss;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1373","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1373.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1373.mp3"]}},{"no":10,"arab":"دَعْوَاهُمْ فِيهَا سُبْحَانَكَ اللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلَامٌ ۚ وَآخِرُ دَعْوَاهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"da'waahum fiihaa subhaanaka allaahumma watahiyyatuhum fiihaa salaamun waaakhiru da'waahum ani alhamdu lillaahi rabbi al'aalamiina","translate":{"id":"Do'a mereka di dalamnya ialah: \"Subhanakallahumma\" , dan salam penghormatan mereka ialah: \"Salam\" . Dan penutup do'a mereka ialah: \"Alhamdulilaahi Rabbil 'aalamin .\n","en":"[and] in that [state of happiness] they will call out, \"Limitless art Thou in Thy glory, O God!\"-and will be answered with the greeting, \"Peace!\" And their call will close with [the words], \"All praise is due to God, the Sustainer of all the worlds!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1374","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1374.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1374.mp3"]}},{"no":11,"arab":"وَلَوْ يُعَجِّلُ اللَّهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُمْ بِالْخَيْرِ لَقُضِيَ إِلَيْهِمْ أَجَلُهُمْ ۖ فَنَذَرُ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا فِي طُغْيَانِهِمْ يَعْمَهُونَ","latin":"walaw yu'ajjilu allaahu lilnnaasi alsysyarra isti'jaalahum bialkhayri laqudhiya ilayhim ajaluhum fanadzaru alladziina laa yarjuuna liqaa-anaa fii thughyaanihim ya'mahuuna","translate":{"id":"Dan kalau sekiranya Allah menyegerakan kejahatan bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pastilah diakhiri umur mereka. Maka Kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan Kami, bergelimangan di dalam kesesatan mereka.\n","en":"NOW IF GOD were to hasten for human beings the ill [which they deserve by their sinning] in the same manner as they [themselves] would hasten [the coming to them of what they consider to be] good, their end would indeed come forthwith! But We leave them alone [for a while] -all those who do not believe that they are destined to meet Us: [We leave them alone] in their overweening arrogance, blindly stumbling to and fro."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1375","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1375.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1375.mp3"]}},{"no":12,"arab":"وَإِذَا مَسَّ الْإِنْسَانَ الضُّرُّ دَعَانَا لِجَنْبِهِ أَوْ قَاعِدًا أَوْ قَائِمًا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُ مَرَّ كَأَنْ لَمْ يَدْعُنَا إِلَىٰ ضُرٍّ مَسَّهُ ۚ كَذَٰلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُوا يَعْمَلُونَ","latin":"wa-idzaa massa al-insaana aldhdhurru da'aanaa lijanbihi aw qaa'idan aw qaa-iman falammaa kasyafnaa 'anhu dhurrahu marra ka-an lam yad'unaa ilaa dhurrin massahu kadzaalika zuyyina lilmusrifiina maa kaanuu ya'maluuna","translate":{"id":"Dan apabila manusia ditimpa bahaya dia berdo'a kepada Kami dalam keadaan berbaring, duduk atau berdiri, tetapi setelah Kami hilangkan bahaya itu daripadanya, dia (kembali) melalui (jalannya yang sesat), seolah-olah dia tidak pernah berdo'a kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya. Begitulah orang-orang yang melampaui batas itu memandang baik apa yang selalu mereka kerjakan.\n","en":"For [thus it is:] when affliction befalls man, he cries out unto Us, whether he be lying on his side or sitting or standing; but as soon as We have freed him of his affliction, he goes on as though he had never invoked Us to save him from the affliction that befell him! Thus do their own doings seem goodly unto those who waste their own selves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1376","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1376.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1376.mp3"]}},{"no":13,"arab":"وَلَقَدْ أَهْلَكْنَا الْقُرُونَ مِنْ قَبْلِكُمْ لَمَّا ظَلَمُوا ۙ وَجَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ وَمَا كَانُوا لِيُؤْمِنُوا ۚ كَذَٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ","latin":"walaqad ahlaknaa alquruuna min qablikum lammaa zhalamuu wajaa-at-hum rusuluhum bialbayyinaati wamaa kaanuu liyu/minuu kadzaalika najzii alqawma almujrimiina","translate":{"id":"Dan sesungguhnya Kami telah membinasakan umat-umat sebelum kamu, ketika mereka berbuat kezaliman, padahal rasul-rasul mereka telah datang kepada mereka dengan membawa keterangan-keterangan yang nyata, tetapi mereka sekali-kali tidak hendak beriman. Demikianlah Kami memberi pembalasan kepada orang-orang yang berbuat dosa.\n","en":"And, indeed, We destroyed before your time [whole] generations when they [persistently] did evil although the apostles sent unto them brought them all evidence of the truth; for they refused to believe [them]. Thus do We requite people who are lost in sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1377","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1377.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1377.mp3"]}},{"no":14,"arab":"ثُمَّ جَعَلْنَاكُمْ خَلَائِفَ فِي الْأَرْضِ مِنْ بَعْدِهِمْ لِنَنْظُرَ كَيْفَ تَعْمَلُونَ","latin":"tsumma ja'alnaakum khalaa-ifa fii al-ardhi min ba'dihim linanzhura kayfa ta'maluuna","translate":{"id":"Kemudian Kami jadikan kamu pengganti-pengganti (mereka) di muka bumi sesudah mereka, supaya Kami memperhatikan bagaimana kamu berbuat.\n","en":"And thereupon We made you their successors on earth, so that We might behold how you act."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1378","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1378.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1378.mp3"]}},{"no":15,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ ۙ قَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا ائْتِ بِقُرْآنٍ غَيْرِ هَٰذَا أَوْ بَدِّلْهُ ۚ قُلْ مَا يَكُونُ لِي أَنْ أُبَدِّلَهُ مِنْ تِلْقَاءِ نَفْسِي ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ ۖ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa bayyinaatin qaala alladziina laa yarjuuna liqaa-anaa i/ti biqur-aanin ghayri haadzaa aw baddilhu qul maa yakuunu lii an ubaddilahu min tilqaa-i nafsii in attabi'u illaa maa yuuhaa ilayya innii akhaafu in 'ashaytu rabbii 'adzaaba yawmin 'azhiimin","translate":{"id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami yang nyata, orang-orang yang tidak mengharapkan pertemuan dengan Kami berkata: \"Datangkanlah Al Qur'an yang lain dari ini atau gantilah dia \". Katakanlah: \"Tidaklah patut bagiku menggantinya dari pihak diriku sendiri. Aku tidak mengikut kecuali apa yang diwahyukan kepadaku. Sesungguhnya aku takut jika mendurhakai Tuhanku kepada siksa hari yang besar (kiamat)\".\n","en":"AND [thus it is:] whenever Our messages are conveyed unto them in all their clarity, those who do not believe that they are destined to meet Us [are wont to] say, \"Bring us a discourse other than this, or alter this one.” Say [O Prophet]: \"It is not conceivable that I should alter it of my own volition; I only follow what is revealed to me. Behold, I would dread, were I [thus] to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1379","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1379.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1379.mp3"]}},{"no":16,"arab":"قُلْ لَوْ شَاءَ اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلَا أَدْرَاكُمْ بِهِ ۖ فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا مِنْ قَبْلِهِ ۚ أَفَلَا تَعْقِلُونَ","latin":"qul law syaa-a allaahu maa talawtuhu 'alaykum walaa adraakum bihi faqad labitstu fiikum 'umuran min qablihi afalaa ta'qiluuna","translate":{"id":"Katakanlah: \"Jikalau Allah menghendaki, niscaya aku tidak membacakannya kepadamu dan Allah tidak (pula) memberitahukannya kepadamu\". Sesungguhnya aku telah tinggal bersamamu beberapa lama sebelumnya . Maka apakah kamu tidak memikirkannya?\n","en":"Say: \"Had God willed it [otherwise], I would not have conveyed this [divine writ] unto you, nor would He have brought it to your knowledge. Indeed. a whole lifetime have I dwelt among you ere this [revelation came unto me]: will you not, then, use your reason?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1380","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1380.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1380.mp3"]}},{"no":17,"arab":"فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۚ إِنَّهُ لَا يُفْلِحُ الْمُجْرِمُونَ","latin":"faman azhlamu mimmani iftaraa 'alaa allaahi kadziban aw kadzdzaba bi-aayaatihi innahu laa yuflihu almujrimuuna","translate":{"id":"Maka siapakah yang lebih zalim daripada orang yang mengada-adakan kedustaan terhadap Allah atau mendustakan ayat-ayatNya? Sesungguhnya, tiadalah beruntung orang-orang yang berbuat dosa.\n","en":"And who could be more wicked than they who attribute their own lying inventions to God or give the lie to His messages? Verily, those who are lost in sin will never attain to a happy state -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1381","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1381.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1381.mp3"]}},{"no":18,"arab":"وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِنْدَ اللَّهِ ۚ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","latin":"waya'buduuna min duuni allaahi maa laa yadhurruhum walaa yanfa'uhum wayaquuluuna haaulaa-i syufa'aaunaa 'inda allaahi qul atunabbi-uuna allaaha bimaa laa ya'lamu fii alssamaawaati walaa fii al-ardhi subhaanahu wata'aalaa 'ammaa yusyrikuuna","translate":{"id":"Dan mereka menyembah selain daripada Allah apa yang tidak dapat mendatangkan kemudharatan kepada mereka dan tidak (pula) kemanfa'atan, dan mereka berkata: \"Mereka itu adalah pemberi syafa'at kepada kami di sisi Allah\". Katakanlah: \"Apakah kamu mengabarkan kepada Allah apa yang tidak diketahui-Nya baik di langit dan tidak (pula) dibumi ?\" Maha Suci Allah dan Maha Tinggi dan apa yang mereka mempersekutukan (itu).\n","en":"and [neither will] they [who] worship, side by side with God, things or beings that can neither harm nor benefit them, saying [to themselves], \"These are our intercessors with God!\" Say: \"Do you [think that you could] inform God of anything in the heavens or on earth that He does not know? Limitless is He in His glory, and sublimely exalted above anything to which men may ascribe a share in His divinity!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1382","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1382.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1382.mp3"]}},{"no":19,"arab":"وَمَا كَانَ النَّاسُ إِلَّا أُمَّةً وَاحِدَةً فَاخْتَلَفُوا ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ فِيمَا فِيهِ يَخْتَلِفُونَ","latin":"wamaa kaana alnnaasu illaa ummatan waahidatan faikhtalafuu walawlaa kalimatun sabaqat min rabbika laqudhiya baynahum fiimaa fiihi yakhtalifuuna","translate":{"id":"Manusia dahulunya hanyalah satu umat, kemudian mereka berselisih . Kalau tidaklah karena suatu ketetapan yang telah ada dari Tuhanmu dahulu , pastilah telah diberi keputusan di antara mereka, tentang apa yang mereka perselisihkan itu.\n","en":"AND [know that] all mankind were once but one single community, and only later did they begin to hold divergent views. And had it not been for a decree- that had already gone forth from thy Sustainer, all their differences would indeed have been settled [from the outset]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1383","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1383.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1383.mp3"]}},{"no":20,"arab":"وَيَقُولُونَ لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۖ فَقُلْ إِنَّمَا الْغَيْبُ لِلَّهِ فَانْتَظِرُوا إِنِّي مَعَكُمْ مِنَ الْمُنْتَظِرِينَ","latin":"wayaquuluuna lawlaa unzila 'alayhi aayatun min rabbihi faqul innamaa alghaybu lillaahi faintazhiruu innii ma'akum mina almuntazhiriina","translate":{"id":"Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) suatu keterangan (mu'jizat) dari Tuhannya?\" Maka katakanlah: \"Sesungguhnya yang ghaib itu kepunyaan Allah, sebab itu tunggu (sajalah) olehmu, sesungguhnya aku bersama kamu termasuk orang-orang yang manunggu.\n","en":"NOW THEY [who deny the truth] are wont to ask, \"Why has no miraculous sign ever been bestowed upon him from on high by his Sustainer?\" Say, then: \"God's alone is the knowledge of that which. is beyond the reach of human perception. Wait, then, [until His will becomes manifest:] verily, I shall wait with you!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1384","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1384.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1384.mp3"]}},{"no":21,"arab":"وَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً مِنْ بَعْدِ ضَرَّاءَ مَسَّتْهُمْ إِذَا لَهُمْ مَكْرٌ فِي آيَاتِنَا ۚ قُلِ اللَّهُ أَسْرَعُ مَكْرًا ۚ إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ","latin":"wa-idzaa adzaqnaa alnnaasa rahmatan min ba'di dharraa-a massat-hum idzaa lahum makrun fii aayaatinaa quli allaahu asra'u makran inna rusulanaa yaktubuuna maa tamkuruuna","translate":{"id":"Dan apabila Kami merasakan kepada manusia suatu rahmat, sesudah (datangnya) bahaya menimpa mereka, tiba-tiba mereka mempunyai tipu daya dalam (menentang) tanda-tanda kekuasaan Kami. Katakanlah: \"Allah lebih cepat pembalasannya (atas tipu daya itu)\". Sesungguhnya malaikat-malaikat Kami menuliskan tipu dayamu.\n","en":"And [thus it is:] whenever We let [such] people taste [some of Our] grace after hardship has visited them-lo! they forthwith turn to devising false arguments against Our messages. Say: \"God is swifter [than you] in His deep devising!\" Behold, Our [heavenly] messengers are recording all that you may devise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1385","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1385.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1385.mp3"]}},{"no":22,"arab":"هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ ۖ حَتَّىٰ إِذَا كُنْتُمْ فِي الْفُلْكِ وَجَرَيْنَ بِهِمْ بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا بِهَا جَاءَتْهَا رِيحٌ عَاصِفٌ وَجَاءَهُمُ الْمَوْجُ مِنْ كُلِّ مَكَانٍ وَظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ ۙ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ لَئِنْ أَنْجَيْتَنَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ","latin":"huwa alladzii yusayyirukum fii albarri waalbahri hattaa idzaa kuntum fii alfulki wajarayna bihim biriihin thayyibatin wafarihuu bihaa jaa-at-haa riihun 'aasifun wajaa-ahumu almawju min kulli makaanin wazhannuu annahum uhiitha bihim da'awuu allaaha mukhlishiina lahu alddiina la-in anjaytanaa min haadzihi lanakuunanna mina alsysyaakiriina","translate":{"id":"Dialah Tuhan yang menjadikan kamu dapat berjalan di daratan, (berlayar) di lautan. Sehingga apabila kamu berada di dalam bahtera, dan meluncurlah bahtera itu membawa orang-orang yang ada di dalamnya dengan tiupan angin yang baik, dan mereka bergembira karenanya, datanglah angin badai, dan (apabila) gelombang dari segenap penjuru menimpanya, dan mereka yakin bahwa mereka telah terkepung (bahaya), maka mereka berdo'a kepada Allah dengan mengikhlaskan keta'atan kepada-Nya semata-mata. (Mereka berkata): \"Sesungguhnya jika Engkau menyelamatkan kami dari bahaya ini, pastilah kami akan termasuk orang-orang yang bersyukur\".\n","en":"He it is who enables you to travel on land and sea. And [behold what happens] when you go to sea in ships: [they go to sea in ships,] and they sail on in them in a favourable wind, and they rejoice thereat until there comes upon them a tempest, and waves surge towards them from all sides, so that they believe themselves to be encompassed [by death; and then] they call unto God, [at that moment] sincere in their faith in Him alone, \"If Thou wilt but save us from this, we shall most certainly be among the grateful!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1386","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1386.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1386.mp3"]}},{"no":23,"arab":"فَلَمَّا أَنْجَاهُمْ إِذَا هُمْ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۗ يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَىٰ أَنْفُسِكُمْ ۖ مَتَاعَ الْحَيَاةِ الدُّنْيَا ۖ ثُمَّ إِلَيْنَا مَرْجِعُكُمْ فَنُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"falammaa anjaahum idzaa hum yabghuuna fii al-ardhi bighayri alhaqqi yaa ayyuhaa alnnaasu innamaa baghyukum 'alaa anfusikum mataa'a alhayaati alddunyaa tsumma ilaynaa marji'ukum fanunabbi-ukum bimaa kuntum ta'maluuna ","translate":{"id":"Maka tatkala Allah menyelamatkan mereka, tiba-tiba mereka membuat kezaliman di muka bumi tanpa (alasan) yang benar. Hai manusia, sesungguhnya (bencana) kezalimanmu akan menimpa dirimu sendiri; (hasil kezalimanmu) itu hanyalah keni'matan hidup duniawi, kemudian kepada Kami-lah kembalimu, lalu Kami kabarkan kepadamu apa yang telah kamu kerjakan.\n","en":"Yet as soon as He has saved them from this [danger], lo! they behave outrageously on earth, offending against all right! O men! All your outrageous deeds are bound to fall back upon your own selves! [You care only for] the enjoyment of life in this world: [but remember that] in the end unto Us you must return, whereupon We shall make you truly understand all that you were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1387","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1387.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1387.mp3"]}},{"no":24,"arab":"إِنَّمَا مَثَلُ الْحَيَاةِ الدُّنْيَا كَمَاءٍ أَنْزَلْنَاهُ مِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَالْأَنْعَامُ حَتَّىٰ إِذَا أَخَذَتِ الْأَرْضُ زُخْرُفَهَا وَازَّيَّنَتْ وَظَنَّ أَهْلُهَا أَنَّهُمْ قَادِرُونَ عَلَيْهَا أَتَاهَا أَمْرُنَا لَيْلًا أَوْ نَهَارًا فَجَعَلْنَاهَا حَصِيدًا كَأَنْ لَمْ تَغْنَ بِالْأَمْسِ ۚ كَذَٰلِكَ نُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَتَفَكَّرُونَ","latin":"innamaa matsalu alhayaati alddunyaa kamaa-in anzalnaahu mina alssamaa-i faikhtalatha bihi nabaatu al-ardhi mimmaa ya/kulu alnnaasu waal-an'aamu hattaa idzaa akhadzati al-ardhu zukhrufahaa waizzayyanat wazhanna ahluhaa annahum qaadiruuna 'alayhaa ataahaa amrunaa laylan aw nahaaran faja'alnaahaa hashiidan ka-an lam taghna bial-amsi kadzaalika nufashshilu al-aayaati liqawmin yatafakkaruuna","translate":{"id":"Sesungguhnya perumpamaan kehidupan duniawi itu, adalah seperti air (hujan) yang Kami turunkan dan langit, lalu tumbuhlah dengan suburnya karena air itu tanam-tanaman bumi, di antaranya ada yang dimakan manusia dan binatang ternak. Hingga apabila bumi itu telah sempurna keindahannya, dan memakai (pula) perhiasannya , dan pemilik-permliknya mengira bahwa mereka pasti menguasasinya , tiba-tiba datanglah kepadanya azab Kami di waktu malam atau siang, lalu Kami jadikan (tanam-tanamannya) laksana tanam-tanaman yang sudah disabit, seakan-akan belum pernah tumbuh kemarin. Demikianlah Kami menjelaskan tanda-tanda kekuasaan (Kami) kepada orang-orang berfikir.\n","en":"The parable of the life of this world is but that of rain which We send down from the sky, and which is absorbed by the plants of the earth whereof men and animals draw nourishment, until -when the earth has assumed its artful adornment and has been embellished, and they who dwell on it believe that they have gained mastery over it -there comes down upon it Our judgment, by night or by day, and We cause it to become [like] a field mown down, as if there had been no yesterday. Thus clearly do We spell out these messages unto people who think!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1388","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1388.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1388.mp3"]}},{"no":25,"arab":"وَاللَّهُ يَدْعُو إِلَىٰ دَارِ السَّلَامِ وَيَهْدِي مَنْ يَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"waallaahu yad'uu ilaa daari alssalaami wayahdii man yasyaau ilaa shiraathin mustaqiimin","translate":{"id":"Allah menyeru (manusia) ke Darussalam (surga), dan menunjuki orang yang dikehendaki-Nya kepada jalan yang lurus (Islam) .\n","en":"AND [know that] God invites [man] unto the abode of peace, and guides him that wills [to be guided] onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1389","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1389.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1389.mp3"]}},{"no":26,"arab":"لِلَّذِينَ أَحْسَنُوا الْحُسْنَىٰ وَزِيَادَةٌ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ وَلَا ذِلَّةٌ ۚ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ","latin":"lilladziina ahsanuu alhusnaa waziyaadatun walaa yarhaqu wujuuhahum qatarun walaa dzillatun ulaa-ika ash-haabu aljannati hum fiihaa khaaliduuna","translate":{"id":"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya . Dan muka mereka tidak ditutupi debu hitam dan tidak (pula) kehinaan . Mereka itulah penghuni syurga, mereka kekal di dalamnya.\n","en":"For those who persevere in doing good there is the ultimate good in store, and more [than that]. No darkness and no ignominy will overshadow their faces [on Resurrection Day]: it is they who are destined for paradise, therein to abide."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1390","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1390.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1390.mp3"]}},{"no":27,"arab":"وَالَّذِينَ كَسَبُوا السَّيِّئَاتِ جَزَاءُ سَيِّئَةٍ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٌ ۖ مَا لَهُمْ مِنَ اللَّهِ مِنْ عَاصِمٍ ۖ كَأَنَّمَا أُغْشِيَتْ وُجُوهُهُمْ قِطَعًا مِنَ اللَّيْلِ مُظْلِمًا ۚ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ","latin":"waalladziina kasabuu alssayyi-aati jazaau sayyi-atin bimitslihaa watarhaquhum dzillatun maa lahum mina allaahi min 'aasimin ka-annamaa ughsyiyat wujuuhuhum qitha'an mina allayli muzhliman ulaa-ika ash-haabu alnnaari hum fiihaa khaaliduuna","translate":{"id":"Dan orang-orang yang mengerjakan kejahatan (mendapat) balasan yang setimpal dan mereka ditutupi kehinaan. Tidak ada bagi mereka seorang pelindungpun dari (azab) Allah, seakan-akan muka mereka ditutupi dengan kepingan-kepingan malam yang gelap gelita. Mereka itulah penghuni neraka; mereka kekal di dalamnya.\n","en":"But us for those who have done evil deeds - the recompense of an evil, deed shall be the like thereof: and - since they will have none to defend them against God - ignominy will overshadow them as though their faces were veiled by the night's own darkness: it is they who are destined for the fire. therein to abide."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1391","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1391.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1391.mp3"]}},{"no":28,"arab":"وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا مَكَانَكُمْ أَنْتُمْ وَشُرَكَاؤُكُمْ ۚ فَزَيَّلْنَا بَيْنَهُمْ ۖ وَقَالَ شُرَكَاؤُهُمْ مَا كُنْتُمْ إِيَّانَا تَعْبُدُونَ","latin":"wayawma nahsyuruhum jamii'an tsumma naquulu lilladziina asyrakuu makaanakum antum wasyurakaaukum fazayyalnaa baynahum waqaala syurakaauhum maa kuntum iyyaanaa ta'buduuna","translate":{"id":"(Ingatlah) suatu hari (ketika itu). Kami mengumpulkan mereka semuanya, kemudian Kami berkata kepada orang-orang yang mempersekutukan (Tuhan): \"Tetaplah kamu dan sekutu-sekutumu di tempatmu itu\". Lalu Kami pisahkan mereka dan berkatalah sekutu-sekutu mereka: \"Kamu sekali-kali tidak pernah menyembah kami.\n","en":"For, one Day We shall gather them all together, and then We shall say unto those who [in their lifetime] ascribed divinity to aught but God, \"Stand where you are, you and those [beings and powers] to whom you were wont to ascribe a share in God's divinity! -for by then We shall have [visibly] separated them from one another. And the beings to whom they had ascribed a share in God's divinity will say [to those who had worshipped them], \"It was not us that you were wont to worship;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1392","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1392.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1392.mp3"]}},{"no":29,"arab":"فَكَفَىٰ بِاللَّهِ شَهِيدًا بَيْنَنَا وَبَيْنَكُمْ إِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغَافِلِينَ","latin":"fakafaa biallaahi syahiidan baynanaa wabaynakum in kunnaa 'an 'ibaadatikum laghaafiliina","translate":{"id":"Dan cukuplah Allah menjadi saksi antara kami dengan kamu, bahwa kami tidak tahu-menahu tentang penyembahan kamu (kepada kami) \".\n","en":"and none can bear witness between us and you as God does: we were, for certain, unaware of your worshipping [us]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1393","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1393.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1393.mp3"]}},{"no":30,"arab":"هُنَالِكَ تَبْلُو كُلُّ نَفْسٍ مَا أَسْلَفَتْ ۚ وَرُدُّوا إِلَى اللَّهِ مَوْلَاهُمُ الْحَقِّ ۖ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ","latin":"hunaalika tabluu kullu nafsin maa aslafat warudduu ilaa allaahi mawlaahumu alhaqqi wadhalla 'anhum maa kaanuu yaftaruuna","translate":{"id":"Di tempat itu (padang Mahsyar), tiap-tiap diri merasakan pembalasan dari apa yang telah dikerjakannya dahulu dan mereka dikembalikan kepada Allah Pelindung mereka yang sebenarnya dan lenyaplah dari mereka apa yang mereka ada-adakan.\n","en":"There and then will every human being clearly apprehend what he has done in the past; and all will be brought back unto God, their true Lord Supreme, and all their false imagery will have forsaken them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1394","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1394.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1394.mp3"]}},{"no":31,"arab":"قُلْ مَنْ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ أَمَّنْ يَمْلِكُ السَّمْعَ وَالْأَبْصَارَ وَمَنْ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ وَمَنْ يُدَبِّرُ الْأَمْرَ ۚ فَسَيَقُولُونَ اللَّهُ ۚ فَقُلْ أَفَلَا تَتَّقُونَ","latin":"qul man yarzuqukum mina alssamaa-i waal-ardhi amman yamliku alssam'a waal-abshaara waman yukhriju alhayya mina almayyiti wayukhriju almayyita mina alhayyi waman yudabbiru al-amra fasayaquuluuna allaahu faqul afalaa tattaquuna","translate":{"id":"Katakanlah: \"Siapakah yang memberi rezki kepadamu dari langit dan bumi, atau siapakah yang kuasa (menciptakan) pendengaran dan penglihatan, dan siapakah yang mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup dan siapakah yang mengatur segala urusan?\" Maka mereka akan menjawab: \"Allah\". Maka katakanlah \"Mangapa kamu tidak bertakwa kepada-Nya)?\"\n","en":"SAY: \"Who is it that provides you with sustenance out of heaven and earth, or who is it that has full power over [your] hearing and sight? And who is it that brings forth the living out of that which is dead, and brings forth the dead out of that which is alive? And who is it that governs all that exists?\" And they will [surely] answer: \"[It is] God.\" Say, then: \"Will you not, then, become [fully] conscious of Him-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1395","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1395.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1395.mp3"]}},{"no":32,"arab":"فَذَٰلِكُمُ اللَّهُ رَبُّكُمُ الْحَقُّ ۖ فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلَالُ ۖ فَأَنَّىٰ تُصْرَفُونَ","latin":"fadzaalikumu allaahu rabbukumu alhaqqu famaatsaa ba'da alhaqqi illaa aldhdhalaalu fa-annaa tushrafuuna","translate":{"id":"Maka (Zat yang demikian) itulah Allah Tuhan kamu yang sebenarnya; maka tidak ada sesudah kebenaran itu, melainkan kesesatan. Maka bagaimanakah kamu dipalingkan (dari kebenaran)?\n","en":"seeing that He is God, your Sustainer, the Ultimate Truth? For, after the truth [has been forsaken], what is there [left] but error? How, then, can you lose sight of the truth?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1396","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1396.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1396.mp3"]}},{"no":33,"arab":"كَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِينَ فَسَقُوا أَنَّهُمْ لَا يُؤْمِنُونَ","latin":"kadzaalika haqqat kalimatu rabbika 'alaa alladziina fasaquu annahum laa yu/minuuna","translate":{"id":"Demikianlah telah tetap hukuman Tuhanmu terhadap orang-orang yang fasik, karena sesungguhnya mereka tidak beriman.\n","en":"Thus is thy Sustainer's word proved true with regard to such as are bent on sinful doings: they will not believes"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1397","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1397.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1397.mp3"]}},{"no":34,"arab":"قُلْ هَلْ مِنْ شُرَكَائِكُمْ مَنْ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۚ قُلِ اللَّهُ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ","latin":"qul hal min syurakaa-ikum man yabdau alkhalqa tsumma yu'iiduhu quli allaahu yabdau alkhalqa tsumma yu'iiduhu fa-annaa tu/fakuuna","translate":{"id":"Katakanlah: \"Apakah di antara sekutu-sekutumu ada yang dapat memulai penciptaan makhluk, kemudian mengulanginya (menghidupkannya) kembali?\" katakanlah: \"Allah-lah yang memulai penciptaan makhluk, kemudian mengulanginya (menghidupkannya) kembali; maka bagaimanakah kamu dipalingkan (kepada menyembah yang selain Allah)?\"\n","en":"Say: \"Can any of those beings to whom you ascribe a share in God's divinity create [life] in the first instance, and then bring it forth anew?” Say: \"It is God [alone] who creates [all life] in the first instance, and then brings it forth anew. How perverted, then, are your minds!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1398","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1398.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1398.mp3"]}},{"no":35,"arab":"قُلْ هَلْ مِنْ شُرَكَائِكُمْ مَنْ يَهْدِي إِلَى الْحَقِّ ۚ قُلِ اللَّهُ يَهْدِي لِلْحَقِّ ۗ أَفَمَنْ يَهْدِي إِلَى الْحَقِّ أَحَقُّ أَنْ يُتَّبَعَ أَمَّنْ لَا يَهِدِّي إِلَّا أَنْ يُهْدَىٰ ۖ فَمَا لَكُمْ كَيْفَ تَحْكُمُونَ","latin":"qul hal min syurakaa-ikum man yahdii ilaa alhaqqi quli allaahu yahdii lilhaqqi afaman yahdii ilaa alhaqqi ahaqqu an yuttaba'a amman laa yahiddii illaa an yuhdaa famaa lakum kayfa tahkumuuna","translate":{"id":"Katakanlah: \"Apakah di antara sekutu-sekuturmu ada yang menunjuki kepada kebenaran?\" Katakanlah \"Allah-lah yang menunjuki kepada kebenaran\". Maka apakah orang-orang yang menunjuki kepada kebenaran itu lebih berhak diikuti ataukah orang yang tidak dapat memberi petunjuk kecuali (bila) diberi petunjuk? Mengapa kamu (berbuat demikian)? Bagaimanakah kamu mengambil keputusan?\n","en":"Say: \"Does any of those beings to whom you ascribe a share in God's divinity guide unto the truth?\" Say: \"It is God [alone] who guides unto the truth. Which, then, is more worthy to be followed - He who guides unto the truth, or he who cannot find the right way unless he is guided? What, then, is amiss with you and your judgment?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1399","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1399.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1399.mp3"]}},{"no":36,"arab":"وَمَا يَتَّبِعُ أَكْثَرُهُمْ إِلَّا ظَنًّا ۚ إِنَّ الظَّنَّ لَا يُغْنِي مِنَ الْحَقِّ شَيْئًا ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَفْعَلُونَ","latin":"wamaa yattabi'u aktsaruhum illaa zhannan inna alzhzhanna laa yughnii mina alhaqqi syay-an inna allaaha 'aliimun bimaa yaf'aluuna","translate":{"id":"Dan kebanyakan mereka tidak mengikuti kecuali persangkaan saja. Sesungguhnya persangkaan itu tidak sedikitpun berguna untuk mencapai kebenaran . Sesungguhnya Allah Maha Mengetahui apa yang mereka kerjakan.\n","en":"For, most of them follow nothing but conjecture: [and,] behold, conjecture can never be a substitute for truth. Verily, God has full knowledge of all that they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1400","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1400.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1400.mp3"]}},{"no":37,"arab":"وَمَا كَانَ هَٰذَا الْقُرْآنُ أَنْ يُفْتَرَىٰ مِنْ دُونِ اللَّهِ وَلَٰكِنْ تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ","latin":"wamaa kaana haadzaa alqur-aanu an yuftaraa min duuni allaahi walaakin tashdiiqa alladzii bayna yadayhi watafshiila alkitaabi laa rayba fiihi min rabbi al'aalamiina","translate":{"id":"Tidaklah mungkin Al Qur'an ini dibuat oleh selain Allah; akan tetapi (Al Qur'an itu) membenarkan kitab-kitab yang sebelumnya dan menjelaskan hukum-hukum yang telah ditetapkannya , tidak ada keraguan di dalamnya, (diturunkan) dari Tuhan semesta alam.\n","en":"Now this Qur'an could not possibly have been devised by anyone save God: nay indeed, it confirms the truth of whatever there still remains [of earlier revelations] and clearly spells out the revelation [which comes] -let there be no doubt about it-from the Sustainer of all the worlds."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1401","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1401.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1401.mp3"]}},{"no":38,"arab":"أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ فَأْتُوا بِسُورَةٍ مِثْلِهِ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ","latin":"am yaquuluuna iftaraahu qul fa/tuu bisuuratin mitslihi waud'uu mani istatha'tum min duuni allaahi in kuntum shaadiqiina","translate":{"id":"Atau (patutkah) mereka mengatakan \"Muhammad membuat-buatnya.\" Katakanlah: \"(Kalau benar yang kamu katakan itu), maka cobalah datangkan sebuah surat seumpamanya dan panggillah siapa-siapa yang dapat kamu panggil (untuk membuatnya) selain Allah, jika kamu orang yang benar.\"\n","en":"And yet, they [who are bent on denying the truth] assert, \"[Muhammad] has invented it!\" Say [unto them]: \"Produce, then, a surah of similar merit; and [to this end] call to your aid whomever you can, other than God, if what you say is true!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1402","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1402.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1402.mp3"]}},{"no":39,"arab":"بَلْ كَذَّبُوا بِمَا لَمْ يُحِيطُوا بِعِلْمِهِ وَلَمَّا يَأْتِهِمْ تَأْوِيلُهُ ۚ كَذَٰلِكَ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ","latin":"bal kadzdzabuu bimaa lam yuhiithuu bi'ilmihi walammaa ya/tihim ta/wiiluhu kadzaalika kadzdzaba alladziina min qablihim faunzhur kayfa kaana 'aaqibatu alzhzhaalimiina","translate":{"id":"Bahkan yang sebenarnya, mereka mendustakan apa yang mereka belum mengetahuinya dengan sempurna padahal belum datang kepada mereka penjelasannya. Demikianlah orang-orang yang sebelum mereka telah mendustakan (rasul). Maka perhatikanlah bagaimana akibat orang-orang yang zalim itu.\n","en":"Nay, but they are bent on giving the lie to everything the wisdom whereof they do not comprehend, and ere its inner meaning has become clear to them Even thus did those who lived before their time give the lie to the truth: and behold what happened in the end to those evildoers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1403","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1403.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1403.mp3"]}},{"no":40,"arab":"وَمِنْهُمْ مَنْ يُؤْمِنُ بِهِ وَمِنْهُمْ مَنْ لَا يُؤْمِنُ بِهِ ۚ وَرَبُّكَ أَعْلَمُ بِالْمُفْسِدِينَ","latin":"waminhum man yu/minu bihi waminhum man laa yu/minu bihi warabbuka a'lamu bialmufsidiina","translate":{"id":"Di antara mereka ada orang-orang yang beriman kepada Al Qur'an, dan di antaranya ada (pula) orang-orang yang tidak beriman kepadanya. Tuhanmu lebih mengetahui tentang orang-orang yang berbuat kerusakan.\n","en":"And there are among them such as will in time come to believe in this [divine writ], just as there are among them such as will never believe in it; and thy Sustainer is fully aware as to who are the spreaders of corruption."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1404","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1404.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1404.mp3"]}},{"no":41,"arab":"وَإِنْ كَذَّبُوكَ فَقُلْ لِي عَمَلِي وَلَكُمْ عَمَلُكُمْ ۖ أَنْتُمْ بَرِيئُونَ مِمَّا أَعْمَلُ وَأَنَا بَرِيءٌ مِمَّا تَعْمَلُونَ","latin":"wa-in kadzdzabuuka faqul lii 'amalii walakum 'amalukum antum barii-uuna mimmaa a'malu wa-anaa barii-un mimmaa ta'maluuna","translate":{"id":"Jika mereka mendustakan kamu, maka katakanlah: \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu berlepas diri terhadap apa yang aku kerjakan dan akupun berlepas diri terhadap apa yang kamu kerjakan\".\n","en":"And [so, O Prophet,] if they give thee the lie, say: \"To me [shall be accounted] my doings, and to you, your doings: you are not accountable for what I am doing, and I am not accountable for whatever you do.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1405","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1405.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1405.mp3"]}},{"no":42,"arab":"وَمِنْهُمْ مَنْ يَسْتَمِعُونَ إِلَيْكَ ۚ أَفَأَنْتَ تُسْمِعُ الصُّمَّ وَلَوْ كَانُوا لَا يَعْقِلُونَ","latin":"waminhum man yastami'uuna ilayka afa-anta tusmi'u alshshumma walaw kaanuu laa ya'qiluuna","translate":{"id":"Dan di antara mereka ada orang yang mendengarkanmu .Apakah kamu dapat menjadikan orang-orang tuli itu mendengar walaupun mereka tidak mengerti.\n","en":"And there are among them such as (pretend to] listen to thee: but canst thou cause the deaf to hearken even though they will not use their reason?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1406","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1406.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1406.mp3"]}},{"no":43,"arab":"وَمِنْهُمْ مَنْ يَنْظُرُ إِلَيْكَ ۚ أَفَأَنْتَ تَهْدِي الْعُمْيَ وَلَوْ كَانُوا لَا يُبْصِرُونَ","latin":"waminhum man yanzhuru ilayka afa-anta tahdii al'umya walaw kaanuu laa yubshiruuna","translate":{"id":"Dan di antara mereka ada orang yang melihat kepadamu , apakah dapat kamu memberi petunjuk kepada orang-orang yang buta, walaupun mereka tidak dapat memperhatikan.\n","en":"And there are among them such as [pretend to] look towards thee: but canst thou show the right way to the blind even though they cannot see?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1407","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1407.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1407.mp3"]}},{"no":44,"arab":"إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا وَلَٰكِنَّ النَّاسَ أَنْفُسَهُمْ يَظْلِمُونَ","latin":"inna allaaha laa yazhlimu alnnaasa syay-an walaakinna alnnaasa anfusahum yazhlimuuna","translate":{"id":"Sesungguhnya Allah tidak berbuat zalim kepada manusia sedikitpun, akan tetapi manusia itulah yang berbuat zalim kepada diri mereka sendiri.\n","en":"Verily, God does not do the least wrong unto men, but it is men who wrong themselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1408","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1408.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1408.mp3"]}},{"no":45,"arab":"وَيَوْمَ يَحْشُرُهُمْ كَأَنْ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنَ النَّهَارِ يَتَعَارَفُونَ بَيْنَهُمْ ۚ قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ وَمَا كَانُوا مُهْتَدِينَ","latin":"wayawma yahsyuruhum ka-an lam yalbatsuu illaa saa'atan mina alnnahaari yata'aarafuuna baynahum qad khasira alladziina kadzdzabuu biliqaa-i allaahi wamaa kaanuu muhtadiina","translate":{"id":"Dan (ingatlah) akan hari (yang di waktu itu) Allah mengumpulkan mereka, (mereka merasa di hari itu) seakan-akan mereka tidak pernah berdiam (di dunia) hanya sesaat di siang hari, (di waktu itu) mereka saling berkenalan. Sesungguhnya rugilah orang-orang yang mendustakan pertemuan mereka dengan Allah dan mereka tidak mendapat petunjuk\n","en":"And on the Day when He shall gather them [unto Himself, it will seem to them] as if they had not tarried [on earth] longer than an hour of a day, knowing one another; [and] lost indeed will be they who [in their lifetime] considered it a lie that they were destined to meet God, and [thus] failed to find the right' way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1409","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1409.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1409.mp3"]}},{"no":46,"arab":"وَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا مَرْجِعُهُمْ ثُمَّ اللَّهُ شَهِيدٌ عَلَىٰ مَا يَفْعَلُونَ","latin":"wa-immaa nuriyannaka ba'dha alladzii na'iduhum aw natawaffayannaka fa-ilaynaa marji'uhum tsumma allaahu syahiidun 'alaa maa yaf'aluuna","translate":{"id":"Dan jika Kami perlihatkan kepadamu sebahagian dari (siksa) yang Kami ancamkan kepada mereka, (tentulah kamu akan melihatnya) atau (jika) Kami wafatkan kamu (sebelum itu), maka kepada Kami jualah mereka kembali , dan Allah menjadi saksi atas apa yang mereka kerjakan.\n","en":"And whether We show thee [in this world something of what We hold in store for those [deniers of the truth], or whether We cause thee to die [before that retribution takes place - know that, in the end], it is unto Us that they must return; and God is witness to all that they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1410","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1410.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1410.mp3"]}},{"no":47,"arab":"وَلِكُلِّ أُمَّةٍ رَسُولٌ ۖ فَإِذَا جَاءَ رَسُولُهُمْ قُضِيَ بَيْنَهُمْ بِالْقِسْطِ وَهُمْ لَا يُظْلَمُونَ","latin":"walikulli ummatin rasuulun fa-idzaa jaa-a rasuuluhum qudhiya baynahum bialqisthi wahum laa yuzhlamuuna","translate":{"id":"Tiap-tiap umat mempunyai rasul; maka apabila telah datang rasul mereka, diberikanlah keputusan antara mereka dengan adil dan mereka (sedikitpun) tidak dianiaya.\n","en":"NOW every community has had an apostle; and only after their apostle has appeared [and delivered his message] is judgment passed on them, in all equity; and never are they wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1411","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1411.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1411.mp3"]}},{"no":48,"arab":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ","latin":"wayaquuluuna mataa haadzaa alwa'du in kuntum shaadiqiina","translate":{"id":"Mereka mengatakan: \"Bilakah (datangnya) ancaman itu, jika memang kamu orang-orang yang benar?\"\n","en":"And yet, they [who deny the truth] are wont to ask, \"When is that promise [of resurrection and judgment] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1412","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1412.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1412.mp3"]}},{"no":49,"arab":"قُلْ لَا أَمْلِكُ لِنَفْسِي ضَرًّا وَلَا نَفْعًا إِلَّا مَا شَاءَ اللَّهُ ۗ لِكُلِّ أُمَّةٍ أَجَلٌ ۚ إِذَا جَاءَ أَجَلُهُمْ فَلَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ","latin":"qul laa amliku linafsii dharran walaa naf'an illaa maa syaa-a allaahu likulli ummatin ajalun idzaa jaa-a ajaluhum falaa yasta/khiruuna saa'atan walaa yastaqdimuuna","translate":{"id":"Katakanlah: \"Aku tidak berkuasa mendatangkan kemudharatan dan tidak (pula) kemanfaatan kepada diriku, melainkan apa yang dikehendaki Allah\". Tiap-tiap umat mempunyai ajal . Apabila telah datang ajal mereka, maka mereka tidak dapat mengundurkannya barang sesaatpun dan tidak (pula) mendahulukan(nya).\n","en":"Say [O Prophet]: \"It is not within my power to avert harm from, or bring benefit to, myself, except as God may please. For all people a term has been set: when the end of their term approaches, they can neither delay it by a single moment, nor hasten it.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1413","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1413.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1413.mp3"]}},{"no":50,"arab":"قُلْ أَرَأَيْتُمْ إِنْ أَتَاكُمْ عَذَابُهُ بَيَاتًا أَوْ نَهَارًا مَاذَا يَسْتَعْجِلُ مِنْهُ الْمُجْرِمُونَ","latin":"qul ara-aytum in ataakum 'adzaabuhu bayaatan aw nahaaran maatsaa yasta'jilu minhu almujrimuuna","translate":{"id":"Katakanlah: \"Terangkan kepadaku, jika datang kepada kamu sekalian sikaaan-Nya di waktu malam atau di siang hari, apakah orang-orang yang berdosa itu meminta disegerakan juga ?\"\n","en":"Say: \"Have you ever considered [how you would feel] if His chastisement were to befall you by night or by day? What could there be in that prospect that people lost in sin should wish to hasten?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1414","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1414.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1414.mp3"]}},{"no":51,"arab":"أَثُمَّ إِذَا مَا وَقَعَ آمَنْتُمْ بِهِ ۚ آلْآنَ وَقَدْ كُنْتُمْ بِهِ تَسْتَعْجِلُونَ","latin":"atsumma idzaa maa waqa'a aamantum bihi aal-aana waqad kuntum bihi tasta'jiluuna","translate":{"id":"Kemudian apakah setelah terjadinya (azab itu), kemudian itu kamu baru mempercayainya? Apakah sekarang (baru kamu mempercayai), padahal sebelumnya kamu selalu meminta supaya disegerakan?\n","en":"Will you, then, believe in it [only] after it has come to pass -[on the Day when you will be asked, `Do you believe in it] now, after having [contemptuously] called for its speedy advent?'"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1415","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1415.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1415.mp3"]}},{"no":52,"arab":"ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُوا ذُوقُوا عَذَابَ الْخُلْدِ هَلْ تُجْزَوْنَ إِلَّا بِمَا كُنْتُمْ تَكْسِبُونَ","latin":"tsumma qiila lilladziina zhalamuu dzuuquu 'adzaaba alkhuldi hal tujzawna illaa bimaa kuntum taksibuuna","translate":{"id":"Kemudian dikatakan kepada orang-orang yang zalim (musyrik) itu: \"Rasakanlah olehmu siksaan yang kekal; kamu tidak diberi balasan melainkan dengan apa yang telah kamu kerjakan.\"\n","en":"-whereupon those who [in their lifetime] were bent on evildoing will be told, `Taste suffering abiding! Is this requital anything but the just due for what you were wont to do?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1416","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1416.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1416.mp3"]}},{"no":53,"arab":"وَيَسْتَنْبِئُونَكَ أَحَقٌّ هُوَ ۖ قُلْ إِي وَرَبِّي إِنَّهُ لَحَقٌّ ۖ وَمَا أَنْتُمْ بِمُعْجِزِينَ","latin":"wayastanbi-uunaka ahaqqun huwa qul ii warabbii innahu lahaqqun wamaa antum bimu'jiziina","translate":{"id":"Dan mereka menanyakan kepadamu: \"Benarkah (azab yang dijanjikan) itu? Katakanlah: \"Ya, demi Tuhanku, sesungguhnya azab itu adalah benar dan kamu sekali-kali tidak bisa luput (daripadanya)\".\n","en":"And some people ask thee, \"Is all this true?\" Say: \"Yea, by my Sustainer! It is most certainly true, and you cannot elude [the final reckoning]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1417","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1417.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1417.mp3"]}},{"no":54,"arab":"وَلَوْ أَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِي الْأَرْضِ لَافْتَدَتْ بِهِ ۗ وَأَسَرُّوا النَّدَامَةَ لَمَّا رَأَوُا الْعَذَابَ ۖ وَقُضِيَ بَيْنَهُمْ بِالْقِسْطِ ۚ وَهُمْ لَا يُظْلَمُونَ","latin":"walaw anna likulli nafsin zhalamat maa fii al-ardhi laiftadat bihi wa-asarruu alnnadaamata lammaa ra-awuu al'adzaaba waqudhiya baynahum bialqisthi wahum laa yuzhlamuuna","translate":{"id":"Dan kalau setiap diri yang zalim (muayrik) itu mempunyai segala apa yang ada di bumi ini, tentu dia menebus dirinya dengan itu, dan mereka membunyikan penyesalannya ketika mereka telah menyaksikan azab itu. Dan telah diberi keputusan di antara mereka dengan adil, sedang mereka tidak dianiaya.\n","en":"And all human beings that have been doing evil's would surely, if they possessed all that is on earth, offer it as ransom [on Judgment Day]; and when they see the suffering [that awaits them], they will be unable to express their remorse. But judgment will be passed on them in all equity; and they will not be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1418","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1418.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1418.mp3"]}},{"no":55,"arab":"أَلَا إِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ أَلَا إِنَّ وَعْدَ اللَّهِ حَقٌّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","latin":"alaa inna lillaahi maa fii alssamaawaati waal-ardhi alaa inna wa'da allaahi haqqun walaakinna aktsarahum laa ya'lamuuna","translate":{"id":"Ingatlah, sesungguhnya kepunyaan Allah apa yang ada di langit dan di bumi. Ingatlah, sesungguhnya janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahui(nya).\n","en":"Oh, verily, unto God belongs all that is in the heavens and on earth! Oh, verily, God's promise always comes true-but most of them know it not!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1419","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1419.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1419.mp3"]}},{"no":56,"arab":"هُوَ يُحْيِي وَيُمِيتُ وَإِلَيْهِ تُرْجَعُونَ","latin":"huwa yuhyii wayumiitu wa-ilayhi turja'uuna","translate":{"id":"Dia-lah yang menghidupkan dan mematikan dan hanya kepada-Nya-lah kamu dikembalikan.\n","en":"He alone grants life and deals death; and unto Him you all must return."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1420","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1420.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1420.mp3"]}},{"no":57,"arab":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُمْ مَوْعِظَةٌ مِنْ رَبِّكُمْ وَشِفَاءٌ لِمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ","latin":"yaa ayyuhaa alnnaasu qad jaa-atkum maw'izhatun min rabbikum wasyifaaun limaa fii alshshuduuri wahudan warahmatun lilmu/miniina","translate":{"id":"Hai manusia, sesungguhnya telah datang kepadamu pelajaran dari Tuhanmu dan penyembuh bagi penyakit-penyakit (yang berada) dalam dada dan petunjuk serta rahmat bagi orang-orang yang beriman.\n","en":"O MANKIND! There has now come unto you an admonition from your Sustainer, and a cure for all [the ill] that may be in men's hearts, and guidance and grace unto all who believe [in Him]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1421","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1421.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1421.mp3"]}},{"no":58,"arab":"قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ","latin":"qul bifadhli allaahi wabirahmatihi fabidzaalika falyafrahuu huwa khayrun mimmaa yajma'uuna","translate":{"id":"Katakanlah: \"Dengan kurnia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira. Kurnia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang mereka kumpulkan\".\n","en":"Say: \"In [this] bounty of God and in His grace-in this, then, let them rejoice: it is better than all [the worldly wealth] that they may amass!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1422","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1422.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1422.mp3"]}},{"no":59,"arab":"قُلْ أَرَأَيْتُمْ مَا أَنْزَلَ اللَّهُ لَكُمْ مِنْ رِزْقٍ فَجَعَلْتُمْ مِنْهُ حَرَامًا وَحَلَالًا قُلْ آللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى اللَّهِ تَفْتَرُونَ","latin":"qul ara-aytum maa anzala allaahu lakum min rizqin faja'altum minhu haraaman wahalaalan qul aallaahu adzina lakum am 'alaa allaahi taftaruuna","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku tentang rezki yang diturunkan Allah kepadamu, lalu kamu jadikan sebagiannya haram dan (sebagiannya) halal\". Katakanlah: \"Apakah Allah telah memberikan izin kepadamu (tentang ini) atau kamu mengada-adakan saja terhadap Allah ?\"\n","en":"Say: \"Have you ever considered all the means of sustenance which God has bestowed upon you from on high -and which you thereupon divide into 'things forbidden' and 'things lawful? Say: \"Has God given you leave [to do this] -or do you, perchance, attribute your own guesswork to God?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1423","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1423.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1423.mp3"]}},{"no":60,"arab":"وَمَا ظَنُّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ يَوْمَ الْقِيَامَةِ ۗ إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ","latin":"wamaa zhannu alladziina yaftaruuna 'alaa allaahi alkadziba yawma alqiyaamati inna allaaha ladzuu fadhlin 'alaa alnnaasi walaakinna aktsarahum laa yasykuruuna","translate":{"id":"Apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah pada hari kiamat ? Sesungguhnya Allah benar-benar mempunyai karunia (yang dilimpahkan) atas manusia, tetapi kebanyakan mereka tidak mensyukuri(nya).\n","en":"But what do they think-they who attribute their own lying inventions to God-[what do they think will happen to them]. on the Day of Resurrection? Behold, God is indeed limitless in His bounty unto men -but most of them are ungrateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1424","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1424.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1424.mp3"]}},{"no":61,"arab":"وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِنْ قُرْآنٍ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ ۚ وَمَا يَعْزُبُ عَنْ رَبِّكَ مِنْ مِثْقَالِ ذَرَّةٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَلَا أَصْغَرَ مِنْ ذَٰلِكَ وَلَا أَكْبَرَ إِلَّا فِي كِتَابٍ مُبِينٍ","latin":"wamaa takuunu fii sya/nin wamaa tatluu minhu min qur-aanin walaa ta'maluuna min 'amalin illaa kunnaa 'alaykum syuhuudan idz tufiidhuuna fiihi wamaa ya'zubu 'an rabbika min mitsqaali dzarratin fii al-ardhi walaa fii alssamaa-i walaa ashghara min dzaalika walaa akbara illaa fii kitaabin mubiinun","translate":{"id":"Kamu tidak berada dalam suatu keadaan dan tidak membaca suatu ayat dari Al Qur'an dan kamu tidak mengerjakan suatu pekerjaan, melainkan Kami menjadi saksi atasmu di waktu kamu melakukannya. Tidak luput dari pengetahuan Tuhanmu biarpun sebesar zarrah (atom) di bumi ataupun di langit. Tidak ada yang lebih kecil dan tidak (pula) yang lebih besar dari itu, melainkan (semua tercatat) dalam kitab yang nyata (Lauh Mahfuzh).\n","en":"AND IN whatever condition thou mayest find thyself, [O Prophet,] and whatever discourse of this [divine writ] thou mayest be reciting, and whatever work you [all, O men,] may do -[remember that] We are your witness [from the moment] when you enter upon it: for, not even an atom's weight [of whatever there is] on earth or in heaven escapes thy Sustainer's knowledge; and neither is there anything smaller than that, or larger, but is recorded in [His] clear decree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1425","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1425.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1425.mp3"]}},{"no":62,"arab":"أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","latin":"alaa inna awliyaa-a allaahi laa khawfun 'alayhim walaa hum yahzanuuna","translate":{"id":"Ingatlah, sesungguhnya wali-wali Allah itu, tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati.\n","en":"Oh, verily, they who are close to God - no fear need they have, and neither shall they grieve:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1426","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1426.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1426.mp3"]}},{"no":63,"arab":"الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","latin":"alladziina aamanuu wakaanuu yattaquuna ","translate":{"id":"(Yaitu) orang-orang yang beriman dan mereka selalu bertakwa.\n","en":"they who have attained to faith and have always been conscious of Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1427","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1427.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1427.mp3"]}},{"no":64,"arab":"لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۚ لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","latin":"lahumu albusyraa fii alhayaati alddunyaa wafii al-aakhirati laa tabdiila likalimaati allaahi dzaalika huwa alfawzu al'azhiimu","translate":{"id":"Bagi mereka berita gembira di dalam kehidupan di dunia dan (dalam kehidupan\\} di akhirat. Tidak ada perobahan bagi kalimat-kalimat (janji-janji) Allah. Yang demikian itu adalah kemenangan yang besar.\n","en":"For them there is the glad tiding [of happiness] in the life of this world and in the life to come; [and since] nothing could ever alter [the outcome of] God's promises, this, this is the triumph supreme!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1428","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1428.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1428.mp3"]}},{"no":65,"arab":"وَلَا يَحْزُنْكَ قَوْلُهُمْ ۘ إِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا ۚ هُوَ السَّمِيعُ الْعَلِيمُ","latin":"walaa yahzunka qawluhum inna al'izzata lillaahi jamii'an huwa alssamii'u al'aliimu","translate":{"id":"Janganlah kamu sedih oleh perkataan mereka. Sesungguhnya kekuasaan itu seluruhnya adalah kepunyaan Allah. Dialah Yang Maha Mendengar lagi Maba Mengetahui.\n","en":"And be not grieved by the sayings of those [who deny the truth]. Behold, all might and glory belong to God alone: He alone is all-hearing, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1429","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1429.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1429.mp3"]}},{"no":66,"arab":"أَلَا إِنَّ لِلَّهِ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ ۗ وَمَا يَتَّبِعُ الَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ شُرَكَاءَ ۚ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ","latin":"alaa inna lillaahi man fii alssamaawaati waman fii al-ardhi wamaa yattabi'u alladziina yad'uuna min duuni allaahi syurakaa-a in yattabi'uuna illaa alzhzhanna wa-in hum illaa yakhrushuuna","translate":{"id":"Ingatlah, sesungguhnya kepunyaan Allah semua yang ada di langit dan semua yang ada di bumi. Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\n","en":"OH, VERILY, unto God belongs whoever is in the heavens and whoever is on earth: hence, what is it that they follow-those who invoke, beside God. beings to whom they ascribe a share in His divinity? They follow but the conjectures [of others], and themselves do nothing but guess -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1430","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1430.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1430.mp3"]}},{"no":67,"arab":"هُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِتَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَسْمَعُونَ","latin":"huwa alladzii ja'ala lakumu allayla litaskunuu fiihi waalnnahaara mubshiran inna fii dzaalika laaayaatin liqawmin yasma'uuna","translate":{"id":"Dialah yang menjadikan malam bagi kamu supaya kamu beristirahat padanya dan (menjadikan) siang terang benderang (supaya kamu mencari karunia Allah). Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang mendengar .\n","en":"[whereas] it is He who has made the night for you, so that you might have rest therein, and the day, to make [you] see in this, behold, there are messages indeed for people who [are willing to] listen."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1431","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1431.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1431.mp3"]}},{"no":68,"arab":"قَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ هُوَ الْغَنِيُّ ۖ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ إِنْ عِنْدَكُمْ مِنْ سُلْطَانٍ بِهَٰذَا ۚ أَتَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ","latin":"qaaluu ittakhadza allaahu waladan subhaanahu huwa alghaniyyu lahu maa fii alssamaawaati wamaa fii al-ardhi in 'indakum min sulthaanin bihaadzaa ataquuluuna 'alaa allaahi maa laa ta'lamuuna","translate":{"id":"Mereka (orang-orang Yahudi dan Nasrani) berkata: \"Allah mempuyai anak\". Maha Suci Allah; Dia-lah Yang Maha Kaya; kepunyaan-Nya apa yang ada di langit dan apa yang di bumi. Kamu tidak mempunyai hujjah tentang ini. Pantaskah kamu mengatakan terhadap Allah apa yang tidak kamu ketahui?\n","en":"[And yet] they assert, \"God has taken unto Himself a son!\" Limitless is He in His glory! Self-sufficient is He: unto Him belongs all that is in the heavens and all that is on earth! No evidence whatever have you for this [assertion]! Would you ascribe unto God something which you cannot know?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1432","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1432.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1432.mp3"]}},{"no":69,"arab":"قُلْ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ","latin":"qul inna alladziina yaftaruuna 'alaa allaahi alkadziba laa yuflihuuna","translate":{"id":"Katakanlah: \"Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak beruntung\".\n","en":"Say: \"Verily, they who attribute their own lying inventions to God will never attain to a happy state!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1433","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1433.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1433.mp3"]}},{"no":70,"arab":"مَتَاعٌ فِي الدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُهُمْ ثُمَّ نُذِيقُهُمُ الْعَذَابَ الشَّدِيدَ بِمَا كَانُوا يَكْفُرُونَ","latin":"mataa'un fii alddunyaa tsumma ilaynaa marji'uhum tsumma nudziiquhumu al'adzaaba alsysyadiida bimaa kaanuu yakfuruuna","translate":{"id":"(Bagi mereka) kesenangan (sementara) di dunia, kemudian kepada Kami-lah mereka kembali, kemudian Kami rasakan kepada mereka siksa yang berat, disebabkan kekafiran mereka.\n","en":"[A brief] enjoyment in this world-and thereafter unto Us they must return: and then We shall let them taste suffering severe as an outcome of their persistent denial of the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1434","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1434.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1434.mp3"]}},{"no":71,"arab":"وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ يَا قَوْمِ إِنْ كَانَ كَبُرَ عَلَيْكُمْ مَقَامِي وَتَذْكِيرِي بِآيَاتِ اللَّهِ فَعَلَى اللَّهِ تَوَكَّلْتُ فَأَجْمِعُوا أَمْرَكُمْ وَشُرَكَاءَكُمْ ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُوا إِلَيَّ وَلَا تُنْظِرُونِ","latin":"wautlu 'alayhim naba-a nuuhin idz qaala liqawmihi yaa qawmi in kaana kabura 'alaykum maqaamii watadzkiirii bi-aayaati allaahi fa'alaa allaahi tawakkaltu fa-ajmi'uu amrakum wasyurakaa-akum tsumma laa yakun amrukum 'alaykum ghummatan tsumma iqdhuu ilayya walaa tunzhiruuni","translate":{"id":"Dan bacakanIah kepada mereka berita penting tentang Nuh di waktu dia berkata kepada kaumnya: \"Hai kaumku, jika terasa berat bagimu tinggal (bersamaku) dan peringatanku (kepadamu) dengan ayat-ayat Allah, maka kepada Allah-lah aku bertawakal, karena itu bulatkanlah keputusanmu dan (kumpulkanlah) sekutu-sekutumu (untuk membinasakanku). Kemudian janganlah keputusanmu itu dirahasiakan, lalu lakukanlah terhadap diriku, dan janganlah kamu memberi tangguh kepadaku.\n","en":"AND CONVEY unto them the story of Noah-when he said unto his people: \"O my people! If my presence [among you] and my announcement of God's messages are repugnant to you -well, in God have I placed my trust. Decide, then, upon what you are going to do [against me], and [call to your aid] those beings to whom you ascribe a share in God's divinity; and once you have chosen your course of action, let no hesitation deflect you from it; and then carry out against me [whatever you may have decided], and give me no respite!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1435","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1435.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1435.mp3"]}},{"no":72,"arab":"فَإِنْ تَوَلَّيْتُمْ فَمَا سَأَلْتُكُمْ مِنْ أَجْرٍ ۖ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ","latin":"fa-in tawallaytum famaa sa-altukum min ajrin in ajriya illaa 'alaa allaahi waumirtu an akuuna mina almuslimiina","translate":{"id":"Jika kamu berpaling (dari peringatanku), aku tidak meminta upah sedikitpun dari padamu. Upahku tidak lain hanyalah dari Allah belaka, dan aku disuruh supaya aku termasuk golongan orang-orang yang berserah diri (kepada-Nya)\".\n","en":"But if you turn away [from the message which I bear, remember that] I have asked no reward whatever of you: my reward rests with none but God, for I have been bidden to be among those who have surrendered themselves unto Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1436","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1436.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1436.mp3"]}},{"no":73,"arab":"فَكَذَّبُوهُ فَنَجَّيْنَاهُ وَمَنْ مَعَهُ فِي الْفُلْكِ وَجَعَلْنَاهُمْ خَلَائِفَ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِينَ","latin":"fakadzdzabuuhu fanajjaynaahu waman ma'ahu fii alfulki waja'alnaahum khalaa-ifa wa-aghraqnaa alladziina kadzdzabuu bi-aayaatinaa faunzhur kayfa kaana 'aaqibatu almundzariina","translate":{"id":"Lalu mereka mendustakan Nuh, maka Kami selamatkan dia dan orang-orang yang bersamanya di dalam bahtera, dan Kami jadikan mereka itu pemegang kekuasaan dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami. Maka perhatikanlah bagaimana kesesudahan orang-orang yang diberi peringatan itu.\n","en":"And yet they gave him the lie! And so We saved him and all who stood by him, in the ark, and made them inherit [the earth], the while We caused those who gave the lie to Our messages to drown: behold, then, what happened in the end to those people who had been warned [in vain]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1437","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1437.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1437.mp3"]}},{"no":74,"arab":"ثُمَّ بَعَثْنَا مِنْ بَعْدِهِ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَاءُوهُمْ بِالْبَيِّنَاتِ فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا بِهِ مِنْ قَبْلُ ۚ كَذَٰلِكَ نَطْبَعُ عَلَىٰ قُلُوبِ الْمُعْتَدِينَ","latin":"tsumma ba'atsnaa min ba'dihi rusulan ilaa qawmihim fajaauuhum bialbayyinaati famaa kaanuu liyu/minuu bimaa kadzdzabuu bihi min qablu kadzaalika nathba'u 'alaa quluubi almu'tadiina","translate":{"id":"Kemudian sesudah Nuh, Kami utus beberapa rasul kepada kaum mereka (masing-masing), maka rasul-rasul itu datang kepada mereka dengan membawa keterangan-keterangan yang nyata, tetapi mereka tidak hendak beriman karena mereka dahulu telah (biasa) mendustakannya . demikianlah Kami mengunci mati hati orang-orang yang melampaui batas.\n","en":"AND THEN, after him, We sent forth [other] apostles-each one unto his own people -and they brought them all evidence of the truth; but they would not believe in anything to which they had once given the lie: thus it is that We seal the hearts of such as [are wont to] transgress the bounds of what is right."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1438","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1438.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1438.mp3"]}},{"no":75,"arab":"ثُمَّ بَعَثْنَا مِنْ بَعْدِهِمْ مُوسَىٰ وَهَارُونَ إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ بِآيَاتِنَا فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا مُجْرِمِينَ","latin":"tsumma ba'atsnaa min ba'dihim muusaa wahaaruuna ilaa fir'awna wamala-ihi bi-aayaatinaa faistakbaruu wakaanuu qawman mujrimiina","translate":{"id":"Kemudian sesudah rasul-rasul itu, Kami utus Musa dan Harun kepada Fir'aun dan pemuka-pemuka kaumnya, dengan (membawa) tanda-tanda (mu'jizat-mu'jizat) Kami, maka mereka menyombongkan diri dan mereka adalah orang-orang yang berdosa.\n","en":"And after those [earlier prophets] We sent Moses and Aaron with Our messages unto Pharaoh and his great ones: but they gloried in their arrogance, for they were people lost in sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1439","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1439.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1439.mp3"]}},{"no":76,"arab":"فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا إِنَّ هَٰذَا لَسِحْرٌ مُبِينٌ","latin":"falammaa jaa-ahumu alhaqqu min 'indinaa qaaluu inna haadzaa lasihrun mubiinun ","translate":{"id":"Dan tatkala telah datang kepada mereka kebenaran dari sisi Kami, mereka berkata: \"Sesungguhnya ini adalah sihir yang nyata\".\n","en":"And so, when the truth came to them from Us, they said, \"Behold, this is clearly nothing but sorcery!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1440","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1440.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1440.mp3"]}},{"no":77,"arab":"قَالَ مُوسَىٰ أَتَقُولُونَ لِلْحَقِّ لَمَّا جَاءَكُمْ ۖ أَسِحْرٌ هَٰذَا وَلَا يُفْلِحُ السَّاحِرُونَ","latin":"qaala muusaa ataquuluuna lilhaqqi lammaa jaa-akum asihrun haadzaa walaa yuflihu alssaahiruuna","translate":{"id":"Musa berkata: \"Apakah kamu mengatakan terhadap kebenaran waktu ia datang kepadamu, sihirkah ini?\" padahal ahli-ahli sihir itu tidaklah mendapat kemenangan\".\n","en":"Said Moses: \"Do you speak thus of the truth after it has been brought to you? Can this be sorcery? But sorcerers can never come to a happy end!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1441","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1441.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1441.mp3"]}},{"no":78,"arab":"قَالُوا أَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ آبَاءَنَا وَتَكُونَ لَكُمَا الْكِبْرِيَاءُ فِي الْأَرْضِ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِينَ","latin":"qaaluu aji/tanaa litalfitanaa 'ammaa wajadnaa 'alayhi aabaa-anaa watakuuna lakumaa alkibriyaau fii al-ardhi wamaa nahnu lakumaa bimu/miniina","translate":{"id":"Mereka berkata: \"Apakah kamu datang kepada kami untuk memalingkan kami dari apa yang kami dapati nenek moyang kami mengerjakannya , dan supaya kamu berdua mempunyai kekuasaan di muka bumi )? kami tidak akan mempercayai kamu berdua.\"\n","en":"[The great ones] replied: \"Hast thou come to turn us away from what we found our forefathers believing in and doing, so that the two of you might become supreme in this land? However, we do not believe in you two!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1442","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1442.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1442.mp3"]}},{"no":79,"arab":"وَقَالَ فِرْعَوْنُ ائْتُونِي بِكُلِّ سَاحِرٍ عَلِيمٍ","latin":"waqaala fir'awnu i/tuunii bikulli saahirin 'aliimin","translate":{"id":"Fir'aun berkata (kepada pemuka kaumnya): \"Datangkanlah kepadaku semua ahli-ahli sihir yang pandai!\"\n","en":"And Pharaoh commanded: \"Bring before me every sorcerer of great knowledge!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1443","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1443.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1443.mp3"]}},{"no":80,"arab":"فَلَمَّا جَاءَ السَّحَرَةُ قَالَ لَهُمْ مُوسَىٰ أَلْقُوا مَا أَنْتُمْ مُلْقُونَ","latin":"falammaa jaa-a alssaharatu qaala lahum muusaa alquu maa antum mulquuna ","translate":{"id":"Maka tatkala ahli-ahli sihir itu datang, Musa berkata kepada mereka: \"Lemparkanlah apa yang hendak kamu lemparkan.\"\n","en":"And when the sorcerers came, Moses said unto them: \"Throw whatever you may [wish to] throw!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1444","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1444.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1444.mp3"]}},{"no":81,"arab":"فَلَمَّا أَلْقَوْا قَالَ مُوسَىٰ مَا جِئْتُمْ بِهِ السِّحْرُ ۖ إِنَّ اللَّهَ سَيُبْطِلُهُ ۖ إِنَّ اللَّهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ","latin":"falammaa alqaw qaala muusaa maa ji/tum bihi alssihru inna allaaha sayubthiluhu inna allaaha laa yushlihu 'amala almufsidiina","translate":{"id":"Maka setelah mereka lemparkan, Musa berkata: \"Apa yang kamu lakukan itu, itulah yang sihir, sesungguhnya Allah akan menampakkan ketidak benarannya\" Sesungguhnya Allah tidak akan membiarkan terus berlangsungnya pekerjaan orang-yang membuat kerusakan.\n","en":"And when they threw down [their staffs and cast a spell upon the people's eyes], Moses said unto them: \"What you have contrived is [but] sorcery which, verily, God will bring to nought! Verily, God does not further the works of spreaders of corruption -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1445","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1445.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1445.mp3"]}},{"no":82,"arab":"وَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ","latin":"wayuhiqqu allaahu alhaqqa bikalimaatihi walaw kariha almujrimuuna","translate":{"id":"Dan Allah akan mengokohkan yang benar dengan ketetapan-Nya, walaupun orang-orang yang berbuat dosa tidak menyukai(nya).\n","en":"whereas by His words God proves the truth to be true, however hateful this may be to those who are lost in sin!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1446","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1446.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1446.mp3"]}},{"no":83,"arab":"فَمَا آمَنَ لِمُوسَىٰ إِلَّا ذُرِّيَّةٌ مِنْ قَوْمِهِ عَلَىٰ خَوْفٍ مِنْ فِرْعَوْنَ وَمَلَئِهِمْ أَنْ يَفْتِنَهُمْ ۚ وَإِنَّ فِرْعَوْنَ لَعَالٍ فِي الْأَرْضِ وَإِنَّهُ لَمِنَ الْمُسْرِفِينَ","latin":"famaa aamana limuusaa illaa dzurriyyatun min qawmihi 'alaa khawfin min fir'awna wamala-ihim an yaftinahum wa-inna fir'awna la'aalin fii al-ardhi wa-innahu lamina almusrifiina","translate":{"id":"Maka tidak ada yang beriman kepada Musa, melainkan pemuda-pemuda dari kaumnya (Musa) dalam keadaan takut bahwa Fir'aun dan pemuka-pemuka kaumnya akan menyiksa mereka. Sesungguhnya Fir'aun itu berbuat sewenang-wenang di muka bumi. Dan sesungguhnya dia termasuk orang-orang yang melampaui batas.\n","en":"But none save a few of his people declared their faith in Moses, [while others held back] for fear of Pharaoh and their great ones, lest they persecute them: for, verily, Pharaoh was mighty on earth and was, verily, of those who are given to excesses."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1447","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1447.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1447.mp3"]}},{"no":84,"arab":"وَقَالَ مُوسَىٰ يَا قَوْمِ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ فَعَلَيْهِ تَوَكَّلُوا إِنْ كُنْتُمْ مُسْلِمِينَ","latin":"waqaala muusaa yaa qawmi in kuntum aamantum biallaahi fa'alayhi tawakkaluu in kuntum muslimiina","translate":{"id":"Berkata Musa: \"Hai kaumku, jika kamu beriman kepada Allah, maka bertawakkallah kepada-Nya saja, jika kamu benar-benar orang yang berserah diri.\"\n","en":"And Moses said: \"O my people! If you believe in God, place your trust in Him -if you have [truly] surrendered yourselves unto Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1448","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1448.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1448.mp3"]}},{"no":85,"arab":"فَقَالُوا عَلَى اللَّهِ تَوَكَّلْنَا رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ","latin":"faqaaluu 'alaa allaahi tawakkalnaa rabbanaa laa taj'alnaa fitnatan lilqawmi alzhzhaalimiina","translate":{"id":"Lalu mereka berkata: \"Kepada Allahlah kami bertawakkal! Ya Tuhan kami; janganlah Engkau jadikan kami sasaran fitnah bagi kaum yang'zalim,\n","en":"Whereupon they answered: \"In God have we placed our trust! O our Sustainer, make us not a plaything for evildoing folk,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1449","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1449.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1449.mp3"]}},{"no":86,"arab":"وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ","latin":"wanajjinaa birahmatika mina alqawmi alkaafiriina","translate":{"id":"dan selamatkanlah kami dengan rahmat Engkau dari (tipu daya) orang-orang yang kafir.\"\n","en":"and save us, by Thy grace, from people who deny the truth!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1450","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1450.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1450.mp3"]}},{"no":87,"arab":"وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ وَأَخِيهِ أَنْ تَبَوَّآ لِقَوْمِكُمَا بِمِصْرَ بُيُوتًا وَاجْعَلُوا بُيُوتَكُمْ قِبْلَةً وَأَقِيمُوا الصَّلَاةَ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","latin":"wa-awhaynaa ilaa muusaa wa-akhiihi an tabawwaaa liqawmikumaa bimishra buyuutan waij'aluu buyuutakum qiblatan wa-aqiimuu alshshalaata wabasysyiri almu/miniina","translate":{"id":"Dan Kami wahyukan kepada Musa dan saudaranya: \"Ambillah olehmu berdua beberapa buah rumah di Mesir untuk tempat tinggal bagi kaummu dan jadikanlah olehmu rumah-rumahmu itu tempat shalat dan dirikanlah olehmu sembahyang serta gembirakanlah orang-orang yang beriman\".\n","en":"And [thus] did We inspire Moses and his brother: \"Set aside for your people some houses in the city, and [tell them], `Turn your houses into places of worship, and be constant in prayer!' And give thou [O Moses] the glad tiding [of God's succour] to all believers.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1451","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1451.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1451.mp3"]}},{"no":88,"arab":"وَقَالَ مُوسَىٰ رَبَّنَا إِنَّكَ آتَيْتَ فِرْعَوْنَ وَمَلَأَهُ زِينَةً وَأَمْوَالًا فِي الْحَيَاةِ الدُّنْيَا رَبَّنَا لِيُضِلُّوا عَنْ سَبِيلِكَ ۖ رَبَّنَا اطْمِسْ عَلَىٰ أَمْوَالِهِمْ وَاشْدُدْ عَلَىٰ قُلُوبِهِمْ فَلَا يُؤْمِنُوا حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ","latin":"waqaala muusaa rabbanaa innaka aatayta fir'awna wamala-ahu ziinatan wa-amwaalan fii alhayaati alddunyaa rabbanaa liyudhilluu 'an sabiilika rabbanaa ithmis 'alaa amwaalihim wausydud 'alaa quluubihim falaa yu/minuu hattaa yarawuu al'adzaaba al-aliima","translate":{"id":"Musa berkata: \"Ya Tuhan kami, sesungguhnya Engkau telah memberi kepada Fir'aun dan pemuka-pemuka kaumnya perhiasan dan harta kekayaan dalam kehidupan dunia, ya Tuhan Kami - akibatnya mereka menyesatkan (manusia) dari jalan Engkau. Ya Tuhan kami, binasakanlah harta benda mereka, dan kunci matilah hati mereka, maka mereka tidak beriman hingga mereka melihat siksaan yang pedih.\"\n","en":"And Moses prayed: \"O our Sustainer! Verily, splendour and riches hast Thou vouchsafed, in the life of this world, unto Pharaoh and his great ones-with the result, O our Sustainer, that they are leading [others] astray from Thy path! O our Sustainer! Wipe out their riches, and harden their hearts, so that they may not attain to faith ere they see the grievous suffering [that awaits them]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1452","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1452.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1452.mp3"]}},{"no":89,"arab":"قَالَ قَدْ أُجِيبَتْ دَعْوَتُكُمَا فَاسْتَقِيمَا وَلَا تَتَّبِعَانِّ سَبِيلَ الَّذِينَ لَا يَعْلَمُونَ","latin":"qaala qad ujiibat da'watukumaa faistaqiimaa walaa tattabi'aanni sabiila alladziina laa ya'lamuuna","translate":{"id":"AlIah berfirman: \"Sesungguhnya telah diperkenankan permohonan kamu berdua, sebab itu tetaplah kamu berdua pada jalan yang lurus dan janganlah sekali-kali kamu mengikuti jalan orang-orang yang tidak mengetahui\".\n","en":"[God] answered: \"Accepted is this your prayer! Continue, then, both of you, steadfastly on the right way, and follow not the path of those who have no knowledge [of right and wrong].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1453","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1453.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1453.mp3"]}},{"no":90,"arab":"وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُ بَغْيًا وَعَدْوًا ۖ حَتَّىٰ إِذَا أَدْرَكَهُ الْغَرَقُ قَالَ آمَنْتُ أَنَّهُ لَا إِلَٰهَ إِلَّا الَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ وَأَنَا مِنَ الْمُسْلِمِينَ","latin":"wajaawaznaa bibanii israa-iila albahra fa-atba'ahum fir'awnu wajunuuduhu baghyan wa'adwan hattaa idzaa adrakahu algharaqu qaala aamantu annahu laa ilaaha illaa alladzii aamanat bihi banuu israa-iila wa-anaa mina almuslimiina","translate":{"id":"Dan Kami memungkinkan Bani Israil melintasi laut, lalu mereka diikuti oleh Fir'aun dan bala tentaranya, karena hendak menganiaya dan menindas (mereka); hingga bila Fir'aun itu telah hampir tenggelam berkatalah dia: \"Saya percaya bahwa tidak ada Tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan saya termasuk orang-orang yang berserah diri (kepada Allah)\".\n","en":"And We brought the children of Israel across the sea; and thereupon Pharaoh and his hosts pursued them with vehement insolence and tyranny, until [they were overwhelmed by the waters of the sea. And] when he was about to drown, [Pharaoh] exclaimed: \"I have come to believe that there is no deity save Him in whom the children of Israel believe, and I am of those who surrender themselves unto Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1454","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1454.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1454.mp3"]}},{"no":91,"arab":"آلْآنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنْتَ مِنَ الْمُفْسِدِينَ","latin":"aal-aana waqad 'ashayta qablu wakunta mina almufsidiina","translate":{"id":"Apakah sekarang (baru kamu percaya), padahal sesungguhnya kamu telah durhaka sejak dahulu, dan kamu termasuk orang-orang yang berbuat kerusakan.\n","en":"[But God said:] \"Now? -when ever before this thou hast been rebelling [against Us], and hast been among those who spread corruption?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1455","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1455.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1455.mp3"]}},{"no":92,"arab":"فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً ۚ وَإِنَّ كَثِيرًا مِنَ النَّاسِ عَنْ آيَاتِنَا لَغَافِلُونَ","latin":"faalyawma nunajjiika bibadanika litakuuna liman khalfaka aayatan wa-inna katsiiran mina alnnaasi 'an aayaatinaa laghaafiluuna","translate":{"id":"Maka pada hari ini Kami selamatkan badanmu supaya kamu dapat menjadi pelajaran bagi orang-orang yang datang sesudahmu dan sesungguhnya kebanyakan dari manusia lengah dari tanda-tanda kekuasaan Kami.\n","en":"[Nay,] but today We shall save only thy body, so that thou mayest be a [warning] sign unto those who will come after thee: for, behold, a good many people are heedless of Our messages!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1456","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1456.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1456.mp3"]}},{"no":93,"arab":"وَلَقَدْ بَوَّأْنَا بَنِي إِسْرَائِيلَ مُبَوَّأَ صِدْقٍ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ فَمَا اخْتَلَفُوا حَتَّىٰ جَاءَهُمُ الْعِلْمُ ۚ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ","latin":"walaqad bawwa/naa banii israa-iila mubawwa-a shidqin warazaqnaahum mina alththhayyibaati famaa ikhtalafuu hattaa jaa-ahumu al'ilmu inna rabbaka yaqdhii baynahum yawma alqiyaamati fiimaa kaanuu fiihi yakhtalifuuna","translate":{"id":"Dan sesungguhnya Kami telah menempatkan Bani Israil di ternpat kediaman yang bagus dan Kami beri mereka rezki dari yang baik-baik. Maka mereka tidak berselisih, kecuali setelah datang kepada mereka pengetahuan (yang tersebut dalam Taurat). Sesungguhnya Tuhan kamu akan memutuskan antara mereka di hari kiamat tentang apa yang mereka perselisihkan itu.\n","en":"And [thereafter], indeed, We assigned unto the children of Israel a most goodly abode, and provided for them sustenance out of the good things of life. And it was not until knowledge [of God's revelation] was vouchsafed to them that they began to hold divergent views: [but,] verily, thy Sustainer will judge between them on Resurrection Day regarding all on which they were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1457","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1457.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1457.mp3"]}},{"no":94,"arab":"فَإِنْ كُنْتَ فِي شَكٍّ مِمَّا أَنْزَلْنَا إِلَيْكَ فَاسْأَلِ الَّذِينَ يَقْرَءُونَ الْكِتَابَ مِنْ قَبْلِكَ ۚ لَقَدْ جَاءَكَ الْحَقُّ مِنْ رَبِّكَ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ","latin":"fa-in kunta fii syakkin mimmaa anzalnnaa ilayka fais-ali alladziina yaqrauuna alkitaaba min qablika laqad jaa-aka alhaqqu min rabbika falaa takuunanna mina almumtariina","translate":{"id":"Maka jika kamu (Muhammad) berada dalam keragu-raguan tentang apa yang Kami turunkan kepadamu, maka tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu. Sesungguhnya telah datang kebenaran kepadamu dari Tuhanmu, sebab itu janganlah sekali-kali kamu temasuk orang-orang yang ragu-ragu.\n","en":"AND SO, [O man,] if thou art in doubt about [the truth of] what We have [now] bestowed upon thee from on high, ask those who read the divine writ [revealed] before thy time: [and thou wilt find that,] surely, the truth has now come unto thee from thy Sustainer. Be not, then, among the doubters -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1458","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1458.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1458.mp3"]}},{"no":95,"arab":"وَلَا تَكُونَنَّ مِنَ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ فَتَكُونَ مِنَ الْخَاسِرِينَ","latin":"walaa takuunanna mina alladziina kadzdzabuu bi-aayaati allaahi fatakuuna mina alkhaasiriina","translate":{"id":"Dan sekali-kali janganlah kamu termasuk orang-orang yang mendustakan ayat-ayat Allah yang menyebabkan kamu termasuk orang-orang yang rugi.\n","en":"and neither be among those who are bent on giving the lie to God's messages, lest thou find thyself among the lost."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1459","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1459.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1459.mp3"]}},{"no":96,"arab":"إِنَّ الَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لَا يُؤْمِنُونَ","latin":"inna alladziina haqqat 'alayhim kalimatu rabbika laa yu/minuuna","translate":{"id":"Sesungguhnya orang-orang yang telah pasti terhadap mereka kalimat Tuhanmu, tidaklah akan beriman ,\n","en":"Verily, they against whom thy Sustainer's word [of judgment] has come true will not attain to faith -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1460","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1460.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1460.mp3"]}},{"no":97,"arab":"وَلَوْ جَاءَتْهُمْ كُلُّ آيَةٍ حَتَّىٰ يَرَوُا الْعَذَابَ الْأَلِيمَ","latin":"walaw jaa-at-hum kullu aayatin hattaa yarawuu al'adzaaba al-aliima","translate":{"id":"meskipun datang kepada mereka segala macam keterangan, hingga mereka menyaksikan azab yang pedih.\n","en":"even though every sign [of the truth] should come within their ken - until they behold the grievous suffering [that awaits them in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1461","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1461.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1461.mp3"]}},{"no":98,"arab":"فَلَوْلَا كَانَتْ قَرْيَةٌ آمَنَتْ فَنَفَعَهَا إِيمَانُهَا إِلَّا قَوْمَ يُونُسَ لَمَّا آمَنُوا كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَمَتَّعْنَاهُمْ إِلَىٰ حِينٍ","latin":"falawlaa kaanat qaryatun aamanat fanafa'ahaa iimaanuhaa illaa qawma yuunusa lammaa aamanuu kasyafnaa 'anhum 'adzaaba alkhizyi fii alhayaati alddunyaa wamatta'naahum ilaa hiinin","translate":{"id":"Dan mengapa tidak ada (penduduk) suatu kota yang beriman, lalu imannya itu bermanfa'at kepadanya selain kaum Yunus? Tatkala mereka (kaum Yunus itu), beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai kepada waktu yang tertentu.\n","en":"For, alas, there has never yet been any community that attained to faith [in its entirety,] and thereupon benefited by its faith, except the people of Jonah. When they came to believe, We removed from them the suffering of disgrace [which otherwise would have befallen them even] in the life of this world, and allowed them to enjoy their life during the time allotted to them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1462","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1462.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1462.mp3"]}},{"no":99,"arab":"وَلَوْ شَاءَ رَبُّكَ لَآمَنَ مَنْ فِي الْأَرْضِ كُلُّهُمْ جَمِيعًا ۚ أَفَأَنْتَ تُكْرِهُ النَّاسَ حَتَّىٰ يَكُونُوا مُؤْمِنِينَ","latin":"walaw syaa-a rabbuka laaamana man fii al-ardhi kulluhum jamii'an afa-anta tukrihu alnnaasa hattaa yakuunuu mu/miniina ","translate":{"id":"Dan jikalau Tuhanmu menghendaki, tentulah beriman semua orang yang di muka bumi seluruhnya. Maka apakah kamu (hendak) memaksa manusia supaya mereka menjadi orang-orang yang beriman semuanya ?\n","en":"And [thus it is:] had thy Sustainer so willed, all those who live on earth would surely have attained to faith, all of them: dost thou, then, think that thou couldst compel people to believe,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1463","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1463.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1463.mp3"]}},{"no":100,"arab":"وَمَا كَانَ لِنَفْسٍ أَنْ تُؤْمِنَ إِلَّا بِإِذْنِ اللَّهِ ۚ وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِينَ لَا يَعْقِلُونَ","latin":"wamaa kaana linafsin an tu/mina illaa bi-idzni allaahi wayaj'alu alrrijsa 'alaa alladziina laa ya'qiluuna","translate":{"id":"Dan tidak ada seorangpun akan beriman kecuali dengan izin Allah; dan Allah menimpakan kemurkaan kepada orang-orang yang tidak mempergunakan akalnya.\n","en":"notwithstanding that no human being can ever attain to faith otherwise than by God's leave, and [that] it is He who lays the loathsome evil [of disbelief] upon those who will not use -their reason?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1464","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1464.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1464.mp3"]}},{"no":101,"arab":"قُلِ انْظُرُوا مَاذَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ","latin":"quli unzhuruu maatsaa fii alssamaawaati waal-ardhi wamaa tughnii al-aayaatu waalnnudzuru 'an qawmin laa yu/minuuna","translate":{"id":"Katakanlah: \"Perhatikanlah apa yaag ada di langit dan di bumi. Tidaklah bermanfa'at tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman\".\n","en":"Say: \"Consider whatever there is in the heavens and on earth!\" But of what avail could all the messages and all the warnings be to people who will not believe?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1465","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1465.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1465.mp3"]}},{"no":102,"arab":"فَهَلْ يَنْتَظِرُونَ إِلَّا مِثْلَ أَيَّامِ الَّذِينَ خَلَوْا مِنْ قَبْلِهِمْ ۚ قُلْ فَانْتَظِرُوا إِنِّي مَعَكُمْ مِنَ الْمُنْتَظِرِينَ","latin":"fahal yantazhiruuna illaa mitsla ayyaami alladziina khalaw min qablihim qul faintazhiruu innii ma'akum mina almuntazhiriina","translate":{"id":"Mereka tidak menunggu-nunggu kecuali (kejadian-kejadian) yang sama dengan kejadian-kejadian (yang menimpa) orang-orang yang telah terdahulu sebelum mereka. Katakanlah: \"Maka tunggulah, sesungguhnya akupun termasuk orang-orang yang menunggu bersama kamu\".\n","en":"Can such, then, expect anything else [to befall them] but the like of the days of [calamity which befell] those [deniers of the truth] who passed away before them? Say: \"Wait, then, [for what will happen) verily, I shall wait with you!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1466","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1466.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1466.mp3"]}},{"no":103,"arab":"ثُمَّ نُنَجِّي رُسُلَنَا وَالَّذِينَ آمَنُوا ۚ كَذَٰلِكَ حَقًّا عَلَيْنَا نُنْجِ الْمُؤْمِنِينَ","latin":"tsumma nunajjii rusulanaa waalladziina aamanuu kadzaalika haqqan 'alaynaa nunjii almu/miniina","translate":{"id":"Kemudian Kami selamatkan rasul-rasul Kami dan orang-orang yang beriman, demikianlah menjadi kewajiban atas Kami menyelamatkan orang-orang yang beriman.\n","en":"[For thus it always happens: We seal the doom of all who deny the truth and give the lie to Our messages;] and thereupon We save Our apostles and those who have attained to faith. Thus have We willed it upon Ourselves: We save all who believe [in Us],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1467","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1467.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1467.mp3"]}},{"no":104,"arab":"قُلْ يَا أَيُّهَا النَّاسُ إِنْ كُنْتُمْ فِي شَكٍّ مِنْ دِينِي فَلَا أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ وَلَٰكِنْ أَعْبُدُ اللَّهَ الَّذِي يَتَوَفَّاكُمْ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُؤْمِنِينَ","latin":"qul yaa ayyuhaa alnnaasu in kuntum fii syakkin min diinii falaa a'budu alladziina ta'buduuna min duuni allaahi walaakin a'budu allaaha alladzii yatawaffaakum waumirtu an akuuna mina almu/miniin","translate":{"id":"Katakanlah: \"Hai manusia, jika kamu masih dalam keragu-raguan tentang agamaku, maka (ketahuilah) aku tidak menyembah yang kamu sembah selain Allah, tetapi aku menyembah Allah yang akan mematikan kamu dan aku telah diperintah supaya termasuk orang-orang yang beriman\",\n","en":"SAY [O Prophet]: \"O mankind! If you are in doubt as to what my faith is, then [know that] I do not worship those beings whom you worship beside God, but [that] I worship God alone, who shall cause you [all] to die: for I have been bidden to be among those who believe [in Him alone].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1468","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1468.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1468.mp3"]}},{"no":105,"arab":"وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ","latin":"wa-an aqim wajhaka lilddiini haniifan walaa takuunanna mina almusyrikiina","translate":{"id":"dan (aku telah diperintah): \"Hadapkanlah mukamu kepada agama dengan tulus dan ikhlas dan janganlah kamu termasuk orang-orang yang musyrik.\n","en":"Hence, [O man,] set thy face steadfastly towards the [true] faith, turning away from all that is false, and be not among those who ascribe divinity to aught beside God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1469","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1469.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1469.mp3"]}},{"no":106,"arab":"وَلَا تَدْعُ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُكَ وَلَا يَضُرُّكَ ۖ فَإِنْ فَعَلْتَ فَإِنَّكَ إِذًا مِنَ الظَّالِمِينَ","latin":"walaa tad'u min duuni allaahi maa laa yanfa'uka walaa yadhurruka fa-in fa'alta fa-innaka idzan mina alzhzhaalimiina","translate":{"id":"Dan janganlah kamu menyembah apa-apa yang tidak memberi manfa'at dan tidak (pula) memberi mudharat kepadamu selain Allah; sebab jika kamu berbuat (yang demikian), itu, maka sesungguhnya kamu kalau begitu termasuk orang-orang yang zalim\".\n","en":"Thus, do not invoke, side by side with God, anything that can neither benefit thee nor harm thee: for, behold, if thou do it, thou wilt surely be among the evildoers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1470","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1470.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1470.mp3"]}},{"no":107,"arab":"وَإِنْ يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِنْ يُرِدْكَ بِخَيْرٍ فَلَا رَادَّ لِفَضْلِهِ ۚ يُصِيبُ بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۚ وَهُوَ الْغَفُورُ الرَّحِيمُ","latin":"wa-in yamsaska allaahu bidhurrin falaa kaasyifa lahu illaa huwa wa-in yuridka bikhayrin falaa raadda lifadhlihi yushiibu bihi man yasyaau min 'ibaadihi wahuwa alghafuuru alrrahiimu","translate":{"id":"Jika Allah menimpakan sesuatu kemudharatan kepadamu, maka tidak ada yang dapat menghilangkannya kecuali Dia. Dan jika Allah menghendaki kebaikan bagi kamu, maka tak ada yang dapat menolak kurniaNya. Dia memberikan kebaikan itu kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya dan Dia-lah Yang Maha Pengampun lagi Maha Penyayang.\n","en":"And [know that] if God should touch thee with misfortune, there is none who could remove it save Him; and if He intends good for thee, there is none who could turn away His bounty: He causes it to alight upon whomsoever He wills of His servants. And He alone is truly forgiving, truly a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1471","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1471.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1471.mp3"]}},{"no":108,"arab":"قُلْ يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الْحَقُّ مِنْ رَبِّكُمْ ۖ فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنَا عَلَيْكُمْ بِوَكِيلٍ","latin":"qul yaa ayyuhaa alnnaasu qad jaa-akumu alhaqqu min rabbikum famani ihtadaa fa-innamaa yahtadii linafsihi waman dhalla fa-innamaa yadhillu 'alayhaa wamaa anaa 'alaykum biwakiilin","translate":{"id":"Katakanlah: \"Hai manusia, sesungguhnya teIah datang kepadamu kebenaran (Al Qur'an) dari Tuhanmu, sebab itu barangsiapa yang mendapat petunjuk maka sesungguhnya (petunjuk itu) untuk kebaikan dirinya sendiri. Dan barangsiapa yang sesat, maka sesungguhnya kesesatannya itu mencelakakan dirinya sendiri. Dan aku bukanlah seorang penjaga terhadap dirimu\".\n","en":"SAY [O Prophet]: \"O mankind! The truth from your Sustainer has now come unto you. Whoever, therefore, chooses to follow the right path, follows it but for his own good; and whoever chooses to go astray, goes but astray to his own hurt. And I am not responsible for your conduct.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1472","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1472.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1472.mp3"]}},{"no":109,"arab":"وَاتَّبِعْ مَا يُوحَىٰ إِلَيْكَ وَاصْبِرْ حَتَّىٰ يَحْكُمَ اللَّهُ ۚ وَهُوَ خَيْرُ الْحَاكِمِينَ","latin":"waittabi' maa yuuhaa ilayka waishbir hattaa yahkuma allaahu wahuwa khayru alhaakimiina","translate":{"id":"Dan ikutilah apa yang diwahyukan kepadamu, dan bersabarlah hingga Allah memberi keputusan dan Dia adalah Hakim yang sebaik-baiknya.\n","en":"And [as for thyself, O Muhammad,] follow but what is being revealed unto thee, and be patient in adversity, until God shall give His judgment: for He is the best of all judges."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1473","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1473.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1473.mp3"]}}]}