{"alquran":{"no":14,"name":"Ibrahim","arab":"ابراهيم","start":1750,"count":52,"rukku":7,"type":"mecca","description":"Surat Ibrahim ini terdiri atas 52 ayat, termasuk golongan surat-surat Makkiyyah karena diturunkan di Mekah sebelum Hijrah. Dinamakan <i>Ibrahim</i>, karena surat ini mengandung doa Nabi Ibrahim a.s. yaitu ayat 35 sampai dengan 41. Do'a ini isinya antara lain: permohonan agar keturunannya mendirikan shalat, dijauhkan dari menyembah berhala-berhala dan agar Mekah dan daerah sekitarnya menjadi daerah yang aman dan makmur. Doa Nabi Ibrahim a.s. ini telah diperkenankan oleh Allah s.w.t. sebagaimana telah terbukti keamanannya sejak dahulu sampai sekarang. Do'a tersebut dipanjatkan beliau ke hadirat Allah s.w.t. sesudah selesai membina Ka'bah bersama puteranya Ismail a.s., di dataran tanah Mekah yang tandus."},"surah":[{"no":1,"arab":" الر ۚ كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَاطِ الْعَزِيزِ الْحَمِيدِ","latin":"alif-laam-raa kitaabun anzalnaahu ilayka litukhrija alnnaasa mina alzhzhulumaati ilaa alnnuuri bi-idzni rabbihim ilaa shiraathi al'aziizi alhamiidi","translate":{"id":"Alif, laam raa. (Ini adalah) Kitab yang Kami turunkan kepadamu supaya kamu mengeluarkan manusia dari gelap gulita kepada cahaya terang benderang dengan izin Tuhan mereka, (yaitu) menuju jalan Tuhan Yang Maha Perkasa lagi Maha Terpuji.\n","en":"Alif. Lam. Ra. A DIVINE WRIT [is this -a revelation] which We have bestowed upon thee from on high in order that thou might bring forth all mankind, by their Sustainer's leave, out of the depths of darkness into the light: onto the way that leads to the Almighty, the One to whom all praise is due -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1751","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1751.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1751.mp3"]}},{"no":2,"arab":"اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَوَيْلٌ لِلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ","latin":"allaahi alladzii lahu maa fii alssamaawaati wamaa fii al-ardhi wawaylun lilkaafiriina min 'adzaabin syadiidin","translate":{"id":"Allah-lah yang memiliki segala apa yang di langit dan di bumi. Dan kecelakaanlah bagi orang-orang kafir karena siksaan yang sangat pedih,\n","en":"to God, unto whom all that is in the heavens and all that is on earth belongs. But woe unto those who deny the truth: for suffering severe"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1752","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1752.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1752.mp3"]}},{"no":3,"arab":"الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا ۚ أُولَٰئِكَ فِي ضَلَالٍ بَعِيدٍ","latin":"alladziina yastahibbuuna alhayaata alddunyaa 'alaa al-aakhirati wayashudduuna 'an sabiili allaahi wayabghuunahaa 'iwajan ulaa-ika fii dhalaalin ba'iidin","translate":{"id":"(yaitu) orang-orang yang lebih menyukai kehidupan dunia dari pada kehidupan akhirat, dan menghalang-halangi (manusia) dari jalan Allah dan menginginkan agar jalan Allah itu bengkok. Mereka itu berada dalam kesesatan yang jauh.\n","en":"awaits those who choose the life of this world as the sole object of their love, preferring it to [all thought of] the life to come, and who turn others away from the path of God and try to make it appear crooked. Such as these have indeed gone far astray!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1753","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1753.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1753.mp3"]}},{"no":4,"arab":"وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ ۖ فَيُضِلُّ اللَّهُ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"wamaa arsalnaa min rasuulin illaa bilisaani qawmihi liyubayyina lahum fayudhillu allaahu man yasyaau wayahdii man yasyaau wahuwa al'aziizu alhakiimu","translate":{"id":"Kami tidak mengutus seorang rasulpun, melainkan dengan bahasa kaumnya , supaya ia dapat memberi penjelasan dengan terang kepada mereka. Maka Allah menyesatkan siapa yang Dia kehendaki, dan memberi petunjuk kepada siapa yang Dia kehendaki. Dan Dia-lah Tuhan Yang Maha Kuasa lagi Maha Bijaksana.\n","en":"AND NEVER have We sent forth any apostle otherwise than [with a message] in his own people's tongue, so that he might make [the truth] clear unto them; but God lets go astray him that wills [to go astray], and guides him that wills [to be guided] -for He alone is almighty, truly wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1754","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1754.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1754.mp3"]}},{"no":5,"arab":"وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ","latin":"walaqad arsalnaa muusaa bi-aayaatinaa an akhrij qawmaka mina alzhzhulumaati ilaa alnnuuri wadzakkirhum bi-ayyaami allaahi inna fii dzaalika laaayaatin likulli shabbaarin syakuurin","translate":{"id":"Dan sesungguhnya Kami telah mengutus Musa dengan membawa ayat-ayat Kami, (dan Kami perintahkan kepadanya): \"Keluarkanlah kaummu dari gelap gulita kepada cahaya terang benderang dan ingatkanlah mereka kepada hari-hari Allah \". Sesunguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi setiap orang penyabar dan banyak bersyukur.\n","en":"And [thus], indeed, have We sent forth Moses with Our messages [and this Our command]: \"Lead thy people out of the depths of darkness into the light, and remind them of the Days of God!\" Verily, in this [reminder] there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1755","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1755.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1755.mp3"]}},{"no":6,"arab":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ أَنْجَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ","latin":"wa-idz qaala muusaa liqawmihi udzkuruu ni'mata allaahi 'alaykum idz anjaakum min aali fir'awna yasuumuunakum suu-a al'adzaabi wayudzabbihuuna abnaa-akum wayastahyuuna nisaa-akum wafii dzaalikum balaaun min rabbikum 'azhiimun","translate":{"id":"Dan (ingatlah), ketika Musa berkata kepada kaumnya: \"Ingatlah ni'mat Allah atasmu ketika Dia menyelamatkan kamu dari (Fir'aun dan) pengikut-pengikutnya, mereka menyiksa kamu dengan siksa yang pedih, mereka menyembelih anak-anak laki-lakimu, membiarkan hidup anak-anak perempuanmu; dan pada yang demikian itu ada cobaan yang besar dari Tuhanmu\".\n","en":"And, lo Moses spoke [thus] unto his people: \"Remember the blessings which God bestowed upon you when He saved you from Pharaoh's people who afflicted you with cruel suffering, and slaughtered your sons, and spared [only] your women -which was an awesome trial from your Sustainer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1756","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1756.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1756.mp3"]}},{"no":7,"arab":"وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ","latin":"wa-idz ta-adzdzana rabbukum la-in syakartum la-aziidannakum wala-in kafartum inna 'adzaabii lasyadiidun","translate":{"id":"Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (ni'mat) kepadamu, dan jika kamu mengingkari (ni'mat-Ku), maka sesungguhnya azab-Ku sangat pedih\".\n","en":"And [remember the time] when your Sustainer made [this promise] known: 'If you are grateful [to Me], I shall most certainly give you more and more; but if you are ungrateful, verily, My chastisement will be severe indeed!\"'"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1757","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1757.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1757.mp3"]}},{"no":8,"arab":"وَقَالَ مُوسَىٰ إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الْأَرْضِ جَمِيعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَمِيدٌ","latin":"waqaala muusaa in takfuruu antum waman fii al-ardhi jamii'an fa-inna allaaha laghaniyyun hamiidun","translate":{"id":"Dan Musa berkata: \"Jika kamu dan orang-orang yang ada di muka bumi semuanya mengingkari (ni'mat Allah) maka sesungguhnya Allah Maha Kaya lagi Maha Terpuji\".\n","en":"And Moses added: \"If you should [ever] deny the truth-you and whoever else lives on earth, all of you-[know that,] verily, God is indeed self-sufficient, ever to be praised!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1758","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1758.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1758.mp3"]}},{"no":9,"arab":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِنْ قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ ۛ وَالَّذِينَ مِنْ بَعْدِهِمْ ۛ لَا يَعْلَمُهُمْ إِلَّا اللَّهُ ۚ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَرَدُّوا أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُوا إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُمْ بِهِ وَإِنَّا لَفِي شَكٍّ مِمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ","latin":"alam ya/tikum nabau alladziina min qablikum qawmi nuuhin wa'aadin watsamuuda waalladziina min ba'dihim laa ya'lamuhum illaa allaahu jaa-at-hum rusuluhum bialbayyinaati faradduu aydiyahum fii afwaahihim waqaaluu innaa kafarnaa bimaa ursiltum bihi wa-innaa lafii syakkin mimmaa tad'uunanaa ilayhi muriibun","translate":{"id":"Belumkah sampai kepadamu berita orang-orang sebelum kamu (yaitu) kaum Nuh, 'Ad, Tsamud dan orang-orang sesudah mereka. Tidak ada yang mengetahui mereka selain Allah. Telah datang rasul-rasul kepada mereka (membawa) bukti-bukti yang nyata lalu mereka menutupkan tangannya ke mulutnya (karena kebencian), dan berkata: \"Sesungguhnya kami mengingkari apa yang kamu disuruh menyampaikannya (kepada kami), dan sesungguhnya kami benar-benar dalam keragu-raguan yang menggelisahkan terhadap apa yang kamu ajak kami kepadanya\".\n","en":"HAVE THE STORIES of those [deniers of the truth] who lived before you never yet come within your ken - [the stories of] the people of Noah, and of [the tribes of] `Ad and Thamud, and of those who came after them? None knows them [now] save God. There came unto them their apostles with all evidence of the truth -but they covered their mouths with their hands and answered: \"Behold, we refuse to regard as true the message with which you [claim to] have been entrusted; and, behold, we are in grave doubt, amounting to suspicion, about [the meaning of] your call to us!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1759","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1759.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1759.mp3"]}},{"no":10,"arab":"قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَدْعُوكُمْ لِيَغْفِرَ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ قَالُوا إِنْ أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا تُرِيدُونَ أَنْ تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتُونَا بِسُلْطَانٍ مُبِينٍ","latin":"qaalat rusuluhum afii allaahi syakkun faathiri alssamaawaati waal-ardhi yad'uukum liyaghfira lakum min dzunuubikum wayu-akhkhirakum ilaa ajalin musamman qaaluu in antum illaa basyarun mitslunaa turiiduuna an tashudduunaa 'ammaa kaana ya'budu aabaaunaa fa/tuunaa bisulthaanin mubiinin","translate":{"id":"Berkata rasul-rasul mereka: \"Apakah ada keragu-raguan terhadap Allah, Pencipta langit dan bumi? Dia menyeru kamu untuk memberi ampunan kepadamu dari dosa-dosamu dan menangguhkan (siksaan)mu sampai masa yang ditentukan?\" Mereka berkata: \"Kamu tidak lain hanyalah manusia seperti kami juga. Kamu menghendaki untuk menghalang-halangi (membelokkan) kami dari apa yang selalu disembah nenek moyang kami, karena itu datangkanlah kepada kami, bukti yang nyata\".\n","en":"Said the apostles sent unto them: \"Can there be any doubt about [the existence and oneness of] God, the Originator of the heavens and the earth? It is He who calls unto you, so that He may forgive you [whatever is past] of your sins and grant you respite until a term [set by Him is fulfilled].\" [But] they replied: \"You are nothing but mortal men like ourselves! You want to turn us away from what our forefathers were wont to worship: well, then, bring us a clear proof [of your being God's message-bearers]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1760","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1760.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1760.mp3"]}},{"no":11,"arab":"قَالَتْ لَهُمْ رُسُلُهُمْ إِنْ نَحْنُ إِلَّا بَشَرٌ مِثْلُكُمْ وَلَٰكِنَّ اللَّهَ يَمُنُّ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۖ وَمَا كَانَ لَنَا أَنْ نَأْتِيَكُمْ بِسُلْطَانٍ إِلَّا بِإِذْنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","latin":"qaalat lahum rusuluhum in nahnu illaa basyarun mitslukum walaakinna allaaha yamunnu 'alaa man yasyaau min 'ibaadihi wamaa kaana lanaa an na/tiyakum bisulthaanin illaa bi-idzni allaahi wa'alaa allaahi falyatawakkali almu/minuuna","translate":{"id":"Rasul-rasul mereka berkata kepada mereka: \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Dan tidak patut bagi kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah. Dan hanya kepada Allah sajalah hendaknya orang-orang mukmin bertawakkal.\n","en":"Their apostles answered them: \"True, we are nothing but mortal men like yourselves: but God bestows His favour upon whomever He wills of His servants. Withal, it is not within our power to bring you a proof [of our mission], unless it be by God's leave-and [so] it is in God that all believers must place their trust."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1761","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1761.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1761.mp3"]}},{"no":12,"arab":"وَمَا لَنَا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَدْ هَدَانَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ","latin":"wamaa lanaa allaa natawakkala 'alaa allaahi waqad hadaanaa subulanaa walanashbiranna 'alaa maa aadzaytumuunaa wa'alaa allaahi falyatawakkali almutawakkiluuna","translate":{"id":"Mengapa kami tidak akan bertawakkal kepada Allah padahal Dia telah menunjukkan jalan kepada kami, dan kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami. Dan hanya kepada Allah saja orang-orang yang bertawakkal itu, berserah diri\".\n","en":"And how could we not place our trust in God, seeing that it is He who has shown us the path which we are to follow? \"Hence, we shall certainly bear with patience whatever hurt you may do us: for, all who have trust [in His existence] must place their trust in God [alone]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1762","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1762.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1762.mp3"]}},{"no":13,"arab":"وَقَالَ الَّذِينَ كَفَرُوا لِرُسُلِهِمْ لَنُخْرِجَنَّكُمْ مِنْ أَرْضِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۖ فَأَوْحَىٰ إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظَّالِمِينَ","latin":"waqaala alladziina kafaruu lirusulihim lanukhrijannakum min ardhinaa aw lata'uudunna fii millatinaa fa-awhaa ilayhim rabbuhum lanuhlikanna alzhzhaalimiina","translate":{"id":"Orang-orang kafir berkata kepada Rasul-rasul mereka: \"Kami sungguh-sungguh akan mengusir kamu dari negeri kami atau kamu kembali kepada agama kami\". Maka Tuhan mewahyukan kepada mereka: \"Kami pasti akan membinasakan orang-orang yang zalim itu,\n","en":"But they who denied the truth spoke [thus] unto their apostles: \"We shall most certainly expel you from our land, unless you return forthwith to our ways. Whereupon their Sustainer revealed this to His apostles: \"Most certainly shall We destroy these evildoers,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1763","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1763.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1763.mp3"]}},{"no":14,"arab":"وَلَنُسْكِنَنَّكُمُ الْأَرْضَ مِنْ بَعْدِهِمْ ۚ ذَٰلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ","latin":"walanuskinannakumu al-ardha min ba'dihim dzaalika liman khaafa maqaamii wakhaafa wa'iidi","translate":{"id":"dan Kami pasti akan menempatkan kamu di negeri-negeri itu sesudah mereka. Yang demikian itu (adalah untuk) orang-orang yang takut (akan menghadap) kehadirat-Ku dan yang takut kepada ancaman-Ku \".\n","en":"and most certainly shall We cause you to dwell on earth [long] after they have passed away: this is [My promise] unto all who stand in awe of My presence, and stand in awe of My warning!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1764","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1764.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1764.mp3"]}},{"no":15,"arab":"وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ","latin":"waistaftahuu wakhaaba kullu jabbaarin 'aniidin","translate":{"id":"Dan mereka memohon kemenangan (atas musuh-musuh mereka) dan binasalah semua orang yang berlaku sewenang-wenang lagi keras kepala,\n","en":"And they prayed [to God] that the truth be made to triumph. And [thus it is:] every arrogant enemy of the truth shall be undone [in the life to come],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1765","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1765.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1765.mp3"]}},{"no":16,"arab":"مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَىٰ مِنْ مَاءٍ صَدِيدٍ","latin":"min waraa-ihi jahannamu wayusqaa min maa-in shadiidin","translate":{"id":"di hadapannya ada Jahannam dan dia akan diberi minuman dengan air nanah,\n","en":"with hell awaiting him; and he shall be made to drink of the water of most bitter distress,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1766","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1766.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1766.mp3"]}},{"no":17,"arab":"يَتَجَرَّعُهُ وَلَا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ","latin":"yatajarra'uhu walaa yakaadu yusiighuhu waya/tiihi almawtu min kulli makaanin wamaa huwa bimayyitin wamin waraa-ihi 'adzaabun ghaliizhun","translate":{"id":"diminumnnya air nanah itu dan hampir dia tidak bisa menelannya dan datanglah (bahaya) maut kepadanya dari segenap penjuru, tetapi dia tidak juga mati, dan dihadapannya masih ada azab yang berat.\n","en":"gulping it [unceasingly,] little by little, and yet hardly able to swallow it. And death will beset him from every quarter - but he shall not die: for [yet more] severe suffering lies ahead of him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1767","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1767.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1767.mp3"]}},{"no":18,"arab":"مَثَلُ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ ۖ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَىٰ شَيْءٍ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ","latin":"matsalu alladziina kafaruu birabbihim a'maaluhum karamaadin isytaddat bihi alrriihu fii yawmin 'aasifin laa yaqdiruuna mimmaa kasabuu 'alaa syay-in dzaalika huwa aldhdhalaalu alba'iidu","translate":{"id":"Orang-orang yang kafir kepada Tuhannya, amalan-amalan mereka adalah seperti abu yang ditiup angin dengan keras pada suatu hari yang berangin kencang. Mereka tidak dapat mengambil manfaat sedikitpun dari apa yang telah mereka usahakan (di dunia). Yang demikian itu adalah kesesatan yang jauh.\n","en":"[This, then, is] the parable of those who are bent on denying their Sustainer: all their works are as ashes which the wind blows about fiercely on a stormy day: [in the life to come,] they cannot achieve any benefit whatever from all [the good] that they may have wrought: for this [denial of God] is indeed the farthest one can go astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1768","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1768.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1768.mp3"]}},{"no":19,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ","latin":"alam tara anna allaaha khalaqa alssamaawaati waal-ardha bialhaqqi in yasya/ yudzhibkum waya/ti bikhalqin jadiidin ","translate":{"id":"Tidakkah kamu perhatikan, bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak ? Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mengganti(mu) dengan makhluk yang baru,\n","en":"ART THOU NOT aware that God has created the heavens and the earth in accordance with [an inner] truth? He can, if He so wills, do away with you and bring forth a new mankind [in your stead]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1769","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1769.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1769.mp3"]}},{"no":20,"arab":"وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ","latin":"wamaa dzaalika 'alaa allaahi bi'aziizin","translate":{"id":"dan yang demikian itu sekali-kali tidak sukar bagi Allah.\n","en":"nor is this difficult for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1770","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1770.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1770.mp3"]}},{"no":21,"arab":"وَبَرَزُوا لِلَّهِ جَمِيعًا فَقَالَ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِنْ شَيْءٍ ۚ قَالُوا لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ ۖ سَوَاءٌ عَلَيْنَا أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِنْ مَحِيصٍ","latin":"wabarazuu lillaahi jamii'an faqaala aldhdhu'afaau lilladziina istakbaruu innaa kunnaa lakum taba'an fahal antum mughnuuna 'annaa min 'adzaabi allaahi min syay-in qaaluu law hadaanaa allaahu lahadaynaakum sawaaun 'alaynaa ajazi'naa am shabarnaa maa lanaa min mahiishin","translate":{"id":"Dan mereka semuanya (di padang Mahsyar) akan berkumpul menghadap ke hadirat Allah, lalu berkatalah orang-orang yang lemah kepada orang-orang yang sombong: \"Sesungguhnya kami dahulu adalah pengikut-pengikutmu, maka dapatkah kamu menghindarkan daripada kami azab Allah (walaupun) sedikit saja? Mereka menjawab: \"Seandainya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepadamu. Sama saja bagi kita, apakah kita mengeluh ataukah bersabar. Sekali-kali kita tidak mempunyai tempat untuk melarikan diri\".\n","en":"And all [mankind] will appear before God [on the Day of Judgment]; and then the weak will say unto those who had gloried in their arrogance: \"Behold, We were but your followers: can you, then, relieve us of something of God's chastisement?\" [And the others] will answer: \"If God would but show us the way [to salvation], we would indeed guide you [towards it]. It is [now] all one, as far as we are concerned, whether we grieve impatiently or endure [our lot] with patience: there is no escape for us!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1771","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1771.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1771.mp3"]}},{"no":22,"arab":"وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي ۖ فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ ۖ مَا أَنَا بِمُصْرِخِكُمْ وَمَا أَنْتُمْ بِمُصْرِخِيَّ ۖ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِنْ قَبْلُ ۗ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ","latin":"waqaala alsysyaythaanu lammaa qudhiya al-amru inna allaaha wa'adakum wa'da alhaqqi wawa'adtukum fa-akhlaftukum wamaa kaana liya 'alaykum min sulthaanin illaa an da'awtukum faistajabtum lii falaa taluumuunii waluumuu anfusakum maa anaa bimushrikhikum wamaa antum bimushrikhiyya innii kafartu bimaa asyraktumuuni min qablu inna alzhzhaalimiina lahum 'adzaabun aliimun","translate":{"id":"Dan berkatalah syaitan tatkala perkara (hisab) telah diselesaikan: \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri. Aku sekali-kali tidak dapat menolongmu dan kamupun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu\". Sesungguhnya orang-orang yang zalim itu mendapat siksaan yang pedih.\n","en":"And when everything will have been decided, Satan will say: \"Behold, God promised you something that was bound to come true! I, too, held out [all manner of] promises to you -but I deceived you. Yet I had no power at all over you: I but called you-and you responded unto me. Hence, blame not me, but blame yourselves. It is not for me to respond to your cries, nor for you to respond to mine: for, behold, I have [always] refused to admit that there was any truth in your erstwhile belief that I had a share in God's divinity.\" Verily, for all evildoers there is grievous suffering in store."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1772","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1772.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1772.mp3"]}},{"no":23,"arab":"وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَامٌ","latin":"waudkhila alladziina aamanuu wa'amiluu alshshaalihaati jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa bi-idzni rabbihim tahiyyatuhum fiihaa salaamun","translate":{"id":"Dan dimasukkanlah orang-orang yang beriman dan beramal saleh ke dalam syurga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya dengan seizin Tuhan mereka. Ucapan penghormatan mereka dalam syurga itu ialah \"salaam\" .\n","en":"But those who shall have attained to faith and done righteous deeds will be brought into gardens through which running waters flow, therein to abide by their Sustainer's leave, and will be welcomed with the greeting, \"Peace!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1773","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1773.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1773.mp3"]}},{"no":24,"arab":"أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ","latin":"alam tara kayfa dharaba allaahu matsalan kalimatan thayyibatan kasyajaratin thayyibatin ashluhaa tsaabitun wafar'uhaa fii alssamaa/-i","translate":{"id":"Tidakkah kamu perhatikan bagaimana Allah telah membuat perumpamaan kalimat yang baik seperti pohon yang baik, akarnya teguh dan cabangnya (menjulang) ke langit,\n","en":"ART THOU NOT aware how God sets forth the parable of a good word? [It is] like a good tree, firmly rooted, [reaching out] with its branches towards the sky,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1774","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1774.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1774.mp3"]}},{"no":25,"arab":"تُؤْتِي أُكُلَهَا كُلَّ حِينٍ بِإِذْنِ رَبِّهَا ۗ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ","latin":"tu/tii ukulahaa kulla hiinin bi-idzni rabbihaa wayadhribu allaahu al-amtsaala lilnnaasi la'allahum yatadzakkaruuna","translate":{"id":"pohon itu memberikan buahnya pada setiap musim dengan seizin Tuhannya. Allah membuat perumpamaan-perumpamaan itu untuk manusia supaya mereka selalu ingat.\n","en":"yielding its fruit at all times by its Sustainer's leave. And [thus it is that] God propounds parables unto men,' so that they might bethink themselves [of the truth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1775","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1775.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1775.mp3"]}},{"no":26,"arab":"وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِنْ فَوْقِ الْأَرْضِ مَا لَهَا مِنْ قَرَارٍ","latin":"wamatsalu kalimatin khabiitsatin kasyajaratin khabiitsatin ijtutstsat min fawqi al-ardhi maa lahaa min qaraarin","translate":{"id":"Dan perumpamaan kalimat yang buruk seperti pohon yang buruk, yang telah dicabut dengan akar-akarnya dari permukaan bumi; tidak dapat tetap (tegak) sedikitpun.\n","en":"And the parable of a corrupt word is that of a corrupt tree, torn up [from its roots] onto the face of the earth, wholly unable to endure."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1776","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1776.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1776.mp3"]}},{"no":27,"arab":"يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَيُضِلُّ اللَّهُ الظَّالِمِينَ ۚ وَيَفْعَلُ اللَّهُ مَا يَشَاءُ","latin":"yutsabbitu allaahu alladziina aamanuu bialqawli altstsaabiti fii alhayaati alddunyaa wafii al-aakhirati wayudhillu allaahu alzhzhaalimiina wayaf'alu allaahu maa yasyaa/u","translate":{"id":"Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zalim dan memperbuat apa yang Dia kehendaki.\n","en":"[Thus,] God grants firmness unto those who have attained to faith through the word that is unshakably true in the life of this world as well as in the life to come; but the wrongdoers He lets go astray: for God does whatever He wills."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1777","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1777.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1777.mp3"]}},{"no":28,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ","latin":"alam tara ilaa alladziina baddaluu ni'mata allaahi kufran wa-ahalluu qawmahum daara albawaari","translate":{"id":"Tidakkah kamu perhatikan orang-orang yang telah menukar ni'mat Allah dengan kekafiran dan menjatuhkan kaumnya ke lembah kebinasaan?,\n","en":"ART THOU NOT aware of those who have preferred a denial of the truth to God's blessings, and [thereby] invited their people to alight in that abode of utter desolation"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1778","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1778.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1778.mp3"]}},{"no":29,"arab":"جَهَنَّمَ يَصْلَوْنَهَا ۖ وَبِئْسَ الْقَرَارُ","latin":"jahannama yashlawnahaa wabi/sa alqaraaru","translate":{"id":"yaitu neraka jahannam; mereka masuk kedalamnya; dan itulah seburuk-buruk tempat kediaman.\n","en":"- hell - which they [themselves] will ' have to endure? And how vile a state to settle in!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1779","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1779.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1779.mp3"]}},{"no":30,"arab":"وَجَعَلُوا لِلَّهِ أَنْدَادًا لِيُضِلُّوا عَنْ سَبِيلِهِ ۗ قُلْ تَمَتَّعُوا فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ","latin":"waja'aluu lillaahi andaadan liyudhilluu 'an sabiilihi qul tamatta'uu fa-inna mashiirakum ilaa alnnaari","translate":{"id":"Orang-orang kafir itu telah menjadikan sekutu-sekutu bagi Allah supaya mereka menyesatkan (manusia) dari jalan-Nya. Katakanlah: \"Bersenang-senanglah kamu, karena sesungguhnya tempat kembalimu ialah neraka\".\n","en":"For, they claimed that there are powers that could rival God, and so they strayed from His path. Say: \"Enjoy yourselves [in this world], but, verily, the fire will be your journey's end!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1780","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1780.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1780.mp3"]}},{"no":31,"arab":"قُلْ لِعِبَادِيَ الَّذِينَ آمَنُوا يُقِيمُوا الصَّلَاةَ وَيُنْفِقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا بَيْعٌ فِيهِ وَلَا خِلَالٌ","latin":"qul li'ibaadiya alladziina aamanuu yuqiimuu alshshalaata wayunfiquu mimmaa razaqnaahum sirran wa'alaaniyatan min qabli an ya/tiya yawmun laa bay'un fiihi walaa khilaalun","translate":{"id":"Katakanlah kepada hamba-hamba-Ku yang telah beriman: \"Hendaklah mereka mendirikan shalat, menafkahkan sebahagian rezki yang Kami berikan kepada mereka secara sembunyi ataupun terang-terangan sebelum datang hari (kiamat) yang pada bari itu tidak ada jual beli dan persahabatan .\n","en":"[And] tell [those of] My servants who have attained to faith that they should be constant in prayer and spend [in Our way], secretly and openly, out of what We provide for them as sustenance, ere there come a Day when there will be no bargaining, and no mutual befriending."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1781","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1781.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1781.mp3"]}},{"no":32,"arab":"اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ ۖ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ ۖ وَسَخَّرَ لَكُمُ الْأَنْهَارَ","latin":"allaahu alladzii khalaqa alssamaawaati waal-ardha wa-anzala mina alssamaa-i maa-an fa-akhraja bihi mina altstsamaraati rizqan lakum wasakhkhara lakumu alfulka litajriya fii albahri bi-amrihi wasakhkhara lakumu al-anhaara","translate":{"id":"Allah-lah yang telah menciptakan langit dan bumi dan menurunkan air hujan dari langit, kemudian Dia mengeluarkan dengan air hujan itu berbagai buah-buahan menjadi rezki untukmu; dan Dia telah menundukkan bahtera bagimu supaya bahtera itu, berlayar di lautan dengan kehendak-Nya, dan Dia telah menundukkan (pula) bagimu sungai-sungai.\n","en":"[And remember that] it is God who has created the heavens and the earth, and who sends down water from the sky and thereby brings forth [all manner] of fruits for your sustenance; and who has made ships subservient to. you, so that they may sail through the sea at His behest; and has made the rivers subservient [to His laws, so that they be of use] to you;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1782","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1782.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1782.mp3"]}},{"no":33,"arab":"وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ دَائِبَيْنِ ۖ وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ","latin":"wasakhkhara lakumu alsysyamsa waalqamara daa-ibayni wasakhkhara lakumu allayla waalnnahaara","translate":{"id":"Dan Dia telah menundukkan (pula) bagimu matahari dan bulan yang terus menerus beredar (dalam orbitnya); dan telah menundukkan bagimu malam dan siang.\n","en":"and has made the sun and the moon, both of them constant upon their courses, subservient [to His laws, so that they be of use] to you; and has made the night and the day subservient [to His laws, so that they be of use] to you."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1783","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1783.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1783.mp3"]}},{"no":34,"arab":"وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ","latin":"waaataakum min kulli maa sa-altumuuhu wa-in ta'udduu ni'mata allaahi laa tuhsuuhaa inna al-insaana lazhaluumun kaffaarun","translate":{"id":"Dan Dia telah memberikan kepadamu (keperluanmu) dan segala apa yang kamu mohonkan kepadanya. Dan jika kamu menghitung ni'mat Allah, tidaklah dapat kamu menghinggakannya. Sesungguhnya manusia itu, sangat zalim dan sangat mengingkari (ni'mat Allah).\n","en":"And [always] does He give you something out of what you may be asking of Him; and should you try to count God's blessings, you could never compute them. [And yet,] behold, man is indeed most persistent in wrongdoing, stubbornly ingrate!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1784","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1784.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1784.mp3"]}},{"no":35,"arab":"وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ","latin":"wa-idz qaala ibraahiimu rabbi ij'al haadzaa albalada aaminan waujnubnii wabaniyya an na'buda al-ashnaama","translate":{"id":"Dan (ingatlah), ketika Ibrahim berkata: \"Ya Tuhanku, jadikanlah negeri ini (Mekah), negeri yang aman, dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala.\n","en":"AND [remember the time] when Abraham spoke [thus]: \"O my Sustainer! Make this land secure, and preserve me and my children from ever worshipping idols -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1785","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1785.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1785.mp3"]}},{"no":36,"arab":"رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ ۖ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي ۖ وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ","latin":"rabbi innahunna adhlalna katsiiran mina alnnaasi faman tabi'anii fa-innahu minnii waman 'ashaanii fa-innaka ghafuurun rahiimun","translate":{"id":"Ya Tuhanku, sesungguhnya berhala-berhala itu telah menyesatkan kebanyakan daripada manusia, maka barangsiapa yang mengikutiku, maka sesungguhnya orang itu termasuk golonganku, dan barangsiapa yang mendurhakai aku, maka sesungguhnya Engkau, Maha Pengampun lagi Maha Penyayang.\n","en":"for, verily, O my Sustainer, these [false objects of worship] have led many people astray! \"Hence, [only] he who follows me [in this my faith] ~ is truly of me; and as for him who disobeys me - Thou art, verily, much-forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1786","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1786.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1786.mp3"]}},{"no":37,"arab":"رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِنْدَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ","latin":"rabbanaa innii askantu min dzurriyyatii biwaadin ghayri dzii zar'in 'inda baytika almuharrami rabbanaa liyuqiimuu alshshalaata faij'al af-idatan mina alnnaasi tahwii ilayhim waurzuqhum mina altstsamaraati la'allahum yasykuruuna","translate":{"id":"Ya Tuhan kami, sesungguhnya aku telah menempatkan sebahagian keturunanku di lembah yang tidak mempunyai tanam-tanaman di dekat rumah Engkau (Baitullah) yang dihormati, ya Tuhan kami (yang demikian itu) agar mereka mendirikan shalat, maka jadikanlah hati sebagian manusia cenderung kepada mereka dan beri rezkilah mereka dari buah-buahan, mudah-mudahan mereka bersyukur.\n","en":"\"O our Sustainer! Behold, I have settled some of my offspring in a valley in which there is no arable land, close to Thy sanctified Temple, so that, O our Sustainer, they might devote themselves to prayer: cause Thou, therefore, people's hearts to incline towards them and grant them fruitful sustenance, so that they might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1787","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1787.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1787.mp3"]}},{"no":38,"arab":"رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ","latin":"rabbanaa innaka ta'lamu maa nukhfii wamaa nu'linu wamaa yakhfaa 'alaa allaahi min syay-in fii al-ardhi walaa fii alssamaa/-i","translate":{"id":"Ya Tuhan kami, sesungguhnya Engkau mengetahui apa yang kami sembunyikan dan apa yang kami lahirkan; dan tidak ada sesuatupun yang tersembunyi bagi Allah, baik yang ada di bumi maupun yang ada di langit.\n","en":"\"O our Sustainer! Thou truly knowest all that we may hide [in our hearts] as well as all that we bring into the open:' for nothing whatever, be it on earth or in heaven, remains hidden from God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1788","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1788.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1788.mp3"]}},{"no":39,"arab":"الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ ۚ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ","latin":"alhamdu lillaahi alladzii wahaba lii 'alaa alkibari ismaa'iila wa-ishaaqa inna rabbii lasamii'u alddu'aa/-i","translate":{"id":"Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tua (ku) Ismail dan Ishaq. Sesungguhnya Tuhanku, benar-benar Maha Mendengar (memperkenankan) do'a.\n","en":"\"All praise is due to God, who has bestowed upon me, in my old age, Ishmael and Isaac! Behold, my Sustainer hears indeed all prayer:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1789","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1789.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1789.mp3"]}},{"no":40,"arab":"رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ","latin":"rabbi ij'alnii muqiima alshshalaati wamin dzurriyyatii rabbanaa wtaqabbal du'aa/-i","translate":{"id":"Ya Tuhanku, jadikanlah aku dan anak cucuku orang-orang yang tetap mendirikan shalat, ya Tuhan kami, perkenankanlah do'aku.\n","en":"[hence,] O my Sustainer, cause me and [some] of my offspring to remain constant in prayer! \"And, O our Sustainer, accept this my prayer:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1790","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1790.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1790.mp3"]}},{"no":41,"arab":"رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ","latin":"rabbanaa ighfir lii waliwaalidayya walilmu/miniina yawma yaquumu alhisaabu","translate":{"id":"Ya Tuhan kami, beri ampunlah aku dan kedua ibu bapaku dan sekalian orang-orang mu'min pada hari terjadinya hisab (hari kiamat)\".\n","en":"Grant Thy forgiveness unto me, and my parents, and all the believers, on the Day on which the [last] reckoning will come to pass!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1791","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1791.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1791.mp3"]}},{"no":42,"arab":"وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ","latin":"walaa tahsabanna allaaha ghaafilan 'ammaa ya'malu alzhzhaalimuuna innamaa yu-akhkhiruhum liyawmin tasykhashu fiihi al-abshaaru","translate":{"id":"Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak,\n","en":"AND DO NOT think that God is unaware of what the evildoers are doing: He but grants them respite until the Day when their eyes will stare in horror,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1792","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1792.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1792.mp3"]}},{"no":43,"arab":"مُهْطِعِينَ مُقْنِعِي رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ ۖ وَأَفْئِدَتُهُمْ هَوَاءٌ","latin":"muhthi'iina muqni'ii ruuusihim laa yartaddu ilayhim tharfuhum wa-af-idatuhum hawaa/un","translate":{"id":"mereka datang bergegas-gegas memenuhi panggilan dengan mangangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong.\n","en":"the while they will be running confusedly to and fro, with their heads upraised [in supplication], unable to look away from what they shall behold, and their hearts an abysmal void."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1793","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1793.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1793.mp3"]}},{"no":44,"arab":"وَأَنْذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ فَيَقُولُ الَّذِينَ ظَلَمُوا رَبَّنَا أَخِّرْنَا إِلَىٰ أَجَلٍ قَرِيبٍ نُجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ ۗ أَوَلَمْ تَكُونُوا أَقْسَمْتُمْ مِنْ قَبْلُ مَا لَكُمْ مِنْ زَوَالٍ","latin":"wa-andziri alnnaasa yawma ya/tiihimu al'adzaabu fayaquulu alladziina zhalamuu rabbanaa akhkhirnaa ilaa ajalin qariibin nujib da'wataka wanattabi'i alrrusula awa lam takuunuu aqsamtum min qablu maa lakum min zawaalin","translate":{"id":"Dan berikanlah peringatan kepada manusia terhadap hari (yang pada waktu itu) datang azab kepada mereka, maka berkatalah orang-orang yang zalim: \"Ya Tuhan kami, beri tangguhlah kami (kembalikanlah kami ke dunia) walaupun dalam waktu yang sedikit, niscaya kami akan mematuhi seruan Engkau dan akan mengikuti rasul-rasul\". (Kepada mereka dikatakan): \"Bukankah kamu telah bersumpah dahulu (di dunia) bahwa sekali-kali kamu tidak akan binasa?\n","en":"Hence, warn men of the Day when this suffering may befall them, and when those who did wrong [in their lifetime] will exclaim: \"O our Sustainer! Grant us respite for a short while, so that we might respond to Thy call and follow the apostles!\" [But God will answer:] \"Why - were you not aforetime wont to swear that no kind of resurrection and retribution awaited you?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1794","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1794.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1794.mp3"]}},{"no":45,"arab":"وَسَكَنْتُمْ فِي مَسَاكِنِ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الْأَمْثَالَ","latin":"wasakantum fii masaakini alladziina zhalamuu anfusahum watabayyana lakum kayfa fa'alnaa bihim wadharabnaa lakumu al-amtsaala","translate":{"id":"dan kamu telah berdiam di tempat-tempat kediaman orang-orang yang menganiaya diri mereka sendiri, dan telah nyata bagimu bagaimana Kami telah berbuat terhadap mereka dan telah Kami berikan kepadamu beberapa perumpamaan\".\n","en":"And yet, you dwelt in the dwelling-places of those who had sinned against their own selves [before your time], and it was made obvious to you how We had dealt with them: for We have set forth unto you many a parable [of sin, resurrection and divine retribution].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1795","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1795.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1795.mp3"]}},{"no":46,"arab":"وَقَدْ مَكَرُوا مَكْرَهُمْ وَعِنْدَ اللَّهِ مَكْرُهُمْ وَإِنْ كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ","latin":"waqad makaruu makrahum wa'inda allaahi makruhum wa-in kaana makruhum litazuula minhu aljibaalu","translate":{"id":"Dan sesungguhnya mereka telah membuat makar yang besar padahal di sisi Allah-lah (balasan) makar mereka itu. Dan sesungguhnya makar mereka itu (amat besar) sehingga gunung-gunung dapat lenyap karenanya.\n","en":"And [this retribution will befall all evildoers because] they devise that false imagery of theirs - and all their false imagery is within God's knowledge. [And never can the blasphemers prevail against the truth - not] even if their false imagery were so (well devised and so powerful] that mountains could be moved thereby."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1796","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1796.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1796.mp3"]}},{"no":47,"arab":"فَلَا تَحْسَبَنَّ اللَّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ ۗ إِنَّ اللَّهَ عَزِيزٌ ذُو انْتِقَامٍ","latin":"falaa tahsabanna allaaha mukhlifa wa'dihi rusulahu inna allaaha 'aziizun dzuu intiqaamin","translate":{"id":"Karena itu janganlah sekali-kali kamu mengira Allah akan menyalahi janji-Nya kepada rasul-rasul-Nya; sesungguhnya Allah Maha Perkasa, lagi mempunyai pembalasan.\n","en":"HENCE, do not think that God will fail to fulfil the promise which He gave to His apostles: verily, God is almighty, an avenger of evil!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1797","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1797.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1797.mp3"]}},{"no":48,"arab":"يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ ۖ وَبَرَزُوا لِلَّهِ الْوَاحِدِ الْقَهَّارِ","latin":"yawma tubaddalu al-ardhu ghayra al-ardhi waalssamaawaatu wabarazuu lillaahi alwaahidi alqahhaari","translate":{"id":"(Yaitu) pada hari (ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit, dan meraka semuanya (di padang Mahsyar) berkumpul menghadap ke hadirat Allah yang Maha Esa lagi Maha Perkasa.\n","en":"[His promise will be fulfilled] on the Day when the earth shall be changed into another earth, as shall be the heavens and when [all men] shall appear before God, the One who holds absolute sway over all that exists."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1798","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1798.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1798.mp3"]}},{"no":49,"arab":"وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُقَرَّنِينَ فِي الْأَصْفَادِ","latin":"wataraa almujrimiina yawma-idzin muqarraniina fii al-ashfaadi","translate":{"id":"Dan kamu akan melihat orang-orang yang berdosa pada hari itu diikat bersama-sama dengan belenggu.\n","en":"For on that Day thou wilt see all who were lost in sin linked together in fetters,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1799","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1799.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1799.mp3"]}},{"no":50,"arab":"سَرَابِيلُهُمْ مِنْ قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ النَّارُ","latin":"saraabiiluhum min qathraanin wataghsyaa wujuuhahumu alnnaaru","translate":{"id":"Pakaian mereka adalah dari pelangkin (ter) dan muka mereka ditutup oleh api neraka,\n","en":"clothed in garments of black pitch, with fire veiling their faces."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1800","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1800.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1800.mp3"]}},{"no":51,"arab":"لِيَجْزِيَ اللَّهُ كُلَّ نَفْسٍ مَا كَسَبَتْ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","latin":"liyajziya allaahu kulla nafsin maa kasabat inna allaaha sarii'u alhisaabi","translate":{"id":"agar Allah memberi pembalasan kepada tiap-tiap orang terhadap apa yang ia usahakan. Sesungguhnya Allah Maha cepat hisab-Nya.\n","en":"[And all shall be judged on that Day,] so that God may requite every human being for all that he has earned [in life]: verily, God is swift in reckoning!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1801","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1801.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1801.mp3"]}},{"no":52,"arab":"هَٰذَا بَلَاغٌ لِلنَّاسِ وَلِيُنْذَرُوا بِهِ وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ وَلِيَذَّكَّرَ أُولُو الْأَلْبَابِ","latin":"haadzaa balaaghun lilnnaasi waliyundzaruu bihi waliya'lamuu annamaa huwa ilaahun waahidun waliyadzdzakkara uluu al-albaabi","translate":{"id":"(Al Quraan) ini adalah penjelasan yang sempurna bagi manusia, dan supaya mereka diberi peringatan dengan-Nya, dan supaya mereka mengetahui bahwasanya Dia adalah Tuhan Yang Maha Esa dan agar orang-orang yang berakal mengambil pelajaran.\n","en":"THIS IS A MESSAGE unto all mankind. Hence, let them be warned thereby, and let them know that He is the One and Only God; and let those who are endowed with insight take this to heart!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1802","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1802.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1802.mp3"]}}]}