{"alquran":{"no":16,"name":"An-Nahl","arab":"النحل","start":1901,"count":128,"rukku":16,"type":"mecca","description":"Surat ini terdiri atas 128 ayat, termasuk golongan surat-surat Makkiyyah. Surat ini dinamakan <i>An Nahl</i> yang berarti <i>lebah</i> karena di dalamnya, terdapat firman Allah s.w.t. ayat 68 yang artinya : \"Dan Tuhanmu mewahyukan kepada lebah.\" Lebah adalah makhluk Allah yang banyak memberi manfaat  dan kenikmatan kepada manusia. Ada persamaan antara madu yang dihasilkan oleh lebah dengan Al Quranul Karim. Madu berasal dari bermacam-macam sari bunga dan dia menjadi obat bagi bermacam-macam penyakit manusia (lihat ayat 69). Sedang Al Quran mengandung inti sari dari kitab-kitab yang telah diturunkan kepada Nabi-nabi zaman dahulu ditambah dengan ajaran-ajaran yang diperlukan oleh semua bangsa sepanjang masa untuk mencapai kebahagiaan dunia dan akhirat. (Lihat surat (10) Yunus ayat 57 dan surat (17) Al Isra' ayat  82). Surat ini dinamakan pula \"An Ni'am\" artinya nikmat-nikmat, karena di dalamnya Allah menyebutkan pelbagai macam nikmat untuk hamba-hamba-Nya."},"surah":[{"no":1,"arab":" أَتَىٰ أَمْرُ اللَّهِ فَلَا تَسْتَعْجِلُوهُ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","latin":"ataa amru allaahi falaa tasta'jiluuhu subhaanahu wata'aalaa 'ammaa yusyrikuuna","translate":{"id":"Telah pasti datangnya ketetapan Allah maka janganlah kamu meminta agar disegerakan (datang) nya. Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan.\n","en":"GOD'S JUDGMENT is [bound to] come: do not, therefore, call for its speedy advent! Limitless is He in His glory and sublimely exalted above anything to which men may ascribe a share in His divinity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1902","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1902.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1902.mp3"]}},{"no":2,"arab":"يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ أَنْ أَنْذِرُوا أَنَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاتَّقُونِ","latin":"ataa amru allaahi falaa tasta'jiluuhu subhaanahu wata'aalaa 'ammaa yusyrikuuna","translate":{"id":"Dia menurunkan para malaikat dengan (membawa) wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, yaitu: \"Peringatkanlah olehmu sekalian, bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka hendaklah kamu bertakwa kepada-Ku\".\n","en":"He causes the angels to descend with this divine inspiration, [bestowed] at His behest upon whomever He wills of His servants: \"Warn [all human beings] that there is no deity save Me: be, therefore, conscious of Me!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1903","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1903.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1903.mp3"]}},{"no":3,"arab":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ تَعَالَىٰ عَمَّا يُشْرِكُونَ","latin":"khalaqa alssamaawaati waal-ardha bialhaqqi ta'aalaa 'ammaa yusyrikuuna","translate":{"id":"Dia menciptakan langit dan bumi dengan hak . Maha Tinggi Allah daripada apa yang mereka persekutukan.\n","en":"He has created the heavens and the earth in accordance with [an inner] truth; sublimely exalted is He above anything to which men may ascribe a share in His divinity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1904","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1904.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1904.mp3"]}},{"no":4,"arab":"خَلَقَ الْإِنْسَانَ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ","latin":"khalaqa al-insaana min nuthfatin fa-idzaa huwa khashiimun mubiinun","translate":{"id":"Dia telah menciptakan manusia dari mani, tiba-tiba ia menjadi pembantah yang nyata.\n","en":"He creates man out of a [mere] drop of sperm: and lo! this same being shows himself endowed with the power to think and to argue!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1905","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1905.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1905.mp3"]}},{"no":5,"arab":"وَالْأَنْعَامَ خَلَقَهَا ۗ لَكُمْ فِيهَا دِفْءٌ وَمَنَافِعُ وَمِنْهَا تَأْكُلُونَ","latin":"waal-an'aama khalaqahaa lakum fiihaa dif-un wamanaafi'u waminhaa ta-kuluuna","translate":{"id":"Dan Dia telah menciptakan binatang ternak untuk kamu; padanya ada (bulu) yang menghangatkan dan berbagai-bagai manfa'at, dan sebahagiannya kamu makan.\n","en":"And He creates cattle: you derive warmth from them, and [various other] uses; and from them you obtain food;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1906","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1906.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1906.mp3"]}},{"no":6,"arab":"وَلَكُمْ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسْرَحُونَ","latin":"walakum fiihaa jamaalun hiina turiihuuna wahiina tasrahuuna","translate":{"id":"Dan kamu memperoleh pandangan yang indah padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya ke tempat penggembalaan.\n","en":"and you find beauty in them when you drive them home in the evenings and when you take them out to pasture in the mornings."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1907","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1907.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1907.mp3"]}},{"no":7,"arab":"وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ ۚ إِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ","latin":"watahmilu atsqaalakum ilaa baladin lam takuunuu baalighiihi illaa bisyiqqi al-anfusi inna rabbakum larauufun rahiimun","translate":{"id":"Dan ia memikul beban-bebanmu ke suatu negeri yang kamu tidak sanggup sampai kepadanya, melainkan dengan kesukaran-kesukaran (yang memayahkan) diri. Sesungguhnya Tuhanmu benar-benar Maha Pengasih lagi Maha Penyayang,\n","en":"And they carry your loads to [many] a place which [otherwise] you would be unable to reach without great hardship to yourselves. Verily, your Sustainer is most compassionate, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1908","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1908.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1908.mp3"]}},{"no":8,"arab":"وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً ۚ وَيَخْلُقُ مَا لَا تَعْلَمُونَ","latin":"waalkhayla waalbighaala waalhamiira litarkabuuhaa waziinatan wayakhluqu maa laa ta'lamuuna","translate":{"id":"dan (Dia telah menciptakan) kuda, bagal , dan keledai, agar kamu menungganginya dan (menjadikannya) perhiasan. Dan Allah menciptakan apa yang kamu tidak mengetahuinya.\n","en":"And (it is He who creates] horses and mules and asses for you to ride, as well as for [their] beauty: and He will yet create things of which [today] you have no knowledge."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1909","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1909.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1909.mp3"]}},{"no":9,"arab":"وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ وَمِنْهَا جَائِرٌ ۚ وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ","latin":"wa'alaa allaahi qashdu alssabiili waminhaa jaa-irun walaw syaa-a lahadaakum ajma'iina","translate":{"id":"Dan hak bagi Allah (menerangkan) jalan yang lurus, dan di antara jalan-jalan ada yang bengkok. Dan jikalau Dia menghendaki, tentulah Dia memimpin kamu semuanya (kepada jalan yang benar).\n","en":"And [because He is your Creator,] it rests with God alone to show you the right path: yet there is [many a one] who swerves from it. However, had He so willed, He would have guided you all aright."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1910","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1910.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1910.mp3"]}},{"no":10,"arab":"هُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ مَاءً ۖ لَكُمْ مِنْهُ شَرَابٌ وَمِنْهُ شَجَرٌ فِيهِ تُسِيمُونَ","latin":"huwa alladzii anzala mina alssamaa-i maa-an lakum minhu syaraabun waminhu syajarun fiihi tusiimuuna","translate":{"id":"Dia-lah, Yang telah menurunkan air hujan dari langit untuk kamu, sebahagiannya menjadi minuman dan sebahagiannya (menyuburkan) tumbuh-tumbuhan, yang pada (tempat tumbuhnya) kamu menggembalakan ternakmu.\n","en":"It is He who sends down water from the skies; you drink thereof, and thereof [drink] the plants upon which you pasture your beasts;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1911","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1911.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1911.mp3"]}},{"no":11,"arab":"يُنْبِتُ لَكُمْ بِهِ الزَّرْعَ وَالزَّيْتُونَ وَالنَّخِيلَ وَالْأَعْنَابَ وَمِنْ كُلِّ الثَّمَرَاتِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ","latin":"yunbitu lakum bihi alzzar'a waalzzaytuuna waalnnakhiila waal-a'naaba wamin kulli altstsamaraati inna fii dzaalika laaayatan liqawmin yatafakkaruuna","translate":{"id":"Dia menumbuhkan bagi kamu dengan air hujan itu tanam-tanaman; zaitun, korma, anggur dan segala macam buah-buahan. Sesungguhnya pada yang demikian itu benar-benar ada tanda (kekuasaan Allah) bagi kaum yang memikirkan.\n","en":"[and] by virtue thereof He causes crops to grow for you, and olive trees, and date palms, and grapes, and all [other] kinds of fruit: in this, behold, there is a message indeed for people who think!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1912","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1912.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1912.mp3"]}},{"no":12,"arab":"وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۖ وَالنُّجُومُ مُسَخَّرَاتٌ بِأَمْرِهِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ","latin":"wasakhkhara lakumu allayla waalnnahaara waalsysyamsa waalqamara waalnnujuumu musakhkharaatun bi-amrihi inna fii dzaalika laaayaatin liqawmin ya'qiluuna","translate":{"id":"Dan Dia menundukkan malam dan siang, matahari dan bulan untukmu. Dan bintang-bintang itu ditundukkan (untukmu) dengan perintah-Nya. Sesungguhnya pada yang demikian itu benar-benar ada tanda-tanda (kekuasaan Allah) bagi kaum yang memahami (nya),\n","en":"And He has made the night and the day and the sun and the moon subservient [to His laws, so that they be of use] to you; and all the stars are subservient to His command: in this, behold, there are messages indeed for people who use their reason!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1913","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1913.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1913.mp3"]}},{"no":13,"arab":"وَمَا ذَرَأَ لَكُمْ فِي الْأَرْضِ مُخْتَلِفًا أَلْوَانُهُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَذَّكَّرُونَ","latin":"wamaa dzara-a lakum fii al-ardhi mukhtalifan alwaanuhu inna fii dzaalika laaayatan liqawmin yadzdzakkaruuna","translate":{"id":"dan Dia (menundukkan pula) apa yang Dia ciptakan untuk kamu di bumi ini dengan berlain-lainan macamnya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi kaum yang mengambil pelajaran.\n","en":"And all the [beauty of] many hues-which He has created for you on earth: in this, behold, there is a message for people who (are willing to] take it to heart!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1914","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1914.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1914.mp3"]}},{"no":14,"arab":"وَهُوَ الَّذِي سَخَّرَ الْبَحْرَ لِتَأْكُلُوا مِنْهُ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُوا مِنْهُ حِلْيَةً تَلْبَسُونَهَا وَتَرَى الْفُلْكَ مَوَاخِرَ فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","latin":"wahuwa alladzii sakhkhara albahra lita/kuluu minhu lahman thariyyan watastakhrijuu minhu hilyatan talbasuunahaa wataraa alfulka mawaakhira fiihi walitabtaghuu min fadhlihi wala'allakum tasykuruuna","translate":{"id":"Dan Dia-lah, Allah yang menundukkan lautan (untukmu), agar kamu dapat memakan daripadanya daging yang segar (ikan), dan kamu mengeluarkan dari lautan itu perhiasan yang kamu pakai; dan kamu melihat bahtera berlayar padanya, dan supaya kamu mencari (keuntungan) dari karunia-Nya, dan supaya kamu bersyukur.\n","en":"And He it is who has made the sea subservient [to His laws], so that you might eat fresh meat from it, and take from it gems which you may wear. And on that [very sea] one sees ships ploughing through the waves, so that you might [be able to] go forth in quest of some of His bounty, and thus have cause to be grateful [to Him]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1915","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1915.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1915.mp3"]}},{"no":15,"arab":"وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَأَنْهَارًا وَسُبُلًا لَعَلَّكُمْ تَهْتَدُونَ","latin":"wa-alqaa fii al-ardhi rawaasiya an tamiida bikum wa-anhaaran wasubulan la'allakum tahtaduuna","translate":{"id":"Dan Dia menancapkan gunung-gunung di bumi supaya bumi itu tidak goncang bersama kamu, (dan Dia menciptakan) sungai-sungai dan jalan-jalan agar kamu mendapat petunjuk,\n","en":"And he has placed firm mountains on earth, lest it sway with you, and rivers and paths, so that you might find your way,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1916","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1916.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1916.mp3"]}},{"no":16,"arab":"وَعَلَامَاتٍ ۚ وَبِالنَّجْمِ هُمْ يَهْتَدُونَ","latin":"wa'alaamaatin wabialnnajmi hum yahtaduuna","translate":{"id":"dan (Dia ciptakan) tanda-tanda (penunjuk jalan). Dan dengan bintang-bintang itulah mereka mendapat petunjuk.\n","en":"as well as [various other] means of orientation: for [it is] by the stars that men find their way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1917","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1917.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1917.mp3"]}},{"no":17,"arab":"أَفَمَنْ يَخْلُقُ كَمَنْ لَا يَخْلُقُ ۗ أَفَلَا تَذَكَّرُونَ","latin":"afaman yakhluqu kaman laa yakhluqu afalaa tadzakkaruuna","translate":{"id":"Maka apakah (Allah) yang menciptakan itu sama dengan yang tidak dapat menciptakan (apa-apa) ?. Maka mengapa kamu tidak mengambil pelajaran.\n","en":"IS, THEN, HE who creates comparable to any [being] that cannot create? Will you not, then, bethink yourselves?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1918","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1918.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1918.mp3"]}},{"no":18,"arab":"وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ","latin":"wa-in ta'udduu ni'mata allaahi laa tuhsuuhaa inna allaaha laghafuurun rahiimun","translate":{"id":"Dan jika kamu menghitung-hitung ni'mat Allah, niscaya kamu tak dapat menentukan jumlahnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang.\n","en":"For, should you try to count God's blessings, you could never compute them! Behold, God is indeed much-forgiving, a dispenser of grace;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1919","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1919.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1919.mp3"]}},{"no":19,"arab":"وَاللَّهُ يَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ","latin":"waallaahu ya'lamu maa tusirruuna wamaa tu'linuuna","translate":{"id":"Dan Allah mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan.\n","en":"and God knows all that you keep secret as well as all that you bring into the open."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1920","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1920.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1920.mp3"]}},{"no":20,"arab":"وَالَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ","latin":"waalladziina yad'uuna min duuni allaahi laa yakhluquuna syay-an wahum yukhlaquuna","translate":{"id":"Dan berhala-berhala yang mereka seru selain Allah, tidak dapat membuat sesuatu apapun, sedang berhala-berhala itu (sendiri) dibuat orang.\n","en":"Now those beings that some people invoke beside God cannot create anything, since they themselves are but created:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1921","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1921.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1921.mp3"]}},{"no":21,"arab":"أَمْوَاتٌ غَيْرُ أَحْيَاءٍ ۖ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ","latin":"amwaatun ghayru ahyaa-in wamaa yasy'uruuna ayyaana yub'atsuuna","translate":{"id":"(Berhala-berhala itu) benda mati tidak hidup, dan berhala-berhala tidak mengetahui bilakah penyembah-penyembahnya akan dibangkitkan.\n","en":"they are dead, not living, and they do not [even] know when they will be raised from the dead!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1922","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1922.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1922.mp3"]}},{"no":22,"arab":"إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۚ فَالَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ قُلُوبُهُمْ مُنْكِرَةٌ وَهُمْ مُسْتَكْبِرُونَ","latin":"ilaahukum ilaahun waahidun faalladziina laa yu/minuuna bial-aakhirati quluubuhum munkiratun wahum mustakbiruuna","translate":{"id":"Tuhan kamu adalah Tuhan Yang Maha Esa. Maka orang-orang yang tidak beriman kepada akhirat, hati mereka mengingkari (keesaaan Allah), sedangkan mereka sendiri adalah orang-orang yang sombong.\n","en":"Your God is the One God: but because of their false pride, the hearts of those who do not believe in the life to come refuse to admit this [truth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1923","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1923.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1923.mp3"]}},{"no":23,"arab":"لَا جَرَمَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۚ إِنَّهُ لَا يُحِبُّ الْمُسْتَكْبِرِينَ","latin":"laa jarama anna allaaha ya'lamu maa yusirruuna wamaa yu'linuuna innahu laa yuhibbu almustakbiriina","translate":{"id":"Tidak diragukan lagi bahwa sesungguhnya Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka lahirkan. Sesungguhnya Allah tidak menyukai orang-orang yang sombong.\n","en":"Truly, God knows all that they keep secret as well as all that they bring into the open -[and,] behold, He does not love those who are given to arrogance,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1924","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1924.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1924.mp3"]}},{"no":24,"arab":"وَإِذَا قِيلَ لَهُمْ مَاذَا أَنْزَلَ رَبُّكُمْ ۙ قَالُوا أَسَاطِيرُ الْأَوَّلِينَ","latin":"wa-idzaa qiila lahum maatsaa anzala rabbukum qaaluu asaathiiru al-awwaliina","translate":{"id":"Dan apabila dikatakan kepada mereka \"Apakah yang telah diturunkan Tuhanmu?\" Mereka menjawab: \"Dongeng-dongengan orang-orang dahulu\",\n","en":"and [who], whenever they are asked, \"What is it that your Sustainer has bestowed from on high?\"-are wont to answer, \"Fables of ancient times!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1925","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1925.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1925.mp3"]}},{"no":25,"arab":"لِيَحْمِلُوا أَوْزَارَهُمْ كَامِلَةً يَوْمَ الْقِيَامَةِ ۙ وَمِنْ أَوْزَارِ الَّذِينَ يُضِلُّونَهُمْ بِغَيْرِ عِلْمٍ ۗ أَلَا سَاءَ مَا يَزِرُونَ","latin":"liyahmiluu awzaarahum kaamilatan yawma alqiyaamati wamin awzaari alladziina yudhilluunahum bighayri 'ilmin alaa saa-a maa yaziruuna","translate":{"id":"(ucapan mereka) menyebabkan mereka memikul dosa-dosanya dengan sepenuh-penuhnya pada hari kiamat, dan sebahagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikitpun (bahwa mereka disesatkan). Ingatlah, amat buruklah dosa yang mereka pikul itu.\n","en":"Hence, on Resurrection Day they shall bear the full weight of their own burdens, as well as some of the burdens of those ignorant ones whom they have led astray: oh, how evil the load with which they shall be burdened!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1926","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1926.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1926.mp3"]}},{"no":26,"arab":"قَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَى اللَّهُ بُنْيَانَهُمْ مِنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","latin":"qad makara alladziina min qablihim fa-ataa allaahu bunyaanahum mina alqawaa'idi fakharra 'alayhimu alssaqfu min fawqihim wa-ataahumu al'adzaabu min haytsu laa yasy'uruuna","translate":{"id":"Sesungguhnya orang-orang yang sebelum mereka telah mengadakan makar, maka Allah menghancurkan rumah-rumah mereka dari fondasinya, lalu atap (rumah itu) jatuh menimpa mereka dari atas, dan datanglah azab itu kepada mereka dari tempat yang tidak mereka sadari.\n","en":"Those who lived before them did, too, devise many a blasphemy -whereupon God visited with destruction all that they had ever built, [striking] at its very foundations, so that the roof fell in upon them from above and suffering befell them without their having perceived whence it came."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1927","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1927.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1927.mp3"]}},{"no":27,"arab":"ثُمَّ يَوْمَ الْقِيَامَةِ يُخْزِيهِمْ وَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تُشَاقُّونَ فِيهِمْ ۚ قَالَ الَّذِينَ أُوتُوا الْعِلْمَ إِنَّ الْخِزْيَ الْيَوْمَ وَالسُّوءَ عَلَى الْكَافِرِينَ","latin":"tsumma yawma alqiyaamati yukhziihim wayaquulu ayna syurakaa-iya alladziina kuntum tusyaaqquuna fiihim qaala alladziina uutuu al'ilma inna alkhizya alyawma waalssuu-a 'alaa alkaafiriina","translate":{"id":"Kemudian Allah menghinakan mereka di hari kiamat, dan berfirman: \"Di manakah sekutu-sekutu-Ku itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi-nabi dan orang-orang mu'min) ?\" Berkatalah orang-orang yang telah diberi ilmu: \"Sesungguhnya kehinaan dan azab hari ini ditimpakan atas orang-orang yang kafir\",\n","en":"And then, on Resurrection Day, He will cover them [all] with ignominy, and will say: \"Where, now, are those beings to whom you ascribed a share in My divinity, [and] for whose sake you cut yourselves off [from My guidance]?\" [Whereupon] those who [in their lifetime] were endowed with knowledge will say: \"Verily, ignominy and misery [have fallen] this day upon those who have been denying the truth-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1928","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1928.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1928.mp3"]}},{"no":28,"arab":"الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنْفُسِهِمْ ۖ فَأَلْقَوُا السَّلَمَ مَا كُنَّا نَعْمَلُ مِنْ سُوءٍ ۚ بَلَىٰ إِنَّ اللَّهَ عَلِيمٌ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"alladziina tatawaffaahumu almalaa-ikatu zhaalimii anfusihim fa-alqawuu alssalama maa kunnaa na'malu min suu-in balaa inna allaaha 'aliimun bimaa kuntum ta'maluuna","translate":{"id":"(yaitu) orang-orang yang dimatikan oleh para malaikat dalam keadaan berbuat zalim kepada diri mereka sendiri, lalu mereka menyerah diri (sambil berkata); \"Kami sekali-kali tidak ada mengerjakan sesuatu kejahatanpun\". (Malaikat menjawab): \"Ada, sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan\".\n","en":"those whom the angels have gathered in death while they were still sinning against themselves!\" Then will they [who are thus arraigned] proffer their submission, [saying:] \"We did not [mean to] do any evil! [But they will be answered:] \"Yea, verily, God has full knowledge of all that you were doing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1929","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1929.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1929.mp3"]}},{"no":29,"arab":"فَادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَلَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ","latin":"faudkhuluu abwaaba jahannama khaalidiina fiihaa falabi/sa matswaa almutakabbiriina","translate":{"id":"Maka masukilah pintu-pintu neraka Jahannam, kamu kekal di dalamnya. Maka amat buruklah tempat orang-orang yang menyombongkan diri itu.\n","en":"Hence, enter the gates of hell, therein to abide!\" And evil, indeed, shall be the state of all who are given to false pride!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1930","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1930.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1930.mp3"]}},{"no":30,"arab":"وَقِيلَ لِلَّذِينَ اتَّقَوْا مَاذَا أَنْزَلَ رَبُّكُمْ ۚ قَالُوا خَيْرًا ۗ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۚ وَلَدَارُ الْآخِرَةِ خَيْرٌ ۚ وَلَنِعْمَ دَارُ الْمُتَّقِينَ","latin":"waqiila lilladziina ittaqaw maatsaa anzala rabbukum qaaluu khayran lilladziina ahsanuu fii haadzihi alddunyaa hasanatun waladaaru al-aakhirati khayrun walani'ma daaru almuttaqiina","translate":{"id":"Dan dikatakan kepada orang-orang yang bertakwa: \"Apakah yang telah diturunkan oleh Tuhanmu?\" Mereka menjawab: \"(Allah telah menurunkan) kebaikan\". Orang-orang yang berbuat baik di dunia ini mendapat (pembalasan) yang baik. Dan sesungguhnya kampung akhirat adalah lebih baik dan itulah sebaik-baik tempat bagi orang yang bertakwa,\n","en":"But [when] those who are conscious of God are asked, \"What is it that your Sustainer has bestowed from on high?\" -they answer, \"Goodness supreme!\" Good fortune awaits, in this world, all who persevere in doing good; but their ultimate state will be far better still: for, how excellent indeed will be the state of the God-conscious [in the life to come]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1931","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1931.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1931.mp3"]}},{"no":31,"arab":"جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ لَهُمْ فِيهَا مَا يَشَاءُونَ ۚ كَذَٰلِكَ يَجْزِي اللَّهُ الْمُتَّقِينَ","latin":"jannaatu 'adnin yadkhuluunahaa tajrii min tahtihaa al-anhaaru lahum fiihaa maa yasyaauuna kadzaalika yajzii allaahu almuttaqiina","translate":{"id":"(yaitu) syurga 'Adn yang mereka masuk ke dalamnya, mengalir di bawahnya sungai-sungai, di dalam surga itu mereka mendapat segala apa yang mereka kehendaki. Demikianlah Allah memberi balasan kepada orang-orang yang bertakwa,\n","en":"Gardens of perpetual bliss will they enter - [gardens] through which running waters flow - having therein all that they might desire. Thus will God reward those who are conscious of Him-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1932","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1932.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1932.mp3"]}},{"no":32,"arab":"الَّذِينَ تَتَوَفَّاهُمُ الْمَلَائِكَةُ طَيِّبِينَ ۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"alladziina tatawaffaahumu almalaa-ikatu thayyibiina yaquuluuna salaamun 'alaykumu udkhuluu aljannata bimaa kuntum ta'maluuna","translate":{"id":"(yaitu) orang-orang yang diwafatkan dalam keadaan baik oleh para malaikat dengan mengatakan (kepada mereka): \"Salaamun'alaikum , masuklah kamu ke dalam syurga itu disebabkan apa yang telah kamu kerjakan\".\n","en":"those whom the angels gather in death while they are in a state of inner purity, greeting them thus: \"Peace be upon you! Enter paradise by virtue of what you were doing [in life]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1933","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1933.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1933.mp3"]}},{"no":33,"arab":"هَلْ يَنْظُرُونَ إِلَّا أَنْ تَأْتِيَهُمُ الْمَلَائِكَةُ أَوْ يَأْتِيَ أَمْرُ رَبِّكَ ۚ كَذَٰلِكَ فَعَلَ الَّذِينَ مِنْ قَبْلِهِمْ ۚ وَمَا ظَلَمَهُمُ اللَّهُ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ","latin":"hal yanzhuruuna illaa an ta/tiyahumu almalaa-ikatu aw ya/tiya amru rabbika kadzaalika fa'ala alladziina min qablihim wamaa zhalamahumu allaahu walaakin kaanuu anfusahum yazhlimuuna","translate":{"id":"Tidak ada yang ditunggu-tunggu orang kafir selain dari datangnya para malaikat kepada mereka atau datangnya perintah Tuhanmu . Demikianlah yang telah diperbuat oleh orang-orang (kafir) sebelum mereka. Dan Allah tidak menganiaya mereka, akan tetapi merekalah yang selalu menganiaya diri mereka sendiri,\n","en":"ARE THEY [who deny the truth] but waiting for the angels to appear unto them, or for God's judgment to become manifest? Even thus did behave those [stubborn sinners] who lived before their time; and [when they were destroyed,] it was not God who wronged them, but it was they who had wronged themselves:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1934","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1934.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1934.mp3"]}},{"no":34,"arab":"فَأَصَابَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"fa-ashaabahum sayyi-aatu maa 'amiluu wahaaqa bihim maa kaanuu bihi yastahzi-uuna","translate":{"id":"Maka mereka ditimpa oleh (akibat) kejahatan perbuatan mereka dan mereka diliputi oleh azab yang selalu mereka perolok-olokan.\n","en":"for all the evil that they had done fell [back] upon them, and they were overwhelmed by the very thing which they had been wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1935","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1935.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1935.mp3"]}},{"no":35,"arab":"وَقَالَ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا عَبَدْنَا مِنْ دُونِهِ مِنْ شَيْءٍ نَحْنُ وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ دُونِهِ مِنْ شَيْءٍ ۚ كَذَٰلِكَ فَعَلَ الَّذِينَ مِنْ قَبْلِهِمْ ۚ فَهَلْ عَلَى الرُّسُلِ إِلَّا الْبَلَاغُ الْمُبِينُ","latin":"waqaala alladziina asyrakuu law syaa-a allaahu maa 'abadnaa min duunihi min syay-in nahnu walaa aabaaunaa walaa harramnaa min duunihi min syay-in kadzaalika fa'ala alladziina min qablihim fahal 'alaa alrrusuli illaa albalaaghu almubiinu","translate":{"id":"Dan berkatalah orang-orang musyrik: \"Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apapun selain Dia, baik kami maupun bapak-bapak kami, dan tidak pula kami mengharamkan sesuatupun tanpa (izin)-Nya\". Demikianlah yang diperbuat orang-orang sebelum mereka; maka tidak ada kewajiban atas para rasul, selain dari menyampaikan (amanat Allah) dengan terang.\n","en":"Now they who ascribe divinity to aught beside God say, \"Had God so willed, we would not have worshipped aught but Him - neither we nor our forefathers; nor would we have declared aught as forbidden without a commandment from Him.\" Even thus did speak those [sinners] who lived before their time; but, then, are the apostles bound to do more than clearly deliver the message [entrusted to them]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1936","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1936.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1936.mp3"]}},{"no":36,"arab":"وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ ۖ فَمِنْهُمْ مَنْ هَدَى اللَّهُ وَمِنْهُمْ مَنْ حَقَّتْ عَلَيْهِ الضَّلَالَةُ ۚ فَسِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","latin":"walaqad ba'atsnaa fii kulli ummatin rasuulan ani u'buduu allaaha waijtanibuu alththaaghuuta faminhum man hadaa allaahu waminhum man haqqat 'alayhi aldhdhalaalatu fasiiruu fii al-ardhi faunzhuruu kayfa kaana 'aaqibatu almukadzdzibiina","translate":{"id":"Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan): \"Sembahlah Allah (saja), dan jauhilah Thaghut itu\", maka di antara umat itu ada orang-orang yang diberi petunjuk oleh Allah dan ada pula di antaranya orang-orang yang telah pasti kesesatan baginya . Maka berjalanlah kamu dimuka bumi dan perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (rasul-rasul).\n","en":"And indeed, within every community have We raised up an apostle [entrusted with this message]: \"Worship God, and shun the powers of evil!\" And among those [past generations] were people whom God graced with His guidance, just as there was among them [many a one] who inevitably fell prey to grievous error: go, then, about the earth and behold what happened in the end to those who gave the lie to the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1937","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1937.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1937.mp3"]}},{"no":37,"arab":"إِنْ تَحْرِصْ عَلَىٰ هُدَاهُمْ فَإِنَّ اللَّهَ لَا يَهْدِي مَنْ يُضِلُّ ۖ وَمَا لَهُمْ مِنْ نَاصِرِينَ","latin":"in tahrish 'alaa hudaahum fa-inna allaaha laa yahdii man yudhillu wamaa lahum min naasiriina","translate":{"id":"Jika kamu sangat mengharapkan agar mereka dapat petunjuk, maka sesungguhnya Allah tiada memberi petunjuk kepada orang yang disesatkan-Nya, dan sekali-kali mereka tiada mempunyai penolong.\n","en":"[As for those who are bent on denying the truth-] though thou be ever so eager to show them the right way, [know that,] verily, God does not bestow His guidance upon any whom He judges to have gone astray; and such shall have none to succour them [on Resurrection Day]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1938","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1938.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1938.mp3"]}},{"no":38,"arab":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ لَا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ ۚ بَلَىٰ وَعْدًا عَلَيْهِ حَقًّا وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","latin":"wa-aqsamuu biallaahi jahda aymaanihim laa yab'atsu allaahu man yamuutu balaa wa'dan 'alayhi haqqan walaakinna aktsara alnnaasi laa ya'lamuuna","translate":{"id":"Mereka bersumpah dengan nama Allah dengan sumpahnya yang sungguh-sungguh: \"Allah tidak akan akan membangkitkan orang yang mati\". (Tidak demikian), bahkan (pasti Allah akan membangkitnya), sebagai suatu janji yang benar dari Allah, akan tetapi kebanyakan manusia tiada mengetahui,\n","en":"As it is, they swear by God with their most solemn oaths, \"Never will God raise from the dead anyone who has died!\" Yea indeed! [This very thing has God promised] by a promise which He has willed upon Himself; but most people know it not."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1939","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1939.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1939.mp3"]}},{"no":39,"arab":"لِيُبَيِّنَ لَهُمُ الَّذِي يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كَانُوا كَاذِبِينَ","latin":"liyubayyina lahumu alladzii yakhtalifuuna fiihi waliya'lama alladziina kafaruu annahum kaanuu kaadzibiina","translate":{"id":"agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan itu, agar orang-orang kafir itu mengetahui bahwasanya mereka adalah orang-orang yang berdusta.\n","en":"[He will resurrect them] to the end that He might make clear unto them all whereon they [now] hold divergent views, and that they who are bent on denying the truth [of resurrection] might come to know that they were liars."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1940","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1940.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1940.mp3"]}},{"no":40,"arab":"إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ","latin":"innamaa qawlunaa lisyay-in idzaa aradnaahu an naquula lahu kun fayakuunu","translate":{"id":"Sesungguhnya perkataan Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya: \"kun (jadilah)\", maka jadilah ia.\n","en":"Whenever We will anything to be, We but say unto it Our word \"Be\" -and it is."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1941","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1941.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1941.mp3"]}},{"no":41,"arab":"وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً ۖ وَلَأَجْرُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ","latin":"waalladziina haajaruu fii allaahi min ba'di maa zhulimuu lanubawwi-annahum fii alddunyaa hasanatan wala-ajru al-aakhirati akbaru law kaanuu ya'lamuuna","translate":{"id":"Dan orang-orang yang berhijrah karena Allah sesudah mereka dianiaya, pasti Kami akan memberikan tempat yang bagus kepada mereka di dunia. Dan sesungguhnya pahala di akhirat adalah lebih besar, kalau mereka mengetahui,\n","en":"NOW as for those who forsake the domain of evil in the cause of God, after having suffered wrong [on account of their faith] - We shall most certainly grant them a station of good fortune in this world: but their reward in the life to come will be far greater yet. If they [who deny the truth] could but understand"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1942","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1942.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1942.mp3"]}},{"no":42,"arab":"الَّذِينَ صَبَرُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","latin":"alladziina shabaruu wa'alaa rabbihim yatawakkaluuna","translate":{"id":"(yaitu) orang-orang yang sabar dan hanya kepada Tuhan saja mereka bertawakkal.\n","en":"those who, having attained to patience in adversity, in their Sustainer place their trust!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1943","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1943.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1943.mp3"]}},{"no":43,"arab":"وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ إِلَّا رِجَالًا نُوحِي إِلَيْهِمْ ۚ فَاسْأَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لَا تَعْلَمُونَ","latin":"wamaa arsalnaa min qablika illaa rijaalan nuuhii ilayhim fais-aluu ahla aldzdzikri in kuntum laa ta'lamuuna","translate":{"id":"Dan Kami tidak mengutus sebelum kamu, kecuali orang-orang lelaki yang Kami beri wahyu kepada mereka; maka bertanyalah kepada orang yang mempunyai pengetahuan jika kamu tidak mengetahui,\n","en":"AND [even] before thy time, [O Muhammad,] We never sent [as Our apostles] any but [mortal] men, whom We inspired: and if you have not [yet] realized this, ask the followers of [earlier] revelation,\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1944","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1944.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1944.mp3"]}},{"no":44,"arab":"بِالْبَيِّنَاتِ وَالزُّبُرِ ۗ وَأَنْزَلْنَا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُونَ","latin":"bialbayyinaati waalzzuburi wa-anzalnaa ilayka aldzdzikra litubayyina lilnnaasi maa nuzzila ilayhim wala'allahum yatafakkaruuna","translate":{"id":"keterangan-keterangan (mu'jizat) dan kitab-kitab. Dan Kami turunkan kepadamu Al Qur'an, agar kamu menerangkan pada umat manusia apa yang telah diturunkan kepada mereka dan supaya mereka memikirkan,\n","en":"[and they will tell you that their prophets, too, were but mortal men whom We had endowed] with all evidence of the truth and with books of divine wisdom. And upon thee [too] have We bestowed from on high this reminder, so that thou might make clear unto mankind all that has ever been thus bestowed upon them, and that they might take thought."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1945","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1945.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1945.mp3"]}},{"no":45,"arab":"أَفَأَمِنَ الَّذِينَ مَكَرُوا السَّيِّئَاتِ أَنْ يَخْسِفَ اللَّهُ بِهِمُ الْأَرْضَ أَوْ يَأْتِيَهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","latin":"afa-amina alladziina makaruu alssayyi-aati an yakhsifa allaahu bihimu al-ardha aw ya/tiyahumu al'adzaabu min haytsu laa yasy'uruuna","translate":{"id":"maka apakah orang-orang yang membuat makar yang jahat itu, merasa aman (dari bencana) ditenggelamkannya bumi oleh Allah bersama mereka, atau datangnya azab kepada mereka dari tempat yang tidak mereka sadari,\n","en":"Can, then, they who devise evil schemes ever feel sure that God will not cause the earth to swallow them, or that suffering will not befall them without their perceiving whence [it came]? -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1946","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1946.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1946.mp3"]}},{"no":46,"arab":"أَوْ يَأْخُذَهُمْ فِي تَقَلُّبِهِمْ فَمَا هُمْ بِمُعْجِزِينَ","latin":"aw ya/khudzahum fii taqallubihim famaa hum bimu'jiziina ","translate":{"id":"atau Allah mengazab mereka diwaktu mereka dalam perjalanan, maka sekali-kali mereka tidak dapat menolak (azab itu),\n","en":"or that He will not take them to task [suddenly] in the midst of their comings and goings, without their being able to elude [Him],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1947","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1947.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1947.mp3"]}},{"no":47,"arab":"أَوْ يَأْخُذَهُمْ عَلَىٰ تَخَوُّفٍ فَإِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ","latin":"aw ya/khudzahum 'alaa takhawwufin fa-inna rabbakum larauufun rahiimun","translate":{"id":"atau Allah mengazab mereka dengan berangsur-angsur (sampai binasa) . Maka sesungguhnya Tuhanmu adalah Maha Pengasih lagi Maha Penyayang.\n","en":"or take them to task through slow decay? And yet, behold, your Sustainer is most compassionate, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1948","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1948.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1948.mp3"]}},{"no":48,"arab":"أَوَلَمْ يَرَوْا إِلَىٰ مَا خَلَقَ اللَّهُ مِنْ شَيْءٍ يَتَفَيَّأُ ظِلَالُهُ عَنِ الْيَمِينِ وَالشَّمَائِلِ سُجَّدًا لِلَّهِ وَهُمْ دَاخِرُونَ","latin":"awa lam yaraw ilaa maa khalaqa allaahu min syay-in yatafayyau zhilaaluhu 'ani alyamiini waalsysyamaa-ili sujjadan lillaahi wahum daakhiruuna","translate":{"id":"Dan apakah mereka tidak memperhatikan segala sesuatu yang telah diciptakan Allah yang bayangannya berbolak-balik ke kanan dan ke kiri dalam keadaan sujud kepada Allah, sedang mereka berendah diri?\n","en":"HAVE, THEN, they [who deny the truth] never considered any of the things that God has created _ (how] their shadows turn right and left, prostrating themselves before God and utterly submissive [to His will]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1949","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1949.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1949.mp3"]}},{"no":49,"arab":"وَلِلَّهِ يَسْجُدُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مِنْ دَابَّةٍ وَالْمَلَائِكَةُ وَهُمْ لَا يَسْتَكْبِرُونَ","latin":"walillaahi yasjudu maa fii alssamaawaati wamaa fii al-ardhi min daabbatin waalmalaa-ikatu wahum laa yastakbiruuna","translate":{"id":"Dan kepada Allah sajalah bersujud segala apa yang berada di langit dan semua makhluk yang melata di bumi dan (juga) para maaikat, sedang mereka (malaikat) tidak menyombongkan diri.\n","en":"For, before God prostrates itself all that is in the heavens and all that is on earth - every beast that moves, and the angels: [even] these do not bear themselves with false pride:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1950","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1950.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1950.mp3"]}},{"no":50,"arab":"يَخَافُونَ رَبَّهُمْ مِنْ فَوْقِهِمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ ۩","latin":"yakhaafuuna rabbahum min fawqihim wayaf'aluuna maa yu/maruuna16","translate":{"id":"Mereka takut kepada Tuhan mereka yang di atas mereka dan melaksanakan apa yang diperintahkan (kepada mereka).\n","en":"they fear their Sustainer high above them, and do whatever they are bidden to do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1951","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1951.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1951.mp3"]}},{"no":51,"arab":"وَقَالَ اللَّهُ لَا تَتَّخِذُوا إِلَٰهَيْنِ اثْنَيْنِ ۖ إِنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ ۖ فَإِيَّايَ فَارْهَبُونِ","latin":"waqaala allaahu laa tattakhidzuu ilaahayni itsnayni innamaa huwa ilaahun waahidun fa-iyyaaya fairhabuuni","translate":{"id":"Allah berfirman: \"Janganlah kamu menyembah dua tuhan; sesungguhnya Dialah Tuhan Yang Maha Esa, maka hendaklah kepada-Ku saja kamu takut\".\n","en":"And God has said: \"Do not take to worshipping two [or more] deities. He is the One and Only God: hence, of Me, of Me alone stand in awe!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1952","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1952.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1952.mp3"]}},{"no":52,"arab":"وَلَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَلَهُ الدِّينُ وَاصِبًا ۚ أَفَغَيْرَ اللَّهِ تَتَّقُونَ","latin":"walahu maa fii alssamaawaati waal-ardhi walahu alddiinu waasiban afaghayra allaahi tattaquuna","translate":{"id":"Dan kepunyaan-Nya-lah segala apa yang ada di langit dan di bumi, dan untuk-Nya-lah keta'atan itu selama-lamanya. Maka mengapa kamu bertakwa kepada selain Allah?\n","en":"And His is all that is in the heavens and on earth, and to Him [alone] obedience is always due: will you, then, pay reverence to aught but Him?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1953","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1953.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1953.mp3"]}},{"no":53,"arab":"وَمَا بِكُمْ مِنْ نِعْمَةٍ فَمِنَ اللَّهِ ۖ ثُمَّ إِذَا مَسَّكُمُ الضُّرُّ فَإِلَيْهِ تَجْأَرُونَ","latin":"wamaa bikum min ni'matin famina allaahi tsumma idzaa massakumu aldhdhurru fa-ilayhi taj-aruuna","translate":{"id":"Dan apa saja ni'mat yang ada pada kamu, maka dari Allah-lah (datangnya), dan bila kamu ditimpa oleh kemudharatan, maka hanya kepada-Nya-lah kamu meminta pertolongan.\n","en":"For, whatever good thing comes to you, comes from God; and whenever harm befalls you, it is unto Him that you cry for help"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1954","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1954.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1954.mp3"]}},{"no":54,"arab":"ثُمَّ إِذَا كَشَفَ الضُّرَّ عَنْكُمْ إِذَا فَرِيقٌ مِنْكُمْ بِرَبِّهِمْ يُشْرِكُونَ","latin":"tsumma idzaa kasyafa aldhdhurra 'ankum idzaa fariiqun minkum birabbihim yusyrikuuna","translate":{"id":"Kemudian apabila Dia telah menghilangkan kemudharatan itu dari pada kamu, tiba-tiba sebahagian dari pada kamu mempersekutukan Tuhannya dengan (yang lain),\n","en":"yet as soon as He has removed the harm from you, lo! some of you [begin to] ascribe to other powers a share 'in their Sustainer's divinity"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1955","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1955.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1955.mp3"]}},{"no":55,"arab":"لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ ۚ فَتَمَتَّعُوا ۖ فَسَوْفَ تَعْلَمُونَ","latin":"liyakfuruu bimaa aataynaahum fatamatta'uu fasawfa ta'lamuuna","translate":{"id":"Biarlah mereka mengingkari ni'mat yang telah Kami berikan kepada mereka; maka bersenang-senanglah kamu. Kelak kamu akan mengetahui (akibatnya).\n","en":"[as if] to prove their ingratitude for all that We have granted them! Enjoy, then, your [brief] life: but in time you will come to know [the truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1956","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1956.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1956.mp3"]}},{"no":56,"arab":"وَيَجْعَلُونَ لِمَا لَا يَعْلَمُونَ نَصِيبًا مِمَّا رَزَقْنَاهُمْ ۗ تَاللَّهِ لَتُسْأَلُنَّ عَمَّا كُنْتُمْ تَفْتَرُونَ","latin":"wayaj'aluuna limaa laa ya'lamuuna nashiiban mimmaa razaqnaahum taallaahi latus-alunna 'ammaa kuntum taftaruuna","translate":{"id":"Dan mereka sediakan untuk berhala-berhala yang mereka tiada mengetahui (kekuasaannya), satu bahagian dari rezki yang telah Kami berikan kepada mereka. Demi Allah, sesungguhnya kamu akan ditanyai tentang apa yang telah kamu ada-adakan.\n","en":"As it is, they ascribe - out of what We provide for them as sustenance - a share unto things of which they know nothing. By God, you shall most certainly be called to account for all your false imagery!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1957","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1957.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1957.mp3"]}},{"no":57,"arab":"وَيَجْعَلُونَ لِلَّهِ الْبَنَاتِ سُبْحَانَهُ ۙ وَلَهُمْ مَا يَشْتَهُونَ","latin":"wayaj'aluuna lillaahi albanaati subhaanahu walahum maa yasytahuuna","translate":{"id":"Dan mereka menetapkan bagi Allah anak-anak perempuan . Maha Suci Allah, sedang untuk mereka sendiri (mereka tetapkan) apa yang mereka sukai (yaitu anak-anak laki-laki).\n","en":"And [thus, too,] they ascribe daughters unto God, who is limitless in His glory - whereas for themselves [they would choose, if they could, only] what they desire:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1958","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1958.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1958.mp3"]}},{"no":58,"arab":"وَإِذَا بُشِّرَ أَحَدُهُمْ بِالْأُنْثَىٰ ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ","latin":"wa-idzaa busysyira ahaduhum bialuntsaa zhalla wajhuhu muswaddan wahuwa kazhiimun","translate":{"id":"Dan apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya, dan dia sangat marah.\n","en":"for, whenever any of them is given the glad tiding of [the birth of] a girl, his face darkens, and he is filled with suppressed anger,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1959","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1959.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1959.mp3"]}},{"no":59,"arab":"يَتَوَارَىٰ مِنَ الْقَوْمِ مِنْ سُوءِ مَا بُشِّرَ بِهِ ۚ أَيُمْسِكُهُ عَلَىٰ هُونٍ أَمْ يَدُسُّهُ فِي التُّرَابِ ۗ أَلَا سَاءَ مَا يَحْكُمُونَ","latin":"yatawaaraa mina alqawmi min suu-i maa busysyira bihi ayumsikuhu 'alaa huunin am yadussuhu fii altturaabi alaa saa-a maa yahkumuuna","translate":{"id":"Ia menyembunyikan dirinya dari orang banyak, disebabkan buruknya berita yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan menanggung kehinaan ataukah akan menguburkannya ke dalam tanah (hidup-hidup) ?. Ketahuilah, alangkah buruknya apa yang mereka tetapkan itu.\n","en":"avoiding all people because of the [alleged] evil of the glad tiding which he has received, [and debating within himself:] Shall he keep this [child] despite the contempt [which he feels for it]-or shall he bury it in the dust? Old, evil indeed is whatever they decide!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1960","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1960.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1960.mp3"]}},{"no":60,"arab":"لِلَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ مَثَلُ السَّوْءِ ۖ وَلِلَّهِ الْمَثَلُ الْأَعْلَىٰ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"lilladziina laa yu/minuuna bial-aakhirati matsalu alssaw-i walillaahi almatsalu al-a'laa wahuwa al'aziizu alhakiimu","translate":{"id":"Orang-orang yang tidak beriman kepada kehidupan akhirat, mempunyai sifat yang buruk; dan Allah mempunyai sifat yang Maha Tinggi; dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"[Thus it is that] the attribute of evil applies to all who do not believe in the life to come -whereas unto God applies the attribute of all that is most sublime: for He alone is almighty, truly wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1961","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1961.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1961.mp3"]}},{"no":61,"arab":"وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِظُلْمِهِمْ مَا تَرَكَ عَلَيْهَا مِنْ دَابَّةٍ وَلَٰكِنْ يُؤَخِّرُهُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۖ فَإِذَا جَاءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ","latin":"walaw yu-aakhidzu allaahu alnnaasa bizhulmihim maa taraka 'alayhaa min daabbatin walaakin yu-akhkhiruhum ilaa ajalin musamman fa-idzaa jaa-a ajaluhum laa yasta/khiruuna saa'atan walaa yastaqdimuuna","translate":{"id":"Jikalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ditinggalkan-Nya di muka bumi sesuatupun dari makhluk yang melata, tetapi Allah menangguhkan mereka sampai kepada waktu yang ditentukan. Maka apabila telah tiba waktunya (yang ditentukan) bagi mereka, tidaklah mereka dapat mengundurkannya barang sesaatpun dan tidak (pula) mendahulukannya.\n","en":"Now if God were to take men [immediately] to task for all the evil that they do [on earth], He would not leave a single living creature upon its face. However, He grants them respite until a term set [by Him]: but when the end of their term approaches, they can neither delay it by a single moment, nor can they hasten it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1962","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1962.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1962.mp3"]}},{"no":62,"arab":"وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ الْكَذِبَ أَنَّ لَهُمُ الْحُسْنَىٰ ۖ لَا جَرَمَ أَنَّ لَهُمُ النَّارَ وَأَنَّهُمْ مُفْرَطُونَ","latin":"wayaj'aluuna lillaahi maa yakrahuuna watashifu alsinatuhumu alkadziba anna lahumu alhusnaa laa jarama anna lahumu alnnaara wa-annahum mufrathuuna","translate":{"id":"Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, dan lidah mereka mengucapkan kedustaan, yaitu bahwa sesungguhnya merekalah yang akan mendapat kebaikan. Tiadalah diragukan bahwa nerakalah bagi mereka, dan sesungguhnya mereka segera dimasukkan (ke dalamnya).\n","en":"As it is, they ascribe to God something that they [themselves] dislike -and [all the while] their tongues utter the lie that [by doing so] they earn supreme merit! Truly, they earn but the fire, and will be left out [of God's grace]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1963","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1963.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1963.mp3"]}},{"no":63,"arab":"تَاللَّهِ لَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِنْ قَبْلِكَ فَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَهُوَ وَلِيُّهُمُ الْيَوْمَ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"taallaahi laqad arsalnaa ilaa umamin min qablika fazayyana lahumu alsysyaythaanu a'maalahum fahuwa waliyyuhumu alyawma walahum 'adzaabun aliimun","translate":{"id":"Demi Allah, sesungguhnya Kami telah mengutus rasul-rasul Kami kepada umat-umat sebelum kamu, tetapi syaitan menjadikan umat-umat itu memandang baik perbuatan mereka (yang buruk), maka syaitan menjadi pemimpin mereka di hari itu dan bagi mereka azab yang sangat pedih.\n","en":"By God, [O Prophet,] even before thy time have We sent apostles unto [various] communities: but [those who were bent on denying the truth have always refused to listen to Our messages because] Satan has made all their own doings seem goodly to them: and he is [as] close to them today [as he was to the sinners of yore]; hence, grievous suffering awaits them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1964","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1964.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1964.mp3"]}},{"no":64,"arab":"وَمَا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ إِلَّا لِتُبَيِّنَ لَهُمُ الَّذِي اخْتَلَفُوا فِيهِ ۙ وَهُدًى وَرَحْمَةً لِقَوْمٍ يُؤْمِنُونَ","latin":"wamaa anzalnaa 'alayka alkitaaba illaa litubayyina lahumu alladzii ikhtalafuu fiihi wahudan warahmatan liqawmin yu/minuuna","translate":{"id":"Dan Kami tidak menurunkan kepadamu Al-Kitab (Al Qur'an) ini, melainkan agar kamu dapat menjelaskan kepada mereka apa yang mereka perselisihkan itu dan menjadi petunjuk dan rahmat bagi kaum yang beriman.\n","en":"And upon thee [too] have We bestowed from on' high this divine writ for no other reason than that thou might make clear unto them all [questions of faith] on which they have come to hold divergent views, and [thus offer] guidance and grace unto people who will believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1965","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1965.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1965.mp3"]}},{"no":65,"arab":"وَاللَّهُ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَسْمَعُونَ","latin":"waallaahu anzala mina alssamaa-i maa-an fa-ahyaa bihi al-ardha ba'da mawtihaa inna fii dzaalika laaayatan liqawmin yasma'uuna","translate":{"id":"Dan Allah menurunkan dari langit air (hujan) dan dengan air itu dihidupkan-Nya bumi sesudah matinya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Tuhan) bagi orang-orang yang mendengarkan (pelajaran).\n","en":"AND GOD sends down water from the skies, giving life thereby to the earth after it had been lifeless: in this, behold, there is a message indeed for people who [are willing to] listen."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1966","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1966.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1966.mp3"]}},{"no":66,"arab":"وَإِنَّ لَكُمْ فِي الْأَنْعَامِ لَعِبْرَةً ۖ نُسْقِيكُمْ مِمَّا فِي بُطُونِهِ مِنْ بَيْنِ فَرْثٍ وَدَمٍ لَبَنًا خَالِصًا سَائِغًا لِلشَّارِبِينَ","latin":"wa-inna lakum fii al-an'aami la'ibratan nusqiikum mimmaa fii buthuunihi min bayni fartsin wadamin labanan khaalishan saa-ighan lilsysyaaribiina","translate":{"id":"Dan sesungguhnya pada binatang ternak itu benar-benar terdapat pelajaran bagi kamu. Kami memberimu minum dari pada apa yang berada dalam perutnya (berupa) susu yang bersih antara tahi dan darah, yang mudah ditelan bagi orang-orang yang meminumnya.\n","en":"And, behold, in the cattle [too] there is indeed a lesson for you: We give you to drink of that [fluid] which is [secreted from] within their bellies between that which is to be eliminated [from the animal's body] and [its] life-blood: milk pure and pleasant to those who drink it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1967","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1967.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1967.mp3"]}},{"no":67,"arab":"وَمِنْ ثَمَرَاتِ النَّخِيلِ وَالْأَعْنَابِ تَتَّخِذُونَ مِنْهُ سَكَرًا وَرِزْقًا حَسَنًا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَعْقِلُونَ","latin":"wamin tsamaraati alnnakhiili waal-a'naabi tattakhidzuuna minhu sakaran warizqan hasanan inna fii dzaalika laaayatan liqawmin ya'qiluuna","translate":{"id":"Dan dari buah korma dan anggur, kamu buat minimuman yang memabukkan dan rezki yang baik. Sesunggguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang memikirkan.\n","en":"And [We grant you nourishment] from the fruit of date-palms and vines: from it you derive intoxicants as well as wholesome sustenance -in this, behold, there is a message indeed for people who use their reason!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1968","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1968.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1968.mp3"]}},{"no":68,"arab":"وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ","latin":"wa-awhaa rabbuka ilaa alnnahli ani ittakhidzii mina aljibaali buyuutan wamina alsysyajari wamimmaa ya'risyuuna","translate":{"id":"Dan Tuhanmu mewahyukan kepada lebah: \"Buatlah sarang-sarang di bukit-bukit, di pohon-pohon kayu, dan di tempat-tempat yang dibikin manusia\",\n","en":"And [consider how] thy Sustainer has inspired the bee: \"Prepare for thyself dwellings in mountains and in trees, and in what [men] may build [for thee by way of hives];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1969","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1969.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1969.mp3"]}},{"no":69,"arab":"ثُمَّ كُلِي مِنْ كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخْرُجُ مِنْ بُطُونِهَا شَرَابٌ مُخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ","latin":"tsumma kulii min kulli altstsamaraati fauslukii subula rabbiki dzululan yakhruju min buthuunihaa syaraabun mukhtalifun alwaanuhu fiihi syifaaun lilnnaasi inna fii dzaalika laaayatan liqawmin yatafakkaruuna","translate":{"id":"kemudian makanlah dari tiap-tiap (macam) buah-buahan dan tempuhlah jalan Tuhanmu yang telah dimudahkan (bagimu). Dari perut lebah itu ke luar minuman (madu) yang bermacam-macam warnanya, di dalamnya terdapat obat yang menyembuhkan bagi manusia. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Tuhan) bagi orang-orang yang memikirkan.\n","en":"and then eat of all manner of fruit, and follow humbly the paths ordained for thee by thy Sustainer.\" [And lo!] there issues from within these [bees] a fluid of many hues, wherein there is health for man. In all this, behold, there is a message indeed for people who think!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1970","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1970.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1970.mp3"]}},{"no":70,"arab":"وَاللَّهُ خَلَقَكُمْ ثُمَّ يَتَوَفَّاكُمْ ۚ وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْ لَا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئًا ۚ إِنَّ اللَّهَ عَلِيمٌ قَدِيرٌ","latin":"waallaahu khalaqakum tsumma yatawaffaakum waminkum man yuraddu ilaa ardzali al'umuri likay laa ya'lama ba'da 'ilmin syay-an inna allaaha 'aliimun qadiirun","translate":{"id":"Allah menciptakan kamu, kemudian mewafatkan kamu; dan di antara kamu ada yang dikembalikan kepada umur yang paling lemah (pikun), supaya dia tidak mengetahui lagi sesuatupun yang pernah diketahuinya. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa.\n","en":"AND GOD has created you, and in time will cause you to die; and many a one of you is reduced in old age to a most abject state, ceasing to know anything of what he once knew so well. Verily, God is all-knowing, infinite in His power!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1971","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1971.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1971.mp3"]}},{"no":71,"arab":"وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي الرِّزْقِ ۚ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ ۚ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ","latin":"waallaahu fadhdhala ba'dhakum 'alaa ba'dhin fii alrrizqi famaa alladziina fudhdhiluu biraaddii rizqihim 'alaa maa malakat aymaanuhum fahum fiihi sawaaun afabini'mati allaahi yajhaduuna","translate":{"id":"Dan Allah melebihkan sebahagian kamu dari sebagian yang lain dalam hal rezki, tetapi orang-orang yang dilebihkan (rezkinya itu) tidak mau memberikan rezki mereka kepada budak-budak yang mereka miliki, agar mereka sama (merasakan) rezki itu. Maka mengapa mereka mengingkari ni'mat Allah ?\n","en":"And on some of you God has bestowed more abundant means of sustenance than on others: and yet, they who are more abundantly favoured are [often] unwilling to share their sustenance with those whom their right hands possess, so that they [all] might be equal in this respect. Will they, then, God's blessings [thus] deny?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1972","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1972.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1972.mp3"]}},{"no":72,"arab":"وَاللَّهُ جَعَلَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا وَجَعَلَ لَكُمْ مِنْ أَزْوَاجِكُمْ بَنِينَ وَحَفَدَةً وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ اللَّهِ هُمْ يَكْفُرُونَ","latin":"waallaahu ja'ala lakum min anfusikum azwaajan waja'ala lakum min azwaajikum baniina wahafadatan warazaqakum mina alththhayyibaati afabialbaathili yu/minuuna wabini'mati allaahi hum yakfuruuna","translate":{"id":"Allah menjadikan bagi kamu isteri-isteri dari jenis kamu sendiri dan menjadikan bagimu dari isteri-isteri kamu itu, anak-anak dan cucu-cucu, dan memberimu rezki dari yang baik-baik. Maka mengapakah mereka beriman kepada yang bathil dan mengingkari ni'mat Allah ?\"\n","en":"And God has given you mates of your own kinds and has given you, through your mates, children and children's children, and has provided for you sustenance out of the good things of life. Will men, then, [continue to] believe in things false and vain, and thus blaspheme against God's blessings? -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1973","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1973.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1973.mp3"]}},{"no":73,"arab":"وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَمْلِكُ لَهُمْ رِزْقًا مِنَ السَّمَاوَاتِ وَالْأَرْضِ شَيْئًا وَلَا يَسْتَطِيعُونَ","latin":"waya'buduuna min duuni allaahi maa laa yamliku lahum rizqan mina alssamaawaati waal-ardhi syay-an walaa yastathii'uuna","translate":{"id":"Dan mereka menyembah selain Allah, sesuatu yang tidak dapat memberikan rezki kepada mereka sedikitpun dari langit dan bumi, dan tidak berkuasa (sedikit juapun).\n","en":"and will they [continue to] worship, instead of God, something that has it not within its power to provide for them any sustenance whatever from the heavens or the earth, and can do nothing at all?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1974","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1974.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1974.mp3"]}},{"no":74,"arab":"فَلَا تَضْرِبُوا لِلَّهِ الْأَمْثَالَ ۚ إِنَّ اللَّهَ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ","latin":"falaa tadhribuu lillaahi al-amtsaala inna allaaha ya'lamu wa-antum laa ta'lamuuna","translate":{"id":"Maka janganlah kamu mengadakan sekutu-sekutu bagi Allah. Sesungguhnya Allah mengetahui, sedang kamu tidak mengetahui.\n","en":"Hence, do not coin any similitudes for Gods Verily, God knows [all], whereas you have no [real] knowledge."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1975","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1975.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1975.mp3"]}},{"no":75,"arab":"ضَرَبَ اللَّهُ مَثَلًا عَبْدًا مَمْلُوكًا لَا يَقْدِرُ عَلَىٰ شَيْءٍ وَمَنْ رَزَقْنَاهُ مِنَّا رِزْقًا حَسَنًا فَهُوَ يُنْفِقُ مِنْهُ سِرًّا وَجَهْرًا ۖ هَلْ يَسْتَوُونَ ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","latin":"dharaba allaahu matsalan 'abdan mamluukan laa yaqdiru 'alaa syay-in waman razaqnaahu minnaa rizqan hasanan fahuwa yunfiqu minhu sirran wajahran hal yastawuuna alhamdu lillaahi bal aktsaruhum laa ya'lamuuna","translate":{"id":"Allah membuat perumpamaan dengan seorang hamba sahaya yang dimiliki yang tidak dapat bertindak terhadap sesuatupun dan seorang yang Kami beri rezki yang baik dari Kami, lalu dia menafkahkan sebagian dari rezki itu secara sembunyi dan secara terang-terangan, adakah mereka itu sama? Segala puji hanya bagi Allah, tetapi kebanyakan mereka tiada mengetahui .\n","en":"God propounds [to you] the parable of [two men-] a man enslaved, unable to do anything of his own accord, and a [free] man upon whom We have bestowed goodly sustenance [as a gift] from Ourselves, so that he can spend thereof [at will, both] secretly and openly. Can these [two] be deemed equal? All praise is due to God [alone]: but most of them do not understand it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1976","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1976.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1976.mp3"]}},{"no":76,"arab":"وَضَرَبَ اللَّهُ مَثَلًا رَجُلَيْنِ أَحَدُهُمَا أَبْكَمُ لَا يَقْدِرُ عَلَىٰ شَيْءٍ وَهُوَ كَلٌّ عَلَىٰ مَوْلَاهُ أَيْنَمَا يُوَجِّهْهُ لَا يَأْتِ بِخَيْرٍ ۖ هَلْ يَسْتَوِي هُوَ وَمَنْ يَأْمُرُ بِالْعَدْلِ ۙ وَهُوَ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"wadharaba allaahu matsalan rajulayni ahaduhumaa abkamu laa yaqdiru 'alaa syay-in wahuwa kallun 'alaa mawlaahu aynamaa yuwajjihhu laa ya/ti bikhayrin hal yastawii huwa waman ya/muru bial'adli wahuwa 'alaa shiraathin mustaqiimin","translate":{"id":"Dan Allah membuat (pula) perumpamaan: dua orang lelaki yang seorang bisu, tidak dapat berbuat sesuatupun dan dia menjadi beban atas penanggungnya, ke mana saja dia disuruh oleh penanggungnya itu, dia tidak dapat mendatangkan suatu kebajikanpun. Samakah orang itu dengan orang yang menyuruh berbuat keadilan, dan dia berada pula di atas jalan yang lurus?\n","en":"And God propounds [to you] the parable of two [other] men -one of them dumb, unable to do anything of his own accord, and a sheer burden on his master: to whichever task the latter directs him, he accomplishes no good. Can such a one be considered the equal of [a wise man] who enjoins the doing of what is right and himself follows a straight way?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1977","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1977.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1977.mp3"]}},{"no":77,"arab":"وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَمَا أَمْرُ السَّاعَةِ إِلَّا كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"walillaahi ghaybu alssamaawaati waal-ardhi wamaa amru alssaa'ati illaa kalamhi albashari aw huwa aqrabu inna allaaha 'alaa kulli syay-in qadiirun","translate":{"id":"Dan kepunyaan Allah-lah segala apa yang tersembunyi di langit dan di bumi. Tidak adalah kejadian kiamat itu, melainkan seperti sekejap mata atau lebih cepat (lagi). Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\n","en":"And, God's [alone] is the knowledge of the hidden reality of the heavens and the earth. And so, the advent of the Last Hour will but manifest itself [in a single moment,] like the twinkling of an eye, or closer still: for, behold, God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1978","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1978.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1978.mp3"]}},{"no":78,"arab":"وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ","latin":"waallaahu akhrajakum min buthuuni ummahaatikum laa ta'lamuuna syay-an waja'ala lakumu alssam'a waal-abshaara waal-af-idata la'allakum tasykuruuna","translate":{"id":"Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun, dan Dia memberi kamu pendengaran, penglihatan dan hati, agar kamu bersyukur.\n","en":"And God has brought you forth from your mothers' wombs knowing nothing-but He has endowed you with hearing, and sight, and minds, so that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1979","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1979.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1979.mp3"]}},{"no":79,"arab":"أَلَمْ يَرَوْا إِلَى الطَّيْرِ مُسَخَّرَاتٍ فِي جَوِّ السَّمَاءِ مَا يُمْسِكُهُنَّ إِلَّا اللَّهُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ","latin":"alam yaraw ilaa alththhayri musakhkharaatin fii jawwi alssamaa-i maa yumsikuhunna illaa allaahu inna fii dzaalika laaayaatin liqawmin yu/minuuna","translate":{"id":"Tidakkah mereka memperhatikan burung-burung yang dimudahkan terbang diangkasa bebas. Tidak ada yang menahannya selain daripada Allah. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Tuhan) bagi orang-orang yang beriman.\n","en":"Have, then, they [who deny the truth] never considered the birds, enabled [by God] to fly in mid-air, with none but God holding them aloft? In this, behold, there are messages indeed for people who will believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1980","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1980.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1980.mp3"]}},{"no":80,"arab":"وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَنًا وَجَعَلَ لَكُمْ مِنْ جُلُودِ الْأَنْعَامِ بُيُوتًا تَسْتَخِفُّونَهَا يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقَامَتِكُمْ ۙ وَمِنْ أَصْوَافِهَا وَأَوْبَارِهَا وَأَشْعَارِهَا أَثَاثًا وَمَتَاعًا إِلَىٰ حِينٍ","latin":"waallaahu ja'ala lakum min buyuutikum sakanan waja'ala lakum min juluudi al-an'aami buyuutan tastakhiffuunahaa yawma zha'nikum wayawma iqaamatikum wamin ashwaafihaa wa-awbaarihaa wa-asy'aarihaa atsaatsan wamataa'an ilaa hiinin","translate":{"id":"Dan Allah menjadikan bagimu rumah-rumahmu sebagai tempat tinggal dan Dia menjadikan bagi kamu rumah-rumah (kemah-kemah) dari kulit binatang ternak yang kamu merasa ringan (membawa)nya di waktu kamu berjalan dan waktu kamu bermukim dan (dijadikan-Nya pula) dari bulu domba, bulu onta dan bulu kambing, alat-alat rumah tangga dan perhiasan (yang kamu pakai) sampai waktu (tertentu).\n","en":"And God has given you [the ability to build] your houses as places of rest, and has endowed you with [the skill to make] dwellings out of the skins of animals - easy for you to handle when you travel and when you camp -and [to make] furnishings and goods for temporary use of their [rough] wool and their soft, furry wool and their hair."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1981","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1981.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1981.mp3"]}},{"no":81,"arab":"وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُمْ مِنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُمْ بَأْسَكُمْ ۚ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ","latin":"waallaahu ja'ala lakum mimmaa khalaqa zhilaalan waja'ala lakum mina aljibaali aknaanan waja'ala lakum saraabiila taqiikumu alharra wasaraabiila taqiikum ba/sakum kadzaalika yutimmu ni'matahu 'alaykum la'allakum tuslimuuna","translate":{"id":"Dan Allah menjadikan bagimu tempat bernaung dari apa yang telah Dia ciptakan, dan Dia jadikan bagimu tempat-tempat tinggal di gunung-gunung, dan Dia jadikan bagimu pakaian yang memeliharamu dari panas dan pakaian (baju besi) yang memelihara kamu dalam peperangan. Demikianlah Allah menyempurnakan ni'mat-Nya atasmu agar kamu berserah diri (kepada-Nya).\n","en":"And among the many objects of His creation, God has appointed for you [various] means of protection: thus, He has given you in the mountains places of shelter, and has endowed you with [the ability to make] garments to protect you from heat [and cold], as well as such garments as might protect you from your [mutual] violence. In this way does He bestow the full measure of His blessings on you, so that you might surrender yourselves unto Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1982","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1982.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1982.mp3"]}},{"no":82,"arab":"فَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ الْمُبِينُ","latin":"fa-in tawallaw fa-innamaa 'alayka albalaaghu almubiinu","translate":{"id":"Jika mereka tetap berpaling, maka sesungguhnya kewajiban yang dibebankan atasmu (Muhammad) hanyalah menyampaikan (amanat Allah) dengan terang .\n","en":"BUT IF they turn away [from thee, O Prophet, remember that] thy only duty is a clear delivery of the message [entrusted to thee]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1983","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1983.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1983.mp3"]}},{"no":83,"arab":"يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنْكِرُونَهَا وَأَكْثَرُهُمُ الْكَافِرُونَ","latin":"ya'rifuuna ni'mata allaahi tsumma yunkiruunahaa wa-aktsaruhumu alkaafiruuna","translate":{"id":"Mereka mengetahui ni'mat Allah, kemudian mereka mengingkarinya dan kebanyakan mereka adalah orang-orang yang kafir.\n","en":"They [who turn away from it] are fully aware of God's blessings, but none the less they refuse to acknowledge them [as such], since most of them are given to denying the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1984","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1984.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1984.mp3"]}},{"no":84,"arab":"وَيَوْمَ نَبْعَثُ مِنْ كُلِّ أُمَّةٍ شَهِيدًا ثُمَّ لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا وَلَا هُمْ يُسْتَعْتَبُونَ","latin":"wayawma nab'atsu min kulli ummatin syahiidan tsumma laa yu/dzanu lilladziina kafaruu walaa hum yusta'tabuuna","translate":{"id":"Dan (ingatlah) akan hari (ketika) Kami bangkitkan dari tiap-tiap umat seorang saksi (rasul), kemudian tidak diizinkan kepada orang-orang yang kafir (untuk membela diri) dan tidak (pula) mereka dibolehkan meminta ma'af.\n","en":"But one Day We shall raise up a witness out of every community, whereupon they who were bent on denying the truth will not be allowed to plead [ignorance], and neither will they be allowed to make amends."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1985","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1985.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1985.mp3"]}},{"no":85,"arab":"وَإِذَا رَأَى الَّذِينَ ظَلَمُوا الْعَذَابَ فَلَا يُخَفَّفُ عَنْهُمْ وَلَا هُمْ يُنْظَرُونَ","latin":"wa-idzaa raaa alladziina zhalamuu al'adzaaba falaa yukhaffafu 'anhum walaa hum yunzharuuna","translate":{"id":"Dan apabila orang-orang zalim telah menyaksikan azab, maka tidaklah diringankan azab bagi mereka dan tidak puIa mereka diberi tangguh.\n","en":"And when they who were bent on evildoing behold the suffering [that awaits them, they will realize that] it will not be lightened for them [by virtue of their pleading]; and neither will they be granted respite."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1986","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1986.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1986.mp3"]}},{"no":86,"arab":"وَإِذَا رَأَى الَّذِينَ أَشْرَكُوا شُرَكَاءَهُمْ قَالُوا رَبَّنَا هَٰؤُلَاءِ شُرَكَاؤُنَا الَّذِينَ كُنَّا نَدْعُو مِنْ دُونِكَ ۖ فَأَلْقَوْا إِلَيْهِمُ الْقَوْلَ إِنَّكُمْ لَكَاذِبُونَ","latin":"wa-idzaa raaa alladziina asyrakuu syurakaa-ahum qaaluu rabbanaa haaulaa-i syurakaaunaa alladziina kunnaa nad'uu min duunika fa-alqaw ilayhimu alqawla innakum lakaadzibuuna","translate":{"id":"Dan apabila orang-orang yang mempersekutukan (Allah) melihat sekutu-sekutu mereka , mereka berkata: \"Ya Tuhan kami mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain dari Engkau\". Lalu sekutu-sekutu mereka mengatakan kepada mereka: \"Sesungguhnya kamu benar-benar orang-orang yang dusta\".\n","en":"And when they who were wont to ascribe divinity to beings other than God behold [on Judgment Day] those beings to whom they were wont to ascribe a share in His divinity, they will exclaim: \"O our Sustainer! These are the beings to whom we ascribed a share in Thy divinity, and whom we were wont to invoke instead of Thee!\" -whereupon [those beings] will fling at them the retort: \"Behold, you have indeed been lying [to yourselves]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1987","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1987.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1987.mp3"]}},{"no":87,"arab":"وَأَلْقَوْا إِلَى اللَّهِ يَوْمَئِذٍ السَّلَمَ ۖ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ","latin":"wa-alqaw ilaa allaahi yawma-idzin alssalama wadhalla 'anhum maa kaanuu yaftaruuna","translate":{"id":"Dan mereka menyatakan ketundukannya kepada Allah pada hari itu dan hilanglah dari mereka apa yang selalu mereka ada-adakan .\n","en":"And on that Day will they [who had thus been sinning, belatedly] proffer their surrender to God; and all their false imagery will have forsaken them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1988","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1988.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1988.mp3"]}},{"no":88,"arab":"الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ بِمَا كَانُوا يُفْسِدُونَ","latin":"alladziina kafaruu washadduu 'an sabiili allaahi zidnaahum 'adzaaban fawqa al'adzaabi bimaa kaanuu yufsiduuna","translate":{"id":"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.\n","en":"Upon all who were bent on denying the truth and who turned others away from the path of God will We heap suffering upon suffering in return for all the corruption that they wrought:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1989","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1989.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1989.mp3"]}},{"no":89,"arab":"وَيَوْمَ نَبْعَثُ فِي كُلِّ أُمَّةٍ شَهِيدًا عَلَيْهِمْ مِنْ أَنْفُسِهِمْ ۖ وَجِئْنَا بِكَ شَهِيدًا عَلَىٰ هَٰؤُلَاءِ ۚ وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً وَبُشْرَىٰ لِلْمُسْلِمِينَ","latin":"wayawma nab'atsu fii kulli ummatin syahiidan 'alayhim min anfusihim waji/naa bika syahiidan 'alaa haaulaa-i wanazzalnaa 'alayka alkitaaba tibyaanan likulli syay-in wahudan warahmatan wabusyraa lilmuslimiina","translate":{"id":"(Dan ingatlah) akan hari (ketika) Kami bangkitkan pada tiap-tiap umat seorang saksi atas mereka dari mereka sendiri dan Kami datangkan kamu (Muhammad) menjadi saksi atas seluruh umat manusia. Dan Kami turunkan kepadamu Al Kitab (Al Qur'an) untuk menjelaskan segala sesuatu dan petunjuk serta rahmat dan kabar gembira bagi orang-orang yang berserah diri.\n","en":"for one Day We shall raise up within every community a witness against them from among themselves. And thee [too, O Prophet,] have We brought forth to bear witness regarding those [whom thy message may have reached], inasmuch as We have bestowed from on high upon thee, step by step, this divine writ, to make everything clear, and to provide guidance and grace and a glad tiding unto all who have surrendered themselves to God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1990","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1990.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1990.mp3"]}},{"no":90,"arab":"إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ","latin":"inna allaaha ya/muru bial'adli waal-ihsaani wa-iitaa-i dzii alqurbaa wayanhaa 'ani alfahsyaa-i waalmunkari waalbaghyi ya'izhukum la'allakum tadzakkaruuna","translate":{"id":"Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan, memberi kepada kaum kerabat, dan Allah melarang dari perbuatan keji, kemungkaran dan permusuhan. Dia memberi pengajaran kepadamu agar kamu dapat mengambil pelajaran.\n","en":"BEHOLD, God enjoins justice, and the doing of good, and generosity towards [one's] fellow-men; and He forbids all that is shameful and all that runs counter to reason, as well as envy; [and] He exhorts you [repeatedly] so that you might bear [all this] in mind."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1991","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1991.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1991.mp3"]}},{"no":91,"arab":"وَأَوْفُوا بِعَهْدِ اللَّهِ إِذَا عَاهَدْتُمْ وَلَا تَنْقُضُوا الْأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلًا ۚ إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ","latin":"wa-awfuu bi'ahdi allaahi idzaa 'aahadtum walaa tanqudhuu al-aymaana ba'da tawkiidihaa waqad ja'altumu allaaha 'alaykum kafiilan inna allaaha ya'lamu maa taf'aluuna","translate":{"id":"Dan tepatilah perjanjian dengan Allah apabila kamu berjanji dan janganlah kamu membatalkan sumpah-sumpah(mu) itu, sesudah meneguhkannya, sedang kamu telah menjadikan Allah sebagai saksimu (terhadap sumpah-sumpahmu itu). Sesungguhnya Allah mengetahui apa yang kamu perbuat.\n","en":"And be true to your bond with God whenever you bind yourselves by a pledge, and do not break [your] oaths after having [freely] confirmed them and having called upon God to be witness to your good faith: behold, God knows all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1992","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1992.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1992.mp3"]}},{"no":92,"arab":"وَلَا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَهَا مِنْ بَعْدِ قُوَّةٍ أَنْكَاثًا تَتَّخِذُونَ أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ أَنْ تَكُونَ أُمَّةٌ هِيَ أَرْبَىٰ مِنْ أُمَّةٍ ۚ إِنَّمَا يَبْلُوكُمُ اللَّهُ بِهِ ۚ وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيَامَةِ مَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ","latin":"walaa takuunuu kaallatii naqadhat ghazlahaa min ba'di quwwatin ankaatsan tattakhidzuuna aymaanakum dakhalan baynakum an takuuna ummatun hiya arbaa min ummatin innamaa yabluukumu allaahu bihi walayubayyinanna lakum yawma alqiyaamati maa kuntum fiihi takhtalifuuna","translate":{"id":"Dan janganlah kamu seperti seorang perempuan yang menguraikan benangnya yang sudah dipintal dengan kuat, menjadi cerai berai kembali, kamu menjadikan sumpah (perjanjian) mu sebagai alat penipu di antaramu, disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain . Sesungguhnya Allah hanya menguji kamu dengan hal itu. Dan sesungguhnya di hari kiamat akan dijelaskan-Nya kepadamu apa yang dahulu kamu perselisihkan itu.\n","en":"Hence, be not like her who breaks and completely untwists the yarn which she [herself] has spun and made strong-[be not like this by] using your oaths as a means of deceiving one another, simply because some of you may be more powerful than others.\" By all this, God but puts you to a test-and [He does it] so that on Resurrection Day He might make clear unto you all that on which you were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1993","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1993.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1993.mp3"]}},{"no":93,"arab":"وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً وَلَٰكِنْ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَلَتُسْأَلُنَّ عَمَّا كُنْتُمْ تَعْمَلُونَ","latin":"walaw syaa-a allaahu laja'alakum ummatan waahidatan walaakin yudhillu man yasyaau wayahdii man yasyaau walatus-alunna 'ammaa kuntum ta'maluuna","translate":{"id":"Dan kalau Allah menghendaki, niscaya Dia menjadikan kamu satu umat (saja), tetapi Allah menyesatkan siapa yang dikehendaki-Nya dan memberi petunjuk kepada siapa yang dikehendaki-Nya. Dan sesungguhnya kamu akan ditanya tentang apa yang telah kamu kerjakan.\n","en":"For, had God so willed, He could surely have made you all one single community; however, He lets go astray him that wills [to go astray], and guides aright him that wills [to be guided]; and you will surely be called to account for all that you ever did!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1994","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1994.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1994.mp3"]}},{"no":94,"arab":"وَلَا تَتَّخِذُوا أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا السُّوءَ بِمَا صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ ۖ وَلَكُمْ عَذَابٌ عَظِيمٌ","latin":"walaa tattakhidzuu aymaanakum dakhalan baynakum fatazilla qadamun ba'da tsubuutihaa watadzuuquu alssuu-a bimaa shadadtum 'an sabiili allaahi walakum 'adzaabun 'azhiimun","translate":{"id":"Dan janganlah kamu jadikan sumpah-sumpahmu sebagai alat penipu di antaramu, yang menyebabkan tergelincir kaki (mu) sesudah kokoh tegaknya, dan kamu rasakan kemelaratan (di dunia) karena kamu menghalangi (manusia) dari jalan Allah; dan bagimu azab yang besar.\n","en":"And do not use your oaths as a means of deceiving one another-or else [your] foot will slip after having been firm, and then you will have to taste the evil [consequences] of your having turned away from the path of God, with tremendous suffering awaiting you [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1995","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1995.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1995.mp3"]}},{"no":95,"arab":"وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا ۚ إِنَّمَا عِنْدَ اللَّهِ هُوَ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","latin":"walaa tasytaruu bi'ahdi allaahi tsamanan qaliilan innamaa 'inda allaahi huwa khayrun lakum in kuntum ta'lamuuna","translate":{"id":"Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit (murah), sesungguhnya apa yang ada di sisi Allah, itulah yang lebih baik bagimu jika kamu mengetahui.\n","en":"Hence, do not barter away your bond with God for a trifling gain! Verily, that which is with God is by far the best for you, if you but knew it:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1996","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1996.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1996.mp3"]}},{"no":96,"arab":"مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ ۗ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ","latin":"maa 'indakum yanfadu wamaa 'inda allaahi baaqin walanajziyanna alladziina shabaruu ajrahum bi-ahsani maa kaanuu ya'maluuna","translate":{"id":"Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. Dan sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.\n","en":"all that is with you is bound to come to an end, whereas that which is with God is everlasting. And most certainly shall We grant unto those who are patient in adversity their reward in accordance with the best that they ever did."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1997","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1997.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1997.mp3"]}},{"no":97,"arab":"مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ","latin":"man 'amila shaalihan min dzakarin aw untsaa wahuwa mu/minun falanuhyiyannahu hayaatan thayyibatan walanajziyannahum ajrahum bi-ahsani maa kaanuu ya'maluuna","translate":{"id":"Barangsiapa yang mengerjakan amal saleh, baik laki-laki maupun perempuan dalam keadaan beriman, maka sesungguhnya akan Kami berikan kepadanya kehidupan yang baik dan sesungguhnya akan Kami beri balasan kepada mereka dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.\n","en":"As for anyone - be it man or woman - who does righteous deeds, and is a believer withal - him shall We most certainly cause to live a good life. and most certainly shall We grant unto such as these their reward in accordance with the best that they ever did."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1998","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1998.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1998.mp3"]}},{"no":98,"arab":"فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ","latin":"fa-idzaa qara/ta alqur-aana faista'idz biallaahi mina alsysyaythaani alrrajiimi","translate":{"id":"Apabila kamu membaca Al Qur'an hendaklah kamu meminta perlindungan kepada Allah dari syaitan yang terkutuk.\n","en":"NOW whenever thou happen to read this Qur'an, seek refuge with God from Satan, the accursed."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1999","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1999.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1999.mp3"]}},{"no":99,"arab":"إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","latin":"innahu laysa lahu sulthaanun 'alaa alladziina aamanuu wa'alaa rabbihim yatawakkaluuna","translate":{"id":"Sesungguhnya syaitan itu tidak ada kekuasaannya atas orang-orang yang beriman dan bertawakkal kepada Tuhannya.\n","en":"Behold, he has no power over those who have attained to faith and in their Sustainer place their tray trust:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2000","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2000.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2000.mp3"]}},{"no":100,"arab":"إِنَّمَا سُلْطَانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُمْ بِهِ مُشْرِكُونَ","latin":"innamaa sulthaanuhu 'alaa alladziina yatawallawnahu waalladziina hum bihi musyrikuuna","translate":{"id":"Sesungguhnya kekuasaannya (syaitan) hanyalah atas orang-orang yang mengambilnya jadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.\n","en":"he has power only over those who are willing to follow him, and who [thus] ascribe to him a share in God's divinity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2001","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2001.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2001.mp3"]}},{"no":101,"arab":"وَإِذَا بَدَّلْنَا آيَةً مَكَانَ آيَةٍ ۙ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ قَالُوا إِنَّمَا أَنْتَ مُفْتَرٍ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","latin":"wa-idzaa baddalnaa aayatan makaana aayatin waallaahu a'lamu bimaa yunazzilu qaaluu innamaa anta muftarin bal aktsaruhum laa ya'lamuuna","translate":{"id":"Dan apabila Kami letakkan suatu ayat di tempat ayat yang lain sebagai penggantinya padahal Allah lebih mengetahui apa yang diturunkan-Nya, mereka berkata: \"Sesungguhnya kamu adalah orang yang mengada-adakan saja\". Bahkan kebanyakan mereka tiada mengetahui.\n","en":"And now that We replace one message by another -since God is fully aware of what He bestows from on high, step by step - they [who deny the truth] are wont to say, \"Thou but inventest it!\" Nay, but most of them do not understand it!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2002","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2002.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2002.mp3"]}},{"no":102,"arab":"قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ مِنْ رَبِّكَ بِالْحَقِّ لِيُثَبِّتَ الَّذِينَ آمَنُوا وَهُدًى وَبُشْرَىٰ لِلْمُسْلِمِينَ","latin":"qul nazzalahu ruuhu alqudusi min rabbika bialhaqqi liyutsabbita alladziina aamanuu wahudan wabusyraa lilmuslimiina","translate":{"id":"Katakanlah: \"Ruhul Qudus (Jibril) menurunkan Al Qur'an itu dari Tuhanmu dengan benar, untuk meneguhkan (hati) orang-orang yang telah beriman, dan menjadi petunjuk serta kabar gembira bagi orang-orang yang berserah diri (kepada Allah)\".\n","en":"Say: \"Holy inspiration has brought it down from thy Sustainer by stages, setting forth the truth, so that it might give firmness unto those who have attained to faith, and provide guidance and a glad tiding unto all who have surrendered themselves to God.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2003","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2003.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2003.mp3"]}},{"no":103,"arab":"وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُ بَشَرٌ ۗ لِسَانُ الَّذِي يُلْحِدُونَ إِلَيْهِ أَعْجَمِيٌّ وَهَٰذَا لِسَانٌ عَرَبِيٌّ مُبِينٌ","latin":"walaqad na'lamu annahum yaquuluuna innamaa yu'allimuhu basyarun lisaanu alladzii yulhiduuna ilayhi a'jamiyyun wahaadzaa lisaanun 'arabiyyun mubiinun","translate":{"id":"Dan sesungguhnya Kami mengetahui bahwa mereka berkata: \"Sesungguhnya Al Qur'an itu diajarkan oleh seorang manusia kepadanya (Muhammad)\". Padahal bahasa orang yang mereka tuduhkan (bahwa) Muhammad belajar kepadanya bahasa 'Ajam , sedang Al Qur'an adalah dalam bahasa Arab yang terang.\n","en":"And, indeed, full well do We know that they say, \"It is but a human being that imparts [all] this to him! -[notwithstanding that] the tongue of him to whom they so maliciously point is wholly outlandish, whereas this is Arabic speech, clear [in itself] and clearly showing the truth [of its source]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2004","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2004.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2004.mp3"]}},{"no":104,"arab":"إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِآيَاتِ اللَّهِ لَا يَهْدِيهِمُ اللَّهُ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"inna alladziina laa yu/minuuna bi-aayaati allaahi laa yahdiihimu allaahu walahum 'adzaabun aliimun","translate":{"id":"Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah (Al Qur'an), Allah tidak akan memberi petunjuk kepada mereka dan bagi mereka azab yang pedih.\n","en":"Verily, as for those who will not believe in God's messages, God does not guide them aright; and grievous suffering will be their lot [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2005","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2005.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2005.mp3"]}},{"no":105,"arab":"إِنَّمَا يَفْتَرِي الْكَذِبَ الَّذِينَ لَا يُؤْمِنُونَ بِآيَاتِ اللَّهِ ۖ وَأُولَٰئِكَ هُمُ الْكَاذِبُونَ","latin":"innamaa yaftarii alkadziba alladziina laa yu/minuuna bi-aayaati allaahi waulaa-ika humu alkaadzibuuna","translate":{"id":"Sesungguhnya yang mengada-adakan kebohongan, hanyalah orang-orang yang tidak beriman kepada ayat-ayat Allah, dan mereka itulah orang-orang pendusta.\n","en":"It is but they who will not believe in God's messages that invent this falsehood; and it is they, they who are lying!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2006","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2006.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2006.mp3"]}},{"no":106,"arab":"مَنْ كَفَرَ بِاللَّهِ مِنْ بَعْدِ إِيمَانِهِ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالْإِيمَانِ وَلَٰكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِنَ اللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ","latin":"man kafara biallaahi min ba'di iimaanihi illaa man ukriha waqalbuhu muthma-innun bial-iimaani walaakin man syaraha bialkufri shadran fa'alayhim ghadhabun mina allaahi walahum 'adzaabun 'azhiimun","translate":{"id":"Barangsiapa yang kafir kepada Allah sesudah dia beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa kafir padahal hatinya tetap tenang dalam beriman (dia tidak berdosa), akan tetapi orang yang melapangkan dadanya untuk kekafiran, maka kemurkaan Allah menimpanya dan baginya azab yang besar.\n","en":"As for anyone who denies God after having once attained to faith-and this, to be sure, does not apply to one who does it under duress, the while his heart remains true to his faith, but [only, to] him who willingly opens up his heart to a denial of the truth-: upon all such [falls] God's condemnation, and tremendous suffering awaits them:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2007","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2007.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2007.mp3"]}},{"no":107,"arab":"ذَٰلِكَ بِأَنَّهُمُ اسْتَحَبُّوا الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَأَنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ","latin":"dzaalika bi-annahumu istahabbuu alhayaata alddunyaa 'alaa al-aakhirati wa-anna allaaha laa yahdii alqawma alkaafiriina","translate":{"id":"Yang demikian itu disebabkan karena sesungguhnya mereka mencintai kehidupan di dunia lebih dari akhirat, dan bahwasanya Allah tiada memberi petunjuk kepada kaum yang kafir.\n","en":"all this, because they hold this world's life in greater esteem than the life to come, and because God does not bestow His guidance upon people who deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2008","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2008.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2008.mp3"]}},{"no":108,"arab":"أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَسَمْعِهِمْ وَأَبْصَارِهِمْ ۖ وَأُولَٰئِكَ هُمُ الْغَافِلُونَ","latin":"ulaa-ika alladziina thaba'a allaahu 'alaa quluubihim wasam'ihim wa-abshaarihim waulaa-ika humu alghaafiluuna","translate":{"id":"Mereka itulah orang-orang yang hati, pendengaran dan penglihatannya telah dikunci mati oleh Allah, dan mereka itulah orang-orang yang lalai.\n","en":"They whose hearts and whose hearing and whose sight God has sealed -it is they, they who are heedless!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2009","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2009.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2009.mp3"]}},{"no":109,"arab":"لَا جَرَمَ أَنَّهُمْ فِي الْآخِرَةِ هُمُ الْخَاسِرُونَ","latin":"laa jarama annahum fii al-aakhirati humu alkhaasiruuna","translate":{"id":"Pastilah bahwa mereka di akhirat nanti adalah orang-orang yang merugi.\n","en":"Truly it is they, they who in the life to come shall be the losers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2010","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2010.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2010.mp3"]}},{"no":110,"arab":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُوا مِنْ بَعْدِ مَا فُتِنُوا ثُمَّ جَاهَدُوا وَصَبَرُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ","latin":"tsumma inna rabbaka lilladziina haajaruu min ba'di maa futinuu tsumma jaahaduu washabaruu inna rabbaka min ba'dihaa laghafuurun rahiimun","translate":{"id":"Dan sesungguhnya Tuhanmu (pelindung) bagi orang-orang yang berhijrah sesudah menderita cobaan, kemudian mereka berjihad dan sabar; sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang.\n","en":"And yet, behold, thy Sustainer [grants His forgiveness] unto those who forsake the domain of evil after having succumbed to its temptation, and who thenceforth strive hard [in God's cause] and are patient in adversity: behold, after such [repentance] thy Sustainer is indeed much-forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2011","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2011.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2011.mp3"]}},{"no":111,"arab":"يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُمْ لَا يُظْلَمُونَ","latin":"yawma ta/tii kullu nafsin tujaadilu 'an nafsihaa watuwaffaa kullu nafsin maa 'amilat wahum laa yuzhlamuuna","translate":{"id":"(Ingatlah) suatu hari (ketika) tiap-tiap diri datang untuk membela dirinya sendiri dan bagi tiap-tiap diri disempurnakan (balasan) apa yang telah dikerjakannya, sedangkan mereka tidak dianiaya (dirugikan).\n","en":"[Be conscious, then, of] the Day when every human being shall come to plead for himself [alone], and every human being shall be repaid in full for whatever he has done, and none shall be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2012","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2012.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2012.mp3"]}},{"no":112,"arab":"وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ","latin":"wadharaba allaahu matsalan qaryatan kaanat aaminatan muthma-innatan ya/tiihaa rizquhaa raghadan min kulli makaanin fakafarat bi-an'umi allaahi fa-adzaaqahaa allaahu libaasa aljuu'i waalkhawfi bimaa kaanuu yashna'uuna","translate":{"id":"Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezkinya datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari ni'mat-ni'mat Allah; karena itu Allah merasakan kepada mereka pakaian kelaparan dan ketakutan, disebabkan apa yang selalu mereka perbuat.\n","en":"AND GOD propounds [to you] a parable: [Imagine] a town which was [once] secure and at ease, with its sustenance coming to it abundantly from all quarters, and which thereupon blasphemously refused to show gratitude for God's blessings: and therefore God caused it to taste the all-embracing misery of hunger and fear in result of all [the evil] that its people had so persistently wrought."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2013","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2013.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2013.mp3"]}},{"no":113,"arab":"وَلَقَدْ جَاءَهُمْ رَسُولٌ مِنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ الْعَذَابُ وَهُمْ ظَالِمُونَ","latin":"walaqad jaa-ahum rasuulun minhum fakadzdzabuuhu fa-akhadzahumu al'adzaabu wahum zhaalimuuna","translate":{"id":"Dan sesungguhnya telah datang kepada mereka seorang rasul dari mereka sendiri, tetapi mereka mendustakannya; karena itu mereka dimusnahkan azab dan mereka adalah orang-orang yang zalim.\n","en":"And indeed, there had come unto them an apostle from among themselves -but they gave him the lie; and therefore suffering overwhelmed them while they were thus doing wrong [to themselves]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2014","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2014.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2014.mp3"]}},{"no":114,"arab":"فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا وَاشْكُرُوا نِعْمَتَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ","latin":"fakuluu mimmaa razaqakumu allaahu halaalan thayyiban wausykuruu ni'mata allaahi in kuntum iyyaahu ta'buduuna","translate":{"id":"Maka makanlah yang halal lagi baik dari rezki yang telah diberikan Allah kepadamu; dan syukurilah ni'mat Allah, jika kamu hanya kepada-Nya saja menyembah.\n","en":"AND SO, partake of all the lawful, good things which God has provided for you as sustenance, and render thanks unto God for His blessings, if it is [truly] Him that you worship."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2015","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2015.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2015.mp3"]}},{"no":115,"arab":"إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ ۖ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"innamaa harrama 'alaykumu almaytata waalddama walahma alkhinziiri wamaa uhilla lighayri allaahi bihi famani idthurra ghayra baaghin walaa 'aadin fa-inna allaaha ghafuurun rahiimun","translate":{"id":"Sesungguhnya Allah hanya mengharamkan atasmu (memakan) bangkai, darah, daging babi dan apa yang disembelih dengan menyebut nama selain Allah; tetapi barangsiapa yang terpaksa memakannya dengan tidak menganiaya dan tidak pula melampaui batas, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"He has forbidden to you only carrion, and blood, and the flesh of swine, and that over which any name other than God's has been invoked; but if one is driven [to it] by necessity - neither coveting it nor exceeding his immediate need -verily, God is much forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2016","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2016.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2016.mp3"]}},{"no":116,"arab":"وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَٰذَا حَلَالٌ وَهَٰذَا حَرَامٌ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ ۚ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ","latin":"walaa taquuluu limaa tashifu alsinatukumu alkadziba haadzaa halaalun wahaadzaa haraamun litaftaruu 'alaa allaahi alkadziba inna alladziina yaftaruuna 'alaa allaahi alkadziba laa yuflihuuna","translate":{"id":"Dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lidahmu secara dusta \"ini halal dan ini haram\", untuk mengada-adakan kebohongan terhadap Allah. Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tiadalah beruntung.\n","en":"Hence, do not utter falsehoods by letting your tongues determine [at your own discretion], \"This is lawful and that is forbidden\", thus attributing your own lying inventions to God: for, behold, they who attribute their own lying inventions to God will never attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2017","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2017.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2017.mp3"]}},{"no":117,"arab":"مَتَاعٌ قَلِيلٌ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"mataa'un qaliilun walahum 'adzaabun aliimun","translate":{"id":"(Itu adalah) kesenangan yang sedikit, dan bagi mereka azab yang pedih.\n","en":"A brief enjoyment [may be theirs in this world] -but grievous suffering awaits them [in the life to come]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2018","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2018.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2018.mp3"]}},{"no":118,"arab":"وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِنْ قَبْلُ ۖ وَمَا ظَلَمْنَاهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ","latin":"wa'alaa alladziina haaduu harramnaa maa qashashnaa 'alayka min qablu wamaa zhalamnaahum walaakin kaanuu anfusahum yazhlimuuna","translate":{"id":"Dan terhadap orang-orang Yahudi, Kami haramkan apa yang telah Kami ceritakan dahulu kepadamu ; dan Kami tiada menganiaya mereka, akan tetapi merekalah yang menganiaya diri mereka sendiri.\n","en":"And [only] unto those who followed the Jewish faith did We forbid all that We have mentioned to thee ere this; and no wrong did We do to them, but it was they who persistently wronged themselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2019","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2019.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2019.mp3"]}},{"no":119,"arab":"ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُوا السُّوءَ بِجَهَالَةٍ ثُمَّ تَابُوا مِنْ بَعْدِ ذَٰلِكَ وَأَصْلَحُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ","latin":"tsumma inna rabbaka lilladziina 'amiluu alssuu-a bijahaalatin tsumma taabuu min ba'di dzaalika wa-ashlahuu inna rabbaka min ba'dihaa laghafuurun rahiimun","translate":{"id":"Kemudian, sesungguhnya Tuhanmu (mengampuni) bagi orang-orang yang mengerjakan kesalahan karena kebodohannya, kemudian mereka bertaubat sesudah itu dan memperbaiki (dirinya), sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang.\n","en":"And once again: Behold, thy Sustainer [shows mercy] to those who do evil out of ignorance and afterwards repent and live righteously: behold, after such [repentance] thy Sustainer is indeed much forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2020","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2020.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2020.mp3"]}},{"no":120,"arab":"إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِلَّهِ حَنِيفًا وَلَمْ يَكُ مِنَ الْمُشْرِكِينَ","latin":"inna ibraahiima kaana ummatan qaanitan lillaahi haniifan walam yaku mina almusyrikiina","translate":{"id":"Sesungguhnya Ibrahim adalah seorang imam yang dapat dijadikan teladan lagi patuh kepada Allah dan hanif . Dan sekali-kali bukanlah dia termasuk orang-orang yang mempersekutukan (Tuhan),\n","en":"VERILY, Abraham was a man who combined within himself all virtues, devoutly obeying God's will, turning away from all that is false, and not being of those who ascribe divinity to aught beside God:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2021","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2021.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2021.mp3"]}},{"no":121,"arab":"شَاكِرًا لِأَنْعُمِهِ ۚ اجْتَبَاهُ وَهَدَاهُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"syaakiran li-an'umihi ijtabaahu wahadaahu ilaa shiraathin mustaqiimin","translate":{"id":"(lagi) yang mensyukuri ni'mat-ni'mat Allah. Allah telah memilihnya dan menunjukinya kepada jalan yang lurus.\n","en":"[for he was always] grateful for the blessings granted by Him who had elected him and guided him onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2022","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2022.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2022.mp3"]}},{"no":122,"arab":"وَآتَيْنَاهُ فِي الدُّنْيَا حَسَنَةً ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ","latin":"waaataynaahu fii alddunyaa hasanatan wa-innahu fii al-aakhirati lamina alshshaalihiina","translate":{"id":"Dan Kami berikan kepadanya kebaikan di dunia. Dan sesungguhnya dia di akhirat benar-benar termasuk orang-orang yang saleh.\n","en":"And so We vouchsafed him good in this world; and, verily, in the life to come [too] he shall find himself among the righteous."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2023","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2023.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2023.mp3"]}},{"no":123,"arab":"ثُمَّ أَوْحَيْنَا إِلَيْكَ أَنِ اتَّبِعْ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ","latin":"tsumma awhaynaa ilayka ani ittabi' millata ibraahiima haniifan wamaa kaana mina almusyrikiina","translate":{"id":"Kemudian Kami wahyukan kepadamu (Muhammad): \"Ikutilah agama Ibrahim seorang yang hanif\" dan bukanlah dia termasuk orang-orang yang mempersekutukan Tuhan.\n","en":"And lastly, We have inspired thee, [O Muhammad, with this message:] \"Follow the creed of Abraham, who turned away from all that is false, and was not of those who ascribe divinity to aught beside God;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2024","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2024.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2024.mp3"]}},{"no":124,"arab":"إِنَّمَا جُعِلَ السَّبْتُ عَلَى الَّذِينَ اخْتَلَفُوا فِيهِ ۚ وَإِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ","latin":"innamaa ju'ila alssabtu 'alaa alladziina ikhtalafuu fiihi wa-inna rabbaka layahkumu baynahum yawma alqiyaamati fiimaa kaanuu fiihi yakhtalifuuna","translate":{"id":"Sesungguhnya diwajibkan (menghormati) hari Sabtu atas orang-orang (Yahudi) yang berselisih padanya. Dan sesungguhnya Tuhanmu benar-benar akan memberi putusan di antara mereka di hari kiamat terhadap apa yang telah mereka perselisihkan itu.\n","en":"[and know that the observance of] the Sabbath was ordained only for those who came to hold divergent views about him; but, verily, God will judge between them on Resurrection Day with regard to all on which they were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2025","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2025.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2025.mp3"]}},{"no":125,"arab":"ادْعُ إِلَىٰ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ ۖ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ ۚ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ ۖ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ","latin":"ud'u ilaa sabiili rabbika bialhikmati waalmaw'izhati alhasanati wajaadilhum biallatii hiya ahsanu inna rabbaka huwa a'lamu biman dhalla 'an sabiilihi wahuwa a'lamu bialmuhtadiina","translate":{"id":"Serulah (manusia) kepada jalan Tuhan-mu dengan hikmah dan pelajaran yang baik dan bantahlah mereka dengan cara yang baik. Sesungguhnya Tuhanmu Dialah yang lebih mengetahui tentang siapa yang tersesat dari jalan-Nya dan Dialah yang lebih mengetahui orang-orang yang mendapat petunjuk.\n","en":"CALL THOU (all mankind] unto thy Sustainer's path with wisdom and goodly exhortation, and argue with them in the most kindly manner- for, behold, thy Sustainer knows best as to who strays from His path, and best knows He as to who are the right-guided."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2026","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2026.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2026.mp3"]}},{"no":126,"arab":"وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ ۖ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ","latin":"wa-in 'aaqabtum fa'aaqibuu bimitsli maa 'uuqibtum bihi wala-in shabartum lahuwa khayrun lilshshaabiriina","translate":{"id":"Dan jika kamu memberikan balasan, maka balaslah dengan balasan yang sama dengan siksaan yang ditimpakan kepadamu . Akan tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang-orang yang sabar.\n","en":"Hence, if you have to respond to an attack (in argument], respond only to the extent of the attack levelled against you; but to bear yourselves with patience is indeed far better for (you, since God is with] those who are patient in adversity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2027","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2027.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2027.mp3"]}},{"no":127,"arab":"وَاصْبِرْ وَمَا صَبْرُكَ إِلَّا بِاللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ","latin":"waishbir wamaa shabruka illaa biallaahi walaa tahzan 'alayhim walaa taku fii dhayqin mimmaa yamkuruuna","translate":{"id":"Bersabarlah (hai Muhammad) dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah dan janganlah kamu bersedih hati terhadap (kekafiran) mereka dan janganlah kamu bersempit dada terhadap apa yang mereka tipu dayakan.\n","en":"Endure, then, with patience (all that they who deny the truth may say] -always remembering that it is none but God who gives thee the strength to endure adversity -and do not grieve over them, and neither be distressed by the false arguments which they devise:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2028","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2028.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2028.mp3"]}},{"no":128,"arab":"إِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوْا وَالَّذِينَ هُمْ مُحْسِنُونَ","latin":"inna allaaha ma'a alladziina ittaqaw waalladziina hum muhsinuuna","translate":{"id":"Sesungguhnya Allah beserta orang-orang yang bertakwa dan orang-orang yang berbuat kebaikan.\n","en":"for, verily, God is with those who are conscious of Him and are doers of good withal!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2029","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2029.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2029.mp3"]}}]}