{"alquran":{"no":17,"name":"Al-Israa","arab":"الإسراء","start":2029,"count":111,"rukku":12,"type":"mecca","description":"Surat ini terdiri atas 111 ayat, termasuk golongan surat-surat Makkiyyah. Dinamakan dengan <i>Al Israa'</i> yang berarti <i>memperjalankan di malam hari</i>, berhubung peristiwa Israa' Nabi Muhammad s.a.w. di Masjidil Haram di Mekah ke Masjidil Aqsha di Baitul Maqdis dicantumkan pada ayat pertama dalam surat ini. Penuturan cerita Israa' pada permulaan surat ini, mengandung isyarat bahwa Nabi Muhammad s.a.w. beserta umatnya kemudian hari akan mencapai martabat yang tinggi dan akan menjadi umat yang besar.<br> Surat ini dinamakan pula dengan <i>Bani Israil</i> artinya <i>keturunan Israil</i> berhubung dengan permulaan surat ini, yakni pada ayat kedua sampai dengan ayat kedelapan dan kemudian dekat akhir surat yakni pada ayat 101 sampai dengan ayat 104, Allah menyebutkan tentang Bani Israil yang setelah menjadi bangsa yang kuat lagi besar lalu menjadi bangsa yang terhina karena menyimpang dari ajaran Allah s.w.t. Dihubungkannya kisah Israa' dengan riwayat <i>Bani Israil</i> pada surat ini, memberikan peringatan bahwa umat Islam akan mengalami keruntuhan, sebagaimana halnya Bani Israil, apabila mereka juga meninggalkan ajaran-ajaran agamanya."},"surah":[{"no":1,"arab":" سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا ۚ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ","latin":"subhaana alladzii asraa bi'abdihi laylan mina almasjidi alharaami ilaa almasjidi al-aqshaa alladzii baaraknaa hawlahu linuriyahu min aayaatinaa innahu huwa alssamii'u albashiiru","translate":{"id":"Maha Suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam dari Al Masjidil Haram ke Al Masjidil Aqsha yang telah Kami berkahi sekelilingnya agar Kami perlihatkan kepadanya sebagian dari tanda-tanda (kebesaran) Kami. Sesungguhnya Dia adalah Maha Mendengar lagi Maha Mengetahui.\n","en":"LIMITLESS in His glory is He who transported His servant by night from the Inviolable House of Worship [at Mecca] to the Remote House of Worship [, at Jerusalem] - the environs of which We had blessed -so that We might show him some of Our symbols: for, verily, He alone is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2030","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2030.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2030.mp3"]}},{"no":2,"arab":"وَآتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَاهُ هُدًى لِبَنِي إِسْرَائِيلَ أَلَّا تَتَّخِذُوا مِنْ دُونِي وَكِيلًا","latin":"waaataynaa muusaa alkitaaba waja'alnaahu hudan libanii israa-iila allaa tattakhidzuu min duunii wakiilaan","translate":{"id":"Dan Kami berikan kepada Musa kitab (Taurat) dan Kami jadikan kitab Taurat itu petunjuk bagi Bani Israil (dengan firman): \"Janganlah kamu mengambil penolong selain Aku,\n","en":"And [thus, too,] We vouchsafed revelation unto Moses, and made it a [source of] guidance for the children of Israel, [commanding them:] \"Do not ascribe to any but Me the power to determine your fate,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2031","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2031.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2031.mp3"]}},{"no":3,"arab":"ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ ۚ إِنَّهُ كَانَ عَبْدًا شَكُورًا","latin":"dzurriyyata man hamalnaa ma'a nuuhin innahu kaana 'abdan syakuuraan","translate":{"id":"(yaitu) anak cucu dari orang-orang yang Kami bawa bersama-sama Nuh. Sesungguhnya dia adalah hamba (Allah) yang banyak bersyukur.\n","en":"O you descendants of those whom We caused to be borne (in the ark] with Noah! Behold, he was a most grateful servant (of Ours]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2032","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2032.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2032.mp3"]}},{"no":4,"arab":"وَقَضَيْنَا إِلَىٰ بَنِي إِسْرَائِيلَ فِي الْكِتَابِ لَتُفْسِدُنَّ فِي الْأَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا","latin":"waqadhaynaa ilaa banii israa-iila fii alkitaabi latufsidunna fii al-ardhi marratayni walata'lunna 'uluwwan kabiiraan","translate":{"id":"Dan telah Kami tetapkan terhadap Bani Israil dalam Kitab itu: \"Sesungguhnya kamu akan membuat kerusakan di muka bumi ini dua kali dan pasti kamu akan menyombongkan diri dengan kesombongan yang besar\".\n","en":"And we made [this] known to the children of Israel through revelation: Twice, indeed, will you spread corruption on earth and will indeed become grossly overbearing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2033","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2033.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2033.mp3"]}},{"no":5,"arab":"فَإِذَا جَاءَ وَعْدُ أُولَاهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَنَا أُولِي بَأْسٍ شَدِيدٍ فَجَاسُوا خِلَالَ الدِّيَارِ ۚ وَكَانَ وَعْدًا مَفْعُولًا","latin":"fa-idzaa jaa-a wa'du uulaahumaa ba'atsnaa 'alaykum 'ibaadan lanaa ulii ba/sin syadiidin fajaasuu khilaala alddiyaari wakaana wa'dan maf'uulaan","translate":{"id":"Maka apabila datang saat hukuman bagi (kejahatan) pertama dari kedua (kejahatan) itu, Kami datangkan kepadamu hamba-hamba Kami yang mempunyai kekuatan yang besar, lalu mereka merajalela di kampung-kampung, dan itulah ketetapan yang pasti terlaksana.\n","en":"Hence, when the prediction of the first of those two [periods of iniquity] came true, We sent against you some of Our bondmen of terrible prowess in war, and they wrought havoc throughout the land: and so the prediction was fulfilled."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2034","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2034.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2034.mp3"]}},{"no":6,"arab":"ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ وَأَمْدَدْنَاكُمْ بِأَمْوَالٍ وَبَنِينَ وَجَعَلْنَاكُمْ أَكْثَرَ نَفِيرًا","latin":"tsumma radadnaa lakumu alkarrata 'alayhim wa-amdadnaakum bi-amwaalin wabaniina waja'alnaakum aktsara nafiiraan","translate":{"id":"Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka kembali dan Kami membantumu dengan harta kekayaan dan anak-anak dan Kami jadikan kamu kelompok yang lebih besar.\n","en":"And after a time We allowed you to prevail against them once again, and aided you with wealth and offspring, and made you more numerous [than ever]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2035","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2035.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2035.mp3"]}},{"no":7,"arab":"إِنْ أَحْسَنْتُمْ أَحْسَنْتُمْ لِأَنْفُسِكُمْ ۖ وَإِنْ أَسَأْتُمْ فَلَهَا ۚ فَإِذَا جَاءَ وَعْدُ الْآخِرَةِ لِيَسُوءُوا وُجُوهَكُمْ وَلِيَدْخُلُوا الْمَسْجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّرُوا مَا عَلَوْا تَتْبِيرًا","latin":"in ahsantum ahsantum li-anfusikum wa-in asa/tum falahaa fa-idzaa jaa-a wa'du al-aakhirati liyasuu-uu wujuuhakum waliyadkhuluu almasjida kamaa dakhaluuhu awwala marratin waliyutabbiruu maa 'alaw tatbiiraan","translate":{"id":"Jika kamu berbuat baik (berarti) kamu berbuat baik bagi dirimu sendiri dan jika kamu berbuat jahat, maka (kejahatan) itu bagi dirimu sendiri, dan apabila datang saat hukuman bagi (kejahatan) yang kedua, (Kami datangkan orang-orang lain) untuk menyuramkan muka-muka kamu dan mereka masuk ke dalam mesjid, sebagaimana musuh-musuhmu memasukinya pada kali pertama dan untuk membinasakan sehabis-habisnya apa saja yang mereka kuasai.\n","en":"[And We said:] \"If you persevere in doing good, you will but be doing good to yourselves; and if you do evil, it will be [done] to yourselves.\" And so, when the prediction of the second [period of your iniquity] came true, [We raised new enemies against you, and allowed them] to disgrace you utterly, and to enter the Temple as [their forerunners] had entered it once before, and to destroy with utter destruction all that they had conquered."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2036","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2036.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2036.mp3"]}},{"no":8,"arab":"عَسَىٰ رَبُّكُمْ أَنْ يَرْحَمَكُمْ ۚ وَإِنْ عُدْتُمْ عُدْنَا ۘ وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيرًا","latin":"'asaa rabbukum an yarhamakum wa-in 'udtum 'udnaa waja'alnaa jahannama lilkaafiriina hashiiraan","translate":{"id":"Mudah-mudahan Tuhanmu akan melimpahkan rahmat(Nya) kepadamu; dan sekiranya kamu kembali kepada (kedurhakaan) niscaya Kami kembali (mengazabmu) dan Kami jadikan neraka Jahannam penjara bagi orang-orang yang tidak beriman.\n","en":"Your Sustainer may well show mercy unto you; but if you revert [to sinning], We shall revert [to chastising you]. And [remember this:] We have ordained that [in the hereafter] hell shall close upon all who deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2037","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2037.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2037.mp3"]}},{"no":9,"arab":"إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا","latin":"inna haadzaa alqur-aana yahdii lillatii hiya aqwamu wayubasysyiru almu/miniina alladziina ya'maluuna alshshaalihaati anna lahum ajran kabiiraan","translate":{"id":"Sesungguhnya Al Qur'an ini memberikan petunjuk kepada (jalan) yang lebih lurus dan memberi khabar gembira kepada orang-orang Mu'min yang mengerjakan amal saleh bahwa bagi mereka ada pahala yang besar,\n","en":"VERILY, this Qur'an shows the way to all that is most upright, and gives the believers who do good deeds the glad tiding that theirs will be a great reward;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2038","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2038.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2038.mp3"]}},{"no":10,"arab":"وَأَنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا","latin":"wa-anna alladziina laa yu/minuuna bial-aakhirati a'tadnaa lahum 'adzaaban aliimaan","translate":{"id":"dan sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat, Kami sediakan bagi mereka azab yang pedih.\n","en":"and [it announces, too,] that We have readied grievous suffering for those who will not believe in the life to come."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2039","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2039.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2039.mp3"]}},{"no":11,"arab":"وَيَدْعُ الْإِنْسَانُ بِالشَّرِّ دُعَاءَهُ بِالْخَيْرِ ۖ وَكَانَ الْإِنْسَانُ عَجُولًا","latin":"wayad'u al-insaanu bialsysyarri du'aa-ahu bialkhayri wakaana al-insaanu 'ajuulaan","translate":{"id":"Dan manusia mendo'a untuk kejahatan sebagaimana ia mendo'a untuk kebaikan. Dan adalah manusia bersifat tergesa-gesa.\n","en":"As it is, man [often] prays for things that are bad as if he were praying for something that is good: for man is prone to be hasty [in his judgments]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2040","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2040.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2040.mp3"]}},{"no":12,"arab":"وَجَعَلْنَا اللَّيْلَ وَالنَّهَارَ آيَتَيْنِ ۖ فَمَحَوْنَا آيَةَ اللَّيْلِ وَجَعَلْنَا آيَةَ النَّهَارِ مُبْصِرَةً لِتَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ وَلِتَعْلَمُوا عَدَدَ السِّنِينَ وَالْحِسَابَ ۚ وَكُلَّ شَيْءٍ فَصَّلْنَاهُ تَفْصِيلًا","latin":"waja'alnaa allayla waalnnahaara aayatayni famahawnaa aayata allayli waja'alnaa aayata alnnahaari mubshiratan litabtaghuu fadhlan min rabbikum walita'lamuu 'adada alssiniina waalhisaaba wakulla syay-in fashshalnaahu tafshiilaan","translate":{"id":"Dan Kami jadikan malam dan siang sebagai dua tanda, lalu Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang, agar kamu mencari kurnia dari Tuhanmu, dan supaya kamu mengetahui bilangan tahun-tahun dan perhitungan. Dan segala sesuatu telah Kami terangkan dengan jelas.\n","en":"And We have established the night and the day as two symbols; and thereupon We have effaced the symbol of night and set up [in its place] the light giving symbol of day, so that you might seek to obtain your Sustainer's bounty and be aware of the passing years and of the reckoning [that is bound to come]. For clearly, most clearly, have We spelt out everything!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2041","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2041.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2041.mp3"]}},{"no":13,"arab":"وَكُلَّ إِنْسَانٍ أَلْزَمْنَاهُ طَائِرَهُ فِي عُنُقِهِ ۖ وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنْشُورًا","latin":"wakulla insaanin alzamnaahu thaa-irahu fii 'unuqihi wanukhriju lahu yawma alqiyaamati kitaaban yalqaahu mansyuuraan","translate":{"id":"Dan tiap-tiap manusia itu telah Kami tetapkan amal perbuatannya (sebagaimana tetapnya kalung) pada lehernya. Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka.\n","en":"And every human being's destiny have We tied to his neck; and on the Day of Resurrection We shall bring forth for him a record which he will find wide open;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2042","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2042.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2042.mp3"]}},{"no":14,"arab":"اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا","latin":"iqra/ kitaabaka kafaa binafsika alyawma 'alayka hasiibaan","translate":{"id":"\"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu\".\n","en":"[and he will be told:] \"Read this thy record,! Sufficient is thine own self today to make out thine account!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2043","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2043.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2043.mp3"]}},{"no":15,"arab":"مَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۚ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا","latin":"mani ihtadaa fa-innamaa yahtadii linafsihi waman dhalla fa-innamaa yadhillu 'alayhaa walaa taziru waaziratun wizra ukhraa wamaa kunnaa mu'adzdzibiina hattaa nab'atsa rasuulaan","translate":{"id":"Barangsiapa yang berbuat sesuai dengan hidayah (Allah), maka sesungguhnya dia berbuat itu untuk (keselamatan) dirinya sendiri; dan barangsiapa yang sesat maka sesungguhnya dia tersesat bagi (kerugian) dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, dan Kami tidak akan meng'azab sebelum Kami mengutus seorang rasul.\n","en":"Whoever chooses to follow the right path, follows it but for his own good; and whoever goes astray, goes but astray to his own hurt; and no bearer of burdens shall be made to bear another\" burden. Moreover. We would never chastise [any community for the wrong they may do] ere We have sent an apostle [to them]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2044","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2044.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2044.mp3"]}},{"no":16,"arab":"وَإِذَا أَرَدْنَا أَنْ نُهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُوا فِيهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنَاهَا تَدْمِيرًا","latin":"wa-idzaa aradnaa an nuhlika qaryatan amarnaa mutrafiihaa fafasaquu fiihaa fahaqqa 'alayhaa alqawlu fadammarnaahaa tadmiiraan","translate":{"id":"Dan jika Kami hendak membinasakan suatu negeri, maka Kami perintahkan kepada orang-orang yang hidup mewah di negeri itu (supaya menta'ati Allah) tetapi mereka melakukan kedurhakaan dalam negeri itu, maka sudah sepantasnya berlaku terhadapnya perkataan (ketentuan Kami), kemudian Kami hancurkan negeri itu sehancur-hancurnya.\n","en":"But when [this has been done, and] it is Our will to destroy a community, We convey Our last warning to those of its people who have lost themselves entirely in the pursuit of pleasures; and [if] they [continue to] act sinfully, the sentence [of doom] passed on the community takes effect, and We break it to smithereens."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2045","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2045.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2045.mp3"]}},{"no":17,"arab":"وَكَمْ أَهْلَكْنَا مِنَ الْقُرُونِ مِنْ بَعْدِ نُوحٍ ۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِ خَبِيرًا بَصِيرًا","latin":"wakam ahlaknaa mina alquruuni min ba'di nuuhin wakafaa birabbika bidzunuubi 'ibaadihi khabiiran bashiiraan","translate":{"id":"Dan berapa banyaknya kaum sesudah Nuh telah Kami binasakan. Dan cukuplah Tuhanmu Maha Mengetahui lagi Maha Melihat dosa hamba-hamba-Nya.\n","en":"And how many a generation have We [thus] destroyed after [the time of] Noah! For, none has the like of thy Sustainer's awareness and insight into His creatures' sins."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2046","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2046.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2046.mp3"]}},{"no":18,"arab":"مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلَاهَا مَذْمُومًا مَدْحُورًا","latin":"man kaana yuriidu al'aajilata 'ajjalnaa lahu fiihaa maa nasyaau liman nuriidu tsumma ja'alnaa lahu jahannama yashlaahaa madzmuuman madhuuraan","translate":{"id":"Barangsiapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di dunia itu apa yang kami kehendaki bagi orang yang kami kehendaki dan Kami tentukan baginya neraka jahannam; ia akan memasukinya dalam keadaan tercela dan terusir.\n","en":"Unto him who cares for [no more than the enjoyment of] this fleeting life We readily grant thereof as much as We please, [giving] to whomever it is Our will [to give]; but in the end We consign him to [the suffering of] hell; which he will have to endure disgraced and disowned!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2047","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2047.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2047.mp3"]}},{"no":19,"arab":"وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا","latin":"waman araada al-aakhirata wasa'aa lahaa sa'yahaa wahuwa mu/minun faulaa-ika kaana sa'yuhum masykuuraan","translate":{"id":"Dan barangsiapa yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh sedang ia adalah mu'min, maka mereka itu adalah orang-orang yang usahanya dibalasi dengan baik.\n","en":"But as for those who care for the [good of the] life to come, and strive for it as it ought to be striven for, and are [true] believers withal -they are the ones whose striving finds favour [with God]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2048","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2048.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2048.mp3"]}},{"no":20,"arab":"كُلًّا نُمِدُّ هَٰؤُلَاءِ وَهَٰؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ ۚ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا","latin":"kullan numiddu haaulaa-i wahaaulaa-i min 'athaa-i rabbika wamaa kaana 'athaau rabbika mahtsuuraan","translate":{"id":"Kepada masing-masing golongan baik golongan ini maupun golongan itu Kami berikan bantuan dari kemurahan Tuhanmu. Dan kemurahan Tuhanmu tidak dapat dihalangi.\n","en":"All [of them] -these as well as those -do We freely endow with some of thy Sustainer's gifts, since thy Sustainer's giving is never confined [to one kind of man]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2049","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2049.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2049.mp3"]}},{"no":21,"arab":"انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا","latin":"unzhur kayfa fadhdhalnaa ba'dhahum 'alaa ba'dhin walal-aakhiratu akbaru darajaatin wa-akbaru tafdhiilaan","translate":{"id":"Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain). Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.\n","en":"Behold how We bestow [on earth) more bounty on some of them than on others: but [remember that] the life to come will be far higher in degree and far greater in merit and bounty."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2050","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2050.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2050.mp3"]}},{"no":22,"arab":"لَا تَجْعَلْ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتَقْعُدَ مَذْمُومًا مَخْذُولًا","latin":"laa taj'al ma'a allaahi ilaahan aakhara fataq'uda madzmuuman makhdzuulaan","translate":{"id":"Janganlah kamu adakan tuhan yang lain di samping Allah, agar kamu tidak menjadi tercela dan tidak ditinggalkan (Allah).\n","en":"DO NOT set up any other deity side by side with God, lest thou find thyself disgraced and forsaken:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2051","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2051.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2051.mp3"]}},{"no":23,"arab":"وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا","latin":"waqadaa rabbuka allaa ta'buduu illaa iyyaahu wabialwaalidayni ihsaanan immaa yablughanna 'indaka alkibara ahaduhumaa aw kilaahumaa falaa taqul lahumaa uffin walaa tanharhumaa waqul lahumaa qawlan kariimaan","translate":{"id":"Dan Tuhanmu telah memerintahkan supaya kamu jangan menyembah selain Dia dan hendaklah kamu berbuat baik pada ibu bapakmu dengan sebaik-baiknya. Jika salah seorang di antara keduanya atau kedua-duanya sampai berumur lanjut dalam pemeliharaanmu, maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan \"ah\" dan janganlah kamu membentak mereka dan ucapkanlah kepada mereka perkataan yang mulia .\n","en":"for thy Sustainer has ordained that you shall worship none but Him. And do good unto [thy] parents. Should one of them, or both, attain to old age in thy care, never say \"Ugh\" to them or scold them, but [always] speak unto them with reverent speech,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2052","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2052.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2052.mp3"]}},{"no":24,"arab":"وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا","latin":"waikhfidh lahumaa janaaha aldzdzulli mina alrrahmati waqul rabbi irhamhumaa kamaa rabbayaanii shaghiiraan","translate":{"id":"Dan rendahkanlah dirimu terhadap mereka berdua dengan penuh kesayangan dan ucapkanlah: \"Wahai Tuhanku, kasihilah mereka keduanya, sebagaimana mereka berdua telah mendidik aku waktu kecil\".\n","en":"and spread over them humbly the wings of thy tenderness, and say: \"O my Sustainer! Bestow Thy grace upon them, even as they cherished and reared me when I was a child!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2053","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2053.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2053.mp3"]}},{"no":25,"arab":"رَبُّكُمْ أَعْلَمُ بِمَا فِي نُفُوسِكُمْ ۚ إِنْ تَكُونُوا صَالِحِينَ فَإِنَّهُ كَانَ لِلْأَوَّابِينَ غَفُورًا","latin":"rabbukum a'lamu bimaa fii nufuusikum in takuunuu shaalihiina fa-innahu kaana lil-awwaabiina ghafuuraan","translate":{"id":"Tuhanmu lebih mengetahui apa yang ada dalam hatimu; jika kamu orang-orang yang baik, maka sesungguhnya Dia Maha Pengampun bagi orang-orang yang bertaubat.\n","en":"Your Sustainer is fully aware of what is in your hearts. If you are righteous, [He will forgive you your errors]: for, behold, He is much-forgiving to those who turn unto Him again and again."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2054","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2054.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2054.mp3"]}},{"no":26,"arab":"وَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَلَا تُبَذِّرْ تَبْذِيرًا","latin":"waaati dzaa alqurbaa haqqahu waalmiskiina waibna alssabiili walaa tubadzdzir tabdziiraan","translate":{"id":"Dan berikanlah kepada keluarga-keluarga yang dekat akan haknya, kepada orang miskin dan orang yang dalam perjalanan dan janganlah kamu menghambur-hamburkan (hartamu) secara boros.\n","en":"And give his due to the near of kin, as well as to the needy and the wayfarer, but do not squander [thy substance] senselessly."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2055","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2055.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2055.mp3"]}},{"no":27,"arab":"إِنَّ الْمُبَذِّرِينَ كَانُوا إِخْوَانَ الشَّيَاطِينِ ۖ وَكَانَ الشَّيْطَانُ لِرَبِّهِ كَفُورًا","latin":"inna almubadzdziriina kaanuu ikhwaana alsysyayaathiini wakaana alsysyaythaanu lirabbihi kafuuraan","translate":{"id":"Sesungguhnya pemboros-pemboros itu adalah saudara-saudara syaitan dan syaitan itu adalah sangat ingkar kepada Tuhannya.\n","en":"Behold, the squanderers are, indeed, of the ilk of the satans - inasmuch as Satan has indeed proved most ungrateful to his Sustainer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2056","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2056.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2056.mp3"]}},{"no":28,"arab":"وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاءَ رَحْمَةٍ مِنْ رَبِّكَ تَرْجُوهَا فَقُلْ لَهُمْ قَوْلًا مَيْسُورًا","latin":"wa-immaa tu'ridhanna 'anhumu ibtighaa-a rahmatin min rabbika tarjuuhaa faqul lahum qawlan maysuuraan","translate":{"id":"Dan jika kamu berpaling dari mereka untuk memperoleh rahmat dari Tuhanmu yang kamu harapkan, maka katakanlah kepada mereka ucapan yang pantas .\n","en":"And if thou [must] turn aside from those [that are in want, because thou thyself art] seeking to obtain thy Sustainer's grace and hoping for it, at least speak unto them with gentle speech."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2057","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2057.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2057.mp3"]}},{"no":29,"arab":"وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَحْسُورًا","latin":"walaa taj'al yadaka maghluulatan ilaa 'unuqika walaa tabsuthhaa kulla albasthi fataq'uda maluuman mahsuuraan","translate":{"id":"Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu dan janganlah kamu terlalu mengulurkannya karena itu kamu menjadi tercela dan menyesal.\n","en":"And neither allow thy hand to remain shackled to thy neck, nor stretch it forth to the utmost limit [of thy capacity], lest thou find thyself blamed [by thy dependants], or even destitute."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2058","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2058.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2058.mp3"]}},{"no":30,"arab":"إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا","latin":"inna rabbaka yabsuthu alrrizqa liman yasyaau wayaqdiru innahu kaana bi'ibaadihi khabiiran bashiiraan","translate":{"id":"Sesungguhnya Tuhanmu melapangkan rezki kepada siapa yang Dia kehendaki dan menyempitkannya; sesungguhnya Dia Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya.\n","en":"Behold, thy Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills: verily, fully aware is He of [the needs of] His creatures, and sees them all."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2059","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2059.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2059.mp3"]}},{"no":31,"arab":"وَلَا تَقْتُلُوا أَوْلَادَكُمْ خَشْيَةَ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ إِنَّ قَتْلَهُمْ كَانَ خِطْئًا كَبِيرًا","latin":"walaa taqtuluu awlaadakum khasyyata imlaaqin nahnu narzuquhum wa-iyyaakum inna qatlahum kaana khith-an kabiiraan","translate":{"id":"Dan janganlah kamu membunuh anak-anakmu karena takut kemiskinan. Kamilah yang akan memberi rezki kepada mereka dan juga kepadamu. Sesungguhnya membunuh mereka adalah suatu dosa yang besar.\n","en":"Hence, do not kill your children for fear of poverty: it is We who shall provide sustenance for them as well as for you. Verily, killing them is a great sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2060","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2060.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2060.mp3"]}},{"no":32,"arab":"وَلَا تَقْرَبُوا الزِّنَا ۖ إِنَّهُ كَانَ فَاحِشَةً وَسَاءَ سَبِيلًا","latin":"walaa taqrabuu alzzinaa innahu kaana faahisyatan wasaa-a sabiilaan","translate":{"id":"Dan janganlah kamu mendekati zina; sesungguhnya zina itu adalah suatu perbuatan yang keji. Dan suatu jalan yang buruk.\n","en":"And do not commit adultery -for, behold, it is an abomination and an evil way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2061","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2061.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2061.mp3"]}},{"no":33,"arab":"وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۗ وَمَنْ قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِ سُلْطَانًا فَلَا يُسْرِفْ فِي الْقَتْلِ ۖ إِنَّهُ كَانَ مَنْصُورًا","latin":"walaa taqtuluu alnnafsa allatii harrama allaahu illaa bialhaqqi waman qutila mazhluuman faqad ja'alnaa liwaliyyihi sulthaanan falaa yusrif fii alqatli innahu kaana manshuuraan","translate":{"id":"Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya), melainkan dengan suatu (alasan) yang benar . Dan barangsiapa dibunuh secara zalim, maka sesungguhnya Kami telah memberi kekuasaan kepada ahli warisnya, tetapi janganlah ahli waris itu melampaui batas dalam membunuh. Sesungguhnya ia adalah orang yang mendapat pertolongan.\n","en":"And do not take any human being's life -[the life] which God has willed to be, sacred-otherwise than in [the pursuit of] justice. Hence, if anyone has been slain wrongfully, We have empowered the defender of his rights [to exact a just retribution]; but even so, let him not exceed the bounds of equity in [retributive] killing. [And as for him who has been slain wrongfully -] behold, he is indeed succoured [by God]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2062","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2062.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2062.mp3"]}},{"no":34,"arab":"وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُ ۚ وَأَوْفُوا بِالْعَهْدِ ۖ إِنَّ الْعَهْدَ كَانَ مَسْئُولًا","latin":"walaa taqrabuu maala alyatiimi illaa biallatii hiya ahsanu hattaa yablugha asyuddahu wa-awfuu bial'ahdi inna al'ahda kaana mas-uulaan","translate":{"id":"Dan janganlah kamu mendekati harta anak yatim, kecuali dengan cara yang lebih baik (bermanfa'at) sampai ia dewasa dan penuhilah janji; sesungguhnya janji itu pasti diminta pertanggungan jawabnya.\n","en":"And do not touch the substance of an orphan, save to improve it, before he comes of age. And be true to every promise - for, verily, [on Judgment Day] you will be called to account for every promise which you have made!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2063","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2063.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2063.mp3"]}},{"no":35,"arab":"وَأَوْفُوا الْكَيْلَ إِذَا كِلْتُمْ وَزِنُوا بِالْقِسْطَاسِ الْمُسْتَقِيمِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا","latin":"wa-awfuu alkayla idzaa kiltum wazinuu bialqisthaasi almustaqiimi dzaalika khayrun wa-ahsanu ta/wiilaan","translate":{"id":"Dan sempurnakanlah takaran apabila kamu menakar, dan timbanglah dengan neraca yang benar. Itulah yang lebih utama (bagimu) dan lebih baik akibatnya.\n","en":"And give full measure whenever you measure, and weigh with a balance that is true: this will be [for your own] good, and best in the end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2064","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2064.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2064.mp3"]}},{"no":36,"arab":"وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۚ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَٰئِكَ كَانَ عَنْهُ مَسْئُولًا","latin":"walaa taqfu maa laysa laka bihi 'ilmun inna alssam'a waalbashara waalfu-aada kullu ulaa-ika kaana 'anhu mas-uulaan","translate":{"id":"Dan janganlah kamu mengikuti apa yang kamu tidak mempunyai pengetahuan tentangnya. Sesungguhnya pendengaran, penglihatan dan hati, semuanya itu akan diminta pertanggungan jawabnya.\n","en":"And never concern thyself with anything of which thou hast no knowledge: verily, [thy] hearing and sight and heart - all of them - will be called to account for it [on Judgment Day]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2065","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2065.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2065.mp3"]}},{"no":37,"arab":"وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا ۖ إِنَّكَ لَنْ تَخْرِقَ الْأَرْضَ وَلَنْ تَبْلُغَ الْجِبَالَ طُولًا","latin":"walaa tamsyi fii al-ardhi marahan innaka lan takhriqa al-ardha walan tablugha aljibaala thuulaan","translate":{"id":"Dan janganlah kamu berjalan di muka bumi ini dengan sombong, karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi dan sekali-kali kamu tidak akan sampai setinggi gunung.\n","en":"And walk not on earth with haughty self-conceit: for, verily, thou canst never rend the earth asunder, nor canst thou ever grow as tall as the mountains!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2066","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2066.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2066.mp3"]}},{"no":38,"arab":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُ عِنْدَ رَبِّكَ مَكْرُوهًا","latin":"kullu dzaalika kaana sayyi-uhu 'inda rabbika makruuhaan","translate":{"id":"Semua itu kejahatannya amat dibenci di sisi Tuhanmu.\n","en":"The evil of all this is odious in thy Sustainer's sight:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2067","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2067.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2067.mp3"]}},{"no":39,"arab":"ذَٰلِكَ مِمَّا أَوْحَىٰ إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ ۗ وَلَا تَجْعَلْ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتُلْقَىٰ فِي جَهَنَّمَ مَلُومًا مَدْحُورًا","latin":"afa-ashfaakum rabbukum bialbaniina waittakhadza mina almalaa-ikati inaatsan innakum lataquuluuna qawlan 'azhiimaan ","translate":{"id":"Itulah sebagian hikmah yang diwahyukan Tuhanmu kepadamu. Dan janganlah kamu mengadakan tuhan yang lain di samping Allah, yang menyebabkan kamu dilemparkan ke dalam neraka dalam keadaan tercela lagi dijauhkan (dari rahmat Allah).\n","en":"this is part of that knowledge of right and wrong with which thy Sustainer has inspired thee. Hence, do not set up any other deity side by side with God, lest thou be cast into hell, blamed [by thyself] and rejected [by Him]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2068","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2068.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2068.mp3"]}},{"no":40,"arab":"أَفَأَصْفَاكُمْ رَبُّكُمْ بِالْبَنِينَ وَاتَّخَذَ مِنَ الْمَلَائِكَةِ إِنَاثًا ۚ إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا","latin":"afa-ashfaakum rabbukum bialbaniina waittakhadza mina almalaa-ikati inaatsan innakum lataquuluuna qawlan 'azhiimaan ","translate":{"id":"Maka apakah patut Tuhan memilihkan bagimu anak-anak laki-laki sedang Dia sendiri mengambil anak-anak perempuan di antara para malaikat? Sesungguhnya kamu benar-benar mengucapkan kata-kata yang besar (dosanya).\n","en":"HAS, THEN, your Sustainer distinguished you by [giving you] sons, and taken unto Himself daughters in the guise of angels? Verily, you are uttering a dreadful saying!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2069","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2069.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2069.mp3"]}},{"no":41,"arab":"وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِيَذَّكَّرُوا وَمَا يَزِيدُهُمْ إِلَّا نُفُورًا","latin":"walaqad sharrafnaa fii haadzaa alqur-aani liyadzdzakkaruu wamaa yaziiduhum illaa nufuuraan","translate":{"id":"Dan sesungguhnya dalam Al Qur'an ini Kami telah ulang-ulangi (peringatan-peringatan), agar mereka selalu ingat. Dan ulangan peringatan itu tidak lain hanyalah menambah mereka lari (dari kebenaran).\n","en":"And, indeed, many facets have We given [to Our message] in this Qur'an, so that they [who deny the truth] might take it to heart: but all this only increases their aversion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2070","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2070.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2070.mp3"]}},{"no":42,"arab":"قُلْ لَوْ كَانَ مَعَهُ آلِهَةٌ كَمَا يَقُولُونَ إِذًا لَابْتَغَوْا إِلَىٰ ذِي الْعَرْشِ سَبِيلًا","latin":"qul law kaana ma'ahu aalihatun kamaa yaquuluuna idzan laibtaghaw ilaa dzii al'arsyi sabiilaan","translate":{"id":"Katakanlah: \"Jikalau ada tuhan-tuhan di samping-Nya, sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari jalan kepada Tuhan yang mempunyai 'Arsy\".\n","en":"Say: \"If there were-as some people assert [other] deities side by side with Him, surely [even] they would have to strive to find a way unto Him who is enthroned on His almightiness?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2071","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2071.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2071.mp3"]}},{"no":43,"arab":"سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يَقُولُونَ عُلُوًّا كَبِيرًا","latin":"subhaanahu wata'aalaa 'ammaa yaquuluuna 'uluwwan kabiiraan","translate":{"id":"Maha Suci dan Maha Tinggi Dia dari apa yang mereka katakan dengan ketinggian yang sebesar-besarnya.\n","en":"Limitless is He in His glory, and sublimely, immeasurably exalted above anything that men may say [about Him]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2072","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2072.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2072.mp3"]}},{"no":44,"arab":"تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَنْ فِيهِنَّ ۚ وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَٰكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ ۗ إِنَّهُ كَانَ حَلِيمًا غَفُورًا","latin":"tusabbihu lahu alssamaawaatu alssab'u waal-ardhu waman fiihinna wa-in min syay-in illaa yusabbihu bihamdihi walaakin laa tafqahuuna tasbiihahum innahu kaana haliiman ghafuuraan","translate":{"id":"Langit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. Dan tak ada suatupun melainkan bertasbih dengan memuji-Nya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.\n","en":"The seven heavens extol His limitless glory, and the earth, and all that they contain; and there is not a single thing but extols His limitless glory and praise: but you [O men] fail to grasp the manner of their glorifying Him! Verily, He is forbearing, much-forgiving!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2073","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2073.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2073.mp3"]}},{"no":45,"arab":"وَإِذَا قَرَأْتَ الْقُرْآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ حِجَابًا مَسْتُورًا","latin":"wa-idzaa qara/ta alqur-aana ja'alnaa baynaka wabayna alladziina laa yu/minuuna bial-aakhirati hijaaban mastuuraan","translate":{"id":"Dan apabila kamu membaca Al Qur'an niscaya Kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat, suatu dinding yang tertutup,\n","en":"But [thus it is:] whenever thou recitest the Qur'an, We place an invisible barrier between thee and those who will not believe in the life to come: -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2074","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2074.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2074.mp3"]}},{"no":46,"arab":"وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۚ وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَىٰ أَدْبَارِهِمْ نُفُورًا","latin":"waja'alnaa 'alaa quluubihim akinnatan an yafqahuuhu wafii aatsaanihim waqran wa-idzaa dzakarta rabbaka fii alqur-aani wahdahu wallaw 'alaa adbaarihim nufuuraan","translate":{"id":"dan Kami adakan tutupan di atas hati mereka dan sumbatan di telinga mereka, agar mereka tidak dapat memahaminya. Dan apabila kamu menyebut Tuhanmu saja dalam Al Qur'an, niscaya mereka berpaling ke belakang karena bencinya,\n","en":"for, over their hearts We have laid veils which prevent them from grasping its purport, and into their ears, deafness. And so, whenever thou dost mention, while reciting the Qur'an, thy Sustainer as the one and only Divine Being, they turn their backs [upon thee] in aversion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2075","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2075.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2075.mp3"]}},{"no":47,"arab":"نَحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَىٰ إِذْ يَقُولُ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا","latin":"nahnu a'lamu bimaa yastami'uuna bihi idz yastami'uuna ilayka wa-idz hum najwaa idz yaquulu alzhzhaalimuuna in tattabi'uuna illaa rajulan mashuuraan","translate":{"id":"Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan sewaktu mereka mendengarkan kamu, dan sewaktu mereka berbisik-bisik (yaitu) ketika orang-orang zalim itu berkata: \"Kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir\".\n","en":"We are fully aware of what they are listening for when they listen to thee: for when they are secluded among themselves, lo! these wrongdoers say [unto one another], \"If you were to follow [Muhammad, you would follow] only a man bewitched!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2076","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2076.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2076.mp3"]}},{"no":48,"arab":"انْظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا","latin":"unzhur kayfa dharabuu laka al-amtsaala fadhalluu falaa yastathii'uuna sabiilaan","translate":{"id":"Lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu; karena itu mereka menjadi sesat dan tidak dapat lagi menemukan jalan (yang benar).\n","en":"See to what they liken thee, [O Prophet simply] because they have gone astray and are now unable to find a way [to the truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2077","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2077.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2077.mp3"]}},{"no":49,"arab":"وَقَالُوا أَإِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا","latin":"waqaaluu a-idzaa kunnaa 'izhaaman warufaatan a-innaa lamab'uutsuuna khalqan jadiidaan","translate":{"id":"Dan mereka berkata: \"Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apa benar-benarkah kami akan dibangkitkan kembali sebagai makhluk yang baru?\"\n","en":"And [thus, too,] they say, \"After we will have become bones and dust, shall we, forsooth, be raised from the dead in a new act of creation?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2078","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2078.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2078.mp3"]}},{"no":50,"arab":"قُلْ كُونُوا حِجَارَةً أَوْ حَدِيدًا","latin":"qul kuunuu hijaaratan aw hadiidaan","translate":{"id":"Katakanlah: \"Jadilah kamu sekalian batu atau besi,\n","en":"Say: \"[You will be raised from the dead even though] you be stones or iron"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2079","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2079.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2079.mp3"]}},{"no":51,"arab":"أَوْ خَلْقًا مِمَّا يَكْبُرُ فِي صُدُورِكُمْ ۚ فَسَيَقُولُونَ مَنْ يُعِيدُنَا ۖ قُلِ الَّذِي فَطَرَكُمْ أَوَّلَ مَرَّةٍ ۚ فَسَيُنْغِضُونَ إِلَيْكَ رُءُوسَهُمْ وَيَقُولُونَ مَتَىٰ هُوَ ۖ قُلْ عَسَىٰ أَنْ يَكُونَ قَرِيبًا","latin":"aw khalqan mimmaa yakburu fii shuduurikum fasayaquuluuna man yu'iidunaa quli alladzii fatharakum awwala marratin fasayunghidhuuna ilayka ruuusahum wayaquuluuna mataa huwa qul 'asaa an yakuuna qariibaan","translate":{"id":"atau suatu makhluk dari makhluk yang tidak mungkin (hidup) menurut pikiranmu\". Maka mereka akan bertanya: \"Siapa yang akan menghidupkan kami kembali?\" Katakanlah: \"Yang telah menciptakan kamu pada kali yang pertama\". Lalu mereka akan menggeleng-gelengkan kepala mereka kepadamu dan berkata: \"Kapan itu (akan terjadi)?\" Katakanlah: \"Mudah-mudahan waktu berbangkit itu dekat\",\n","en":"or any [other] substance which, to your minds, appears yet farther removed [from life]!\" And [if] thereupon they ask, \"Who is it that will' bring us back [to life]?\"-say thou: \"He who has brought you into being in the first instance.\" And [if] thereupon they shake their heads at thee [in disbelief] and ask, \"When shall this be?\"-say thou: \"It may well be soon,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2080","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2080.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2080.mp3"]}},{"no":52,"arab":"يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ وَتَظُنُّونَ إِنْ لَبِثْتُمْ إِلَّا قَلِيلًا","latin":"yawma yad'uukum fatastajiibuuna bihamdihi watazhunnuuna in labitstum illaa qaliilaan","translate":{"id":"yaitu pada hari Dia memanggil kamu, lalu kamu mematuhi-Nya sambil memuji-Nya dan kamu mengira, bahwa kamu tidak berdiam (di dalam kubur) kecuali sebentar saja.\n","en":"on a Day when He will call you, and you will answer by praising Him, thinking all the while that you have tarried [on earth] but a little while.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2081","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2081.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2081.mp3"]}},{"no":53,"arab":"وَقُلْ لِعِبَادِي يَقُولُوا الَّتِي هِيَ أَحْسَنُ ۚ إِنَّ الشَّيْطَانَ يَنْزَغُ بَيْنَهُمْ ۚ إِنَّ الشَّيْطَانَ كَانَ لِلْإِنْسَانِ عَدُوًّا مُبِينًا","latin":"waqul li'ibaadii yaquuluu allatii hiya ahsanu inna alsysyaythaana yanzaghu baynahum inna alsysyaythaana kaana lil-insaani 'aduwwan mubiinaan","translate":{"id":"Dan katakanlah kepada hamha-hamba-Ku: \"Hendaklah mereka mengucapkan perkataan yang lebih baik (benar). Sesungguhnya syaitan itu menimbulkan perselisihan di antara mereka. Sesungguhnya syaitan itu adalah musuh yang nyata bagi manusia.\n","en":"AND TELL My servants that they should speak in the most kindly manner [unto those who do not share their beliefs]: verily, Satan is always ready to stir up discord between men - for, verily, Satan is man's open foe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2082","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2082.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2082.mp3"]}},{"no":54,"arab":"رَبُّكُمْ أَعْلَمُ بِكُمْ ۖ إِنْ يَشَأْ يَرْحَمْكُمْ أَوْ إِنْ يَشَأْ يُعَذِّبْكُمْ ۚ وَمَا أَرْسَلْنَاكَ عَلَيْهِمْ وَكِيلًا","latin":"rabbukum a'lamu bikum in yasya/ yarhamkum aw in yasya/ yu'adzdzibkum wamaa arsalnaaka 'alayhim wakiilaan","translate":{"id":"Tuhanmu lebih mengetahui tentang kamu. Dia akan memberi rahmat kepadamu jika Dia menghendaki dan Dia akan meng'azabmu, jika Dia menghendaki. Dan, Kami tidaklah mengutusmu untuk menjadi penjaga bagi mereka.\n","en":"Your Sustainer is fully aware of what you are [and what you deserve]: if He so wills, he will bestow [His] grace upon you; and if He so wills, He will chastise you. Hence, We have not sent thee [unto men, O Prophet,] with the power to determine their fate,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2083","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2083.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2083.mp3"]}},{"no":55,"arab":"وَرَبُّكَ أَعْلَمُ بِمَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَىٰ بَعْضٍ ۖ وَآتَيْنَا دَاوُودَ زَبُورًا","latin":"warabbuka a'lamu biman fii alssamaawaati waal-ardhi walaqad fadhdhalnaa ba'dha alnnabiyyiina 'alaa ba'dhin waaataynaa daawuuda zabuuraan","translate":{"id":"Dan Tuhan-mu lebih mengetahui siapa yang (ada) di langit dan di bumi. Dan sesungguhnya telah Kami lebihkan sebagian nabi-nabi itu atas sebagian (yang lain), dan Kami berikan Zabur kepada Daud.\n","en":"seeing that thy Sustainer is fully aware of [what is in the minds of] all beings that are in the heavens and on earth. But, indeed, We did endow some of the prophets more highly than others -just as We bestowed upon David a book of divine wisdom [in token of Our grace]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2084","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2084.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2084.mp3"]}},{"no":56,"arab":"قُلِ ادْعُوا الَّذِينَ زَعَمْتُمْ مِنْ دُونِهِ فَلَا يَمْلِكُونَ كَشْفَ الضُّرِّ عَنْكُمْ وَلَا تَحْوِيلًا","latin":"quli ud'u alladziina za'amtum min duunihi falaa yamlikuuna kasyfa aldhdhurri 'ankum walaa tahwiilaan","translate":{"id":"Katakanlah: \"Panggillah mereka yang kamu anggap (tuhan) selain Allah, maka mereka tidak akan mempunyai kekuasaan untuk menghilangkan bahaya daripadamu dan tidak pula memindahkannya.\"\n","en":"SAY: \"Call upon those [beings] whom you imagine [to be endowed with divine powers] beside Him and [you will find that] they have it not in their power to remove any affliction from you, or to shift it [elsewhere]. \""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2085","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2085.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2085.mp3"]}},{"no":57,"arab":"أُولَٰئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُ وَيَخَافُونَ عَذَابَهُ ۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا","latin":"ulaa-ika alladziina yad'uuna yabtaghuuna ilaa rabbihimu alwasiilata ayyuhum aqrabu wayarjuuna rahmatahu wayakhaafuuna 'adzaabahu inna 'adzaaba rabbika kaana mahtsuuraan","translate":{"id":"Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan mereka siapa di antara mereka yang lebih dekat (kepada Allah) dan mengharapkan rahmat-Nya dan takut akan azab-Nya; sesungguhnya azab Tuhanmu adalah suatu yang (harus) ditakuti.\n","en":"Those [saintly beings] whom they invoke are themselves striving to obtain their Sustainer's favour - [even] those among them who are closest [to Him] - hoping for His grace and dreading His chastisement: for, verily, thy Sustainer's chastisement is something to beware of!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2086","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2086.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2086.mp3"]}},{"no":58,"arab":"وَإِنْ مِنْ قَرْيَةٍ إِلَّا نَحْنُ مُهْلِكُوهَا قَبْلَ يَوْمِ الْقِيَامَةِ أَوْ مُعَذِّبُوهَا عَذَابًا شَدِيدًا ۚ كَانَ ذَٰلِكَ فِي الْكِتَابِ مَسْطُورًا","latin":"wa-in min qaryatin illaa nahnu muhlikuuhaa qabla yawmi alqiyaamati aw mu'adzdzibuuhaa 'adzaaban syadiidan kaana dzaalika fii alkitaabi masthuuraan","translate":{"id":"Tak ada suatu negeripun (yang durhaka penduduknya), melainkan Kami membinasakannya sebelum hari kiamat atau Kami azab (penduduknya) dengan azab yang sangat keras. Yang demikian itu telah tertulis di dalam kitab (Lauh Mahfuzh).\n","en":"And [bear in mind:] there is no community which We will not destroy before the Day of Resurrection, or chastise [even earlier, if it proves sinful,] with suffering severe: all this is laid down in Our decree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2087","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2087.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2087.mp3"]}},{"no":59,"arab":"وَمَا مَنَعَنَا أَنْ نُرْسِلَ بِالْآيَاتِ إِلَّا أَنْ كَذَّبَ بِهَا الْأَوَّلُونَ ۚ وَآتَيْنَا ثَمُودَ النَّاقَةَ مُبْصِرَةً فَظَلَمُوا بِهَا ۚ وَمَا نُرْسِلُ بِالْآيَاتِ إِلَّا تَخْوِيفًا","latin":"wamaa mana'anaa an nursila bial-aayaati illaa an kadzdzaba bihaa al-awwaluuna waaataynaa tsamuuda alnnaaqata mubshiratan fazhalamuu bihaa wamaa nursilu bial-aayaati illaa takhwiifaan","translate":{"id":"Dan sekali-kali tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasan Kami), melainkan karena tanda-tanda itu telah didustakan oleh orang-orang dahulu . Dan telah Kami berikan kepada Tsamud unta betina itu (sebagai mu'jizat) yang dapat dilihat, tetapi mereka menganiaya unta betina itu. Dan Kami tidak memberi tanda-tanda itu melainkan untuk menakuti.\n","en":"And nothing has prevented Us from sending [this message, like the earlier ones,] with miraculous signs [in its wake], save [Our knowledge] that the people of olden times [only too often] gave the lie to them: thus, We provided for [the tribe of] Thamud the she-camel as a light-giving portent, and they sinned against it. And never did We send those signs for any other purpose than to convey a warning."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2088","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2088.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2088.mp3"]}},{"no":60,"arab":"وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِالنَّاسِ ۚ وَمَا جَعَلْنَا الرُّؤْيَا الَّتِي أَرَيْنَاكَ إِلَّا فِتْنَةً لِلنَّاسِ وَالشَّجَرَةَ الْمَلْعُونَةَ فِي الْقُرْآنِ ۚ وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلَّا طُغْيَانًا كَبِيرًا","latin":"wa-idz qulnaa laka inna rabbaka ahatha bialnnaasi wamaa ja'alnaa alrru/yaa allatii araynaaka illaa fitnatan lilnnaasi waalsysyajarata almal'uunata fii alqur-aani wanukhawwifuhum famaa yaziiduhum illaa thughyaanan kabiiraan","translate":{"id":"60. Dan (ingatlah), ketika Kami wahyukan kepadamu: \"Sesungguhnya (ilmu) Tuhanmu meliputi segala manusia\". Dan Kami tidak menjadikan mimpi yang telah Kami perlihatkan kepadamu, melainkan sebagai ujian bagi manusia dan (begitu pula) pohon kayu yang terkutuk dalam Al Qur'an . Dan Kami menakut-nakuti mereka, tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka.\n","en":"And lo! We said unto thee, [O Prophet:] \"Behold, thy Sustainer encompasses all mankind [within His knowledge and might]: and so We have ordained that the vision which We have shown thee -as also the tree [of hell,] cursed in this Qur'an - shall be but a trial for men. Now [by Our mentioning hell] We convey a warning to them: but [if they are bent on denying the truth,] this [warning] only increases their gross, overweening arrogance.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2089","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2089.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2089.mp3"]}},{"no":61,"arab":"وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ قَالَ أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا","latin":"wa-idz qulnaa lilmalaa-ikati usjuduu li-aadama fasajaduu illaa ibliisa qaala a-asjudu liman khalaqta thiinaan","translate":{"id":"Dan (ingatlah), tatkala Kami berfirman kepada para malaikat: \"Sujudlah kamu semua kepada Adam\", lalu mereka sujud kecuali iblis. Dia berkata: \"Apakah aku akan sujud kepada orang yang Engkau ciptakan dari tanah?\"\n","en":"AND LO! We said unto the angels, \"Prostrate yourselves before Adam\"-whereupon they all prostrated themselves, save Iblis. Said he: \"Shall I prostrate myself before one whom Thou hast created out of clay?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2090","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2090.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2090.mp3"]}},{"no":62,"arab":"قَالَ أَرَأَيْتَكَ هَٰذَا الَّذِي كَرَّمْتَ عَلَيَّ لَئِنْ أَخَّرْتَنِ إِلَىٰ يَوْمِ الْقِيَامَةِ لَأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلَّا قَلِيلًا","latin":"qaala ara-aytaka haadzaa alladzii karramta 'alayya la-in akhkhartani ilaa yawmi alqiyaamati la-ahtanikanna dzurriyyatahu illaa qaliilaan","translate":{"id":"Dia (iblis) berkata: \"Terangkanlah kepadaku inikah orangnya yang Engkau muliakan atas diriku? Sesungguhnya jika Engkau memberi tangguh kepadaku sampai hari kiamat, niscaya benar-benar akan aku sesatkan keturunannya, kecuali sebahagian kecil\".\n","en":"[And] he added: \"Tell me, is this [foolish being] the one whom Thou hast exalted above me? Indeed, if Thou wilt but allow me a respite till the Day of Resurrection, I shall most certainly cause his descendants-all but a few-to obey me blindly!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2091","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2091.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2091.mp3"]}},{"no":63,"arab":"قَالَ اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاءً مَوْفُورًا","latin":"qaala idzhab faman tabi'aka minhum fa-inna jahannama jazaaukum jazaa-an mawfuuraan","translate":{"id":"Tuhan berfirman: \"Pergilah, barangsiapa di antara mereka yang mengikuti kamu, maka sesungguhnya neraka Jahannam adalah balasanmu semua, sebagai suatu pembalasan yang cukup.\n","en":"[God] answered: \"Go [the way thou hast chosen]! But as for such of them as shall follow thee - behold, hell will be the recompense of you (all], a recompense most ample!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2092","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2092.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2092.mp3"]}},{"no":64,"arab":"وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْأَمْوَالِ وَالْأَوْلَادِ وَعِدْهُمْ ۚ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا","latin":"waistafziz mani istatha'ta minhum bishawtika wa-ajlib 'alayhim bikhaylika warajlika wasyaarik-hum fii al-amwaali waal-awlaadi wa'idhum wamaa ya'iduhumu alsysyaythaanu illaa ghuruuraan","translate":{"id":"Dan hasunglah siapa yang kamu sanggupi di antara mereka dengan ajakanmu, dan kerahkanlah terhadap mereka pasukan berkuda dan pasukanmu yang berjalan kaki dan berserikatlah dengan mereka pada harta dan anak-anak dan beri janjilah mereka. Dan tidak ada yang dijanjikan oleh syaitan kepada mereka melainkan tipuan belaka .\n","en":"Entice, then, with thy voice such of them as thou canst, and bear upon them with all thy horses and all thy men, and be their partner in [all sins relating to] worldly goods and children, and hold out [all manner of] promises to them: and [they will not know that] whatever Satan promises them is but meant to delude the mind."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2093","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2093.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2093.mp3"]}},{"no":65,"arab":"إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ ۚ وَكَفَىٰ بِرَبِّكَ وَكِيلًا","latin":"inna 'ibaadii laysa laka 'alayhim sulthaanun wakafaa birabbika wakiilaan","translate":{"id":"Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka. Dan cukuplah Tuhan-mu sebagai Penjaga\".\n","en":"\"(And yet,] behold, thou shalt have no power over [such of] My servants [as place their trust in Me]: for none is as worthy of trust as thy Sustainer.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2094","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2094.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2094.mp3"]}},{"no":66,"arab":"رَبُّكُمُ الَّذِي يُزْجِي لَكُمُ الْفُلْكَ فِي الْبَحْرِ لِتَبْتَغُوا مِنْ فَضْلِهِ ۚ إِنَّهُ كَانَ بِكُمْ رَحِيمًا","latin":"rabbukumu alladzii yuzjii lakumu alfulka fii albahri litabtaghuu min fadhlihi innahu kaana bikum rahiimaan","translate":{"id":"Tuhan-mu adalah yang melayarkan kapal-kapal di lautan untukmu, agar kamu mencari sebahagian dari karunia-Nya. Sesungguhnya Dia adalah Maha Penyayang terhadapmu.\n","en":"YOUR SUSTAINER is He who causes ships to move onward for you through the sea, so that you might go about in quest of some of His bounty: verily, a dispenser of grace is He unto you."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2095","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2095.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2095.mp3"]}},{"no":67,"arab":"وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ ۖ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ الْإِنْسَانُ كَفُورًا","latin":"wa-idzaa massakumu aldhdhurru fii albahri dhalla man tad'uuna illaa iyyaahu falammaa najjaakum ilaa albarri a'radhtum wakaana al-insaanu kafuuraan","translate":{"id":"Dan apabila kamu ditimpa bahaya di lautan, niscaya hilanglah siapa yang kamu seru kecuali Dia, Maka tatkala Dia menyelamatkan kamu ke daratan, kamu berpaling. Dan manusia itu adalah selalu tidak berterima kasih.\n","en":"And whenever danger befalls you at sea, all those (powers] that you are wont to invoke forsake you, [and nothing remains for you] save Him: but as soon as He has brought you safe ashore, you turn aside [and forget Him]-for, indeed, bereft of all gratitude is man!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2096","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2096.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2096.mp3"]}},{"no":68,"arab":"أَفَأَمِنْتُمْ أَنْ يَخْسِفَ بِكُمْ جَانِبَ الْبَرِّ أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ثُمَّ لَا تَجِدُوا لَكُمْ وَكِيلًا","latin":"afa-amintum an yakhsifa bikum jaaniba albarri aw yursila 'alaykum hasiban tsumma laa tajiduu lakum wakiilaan","translate":{"id":"Maka apakah kamu merasa aman (dari hukuman Tuhan) yang menjungkir balikkan sebagian daratan bersama kamu atau Dia meniupkan (angin keras yang membawa) batu-batu kecil? dan kamu tidak akan mendapat seorang pelindungpun bagi kamu,\n","en":"Can you, then, ever feel sure that He will not cause a tract of dry land to swallow you up, or let loose upon you a deadly storm-wind, whereupon you would find none to be your protector?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2097","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2097.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2097.mp3"]}},{"no":69,"arab":"أَمْ أَمِنْتُمْ أَنْ يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَىٰ فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِنَ الرِّيحِ فَيُغْرِقَكُمْ بِمَا كَفَرْتُمْ ۙ ثُمَّ لَا تَجِدُوا لَكُمْ عَلَيْنَا بِهِ تَبِيعًا","latin":"am amintum an yu'iidakum fiihi taaratan ukhraa fayursila 'alaykum qaasifan mina alrriihi fayughriqakum bimaa kafartum tsumma laa tajiduu lakum 'alaynaa bihi tabii'aan","translate":{"id":"atau apakah kamu merasa aman dari dikembalikan-Nya kamu ke laut sekali lagi, lalu Dia meniupkan atas kamu angin taupan dan ditenggelamkan-Nya kamu disebabkan kekafiranmu. Dan kamu tidak akan mendapat seorang penolongpun dalam hal ini terhadap (siksaan) Kami.\n","en":"Or can you, perchance, feel sure that He will not make you put back to sea once again, and then let loose upon you a raging tempest and cause you to drown in requital of your ingratitude - whereupon you would find none to uphold you against Us?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2098","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2098.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2098.mp3"]}},{"no":70,"arab":"وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِمَّنْ خَلَقْنَا تَفْضِيلًا","latin":"walaqad karramnaa banii aadama wahamalnaahum fii albarri waalbahri warazaqnaahum mina alththhayyibaati wafadhdhalnaahum 'alaa katsiirin mimman khalaqnaa tafdhiilaan","translate":{"id":"Dan sesungguhnya telah Kami muliakan anak-anak Adam, Kami angkut mereka di daratan dan di lautan , Kami beri mereka rezki dari yang baik-baik dan Kami lebihkan mereka dengan kelebihan yang sempurna atas kebanyakan makhluk yang telah Kami ciptakan.\n","en":"NOW, INDEED, We have conferred dignity on the children of Adam, and borne them over land and sea, and provided for them sustenance out of the good things of life, and favoured them far above most of Our creation:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2099","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2099.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2099.mp3"]}},{"no":71,"arab":"يَوْمَ نَدْعُو كُلَّ أُنَاسٍ بِإِمَامِهِمْ ۖ فَمَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَأُولَٰئِكَ يَقْرَءُونَ كِتَابَهُمْ وَلَا يُظْلَمُونَ فَتِيلًا","latin":"yawma nad'uu kulla unaasin bi-imaamihim faman uutiya kitaabahu biyamiinihi faulaa-ika yaqrauuna kitaabahum walaa yuzhlamuuna fatiilaan","translate":{"id":"(Ingatlah) suatu hari (yang di hari itu) Kami panggil tiap umat dengan pemimpinnya; dan barangsiapa yang diberikan kitab amalannya di tangan kanannya maka mereka ini akan membaca kitabnya itu, dan mereka tidak dianiaya sedikitpun.\n","en":"[but] one Day We shall summon all human beings [and judge them] according to the conscious disposition which governed their deeds [in life]: whereupon they whose record shall be placed in their right hand -it is they who will read their record [with happiness]. Yet none shall be wronged by as much as a hair's breadth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2100","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2100.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2100.mp3"]}},{"no":72,"arab":"وَمَنْ كَانَ فِي هَٰذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا","latin":"waman kaana fii haadzihi a'maa fahuwa fii al-aakhirati a'maa wa-adhallu sabiilaan","translate":{"id":"Dan barangsiapa yang buta (hatinya) di dunia ini, niscaya di akhirat (nanti) ia akan lebih buta (pula) dan lebih tersesat dari jalan (yang benar).\n","en":"for whoever is blind [of heart] in this [world] will be blind in the life to come [as well], and still farther astray from the path [of truth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2101","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2101.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2101.mp3"]}},{"no":73,"arab":"وَإِنْ كَادُوا لَيَفْتِنُونَكَ عَنِ الَّذِي أَوْحَيْنَا إِلَيْكَ لِتَفْتَرِيَ عَلَيْنَا غَيْرَهُ ۖ وَإِذًا لَاتَّخَذُوكَ خَلِيلًا","latin":"wa-in kaaduu layaftinuunaka 'ani alladzii awhaynaa ilayka litaftariya 'alaynaa ghayrahu wa-idzan laittakhadzuuka khaliilaan","translate":{"id":"Dan sesungguhnya mereka hampir memalingkan kamu dari apa yang telah Kami wahyukan kepadamu, agar kamu membuat yang lain secara bohong terhadap Kami; dan kalau sudah begitu tentu","en":"AND,. behold, they [who have gone astray] endeavour to tempt thee away from all [the truth] with which We have inspired thee, [O Prophet,] with a view to making thee invent something else in Our name - in which case they would surely have made thee their friend!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2102","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2102.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2102.mp3"]}},{"no":74,"arab":"وَلَوْلَا أَنْ ثَبَّتْنَاكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلًا","latin":"walawlaa an tsabbatnaaka laqad kidta tarkanu ilayhim syay-an qaliilaan","translate":{"id":"Dan kalau Kami tidak memperkuat (hati)mu, niscaya kamu hampir-hampir condong sedikit kepada mereka,\n","en":"And 'had We not made thee firm [in faith], thou might have inclined to them a. little"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2103","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2103.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2103.mp3"]}},{"no":75,"arab":"إِذًا لَأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا","latin":"idzan la-adzaqnaaka dhi'fa alhayaati wadhi'fa almamaati tsumma laa tajidu laka 'alaynaa nashiiraan","translate":{"id":"kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolongpun terhadap Kami.\n","en":"in which case We would indeed have made thee taste double [chastisement] in life and double [chastisement] after death, and thou wouldst have found none to succour thee against Us!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2104","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2104.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2104.mp3"]}},{"no":76,"arab":"وَإِنْ كَادُوا لَيَسْتَفِزُّونَكَ مِنَ الْأَرْضِ لِيُخْرِجُوكَ مِنْهَا ۖ وَإِذًا لَا يَلْبَثُونَ خِلَافَكَ إِلَّا قَلِيلًا","latin":"wa-in kaaduu layastafizzuunaka mina al-ardhi liyukhrijuuka minhaa wa-idzan laa yalbatsuuna khilaafaka illaa qaliilaan","translate":{"id":"Dan sesungguhnya benar-benar mereka hampir membuatmu gelisah di negeri (Mekah) untuk mengusirmu daripadanya dan kalau terjadi demikian, niscaya sepeninggalmu mereka tidak tinggal, melainkan sebentar saja .\n","en":"And [since they see that they cannot persuade thee,] they endeavour to estrange thee from the land [of thy birth] with a view to driving thee away from, it-but, then, after thou wilt have left, they themselves will not remain [in it] for more than a little while:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2105","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2105.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2105.mp3"]}},{"no":77,"arab":"سُنَّةَ مَنْ قَدْ أَرْسَلْنَا قَبْلَكَ مِنْ رُسُلِنَا ۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحْوِيلًا","latin":"sunnata man qad arsalnaa qablaka min rusulinaa walaa tajidu lisunnatinaa tahwiilaan","translate":{"id":"(Kami menetapkan yang demikian) sebagai suatu ketetapan terhadap rasul-rasul Kami yang Kami utus sebelum kamu dan tidak akan kamu dapati perobahan bagi ketetapan Kami itu.\n","en":"[such has been Our] way with all of Our apostles whom We sent before thy time; and no change wilt thou find in Our ways."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2106","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2106.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2106.mp3"]}},{"no":78,"arab":"أَقِمِ الصَّلَاةَ لِدُلُوكِ الشَّمْسِ إِلَىٰ غَسَقِ اللَّيْلِ وَقُرْآنَ الْفَجْرِ ۖ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا","latin":"aqimi alshshalaata liduluuki alsysyamsi ilaa ghasaqi allayli waqur-aana alfajri inna qur-aana alfajri kaana masyhuudaan","translate":{"id":"Dirikanlah shalat dari sesudah matahari tergelincir sampai gelap malam dan (dirikanlah pula shalat) subuh . Sesungguhnya shalat subuh itu disaksikan (oleh malaikat).\n","en":"BE CONSTANT in [thy] prayer from the time when the sun has passed its zenith till the darkness of night, and [be ever mindful of its] recitation at dawn: for, behold, the recitation [of prayer] at dawn is indeed witnessed [by all that is holy]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2107","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2107.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2107.mp3"]}},{"no":79,"arab":"وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَىٰ أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا","latin":"wamina allayli fatahajjad bihi naafilatan laka 'asaa an yab'atsaka rabbuka maqaaman mahmuudaan","translate":{"id":"Dan pada sebahagian malam hari bersembahyang tahajudlah kamu sebagai suatu ibadah tambahan bagimu; mudah-mudahan Tuhan-mu mengangkat kamu ke tempat yang terpuji.\n","en":"And rise from thy sleep and pray during part of the night [as well], as a free offering from thee, and thy Sustainer may well raise thee to a glorious station [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2108","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2108.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2108.mp3"]}},{"no":80,"arab":"وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا","latin":"waqul rabbi adkhilnii mudkhala shidqin wa-akhrijnii mukhraja shidqin waij'al lii min ladunka sulthaanan nashiiraan","translate":{"id":"Dan katakanlah: \"Ya Tuhan-ku, masukkanlah aku secara masuk yang benar dan keluarkanlah (pula) aku secara keluar yang benar dan berikanlah kepadaku dari sisi Engkau kekuasaan yang menolong .\n","en":"And say [in thy prayer]: \"O my Sustainer! Cause me to enter [upon whatever I may do] in a manner. true and sincere, and cause me to leave [it] in a manner true and sincere, and grant me, out of Thy grace, sustaining strength!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2109","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2109.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2109.mp3"]}},{"no":81,"arab":"وَقُلْ جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ ۚ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا","latin":"waqul rabbi adkhilnii mudkhala shidqin wa-akhrijnii mukhraja shidqin waij'al lii min ladunka sulthaanan nashiiraan","translate":{"id":"Dan katakanlah: \"Yang benar telah datang dan yang batil telah lenyap\". Sesungguhnya yang batil itu adalah sesuatu yang pasti lenyap.\n","en":"And say: \"The truth has now come [to light], and falsehood has withered away: for, behold, all falsehood is bound to wither away!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2110","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2110.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2110.mp3"]}},{"no":82,"arab":"وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا","latin":"wanunazzilu mina alqur-aani maa huwa syifaaun warahmatun lilmu/miniina walaa yaziidu alzhzhaalimiina illaa khasaaraan","translate":{"id":"Dan Kami turunkan dari Al Qur'an suatu yang menjadi penawar dan rahmat bagi orang-orang yang beriman dan Al Qur'an itu tidaklah menambah kepada orang-orang yang zalim selain kerugian.\n","en":"THUS, step by step, We bestow from on high through this Qur'an all that gives health [to the spirit] and is a grace unto those who believe [in Us], the while it only adds to the ruin of evildoers:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2111","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2111.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2111.mp3"]}},{"no":83,"arab":"وَإِذَا أَنْعَمْنَا عَلَى الْإِنْسَانِ أَعْرَضَ وَنَأَىٰ بِجَانِبِهِ ۖ وَإِذَا مَسَّهُ الشَّرُّ كَانَ يَئُوسًا","latin":"wa-idzaa an'amnaa 'alaa al-insaani a'radha wanaaa bijaanibihi wa-idzaa massahu alsysyarru kaana yauusaan","translate":{"id":"Dan apabila Kami berikan kesenangan kepada manusia niscaya berpalinglah dia; dan membelakang dengan sikap yang sombong; dan apabila dia ditimpa kesusahan niscaya dia berputus asa.\n","en":"for [it often happens that] when We bestow Our blessings upon man, he turns away and arrogantly keeps aloof [from any thought of Us]; and when evil fortune touches him, he abandons all hope."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2112","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2112.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2112.mp3"]}},{"no":84,"arab":"قُلْ كُلٌّ يَعْمَلُ عَلَىٰ شَاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَىٰ سَبِيلًا","latin":"qul kullun ya'malu 'alaa syaakilatihi farabbukum a'lamu biman huwa ahdaa sabiilaan","translate":{"id":"Katakanlah: \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\". Maka Tuhanmu lebih mengetahui siapa yang lebih benar jalannya.\n","en":"Say: \"Everyone acts in a manner peculiar to himself -and your Sustainer is fully aware as to who has chosen the best path.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2113","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2113.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2113.mp3"]}},{"no":85,"arab":"وَيَسْأَلُونَكَ عَنِ الرُّوحِ ۖ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُمْ مِنَ الْعِلْمِ إِلَّا قَلِيلًا","latin":"wayas-aluunaka 'ani alrruuhi quli alrruuhu min amri rabbii wamaa uutiitum mina al'ilmi illaa qaliilaan","translate":{"id":"Dan mereka bertanya kepadamu tentang roh. Katakanlah: \"Roh itu termasuk urusan Tuhan-ku, dan tidaklah kamu diberi pengetahuan melainkan sedikit\".\n","en":"AND THEY will ask thee about [the nature of] divine inspiration. Say: \"This inspiration [comes] at my Sustainer's behest; and [you cannot understand its nature, O men, since] you have been granted very little of [real] knowledge.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2114","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2114.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2114.mp3"]}},{"no":86,"arab":"وَلَئِنْ شِئْنَا لَنَذْهَبَنَّ بِالَّذِي أَوْحَيْنَا إِلَيْكَ ثُمَّ لَا تَجِدُ لَكَ بِهِ عَلَيْنَا وَكِيلًا","latin":"wala-in syi/naa lanadzhabanna bialladzii awhaynaa ilayka tsumma laa tajidu laka bihi 'alaynaa wakiilaan","translate":{"id":"Dan sesungguhnya jika Kami menghendaki, niscaya Kami lenyapkan apa yang telah Kami wahyukan kepadamu, dan dengan pelenyapan itu, kamu tidak akan mendapatkan seorang pembelapun terhadap Kami,\n","en":"And if We so willed, We could indeed take away whatever We have revealed unto thee, and in that [state of need] thou wouldst find none to plead in thy behalf before Us."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2115","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2115.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2115.mp3"]}},{"no":87,"arab":"إِلَّا رَحْمَةً مِنْ رَبِّكَ ۚ إِنَّ فَضْلَهُ كَانَ عَلَيْكَ كَبِيرًا","latin":"illaa rahmatan min rabbika inna fadhlahu kaana 'alayka kabiiraan","translate":{"id":"kecuali karena rahmat dari Tuhanmu. Sesungguhnya karunia-Nya atasmu adalah besar.\n","en":"[Thou art spared] only by thy Sustainer's grace: behold, His favour towards thee is great indeed!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2116","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2116.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2116.mp3"]}},{"no":88,"arab":"قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَىٰ أَنْ يَأْتُوا بِمِثْلِ هَٰذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا","latin":"qul la-ini ijtama'ati al-insu waaljinnu 'alaa an ya/tuu bimitsli haadzaa alqur-aani laa ya/tuuna bimitslihi walaw kaana ba'dhuhum liba'dhin zhahiiraan","translate":{"id":"Katakanlah: \"Sesungguhnya jika manusia dan jin berkumpul untuk membuat yang serupa Al Qur'an ini, niscaya mereka tidak akan dapat membuat yang serupa dengan dia, sekalipun sebagian mereka menjadi pembantu bagi sebagian yang lain\".\n","en":"Say: \"If all mankind and all invisible beings would come together with a view to producing the like of this Qur'an, they could not produce its like even though they were to exert all their strength in aiding one another!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2117","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2117.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2117.mp3"]}},{"no":89,"arab":"وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ فَأَبَىٰ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا","latin":"walaqad sharrafnaa lilnnaasi fii haadzaa alqur-aani min kulli matsalin fa-abaa aktsaru alnnaasi illaa kufuuraan","translate":{"id":"Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam Al Qur'an ini tiap-tiap macam perumpamaan, tapi kebanyakan manusia tidak menyukai kecuali mengingkari (nya).\n","en":"For, indeed, many facets have We given in this Qur'an to every kind of lesson [designed] for [the benefit of] mankind! However, most men are unwilling to accept anything but blasphemy"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2118","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2118.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2118.mp3"]}},{"no":90,"arab":"وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّىٰ تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا","latin":"waqaaluu lan nu/mina laka hattaa tafjura lanaa mina al-ardhi yanbuu'aan","translate":{"id":"Dan mereka berkata: \"Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami,\n","en":"and so they say: \"[O Muhammad,] we shall not believe thee till thou cause a spring to gush forth for us from the earth,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2119","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2119.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2119.mp3"]}},{"no":91,"arab":"أَوْ تَكُونَ لَكَ جَنَّةٌ مِنْ نَخِيلٍ وَعِنَبٍ فَتُفَجِّرَ الْأَنْهَارَ خِلَالَهَا تَفْجِيرًا","latin":"aw takuuna laka jannatun min nakhiilin wa'inabin fatufajjira al-anhaara khilaalahaa tafjiiraan","translate":{"id":"atau kamu mempunyai sebuah kebun korma dan anggur, lalu kamu alirkan sungai-sungai di celah kebun yang deras alirannya,\n","en":"or thou have a garden of date-palms and vines and cause rivers to gush forth in their midst in a sudden rush,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2120","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2120.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2120.mp3"]}},{"no":92,"arab":"أَوْ تُسْقِطَ السَّمَاءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلَائِكَةِ قَبِيلًا","latin":"aw tusqitha alssamaa-a kamaa za'amta 'alaynaa kisafan aw ta/tiya biallaahi waalmalaa-ikati qabiilaan","translate":{"id":"atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan atau kamu datangkan Allah dan malaikat-malaikat berhadapan muka dengan kami.\n","en":"or thou cause the skies to fall down upon us in smithereens, as thou hast threatened, or [till] thou bring God and the angels face to face before us,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2121","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2121.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2121.mp3"]}},{"no":93,"arab":"أَوْ يَكُونَ لَكَ بَيْتٌ مِنْ زُخْرُفٍ أَوْ تَرْقَىٰ فِي السَّمَاءِ وَلَنْ نُؤْمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيْنَا كِتَابًا نَقْرَؤُهُ ۗ قُلْ سُبْحَانَ رَبِّي هَلْ كُنْتُ إِلَّا بَشَرًا رَسُولًا","latin":"aw yakuuna laka baytun min zukhrufin aw tarqaa fii alssamaa-i walan nu/mina liruqiyyika hattaa tunazzila 'alaynaa kitaaban naqrauhu qul subhaana rabbii hal kuntu illaa basyaran rasuulaan","translate":{"id":"Atau kamu mempunyai sebuah rumah dari emas, atau kamu naik ke langit. Dan kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah kitab yang kami baca\". Katakanlah: \"Maha Suci Tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul?\"\n","en":"or thou have a house [made] of gold, or thou ascend to heaven - but nay, we would not [even] believe in thy ascension unless thou bring down to us [from heaven] a writing which we [ourselves] could read! Say thou, [O Prophet:] \"Limitless in His glory is my Sustainer! Am I, then, aught but a mortal man, an apostle?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2122","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2122.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2122.mp3"]}},{"no":94,"arab":"وَمَا مَنَعَ النَّاسَ أَنْ يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَىٰ إِلَّا أَنْ قَالُوا أَبَعَثَ اللَّهُ بَشَرًا رَسُولًا","latin":"wamaa mana'a alnnaasa an yu/minuu idz jaa-ahumu alhudaa illaa an qaaluu aba'atsa allaahu basyaran rasuulaan","translate":{"id":"Dan tidak ada sesuatu yang menghalangi manusia untuk beriman tatkala datang petunjuk kepadanya, kecuali perkataan mereka: \"Adakah Allah mengutus seorang manusia menjadi rasul?\"\n","en":"Yet whenever [God's] guidance came to them [through a prophet,] nothing has ever kept people from believing [in him] save this their objection: \"Would God have sent a [mere] mortal man as His apostle?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2123","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2123.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2123.mp3"]}},{"no":95,"arab":"قُلْ لَوْ كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِمْ مِنَ السَّمَاءِ مَلَكًا رَسُولًا","latin":"qul law kaana fii al-ardhi malaa-ikatun yamsyuuna muthma-inniina lanazzalnaa 'alayhim mina alssamaa-i malakan rasuulaan","translate":{"id":"Katakanlah: \"Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi, niscaya Kami turunkan dari langit kepada mereka seorang malaikat menjadi rasul\".\n","en":"Say: \"If angels were walking about on earth as their natural abode, We would indeed have sent down unto them an angel out of heaven as Our apostle.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2124","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2124.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2124.mp3"]}},{"no":96,"arab":"قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ ۚ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا","latin":"qul kafaa biallaahi syahiidan baynii wabaynakum innahu kaana bi'ibaadihi khabiiran bashiiraan","translate":{"id":"Katakanlah: \"Cukuplah Allah menjadi saksi antara aku dan kamu sekalian. Sesungguhnya Dia adalah Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya\".\n","en":"Say: \"None can bear witness between me and you as God does: verily, fully aware is He of His creatures, and He sees all [that is in their hearts].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2125","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2125.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2125.mp3"]}},{"no":97,"arab":"وَمَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ ۖ وَمَنْ يُضْلِلْ فَلَنْ تَجِدَ لَهُمْ أَوْلِيَاءَ مِنْ دُونِهِ ۖ وَنَحْشُرُهُمْ يَوْمَ الْقِيَامَةِ عَلَىٰ وُجُوهِهِمْ عُمْيًا وَبُكْمًا وَصُمًّا ۖ مَأْوَاهُمْ جَهَنَّمُ ۖ كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا","latin":"waman yahdi allaahu fahuwa almuhtadi waman yudhlil falan tajida lahum awliyaa-a min duunihi wanahsyuruhum yawma alqiyaamati 'alaa wujuuhihim 'umyan wabukman washumman ma/waahum jahannamu kullamaa khabat zidnaahum sa'iiraan","translate":{"id":"Dan barangsiapa yang ditunjuki Allah, dialah yang mendapat petunjuk dan barangsiapa yang Dia sesatkan maka sekali-kali kamu tidak akan mendapat penolong-penolong bagi mereka selain dari Dia. Dan Kami akan mengumpulkan mereka pada hari kiamat (diseret) atas muka mereka dalam keadaan buta, bisu dan pekak. Tempat kediaman mereka adalah neraka jahannam. Tiap-tiap kali nyala api Jahannam itu akan padam, Kami tambah lagi bagi mereka nyalanya.\n","en":"And he whom God guides, he alone has found the right way; whereas for those whom He lets go astray thou canst never find anyone to protect them from Him: and [so, when] We shall gather them together on the Day of Resurrection, [they will lie] prone upon their faces, blind and dumb and deaf, with hell as their goal; [and] every time [the fire] abates, We shall increase for them [its] blazing flame."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2126","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2126.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2126.mp3"]}},{"no":98,"arab":"ذَٰلِكَ جَزَاؤُهُمْ بِأَنَّهُمْ كَفَرُوا بِآيَاتِنَا وَقَالُوا أَإِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا","latin":"dzaalika jazaauhum bi-annahum kafaruu bi-aayaatinaa waqaaluu a-idzaa kunnaa 'izhaaman warufaatan a-innaa lamab'uutsuuna khalqan jadiidaan","translate":{"id":"Itulah balasan bagi mereka, karena sesungguhnya mereka kafir kepada ayat-ayat Kami dan (karena mereka) berkata: \"Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru?\"\n","en":"Such will be their requital for having rejected Our messages and having said, \"After we will have become bones and dust, shall we, forsooth, be raised from the dead in a new act of creation?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2127","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2127.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2127.mp3"]}},{"no":99,"arab":"أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ قَادِرٌ عَلَىٰ أَنْ يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلًا لَا رَيْبَ فِيهِ فَأَبَى الظَّالِمُونَ إِلَّا كُفُورًا","latin":"awa lam yaraw anna allaaha alladzii khalaqa alssamaawaati waal-ardha qaadirun 'alaa an yakhluqa mitslahum waja'ala lahum ajalan laa rayba fiihi fa-abaa alzhzhaalimuuna illaa kufuuraan","translate":{"id":"Dan apakah mereka tidak memperhatikan bahwasanya Allah yang menciptakan langit dan bumi adalah kuasa (pula) menciptakan yang serupa dengan mereka, dan telah menetapkan waktu yang tertentu bagi mereka yang tidak ada keraguan padanya? Maka orang-orang zalim itu tidak menghendaki kecuali kekafiran.\n","en":"Are they, then, not aware that God, who has created the heavens and the earth, has the power to create them anew in their own likeness, having, beyond any doubt, set a term for their resurrection? However, all [such] evildoers are unwilling to accept anything but blasphemy!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2128","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2128.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2128.mp3"]}},{"no":100,"arab":"قُلْ لَوْ أَنْتُمْ تَمْلِكُونَ خَزَائِنَ رَحْمَةِ رَبِّي إِذًا لَأَمْسَكْتُمْ خَشْيَةَ الْإِنْفَاقِ ۚ وَكَانَ الْإِنْسَانُ قَتُورًا","latin":"qul law antum tamlikuuna khazaa-ina rahmati rabbii idzan la-amsaktum khasyyata al-infaaqi wakaana al-insaanu qatuuraan","translate":{"id":"Katakanlah: \"Kalau seandainya kamu menguasai perbendaharaan-perbendaharaan rahmat Tuhanku, niscaya perbendaharaan itu kamu tahan, karena takut membelanjakannya\". Dan adalah manusia itu sangat kikir.\n","en":"Say: \"If you were to own' all the treasure-houses of my Sustainer's bounty, lo! you would still try to hold on [to them] tightly for fear of spending [too much]: for man has always been avaricious [whereas God is limitless in His bounty]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2129","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2129.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2129.mp3"]}},{"no":101,"arab":"وَلَقَدْ آتَيْنَا مُوسَىٰ تِسْعَ آيَاتٍ بَيِّنَاتٍ ۖ فَاسْأَلْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُمْ فَقَالَ لَهُ فِرْعَوْنُ إِنِّي لَأَظُنُّكَ يَا مُوسَىٰ مَسْحُورًا","latin":"walaqad aataynaa muusaa tis'a aayaatin bayyinaatin fais-al banii israa-iila idz jaa-ahum faqaala lahu fir'awnu innii la-azhunnuka yaa muusaa mashuuraan","translate":{"id":"Dan sesungguhnya Kami telah memberikan kepada Musa sembilan buah mu'jizat yang nyata , maka tanyakanlah kepada Bani Israil, tatkala Musa datang kepada mereka lalu Fir'aun berkata kepadanya: \"Sesungguhnya aku sangka kamu, hai Musa, seorang yang kena sihir\".\n","en":"AND, INDEED, We gave unto Moses nine clear messages. Ask, then, the children of Israel [to tell thee what happened] when he came unto them, [and appealed to Pharaoh,] and Pharaoh said unto him, \"Verily, O Moses, I think that thou art full of sorcery!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2130","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2130.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2130.mp3"]}},{"no":102,"arab":"قَالَ لَقَدْ عَلِمْتَ مَا أَنْزَلَ هَٰؤُلَاءِ إِلَّا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ بَصَائِرَ وَإِنِّي لَأَظُنُّكَ يَا فِرْعَوْنُ مَثْبُورًا","latin":"qaala laqad 'alimta maa anzala haaulaa-i illaa rabbu alssamaawaati waal-ardhi bashaa-ira wa-innii la-azhunnuka yaa fir'awnu matsbuuraan","translate":{"id":"Musa menjawab: \"Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mu'jizat-mu'jizat itu kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata; dan sesungguhnya aku mengira kamu, hai Fir'aun, seorang yang akan binasa\".\n","en":"Answered [Moses]: \"Thou knowest well that none but the Sustainer of the heavens and the earth has bestowed these [miraculous signs] from on high, as a means of insight [for thee]; and, verily, O Pharaoh, [since thou hast chosen to reject them;] I think that thou art utterly lost!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2131","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2131.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2131.mp3"]}},{"no":103,"arab":"فَأَرَادَ أَنْ يَسْتَفِزَّهُمْ مِنَ الْأَرْضِ فَأَغْرَقْنَاهُ وَمَنْ مَعَهُ جَمِيعًا","latin":"fa-araada an yastafizzahum mina al-ardhi fa-aghraqnaahu waman ma'ahu jamii'aan","translate":{"id":"Kemudian (Fir'aun) hendak mengusir mereka (Musa dan pengikut-pengikutnya) dari bumi (Mesir) itu, maka Kami tenggelamkan dia (Fir'aun) serta orang-orang yang bersama-sama dia seluruhnya,\n","en":"And then Pharaoh resolved to wipe them off [the face of] the earth - whereupon We caused him and all who were with him to drown [in the sea]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2132","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2132.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2132.mp3"]}},{"no":104,"arab":"وَقُلْنَا مِنْ بَعْدِهِ لِبَنِي إِسْرَائِيلَ اسْكُنُوا الْأَرْضَ فَإِذَا جَاءَ وَعْدُ الْآخِرَةِ جِئْنَا بِكُمْ لَفِيفًا","latin":"waqulnaa min ba'dihi libanii israa-iila uskunuu al-ardha fa-idzaa jaa-a wa'du al-aakhirati ji/naa bikum lafiifaan","translate":{"id":"dan Kami berfirman sesudah itu kepada Bani Israil: \"Diamlah di negeri ini, maka apabila datang masa berbangkit, niscaya Kami datangkan kamu dalam keadaan bercampur baur (dengan musuhmu)\".\n","en":"And after that We said unto the children of Israel: \"Dwell now securely on earth - but [remember that] when the promise of the Last Day shall come to pass, We will bring you forth as [parts of] a motley crowd!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2133","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2133.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2133.mp3"]}},{"no":105,"arab":"وَبِالْحَقِّ أَنْزَلْنَاهُ وَبِالْحَقِّ نَزَلَ ۗ وَمَا أَرْسَلْنَاكَ إِلَّا مُبَشِّرًا وَنَذِيرًا","latin":"wabialhaqqi anzalnaahu wabialhaqqi nazala wamaa arsalnaaka illaa mubasysyiran wanadziiraan","translate":{"id":"Dan Kami turunkan (Al Qur'an) itu dengan sebenar-benarnya dan Al Qur'an itu telah turun dengan (membawa) kebenaran. Dan Kami tidak mengutus kamu, melainkan sebagai pembawa berita gembira dan pemberi peringatan.\n","en":"AND AS a guide towards the truth have We bestowed this [revelation] from on high; with this [very] truth has it come down [unto thee, O Prophet]: for We have sent thee but as a herald of glad tidings and a warner,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2134","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2134.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2134.mp3"]}},{"no":106,"arab":"وَقُرْآنًا فَرَقْنَاهُ لِتَقْرَأَهُ عَلَى النَّاسِ عَلَىٰ مُكْثٍ وَنَزَّلْنَاهُ تَنْزِيلًا","latin":"waqur-aanan faraqnaahu litaqra-ahu 'alaa alnnaasi 'alaa muktsin wanazzalnaahu tanziilaan","translate":{"id":"Dan Al Qur'an itu telah Kami turunkan dengan berangsur-angsur agar kamu membacakannya perlahan-lahan kepada manusia dan Kami menurunkannya bagian demi bagian.\n","en":"[bearing] a discourse which We have gradually unfolded, so that thou might read it out to mankind by stages, seeing that We have bestowed it from on high step by step, as [one] revelation."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2135","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2135.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2135.mp3"]}},{"no":107,"arab":"قُلْ آمِنُوا بِهِ أَوْ لَا تُؤْمِنُوا ۚ إِنَّ الَّذِينَ أُوتُوا الْعِلْمَ مِنْ قَبْلِهِ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا","latin":"qul aaminuu bihi aw laa tu/minuu inna alladziina uutuu al'ilma min qablihi idzaa yutlaa 'alayhim yakhirruuna lil-adzqaani sujjadaan","translate":{"id":"Katakanlah: \"Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Qur'an dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,\n","en":"Say: \"Believe in it or do not believe.\" Behold, those who are already endowed with [innate] knowledge fall down upon their faces in prostration as soon as this [divine writ] is conveyed unto them,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2136","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2136.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2136.mp3"]}},{"no":108,"arab":"وَيَقُولُونَ سُبْحَانَ رَبِّنَا إِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا","latin":"wayaquuluuna subhaana rabbinaa in kaana wa'du rabbinaa lamaf'uulaan","translate":{"id":"dan mereka berkata: \"Maha Suci Tuhan kami, sesungguhnya janji Tuhan kami pasti dipenuhi\".\n","en":"and say, \"Limitless in His glory is our Sustainer! Verily, our Sustainer's promise has been fulfilled!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2137","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2137.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2137.mp3"]}},{"no":109,"arab":"وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا ۩","latin":"wayakhirruuna lil-adzqaani yabkuuna wayaziiduhum khusyuu'aan","translate":{"id":"Dan mereka menyungkur atas muka mereka sambil menangis dan mereka bertambah khusyu'.\n","en":"And so they fall down upon their faces, weeping, and [their consciousness of God's grace] increases their humility."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2138","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2138.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2138.mp3"]}},{"no":110,"arab":"قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ ۖ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا","latin":"quli ud'uu allaaha awi ud'uu alrrahmaana ayyan maa tad'uu falahu al-asmaau alhusnaa walaa tajhar bishalaatika walaa tukhaafit bihaa waibtaghi bayna dzaalika sabiilaan","translate":{"id":"Katakanlah: \"Serulah Allah atau serulah Ar-Rahman. Dengan nama yang mana saja kamu seru, Dia mempunyai al asmaaul husna (nama-nama yang terbaik) dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya dan carilah jalan tengah di antara kedua itu\".\n","en":"Say: \"Invoke God, or invoke the Most Gracious: by whichever name you invoke Him, [He is always the One-for] His are all the attributes of perfection. And [pray unto Him; yet] be not too loud in thy prayer nor speak it in too low a voice, but follow a way in-between;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2139","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2139.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2139.mp3"]}},{"no":111,"arab":"وَقُلِ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ ۖ وَكَبِّرْهُ تَكْبِيرًا","latin":"waquli alhamdu lillaahi alladzii lam yattakhidz waladan walam yakun lahu syariikun fii almulki walam yakun lahu waliyyun mina aldzdzulli wakabbirhu takbiiraan","translate":{"id":"Dan katakanlah: \"Segala puji bagi Allah Yang tidak mempunyai anak dan tidak mempunyai sekutu dalam kerajaan-Nya dan Dia bukan pula hina yang memerlukan penolong dan agungkanlah Dia dengan pengagungan yang sebesar-besarnya.\n","en":"and say: \"All praise is due to God, who begets no offspring, and has no partner in His dominion, and has no weakness, and therefore no need of any aid\" -and [thus] extol His limitless greatness."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2140","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2140.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2140.mp3"]}}]}