{"alquran":{"no":18,"name":"Al-Kahf","arab":"الكهف","start":2140,"count":110,"rukku":12,"type":"mecca","description":"Surat  ini terdiri atas 110 ayat, termasuk  golongan  surat-surat Makkiyyah. Dinamai <i>Al-Kahfi</i> artinya <i>Gua</i> dan <i>Ashhabul Kahfi</i> yang artinya <i>Penghuni-Penghuni Gua</i>. Kedua nama ini diambil dari cerita yang terdapat dalam surat ini pada ayat 9 sampai dengan 26, tentang beberapa orang pemuda yang tidur dalam gua bertahun-tahun lamanya. Selain cerita tersebut, terdapat pula beberapa buah cerita dalam surat ini, yang kesemuanya mengandung i'tibar dan pelajaran-pelajaran yang amat berguna bagi kehidupan manusia. Banyak hadist-hadist Rasulullah s.a.w. yang menyatakan keutamaan membaca surat ini."},"surah":[{"no":1,"arab":" الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلَىٰ عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَلْ لَهُ عِوَجًا ۜ","latin":"alhamdu lillaahi alladzii anzala 'alaa 'abdihi alkitaaba walam yaj'al lahu 'iwajaan","translate":{"id":"Segala puji bagi Allah yang telah menurunkan kepada hamba-Nya Al Kitab (Al-Qur'an) dan Dia tidak mengadakan kebengkokan di dalamnya;\n","en":"ALL PRAISE is due to God, who has bestowed. this divine writ from on high upon His servant, and has not allowed any deviousness to obscure its meaning:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2141","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2141.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2141.mp3"]}},{"no":2,"arab":"قَيِّمًا لِيُنْذِرَ بَأْسًا شَدِيدًا مِنْ لَدُنْهُ وَيُبَشِّرَ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا حَسَنًا","latin":"qayyiman liyundzira ba/san syadiidan min ladunhu wayubasysyira almu/miniina alladziina ya'maluuna alshshaalihaati anna lahum ajran hasanaan","translate":{"id":"sebagai bimbingan yang lurus, untuk memperingatkan siksaan yang sangat pedih dari sisi Allah dan memberi berita gembira kepada orang-orang yang beriman, yang mengerjakan amal saleh, bahwa mereka akan mendapat pembalasan yang baik,\n","en":"[a divine writ] unerringly straight, meant to warn [the godless] of a severe punishment from Him, and to give unto the believers who do good works the glad tiding that theirs shall be a goodly reward-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2142","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2142.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2142.mp3"]}},{"no":3,"arab":"مَاكِثِينَ فِيهِ أَبَدًا","latin":"maakitsiina fiihi abadaan","translate":{"id":"mereka kekal di dalamnya untuk selama-lamanya.\n","en":"[a state of bliss] in which they. shall dwell beyond the count of time."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2143","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2143.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2143.mp3"]}},{"no":4,"arab":"وَيُنْذِرَ الَّذِينَ قَالُوا اتَّخَذَ اللَّهُ وَلَدًا","latin":"wayundzira alladziina qaaluu ittakhadza allaahu waladaan","translate":{"id":"Dan untuk memperingatkan kepada orang-orang yang berkata: \"Allah mengambil seorang anak.\"\n","en":"Furthermore, [this divine writ is meant] to warn all those who assert, \"God has taken unto Himself a son.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2144","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2144.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2144.mp3"]}},{"no":5,"arab":"مَا لَهُمْ بِهِ مِنْ عِلْمٍ وَلَا لِآبَائِهِمْ ۚ كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ أَفْوَاهِهِمْ ۚ إِنْ يَقُولُونَ إِلَّا كَذِبًا","latin":"maa lahum bihi min 'ilmin walaa li-aabaa-ihim kaburat kalimatan takhruju min afwaahihim in yaquuluuna illaa kadzibaan","translate":{"id":"Mereka sekali-kali tidak mempunyai pengetahuan tentang hal itu, begitu pula nenek moyang mereka. Alangkah buruknya kata-kata yang keluar dari mulut mereka; mereka tidak mengatakan (sesuatu) kecuali dusta.\n","en":"No knowledge whatever have they of Him, and neither had their forefathers: dreadful -is this saying that comes out of their mouths, [and] nothing but falsehood do they utter!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2145","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2145.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2145.mp3"]}},{"no":6,"arab":"فَلَعَلَّكَ بَاخِعٌ نَفْسَكَ عَلَىٰ آثَارِهِمْ إِنْ لَمْ يُؤْمِنُوا بِهَٰذَا الْحَدِيثِ أَسَفًا","latin":"fala'allaka baakhi'un nafsaka 'alaa aatsaarihim in lam yu/minuu bihaadzaa alhadiitsi asafaan","translate":{"id":"Maka (apakah) barangkali kamu akan membunuh dirimu karena bersedih hati setelah mereka berpaling, sekiranya mereka tidak beriman kepada keterangan ini (Al-Qur'an).\n","en":"But wouldst thou, perhaps, torment thyself to death with grief over them if they are not willing to believe in this message?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2146","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2146.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2146.mp3"]}},{"no":7,"arab":"إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَهَا لِنَبْلُوَهُمْ أَيُّهُمْ أَحْسَنُ عَمَلًا","latin":"innaa ja'alnaa maa 'alaa al-ardhi ziinatan lahaa linabluwahum ayyuhum ahsanu 'amalaan","translate":{"id":"Sesungguhnya Kami telah menjadikan apa yang di bumi sebagai perhiasan baginya, agar Kami menguji mereka siapakah di antara mereka yang terbaik perbuatannya.\n","en":"Behold, We have willed that all beauty on earth be a means by which We put men to a test, [showing] which of them are best in conduct;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2147","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2147.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2147.mp3"]}},{"no":8,"arab":"وَإِنَّا لَجَاعِلُونَ مَا عَلَيْهَا صَعِيدًا جُرُزًا","latin":"wa-innaa lajaa'iluuna maa 'alayhaa sha'iidan juruzaan","translate":{"id":"Dan sesungguhnya Kami benar-benar akan menjadikan (pula) apa yang di atasnya menjadi tanah rata lagi tandus.\n","en":"and, verily, [in time] We shall reduce all that is on it to barren dust!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2148","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2148.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2148.mp3"]}},{"no":9,"arab":"أَمْ حَسِبْتَ أَنَّ أَصْحَابَ الْكَهْفِ وَالرَّقِيمِ كَانُوا مِنْ آيَاتِنَا عَجَبًا","latin":"am hasibta anna ash-haaba alkahfi waalrraqiimi kaanuu min aayaatinaa 'ajabaan","translate":{"id":"Atau kamu mengira bahwa orang-orang yang mendiami gua dan (yang mempunyai) raqim itu, mereka termasuk tanda-tanda kekuasaan Kami yang mengherankan?\n","en":"[AND SINCE the life of this world is but a test, dost thou [really] think that [the parable of] the Men of the Cave and of [their devotion to] the scriptures could be deemed more wondrous than any [other] of Our messages?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2149","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2149.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2149.mp3"]}},{"no":10,"arab":"إِذْ أَوَى الْفِتْيَةُ إِلَى الْكَهْفِ فَقَالُوا رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا","latin":"idz awaa alfityatu ilaa alkahfi faqaaluu rabbanaa aatinaa min ladunka rahmatan wahayyi/ lanaa min amrinaa rasyadaan ","translate":{"id":"(Ingatlah) tatkala para pemuda itu mencari tempat berlindung ke dalam gua, lalu mereka berdo'a: \"Wahai Tuhan kami, berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami (ini).\"\n","en":"When those youths took refuge in the cave, they prayed: \"O our Sustainer! Bestow on us grace from Thyself, and endow us, whatever our [outward] condition, with consciousness of what is right!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2150","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2150.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2150.mp3"]}},{"no":11,"arab":"فَضَرَبْنَا عَلَىٰ آذَانِهِمْ فِي الْكَهْفِ سِنِينَ عَدَدًا","latin":"fadharabnaa 'alaa aatsaanihim fii alkahfi siniina 'adadaan","translate":{"id":"Maka Kami tutup telinga mereka beberapa tahun dalam gua itu ,\n","en":"And thereupon We veiled their ears in the cave for many a year,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2151","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2151.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2151.mp3"]}},{"no":12,"arab":"ثُمَّ بَعَثْنَاهُمْ لِنَعْلَمَ أَيُّ الْحِزْبَيْنِ أَحْصَىٰ لِمَا لَبِثُوا أَمَدًا","latin":"tsumma ba'atsnaahum lina'lama ayyu alhizbayni ahsaa limaa labitsuu amadaan","translate":{"id":"Kemudian Kami bangunkan mereka, agar Kami mengetahui manakah di antara kedua golongan itu yang lebih tepat dalam menghitung berapa lama mereka tinggal (dalam gua itu).\n","en":"and then We awakened Christianity was no longer persecuted and had even become the official religion of the Roman Empire. The ancient coin (dating from the reign of Decius) with which the young man wanted to pay for his purchases immediately aroused curiosity; people began to question the stranger, and the story of the Men of the Cave and their miraculous sleep came to light. them: [and We did all this] so that We might mark out [to the world] which of the two points of view showed a better comprehension of the time-span during which they had remained in this state."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2152","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2152.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2152.mp3"]}},{"no":13,"arab":"نَحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُمْ بِالْحَقِّ ۚ إِنَّهُمْ فِتْيَةٌ آمَنُوا بِرَبِّهِمْ وَزِدْنَاهُمْ هُدًى","latin":"nahnu naqushshu 'alayka naba-ahum bialhaqqi innahum fityatun aamanuu birabbihim wazidnaahum hudaan","translate":{"id":"Kami kisahkan kepadamu (Muhammad) cerita ini dengan benar. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka, dan Kami tambah pula untuk mereka petunjuk.\n","en":"[And now] We shall truly relate to thee their story: Behold, they were young men who had attained to faith in their Sustainer: and [so] We deepened their consciousness of the right way"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2153","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2153.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2153.mp3"]}},{"no":14,"arab":"وَرَبَطْنَا عَلَىٰ قُلُوبِهِمْ إِذْ قَامُوا فَقَالُوا رَبُّنَا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ لَنْ نَدْعُوَ مِنْ دُونِهِ إِلَٰهًا ۖ لَقَدْ قُلْنَا إِذًا شَطَطًا","latin":"warabathnaa 'alaa quluubihim idz qaamuu faqaaluu rabbunaa rabbu alssamaawaati waal-ardhi lan nad'uwa min duunihi ilaahan laqad qulnaa idzan syathathaan","translate":{"id":"Dan Kami meneguhkan hati mereka diwaktu mereka berdiri , lalu mereka pun berkata, \"Tuhan kami adalah Tuhan seluruh langit dan bumi; kami sekali-kali tidak menyeru Tuhan selain Dia, sesungguhnya kami kalau demikian telah mengucapkan perkataan yang amat jauh dari kebenaran\".\n","en":"and endowed their hearts with strength, so that they stood up and said [to one another]: \"Our Sustainer is the Sustainer of the heavens and the earth. Never shall we invoke any deity other than Him: [if we did,] we should indeed have uttered an enormity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2154","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2154.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2154.mp3"]}},{"no":15,"arab":"هَٰؤُلَاءِ قَوْمُنَا اتَّخَذُوا مِنْ دُونِهِ آلِهَةً ۖ لَوْلَا يَأْتُونَ عَلَيْهِمْ بِسُلْطَانٍ بَيِّنٍ ۖ فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا","latin":"haaulaa-i qawmunaa ittakhadzuu min duunihi aalihatan lawlaa ya/tuuna 'alayhim bisulthaanin bayyinin faman azhlamu mimmani iftaraa 'alaa allaahi kadzibaan","translate":{"id":"Kaum kami ini telah menjadikan selain Dia sebagai tuhan-tuhan (untuk disembah). Mengapa mereka tidak mengemukakan alasan yang terang (tentang kepercayaan mereka)? Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah?\n","en":"These people of ours have taken to worshipping [other] deities instead of Him, without being able to adduce any reasonable evidence in support of their beliefs; and who could be more wicked than he who invents a lie about God?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2155","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2155.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2155.mp3"]}},{"no":16,"arab":"وَإِذِ اعْتَزَلْتُمُوهُمْ وَمَا يَعْبُدُونَ إِلَّا اللَّهَ فَأْوُوا إِلَى الْكَهْفِ يَنْشُرْ لَكُمْ رَبُّكُمْ مِنْ رَحْمَتِهِ وَيُهَيِّئْ لَكُمْ مِنْ أَمْرِكُمْ مِرْفَقًا","latin":"wa-idzi i'tazaltumuuhum wamaa ya'buduuna illaa allaaha fa/wuu ilaa alkahfi yansyur lakum rabbukum min rahmatihi wayuhayyi/ lakum min amrikum mirfaqaan","translate":{"id":"Dan apabila kamu meninggalkan mereka dan apa yang mereka sembah selain Allah, maka carilah tempat berlindung ke dalam gua itu, niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu dan menyediakan sesuatu yang berguna bagimu dalam urusan kamu .\n","en":"Hence, now that you have withdrawn from them and from all that they worship instead of God, take refuge in that cave: God will spread His grace over you, and will endow you - whatever your [outward] condition - with all that your souls may need!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2156","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2156.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2156.mp3"]}},{"no":17,"arab":"وَتَرَى الشَّمْسَ إِذَا طَلَعَتْ تَزَاوَرُ عَنْ كَهْفِهِمْ ذَاتَ الْيَمِينِ وَإِذَا غَرَبَتْ تَقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِي فَجْوَةٍ مِنْهُ ۚ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ ۗ مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ ۖ وَمَنْ يُضْلِلْ فَلَنْ تَجِدَ لَهُ وَلِيًّا مُرْشِدًا","latin":"wataraa alsysyamsa idzaa thala'at tazaawaru 'an kahfihim dzaata alyamiini wa-idzaa gharabat taqridhuhum dzaata alsysyimaali wahum fii fajwatin minhu dzaalika min aayaati allaahi man yahdi allaahu fahuwa almuhtadi waman yudhlil falan tajida lahu waliyyan mursyidaan","translate":{"id":"Dan kamu akan melihat matahari ketika terbit, condong dari gua mereka ke sebelah kanan, dan bila matahari terbenam menjauhi mereka ke sebelah kiri sedang mereka berada dalam tempat yang luas dalam gua itu. Itu adalah sebagian dari tanda-tanda (kebesaran) Allah. Barangsiapa yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barangsiapa yang disesatkan-Nya, maka kamu tidak akan mendapatkan seorang pemimpinpun yang dapat memberi petunjuk kepadanya.\n","en":"And [for many a year] thou might have seen the sun, on its rising, incline away from their cave on the right, and, on its setting, turn aside from them on the left, while they lived on in that spacious chamber, [bearing witness to] this of God's messages: He whom God guides, he alone has found the right way; whereas for him whom He lets go astray thou canst never find any protector who would point out the right way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2157","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2157.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2157.mp3"]}},{"no":18,"arab":"وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ ۚ وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ ۖ وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ ۚ لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا","latin":"watahsabuhum ayqaatsan wahum ruquudun wanuqallibuhum dzaata alyamiini wadzaata alsysyimaali wakalbuhum baasithun dziraa'ayhi bialwashiidi lawi iththhala'ta 'alayhim lawallayta minhum firaaran walamuli/ta minhum ru'baan","translate":{"id":"Dan kamu mengira mereka itu bangun, padahal mereka tidur; Dan kami balik-balikkan mereka ke kanan dan ke kiri, sedang anjing mereka mengunjurkan kedua lengannya di muka pintu gua. Dan jika kamu menyaksikan mereka tentulah kamu akan berpaling dari mereka dengan melarikan diri dan tentulah (hati) kamu akan dipenuhi oleh ketakutan terhadap mereka.\n","en":"And thou wouldst have thought that they were awake, whereas they lay asleep. And We caused them to turn over repeatedly, now to the right, now to the left; and their dog [lay] on the threshold, its forepaws outstretched. Hadst thou come upon them [unprepared], thou wouldst surely have turned away from them in flight, and wouldst surely have been filled with awe of them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2158","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2158.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2158.mp3"]}},{"no":19,"arab":"وَكَذَٰلِكَ بَعَثْنَاهُمْ لِيَتَسَاءَلُوا بَيْنَهُمْ ۚ قَالَ قَائِلٌ مِنْهُمْ كَمْ لَبِثْتُمْ ۖ قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ ۚ قَالُوا رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ فَابْعَثُوا أَحَدَكُمْ بِوَرِقِكُمْ هَٰذِهِ إِلَى الْمَدِينَةِ فَلْيَنْظُرْ أَيُّهَا أَزْكَىٰ طَعَامًا فَلْيَأْتِكُمْ بِرِزْقٍ مِنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا","latin":"wakadzaalika ba'atsnaahum liyatasaa-aluu baynahum qaala qaa-ilun minhum kam labitstum qaaluu labitsnaa yawman aw ba'dha yawmin qaaluu rabbukum a'lamu bimaa labitstum faib'atsuu ahadakum biwariqikum haadzihi ilaa almadiinati falyanzhur ayyuhaa azkaa tha'aaman falya/tikum birizqin minhu walyatalaththhaf walaa yusy'iranna bikum ahadaan","translate":{"id":"Dan demikianlah Kami bangunkan mereka agar mereka saling bertanya di antara mereka sendiri. Berkatalah salah seorang di antara mereka: Sudah berapa lamakah kamu berada (disini?)\". Mereka menjawab: \"Kita berada (disini) sehari atau setengah hari\". Berkata (yang lain lagi): \"Tuhan kamu lebih mengetahui berapa lamanya kamu berada (di sini). Maka suruhlah salah seorang di antara kamu untuk pergi ke kota dengan membawa uang perakmu ini, dan hendaklah dia lihat manakah makanan yang lebih baik, maka hendaklah ia membawa makanan itu untukmu, dan hendaklah ia berlaku lemah-lembut dan janganlah sekali-kali menceritakan halmu kepada seorangpun.\n","en":"And so, [in the course of time,] We awakened them; and they began to ask one another [as to what had happened to them]. One of them asked: \"How long have you remained thus?\" [The others] answered: \"We have remained thus a day, or part of a day.\" Said they [who were endowed with deeper insight]: \"Your Sustainer knows best how long you have thus remained. Let, then, one of you go with these silver coins to the town, and let him find out what food is purest there, and bring you thereof [some] provisions. But let him behave with great care and by no means make anyone aware of you:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2159","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2159.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2159.mp3"]}},{"no":20,"arab":"إِنَّهُمْ إِنْ يَظْهَرُوا عَلَيْكُمْ يَرْجُمُوكُمْ أَوْ يُعِيدُوكُمْ فِي مِلَّتِهِمْ وَلَنْ تُفْلِحُوا إِذًا أَبَدًا","latin":"innahum in yazhharuu 'alaykum yarjumuukum aw yu'iiduukum fii millatihim walan tuflihuu idzan abadaan","translate":{"id":"Sesungguhnya jika mereka dapat mengetahui tempatmu, niscaya mereka akan melempar kamu dengan batu, atau memaksamu kembali kepada agama mereka, dan jika demikian niscaya kamu tidak akan beruntung selama lamanya\".\n","en":"for, behold, if they should come to know of you, they might stone you to death or force you back to their faith-in which case you would never attain to any good!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2160","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2160.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2160.mp3"]}},{"no":21,"arab":"وَكَذَٰلِكَ أَعْثَرْنَا عَلَيْهِمْ لِيَعْلَمُوا أَنَّ وَعْدَ اللَّهِ حَقٌّ وَأَنَّ السَّاعَةَ لَا رَيْبَ فِيهَا إِذْ يَتَنَازَعُونَ بَيْنَهُمْ أَمْرَهُمْ ۖ فَقَالُوا ابْنُوا عَلَيْهِمْ بُنْيَانًا ۖ رَبُّهُمْ أَعْلَمُ بِهِمْ ۚ قَالَ الَّذِينَ غَلَبُوا عَلَىٰ أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِمْ مَسْجِدًا","latin":"wakadzaalika a'tsarnaa 'alayhim liya'lamuu anna wa'da allaahi haqqun wa-anna alsaa'ata laa rayba fiihaa idz yatanaaza'uuna baynahum amrahum faqaaluu ibnuu 'alayhim bunyaanan rabbuhum a'lamu bihim qaala alladziina ghalabuu 'alaa amrihim lanattakhidzanna 'alayhim masjidaan","translate":{"id":"Dan demikian (pula) Kami mempertemukan (manusia) dengan mereka, agar manusia itu mengetahui, bahwa janji Allah itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya. Ketika orang-orang itu berselisih tentang urusan mereka , orang-orang itu berkata: \"Dirikan sebuah bangunan di atas (gua) mereka, Tuhan mereka lebih mengetahui tentang mereka\". Orang-orang yang berkuasa atas urusan mereka berkata: \"Sesungguhnya kami akan mendirikan sebuah rumah peribadatan di atasnya\".\n","en":"AND IN THIS way have We drawn [people's] attention to their story, so that they might know - whenever they debate among themselves as to what happened to those [Men of the Cave] that God's promise [of resurrection] is true, and that there can be no doubt as to [the coming of] the Last Hour. And so, some [people] said: \"Erect a building in their memory; God knows best what happened to them.\" Said they whose opinion prevailed in the end: \"Indeed, we must surely raise a house of worship in their memory!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2161","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2161.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2161.mp3"]}},{"no":22,"arab":"سَيَقُولُونَ ثَلَاثَةٌ رَابِعُهُمْ كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ ۖ وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ ۚ قُلْ رَبِّي أَعْلَمُ بِعِدَّتِهِمْ مَا يَعْلَمُهُمْ إِلَّا قَلِيلٌ ۗ فَلَا تُمَارِ فِيهِمْ إِلَّا مِرَاءً ظَاهِرًا وَلَا تَسْتَفْتِ فِيهِمْ مِنْهُمْ أَحَدًا","latin":"sayaquuluuna tsalaatsatun raabi'uhum kalbuhum wayaquuluuna khamsatun saadisuhum kalbuhum rajman bialghaybi wayaquuluuna sab'atun watsaaminuhum kalbuhum qul rabbii a'lamu bi'iddatihim maa ya'lamuhum illaa qaliilun falaa tumaari fiihim illaa miraa-an zhaahiran walaa tastafti fiihim minhum ahadaan","translate":{"id":"Nanti (ada orang yang akan) mengatakan (jumlah mereka) adalah tiga orang yang keempat adalah anjingnya, dan (yang lain) mengatakan: \"(jumlah mereka) adalah lima orang yang keenam adalah anjing nya\", sebagai terkaan terhadap barang yang gaib; dan (yang lain lagi) mengatakan: \"(jumlah mereka) tujuh orang, yang ke delapan adalah anjingnya\". Katakanlah: \"Tuhanku lebih mengetahui jumlah mereka; tidak ada orang yang mengetahui (bilangan) mereka kecuali sedikit\". Karena itu janganlah kamu (Muhammad) bertengkar tentang hal mereka, kecuali pertengkaran lahir saja dan jangan kamu menanyakan tentang mereka (pemuda-pemuda itu) kepada seorangpun di antara mereka.\n","en":"[And in times to come] some will say, \"[They were] three, the fourth of them being their dog,\" while others will say, \"Five, with their dog as the sixth of them\" -idly guessing at something of which they can have no knowledge -and [so on, until] some will say, \"[They were] seven, the eighth of them being their dog.\" Say: \"My Sustainer knows best how many they were. None but a few have any [real] knowledge of them. Hence, do not argue about them otherwise than by way of an obvious argument, and do not ask any of those [story-tellers] to enlighten thee about them.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2162","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2162.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2162.mp3"]}},{"no":23,"arab":"وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَٰلِكَ غَدًا","latin":"walaa taquulanna lisyay-in innii faa'ilun dzaalika ghadaan","translate":{"id":"Dan jangan sekali-kali kamu mengatakan tentang sesuatu: \"Sesungguhnya aku akan mengerjakan ini besok pagi,\n","en":"AND NEVER say about anything, \"Behold, I shall do this tomorrow,\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2163","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2163.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2163.mp3"]}},{"no":24,"arab":"إِلَّا أَنْ يَشَاءَ اللَّهُ ۚ وَاذْكُرْ رَبَّكَ إِذَا نَسِيتَ وَقُلْ عَسَىٰ أَنْ يَهْدِيَنِ رَبِّي لِأَقْرَبَ مِنْ هَٰذَا رَشَدًا","latin":"illaa an yasyaa-a allaahu waudzkur rabbaka idzaa nasiita waqul 'asaa an yahdiyani rabbii li-aqraba min haadzaa rasyadaan","translate":{"id":"kecuali (dengan menyebut): \"Insya Allah\" . Dan ingatlah kepada Tuhanmu jika kamu lupa dan katakanlah: \"Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya dari pada ini\".\n","en":"without (adding], \"if God so wills.\" And if thou shouldst forget [thyself at the time, and become aware of it later], call thy Sustainer to mind and say: \"I pray that my Sustainer guide me, even closer than this, to a consciousness of what is right!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2164","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2164.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2164.mp3"]}},{"no":25,"arab":"وَلَبِثُوا فِي كَهْفِهِمْ ثَلَاثَ مِائَةٍ سِنِينَ وَازْدَادُوا تِسْعًا","latin":"walabitsuu fii kahfihim tsalaatsa mi-atin siniina waizdaaduu tis'aan","translate":{"id":"Dan mereka tinggal dalam gua mereka tiga ratus tahun dan ditambah sembilan tahun (lagi).\n","en":"AND [some people assert], \"They remained in their cave three hundred years\"; and some have added nine [to that number]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2165","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2165.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2165.mp3"]}},{"no":26,"arab":"قُلِ اللَّهُ أَعْلَمُ بِمَا لَبِثُوا ۖ لَهُ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ ۖ أَبْصِرْ بِهِ وَأَسْمِعْ ۚ مَا لَهُمْ مِنْ دُونِهِ مِنْ وَلِيٍّ وَلَا يُشْرِكُ فِي حُكْمِهِ أَحَدًا","latin":"quli allaahu a'lamu bimaa labitsuu lahu ghaybu alssamaawaati waal-ardhi abshir bihi wa-asmi' maa lahum min duunihi min waliyyin walaa yusyriku fii hukmihi ahadaan","translate":{"id":"Katakanlah: \"Allah lebih mengetahui berapa lamanya mereka tinggal (di gua); kepunyaan-Nya-lah semua yang tersembunyi di langit dan di bumi. Alangkah terang penglihatan-Nya dan alangkah tajam pendengaran-Nya; tak ada seorang pelindungpun bagi mereka selain dari pada-Nya; dan Dia tidak mengambil seorangpun menjadi sekutu-Nya dalam menetapkan keputusan\".\n","en":"Say: \"God knows best how long they remained [there]. His [alone] is the knowledge of the hidden reality of the heavens and the earth: how well does He see and hear! No guardian have they apart from Him, since He allots to no one a share in His rule!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2166","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2166.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2166.mp3"]}},{"no":27,"arab":"وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِنْ كِتَابِ رَبِّكَ ۖ لَا مُبَدِّلَ لِكَلِمَاتِهِ وَلَنْ تَجِدَ مِنْ دُونِهِ مُلْتَحَدًا","latin":"wautlu maa uuhiya ilayka min kitaabi rabbika laa mubaddila likalimaatihi walan tajida min duunihi multahadaan","translate":{"id":"Dan bacakanlah apa yang diwahyukan kepadamu, yaitu kitab Tuhanmu (Al Qur'an). Tidak ada (seorangpun) yang dapat merobah kalimat-kalimat-Nya. Dan kamu tidak akan dapat menemukan tempat berlindung selain dari pada-Nya.\n","en":"AND CONVEY [to the world] whatever has been revealed to thee of thy Sustainer's writ. There is nothing that could alter His words; and thou canst find no refuge other than with Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2167","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2167.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2167.mp3"]}},{"no":28,"arab":"وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ ۖ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا ۖ وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَنْ ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا","latin":"waishbir nafsaka ma'a alladziina yad'uuna rabbahum bialghadaati waal'asyiyyi yuriiduuna wajhahu walaa ta'du 'aynaaka 'anhum turiidu ziinata alhayaati alddunyaa walaa tuthi' man aghfalnaa qalbahu 'an dzikrinaa waittaba'a hawaahu wakaana amruhu furuthaan","translate":{"id":"Dan bersabarlah kamu bersama-sama dengan orang-orang yang menyeru Tuhannya di pagi dan senja hari dengan mengharap keridhaan-Nya; dan janganlah kedua matamu berpaling dari mereka (karena) mengharapkan perhiasan dunia ini; dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingati Kami, serta menuruti hawa nafsunya dan adalah keadaannya itu melewati batas.\n","en":"And contain thyself in patience by the side of all who at morn and at evening invoke their Sustainer, seeking His countenance, and let not thine eyes pass beyond them in quest of the beauties of this world's life; and pay no heed to any whose heart We have rendered heedless of all remembrance of Us because he had always followed [only] his own desires, abandoning all that is good and true."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2168","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2168.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2168.mp3"]}},{"no":29,"arab":"وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ ۖ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ ۚ إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ ۚ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا","latin":"waquli alhaqqu min rabbikum faman syaa-a falyu/min waman syaa-a falyakfur innaa a'tadnaa lilzhzhaalimiina naaran ahatha bihim suraadiquhaa wa-in yastaghiitsuu yughaatsuu bimaa-in kaalmuhli yasywii alwujuuha bi/sa alsysyaraabu wasaa-at murtafaqaan","translate":{"id":"Dan katakanlah: \"Kebenaran itu datangnya dari Tuhanmu; maka barangsiapa yang ingin (beriman) hendaklah ia beriman, dan barangsiapa yang ingin (kafir) biarlah ia kafir\". Sesungguhnya Kami telah sediakan bagi orang orang zalim itu neraka, yang gejolaknya mengepung mereka. Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.\n","en":"And say: \"The truth [has now come] from your Sustainer: let, then, him who wills, believe in it, and let him who wills, reject it.\" Verily, for all who sin against themselves [by rejecting Our truth] We have readied a fire whose billowing folds will encompass them from all sides; and if they beg for water, they will be given water [hot] like molten lead, which will scald their faces: how dreadful a drink, and how evil a place to rest!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2169","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2169.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2169.mp3"]}},{"no":30,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ إِنَّا لَا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati innaa laa nudhii'u ajra man ahsana 'amalaan","translate":{"id":"Sesunggunya mereka yang beriman dan beramal saleh, tentulah Kami tidak akan menyia-nyiakan pahala orang-orang yang mengerjakan amalan(nya) dengan yang baik.\n","en":"[But,] behold, as for those who attain to faith and do righteous deeds-verily, We do not fail to requite any who persevere in doing good:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2170","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2170.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2170.mp3"]}},{"no":31,"arab":"أُولَٰئِكَ لَهُمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَيَلْبَسُونَ ثِيَابًا خُضْرًا مِنْ سُنْدُسٍ وَإِسْتَبْرَقٍ مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ ۚ نِعْمَ الثَّوَابُ وَحَسُنَتْ مُرْتَفَقًا","latin":"ulaa-ika lahum jannaatu 'adnin tajrii min tahtihimu al-anhaaru yuhallawna fiihaa min asaawira min dzahabin wayalbasuuna tsiyaaban khudhran min sundusin wa-istabraqin muttaki-iina fiihaa 'alaa al-araa-iki ni'ma altstsawaabu wahasunat murtafaqaan","translate":{"id":"Mereka itulah (orang-orang yang) bagi mereka surga 'Adn, mengalir sungai-sungai di bawahnya; dalam surga itu mereka dihiasi dengan gelang mas dan mereka memakai pakaian hijau dari sutera halus dan sutera tebal, sedang mereka duduk sambil bersandar di atas dipan-dipan yang indah. Itulah pahala yang sebaik-baiknya, dan tempat istirahat yang indah;\n","en":"theirs shall be gardens of perpetual bliss - [gardens] through which running waters flow - wherein they will be adorned with bracelets of gold and will wear green garments of silk and brocade, [and] wherein upon couches they will recline:\" how excellent a recompense, and how goodly a place to rest!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2171","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2171.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2171.mp3"]}},{"no":32,"arab":"وَاضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَابٍ وَحَفَفْنَاهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا","latin":"waidhrib lahum matsalan rajulayni ja'alnaa li-ahadihimaa jannatayni min a'naabin wahafafnaahumaa binakhlin waja'alnaa baynahumaa zar'aan","translate":{"id":"Dan berikanlah kepada mereka sebuah perumpamaan dua orang laki-laki , Kami jadikan bagi seorang di antara keduanya (yang kafir) dua buah kebun anggur dan kami kelilingi kedua kebun itu dengan pohon-pohon korma dan di antara kedua kebun itu Kami buatkan ladang.\n","en":"AND PROPOUND unto them the parable of two men, upon one of whom We had bestowed two vinyards, and surrounded them with date-palms, and placed a field of grain in-between."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2172","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2172.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2172.mp3"]}},{"no":33,"arab":"كِلْتَا الْجَنَّتَيْنِ آتَتْ أُكُلَهَا وَلَمْ تَظْلِمْ مِنْهُ شَيْئًا ۚ وَفَجَّرْنَا خِلَالَهُمَا نَهَرًا","latin":"kiltaa aljannatayni aatat ukulahaa walam tazhlim minhu syay-an wafajjarnaa khilaalahumaa naharaan","translate":{"id":"Kedua buah kebun itu menghasilkan buahnya, dan kebun itu tiada kurang buahnya sedikitpun, dan Kami alirkan sungai di celah-celah kedua kebun itu,\n","en":"Each of the two gardens yielded its produce and never failed therein in any way, for We had caused a stream to gush forth in the midst of each of them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2173","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2173.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2173.mp3"]}},{"no":34,"arab":"وَكَانَ لَهُ ثَمَرٌ فَقَالَ لِصَاحِبِهِ وَهُوَ يُحَاوِرُهُ أَنَا أَكْثَرُ مِنْكَ مَالًا وَأَعَزُّ نَفَرًا","latin":"wakaana lahu tsamarun faqaala lishaahibihi wahuwa yuhaawiruhu anaa aktsaru minka maalan wa-a'azzu nafaraan","translate":{"id":"dan dia mempunyai kekayaan besar, maka ia berkata kepada kawannya (yang mu'min) ketika bercakap-cakap dengan dia: \"Hartaku lebih banyak dari pada hartamu dan pengikut-pengikutku lebih kuat\"\n","en":"And so [the man] had fruit in abundance. And [one day] he said to his friend, bandying words with him, \"More wealth have I than thou, and mightier am I as regards [the number and power of my] followers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2174","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2174.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2174.mp3"]}},{"no":35,"arab":"وَدَخَلَ جَنَّتَهُ وَهُوَ ظَالِمٌ لِنَفْسِهِ قَالَ مَا أَظُنُّ أَنْ تَبِيدَ هَٰذِهِ أَبَدًا","latin":"wadakhala jannatahu wahuwa zhaalimun linafsihi qaala maa azhunnu an tabiida haadzihi abadaan","translate":{"id":"Dan dia memasuki kebunnya sedang dia zalim terhadap dirinya sendiri ; ia berkata: \"Aku kira kebun ini tidak akan binasa selama-lamanya,\n","en":"And having [thus] sinned against himself, he entered his garden, saying, \"I do not think that this will ever perish!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2175","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2175.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2175.mp3"]}},{"no":36,"arab":"وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُدِدْتُ إِلَىٰ رَبِّي لَأَجِدَنَّ خَيْرًا مِنْهَا مُنْقَلَبًا","latin":"wamaa azhunnu alssaa'ata qaa-imatan wala-in rudidtu ilaa rabbii la-ajidanna khayran minhaa munqalabaan","translate":{"id":"dan aku tidak mengira hari kiamat itu akan datang, dan jika sekiranya aku kembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali yang lebih baik dari pada kebun-kebun itu\".\n","en":"And neither do I think that the Last Hour will ever come. But even if [it should come, and] I am brought before my Sustainer, I will surely find something even better than this as [my last] resort!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2176","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2176.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2176.mp3"]}},{"no":37,"arab":"قَالَ لَهُ صَاحِبُهُ وَهُوَ يُحَاوِرُهُ أَكَفَرْتَ بِالَّذِي خَلَقَكَ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ سَوَّاكَ رَجُلًا","latin":"qaala lahu shaahibuhu wahuwa yuhaawiruhu akafarta bialladzii khalaqaka min turaabin tsumma min nuthfatin tsumma sawwaaka rajulaan","translate":{"id":"Kawannya (yang mu'min) berkata kepadanya - sedang dia bercakap-cakap dengannya: \"Apakah kamu kafir kepada (Tuhan) yang menciptakan kamu dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna?\n","en":"And his friend answered him in the course of their argument: \"Wilt thou blaspheme against Him who has created thee out of dust, and then out of a drop of sperm, and in the end has fashioned thee into a [complete] man?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2177","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2177.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2177.mp3"]}},{"no":38,"arab":"لَٰكِنَّا هُوَ اللَّهُ رَبِّي وَلَا أُشْرِكُ بِرَبِّي أَحَدًا","latin":"laakinna huwa allaahu rabbii walaa usyriku birabbii ahadaan","translate":{"id":"Tetapi aku (percaya bahwa): Dialah Allah, Tuhanku, dan aku tidak mempersekutukan seorangpun dengan Tuhanku.\n","en":"But as for myself, [I. know that] He is God, my Sustainer; and I cannot attribute divine powers to any but my Sustainer.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2178","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2178.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2178.mp3"]}},{"no":39,"arab":"وَلَوْلَا إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَاءَ اللَّهُ لَا قُوَّةَ إِلَّا بِاللَّهِ ۚ إِنْ تَرَنِ أَنَا أَقَلَّ مِنْكَ مَالًا وَوَلَدًا","latin":"walawlaa idz dakhalta jannataka qulta maa syaa-a allaahu laa quwwata illaa biallaahi in tarani anaa aqalla minka maalan wawaladaan","translate":{"id":"Dan mengapa kamu tidak mengatakan waktu kamu memasuki kebunmu \"MAASYAA ALLAH, LAA QUWWATA ILLAA BILLAH (sungguh atas kehendak Allah semua ini terwujud, tiada kekuatan kecuali dengan pertolongan Allah). Sekiranya kamu anggap aku lebih sedikit darimu dalam hal harta dan keturunan,\n","en":"And [he continued:] \"Alas, if thou hadst but said, on entering thy garden, `Whatever God wills [shall come to pass, for] there is no power save with God!' Although, as thou seest, I have less wealth and offspring than thou,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2179","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2179.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2179.mp3"]}},{"no":40,"arab":"فَعَسَىٰ رَبِّي أَنْ يُؤْتِيَنِ خَيْرًا مِنْ جَنَّتِكَ وَيُرْسِلَ عَلَيْهَا حُسْبَانًا مِنَ السَّمَاءِ فَتُصْبِحَ صَعِيدًا زَلَقًا","latin":"fa'asaa rabbii an yu/tiyani khayran min jannatika wayursila 'alayhaa husbaanan mina alssamaa-i fatushbiha sha'iidan zalaqaan","translate":{"id":"maka mudah-mudahan Tuhanku, akan memberi kepadaku (kebun) yang lebih baik dari pada kebunmu (ini); dan mudah-mudahan Dia mengirimkan ketentuan (petir) dari langit kepada kebunmu; hingga (kebun itu) menjadi tanah yang licin;\n","en":"yet it may well be that my Sustainer will give me something better than thy garden -just as He may let loose a calamity out of heaven upon this [thy garden], so that it becomes a heap of barren dust"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2180","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2180.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2180.mp3"]}},{"no":41,"arab":"أَوْ يُصْبِحَ مَاؤُهَا غَوْرًا فَلَنْ تَسْتَطِيعَ لَهُ طَلَبًا","latin":"aw yushbiha maauhaa ghawran falan tastathii'a lahu thalabaan","translate":{"id":"atau airnya menjadi surut ke dalam tanah, maka sekali-kali kamu tidak dapat menemukannya lagi\".\n","en":"or its water sinks deep into the ground, so that thou wilt never be able to find it again!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2181","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2181.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2181.mp3"]}},{"no":42,"arab":"وَأُحِيطَ بِثَمَرِهِ فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلَىٰ مَا أَنْفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَا لَيْتَنِي لَمْ أُشْرِكْ بِرَبِّي أَحَدًا","latin":"wauhiitha bitsamarihi fa-ashbaha yuqallibu kaffayhi 'alaa maa anfaqa fiihaa wahiya khaawiyatun 'alaa 'uruusyihaa wayaquulu yaa laytanii lam usyrik birabbii ahadaan","translate":{"id":"Dan harta kekayaannya dibinasakan; lalu ia membulak-balikkan kedua tangannya (tanda menyesal) terhadap apa yang ia telah belanjakan untuk itu, sedang pohon anggur itu roboh bersama para-paranya dan dia berkata: \"Aduhai kiranya dulu aku tidak mempersekutukan seorangpun dengan Tuhanku\".\n","en":"And [thus it happened:] his fruitful gardens were encompassed [by ruin], and there he was, wringing his hands over all that he had spent on that which now lay waste, with its trellises caved in; and he could but say, \"Oh, would that I had not attributed divine powers to any but my Sustainer!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2182","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2182.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2182.mp3"]}},{"no":43,"arab":"وَلَمْ تَكُنْ لَهُ فِئَةٌ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مُنْتَصِرًا","latin":"walam takun lahu fi-atun yanshuruunahu min duuni allaahi wamaa kaana muntashiraan","translate":{"id":"Dan tidak ada bagi dia segolonganpun yang akan menolongnya selain Allah; dan sekali-kali ia tidak dapat membela dirinya.\n","en":"-for now he had nought to succour him in God's stead, nor could he succour himself."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2183","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2183.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2183.mp3"]}},{"no":44,"arab":"هُنَالِكَ الْوَلَايَةُ لِلَّهِ الْحَقِّ ۚ هُوَ خَيْرٌ ثَوَابًا وَخَيْرٌ عُقْبًا","latin":"hunaalika alwalaayatu lillaahi alhaqqi huwa khayrun tsawaaban wakhayrun 'uqbaan","translate":{"id":"Di sana pertolongan itu hanya dari Allah Yang Hak. Dia adalah sebaik-baik Pemberi pahala dan sebaik-baik Pemberi balasan.\n","en":"For thus it is: all protective power belongs to God alone, the True One. He is the best to grant recompense, and the best to determine what is to be."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2184","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2184.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2184.mp3"]}},{"no":45,"arab":"وَاضْرِبْ لَهُمْ مَثَلَ الْحَيَاةِ الدُّنْيَا كَمَاءٍ أَنْزَلْنَاهُ مِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ فَأَصْبَحَ هَشِيمًا تَذْرُوهُ الرِّيَاحُ ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ مُقْتَدِرًا","latin":"waidhrib lahum matsala alhayaati alddunyaa kamaa-in anzalnaahu mina alssamaa-i faikhtalatha bihi nabaatu al-ardhi fa-ashbaha hasyiiman tadzruuhu alrriyaahu wakaana allaahu 'alaa kulli syay-in muqtadiraan","translate":{"id":"Dan berilah perumpamaan kepada mereka (manusia), kehidupan dunia sebagai air hujan yang Kami turunkan dari langit, maka menjadi subur karenanya tumbuh-tumbuhan di muka bumi, kemudian tumbuh-tumbuhan itu menjadi kering yang diterbangkan oleh angin. Dan adalah Allah, Maha Kuasa atas segala sesuatu.\n","en":"AND PROPOUND unto them the parable of the life of this world: [it is] like the water which We send down from the skies, and which is absorbed by the plants of the earth: but [in time] they turn into dry. stubble which the winds blow freely about. And it is God [alone] who determines all things."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2185","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2185.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2185.mp3"]}},{"no":46,"arab":"الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا ۖ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا","latin":"almaalu waalbanuuna ziinatu alhayaati alddunyaa waalbaaqiyaatu alshshaalihaatu khayrun 'inda rabbika tsawaaban wakhayrun amalaan","translate":{"id":"Harta dan anak-anak adalah perhiasan kehidupan dunia tetapi amalan-amalan yang kekal lagi saleh adalah lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan.\n","en":"Wealth and children are an adornment of this, world's life: but good deeds, the fruit whereof endures forever, are of far greater merit in thy Sustainer's sight, and a far better source of hope."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2186","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2186.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2186.mp3"]}},{"no":47,"arab":"وَيَوْمَ نُسَيِّرُ الْجِبَالَ وَتَرَى الْأَرْضَ بَارِزَةً وَحَشَرْنَاهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ أَحَدًا","latin":"wayawma nusayyiru aljibaala wataraa al-ardha baarizatan wahasyarnaahum falam nughaadir minhum ahadaan","translate":{"id":"Dan (ingatlah) akan hari (yang ketika itu) Kami perjalankan gunung-gunung dan kamu akan dapat melihat bumi itu datar dan Kami kumpulkan seluruh manusia, dan tidak kami tinggalkan seorangpun dari mereka.\n","en":"Hence, [bear in mind] the Day, on which We shall cause the mountains to disappear and thou shalt behold the earth void and bare: for [on that Day] We will [resurrect the dead and] gather them all together, leaving out none of them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2187","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2187.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2187.mp3"]}},{"no":48,"arab":"وَعُرِضُوا عَلَىٰ رَبِّكَ صَفًّا لَقَدْ جِئْتُمُونَا كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ ۚ بَلْ زَعَمْتُمْ أَلَّنْ نَجْعَلَ لَكُمْ مَوْعِدًا","latin":"wa'uridhuu 'alaa rabbika shaffan laqad ji/tumuunaa kamaa khalaqnaakum awwala marratin bal za'amtum allan naj'ala lakum maw'idaan","translate":{"id":"Dan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada kali yang pertama; bahkan kamu mengatakan bahwa Kami sekali-kali tidak akan menetapkan bagi kamu waktu (memenuhi) perjanjian.\n","en":"And they will be lined up before thy Sustainer, [and He will say:] \"Now, indeed, you have come unto Us [in a lonely state], even as We created you in the first instances - although you were wont to assert that We would never 'appoint for you a meeting [with Us]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2188","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2188.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2188.mp3"]}},{"no":49,"arab":"وَوُضِعَ الْكِتَابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَا وَيْلَتَنَا مَالِ هَٰذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا ۚ وَوَجَدُوا مَا عَمِلُوا حَاضِرًا ۗ وَلَا يَظْلِمُ رَبُّكَ أَحَدًا","latin":"wawudhi'a alkitaabu fataraa almujrimiina musyfiqiina mimmaa fiihi wayaquuluuna yaa waylatanaa maa lihaadzaa alkitaabi laa yughaadiru shaghiiratan walaa kabiiratan illaa ahsaahaa wawajaduu maa 'amiluu hadiran walaa yazhlimu rabbuka ahadaan","translate":{"id":"Dan diletakkanlah kitab, lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun\".\n","en":"And the record [of everyone's deeds] will be laid open; and thou wilt behold the guilty filled with dread at what [they see] therein; and they will exclaim: \"Oh, woe unto us! What a record is this! It leaves out nothing, be it small or great, but takes everything into account!\" For they will find all that they ever wrought [now] facing them, and [will know that] thy Sustainer does not wrong anyone."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2189","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2189.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2189.mp3"]}},{"no":50,"arab":"وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ ۗ أَفَتَتَّخِذُونَهُ وَذُرِّيَّتَهُ أَوْلِيَاءَ مِنْ دُونِي وَهُمْ لَكُمْ عَدُوٌّ ۚ بِئْسَ لِلظَّالِمِينَ بَدَلًا","latin":"wa-idz qulnaa lilmalaa-ikati usjuduu li-aadama fasajaduu illaa ibliisa kaana mina aljinni fafasaqa 'an amri rabbihi afatattakhidzuunahu wadzurriyyatahu awliyaa-a min duunii wahum lakum 'aduwwun bi/sa lilzhzhaalimiina badalaan","translate":{"id":"Dan (ingatlah) ketika Kami berfirman kepada para malaikat: \"Sujudlah kamu kepada Adam , maka sujudlah mereka kecuali Iblis. Dia adalah dari golongan jin, maka ia mendurhakai perintah Tuhannya. Patutkah kamu mengambil dia dan turanan-turunannya sebagai pemimpin selain daripada-Ku, sedang mereka adalah musuhmu? Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim.\n","en":"AND [remember that] when We told the angels, \"Prostrate yourselves before Adam,\" they all prostrated themselves, save Iblis: he [too] was one of those invisible beings, but then he turned away from his Sustainer's command. Will you, then, take him and his cohorts for (your], masters instead of Me, although they are your foe? How vile an exchange on the evildoers' part!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2190","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2190.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2190.mp3"]}},{"no":51,"arab":"مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ وَلَا خَلْقَ أَنْفُسِهِمْ وَمَا كُنْتُ مُتَّخِذَ الْمُضِلِّينَ عَضُدًا","latin":"maa asyhadtuhum khalqa alssamaawaati waal-ardhi walaa khalqa anfusihim wamaa kuntu muttakhidza almudhilliina 'adhudaan","translate":{"id":"Aku tidak menghadirkan mereka (iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi dan tidak (pula) penciptaan diri mereka sendiri; dan tidaklah Aku mengambil orang-orang yang menyesatkan itu sebagai penolong.\n","en":"I did not make them witnesses of the creation of the heavens and the earth, nor of the creation of their own selves; and neither do I [have any need to] take as My helpers those [beings] that lead [men] astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2191","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2191.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2191.mp3"]}},{"no":52,"arab":"وَيَوْمَ يَقُولُ نَادُوا شُرَكَائِيَ الَّذِينَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَجَعَلْنَا بَيْنَهُمْ مَوْبِقًا","latin":"wayawma yaquulu naaduu syurakaa-iya alladziina za'amtum fada'awhum falam yastajiibuu lahum waja'alnaa baynahum mawbiqaan","translate":{"id":"Dan (ingatlah) akan hari (yang ketika itu) Dia berfirman: \"Serulah olehmu sekalian sekutu-sekutu-Ku yang kamu katakan itu\". Mereka lalu memanggilnya tetapi sekutu-sekutu itu tidak membalas seruan mereka dan Kami adakan untuk mereka tempat kebinasaan (neraka).\n","en":"Hence, [bear in mind] the Day on which He will say, \"Call [now] unto those beings whom you imagined to have a share in My divinity!\" - whereupon they will invoke them, but those [beings] will not respond to them: for We shall have placed between them an unbridgeable gulf."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2192","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2192.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2192.mp3"]}},{"no":53,"arab":"وَرَأَى الْمُجْرِمُونَ النَّارَ فَظَنُّوا أَنَّهُمْ مُوَاقِعُوهَا وَلَمْ يَجِدُوا عَنْهَا مَصْرِفًا","latin":"waraaa almujrimuuna alnnaara fazhannuu annahum muwaaqi'uuhaa walam yajiduu 'anhaa mashrifaan","translate":{"id":"Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat berpaling dari padanya.\n","en":"And those who were lost in sin will behold the fire, and will know that they are bound to fall into it, and will find no way of escape therefrom."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2193","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2193.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2193.mp3"]}},{"no":54,"arab":"وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِلنَّاسِ مِنْ كُلِّ مَثَلٍ ۚ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا","latin":"walaqad sharrafnaa fii haadzaa alqur-aani lilnnaasi min kulli matsalin wakaana al-insaanu aktsara syay-in jadalaan","translate":{"id":"Dan sesungguhnya Kami telah mengulang-ulangi bagi manusia dalam Al Qur'an ini bermacam-macam perumpamaan. Dan manusia adalah makhluk yang paling banyak membantah.\n","en":"THUS, INDEED, have We given in this Qur'an many facets to every kind of lesson [designed] for [the benefit of] mankind. However, man is, above all else, always given to contention:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2194","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2194.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2194.mp3"]}},{"no":55,"arab":"وَمَا مَنَعَ النَّاسَ أَنْ يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَىٰ وَيَسْتَغْفِرُوا رَبَّهُمْ إِلَّا أَنْ تَأْتِيَهُمْ سُنَّةُ الْأَوَّلِينَ أَوْ يَأْتِيَهُمُ الْعَذَابُ قُبُلًا","latin":"wamaa mana'a alnnaasa an yu/minuu idz jaa-ahumu alhudaa wayastaghfiruu rabbahum illaa an ta/tiyahum sunnatu al-awwaliina aw ya/tiyahumu al'adzaabu qubulaan","translate":{"id":"Dam tidak ada sesuatupun yang menghalangi manusia dari beriman, ketika petunjuk telah datang kepada mereka, dan dari memohon ampun kepada Tuhannya, kecuali (keinginan menanti) datangnya hukum (Allah yang telah berlalu pada) umat-umat yang dahulu atau datangnya azab atas mereka dengan nyata.\n","en":"for, what is there to keep people from attaining to faith now that guidance has come unto them, and from asking their Sustainer to forgive them their sins - unless it be [their wish] that the fate of the [sinful] people of ancient times should befall them [as well], or that the [ultimate] suffering should befall them in the hereafter?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2195","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2195.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2195.mp3"]}},{"no":56,"arab":"وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنْذِرِينَ ۚ وَيُجَادِلُ الَّذِينَ كَفَرُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ ۖ وَاتَّخَذُوا آيَاتِي وَمَا أُنْذِرُوا هُزُوًا","latin":"wamaa nursilu almursaliina illaa mubasysyiriina wamundziriina wayujaadilu alladziina kafaruu bialbaathili liyudhidhuu bihi alhaqqa waittakhadzuu aayaatii wamaa undziruu huzuwaan","translate":{"id":"Dan tidaklah Kami mengutus rasul-rasul hanyalah sebagai pembawa berita gembira dan sebagai pemberi peringatan; tetapi orang-orang yang kafir membantah dengan yang batil agar dengan demikian mereka dapat melenyap kan yang hak, dan mereka menganggap ayat-ayat kami dan peringatan-peringatan terhadap mereka sebagai olok-olokan.\n","en":"But We send [Our] message-bearers only as heralds of glad tidings and as warners - whereas those who are bent on denying the truth contend [against them] with fallacious arguments, so as to render void the truth thereby, and to make My messages and warnings a target of their mockery."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2196","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2196.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2196.mp3"]}},{"no":57,"arab":"وَمَنْ أَظْلَمُ مِمَّنْ ذُكِّرَ بِآيَاتِ رَبِّهِ فَأَعْرَضَ عَنْهَا وَنَسِيَ مَا قَدَّمَتْ يَدَاهُ ۚ إِنَّا جَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۖ وَإِنْ تَدْعُهُمْ إِلَى الْهُدَىٰ فَلَنْ يَهْتَدُوا إِذًا أَبَدًا","latin":"waman azhlamu mimman dzukkira bi-aayaati rabbihi fa-a'radha 'anhaa wanasiya maa qaddamat yadaahu innaa ja'alnaa 'alaa quluubihim akinnatan an yafqahuuhu wafii aatsaanihim waqran wa-in tad'uhum ilaa alhudaa falan yahtaduu idzan abadaan","translate":{"id":"Dan siapakah yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat Tuhannya lalu dia berpaling dari padanya dan melupakan apa yang telah dikerjakan oleh kedua tangannya? Sesungguhnya Kami telah meletakkan tutupan di atas hati mereka, (sehingga mereka tidak) memahaminya, dan (Kami letakkan pula) sumbatan di telinga mereka; dan kendatipun kamu menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk selama-lamanya.\n","en":"And who could be more wicked than he to whom his Sustainer's messages are conveyed and who thereupon turns away from them, forgetting all [the evil] that his hands may have wrought? Behold, over their hearts have We laid veils which prevent them from grasping the truth, and into their ears, deafness; and though thou call them onto the right path, they will never allow themselves to be guided."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2197","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2197.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2197.mp3"]}},{"no":58,"arab":"وَرَبُّكَ الْغَفُورُ ذُو الرَّحْمَةِ ۖ لَوْ يُؤَاخِذُهُمْ بِمَا كَسَبُوا لَعَجَّلَ لَهُمُ الْعَذَابَ ۚ بَلْ لَهُمْ مَوْعِدٌ لَنْ يَجِدُوا مِنْ دُونِهِ مَوْئِلًا","latin":"warabbuka alghafuuru dzuu alrrahmati law yu-aakhidzuhum bimaa kasabuu la'ajjala lahumu al'adzaaba bal lahum maw'idun lan yajiduu min duunihi maw-ilaan","translate":{"id":"Dan Tuhanmulah yang Maha Pengampun, lagi mempunyai rahmat. Jika Dia mengazab mereka karena perbuatan mereka, tentu Dia akan menyegerakan azab bagi mereka. Tetapi bagi mereka ada waktu yang tertentu (untuk mendapat azab) yang mereka sekali-kali tidak akan menemukan tempat berlindung dari padanya.\n","en":"Yet, [withal,] thy Sustainer is the Truly-Forgiving One, limitless in His grace. Were He to take them [at once] to task for whatever [wrong] they commit, He would indeed bring about their speedy punishment [then and there]: but nay, they have a time-limit beyond which they shall find no redemption"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2198","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2198.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2198.mp3"]}},{"no":59,"arab":"وَتِلْكَ الْقُرَىٰ أَهْلَكْنَاهُمْ لَمَّا ظَلَمُوا وَجَعَلْنَا لِمَهْلِكِهِمْ مَوْعِدًا","latin":"watilka alquraa ahlaknaahum lammaa zhalamuu waja'alnaa limahlikihim maw'idaan","translate":{"id":"Dan (penduduk) negeri telah Kami binasakan ketika mereka berbuat zalim, dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka.\n","en":"as [was the case with all] those communities that We destroyed when they went on and on doing wrong: for We had set a time-limit for their destruction."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2199","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2199.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2199.mp3"]}},{"no":60,"arab":"وَإِذْ قَالَ مُوسَىٰ لِفَتَاهُ لَا أَبْرَحُ حَتَّىٰ أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا","latin":"wa-idz qaala muusaa lifataahu laa abrahu hattaa ablugha majma'a albahrayni aw amdhiya huqubaan","translate":{"id":"Dan (ingatlah) ketika Musa berkata kepada muridnya : \"Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua buah lautan; atau aku akan berjalan sampai bertahun-tahun\".\n","en":"AND LO! [In the course of his wanderings,] Moses said to his servant: \"I shall not give up until I reach the junction of the two seas, even if I [have to] spend untold years [in my quest]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2200","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2200.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2200.mp3"]}},{"no":61,"arab":"فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا","latin":"falammaa balaghaa majma'a baynihimaa nasiyaa huutahumaa faittakhadza sabiilahu fii albahri sarabaan","translate":{"id":"Maka tatkala mereka sampai ke pertemuan dua buah laut itu, mereka lalai akan ikannya, lalu ikan itu melompat mengambil jalannya ke laut itu.\n","en":"But when they reached the junction between the two [seas], they forgot all about their fish, and it took its way into the sea and disappeared from sight."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2201","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2201.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2201.mp3"]}},{"no":62,"arab":"فَلَمَّا جَاوَزَا قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَٰذَا نَصَبًا","latin":"falammaa jaawazaa qaala lifataahu aatinaa ghadaa-anaa laqad laqiinaa min safarinaa haadzaa nashabaan","translate":{"id":"Maka tatkala mereka berjalan lebih jauh, berkatalah Musa kepada muridnya: \"Bawalah kemari makanan kita; sesungguhnya kita telah merasa letih karena perjalanan kita ini\".\n","en":"And after the two had walked some distance, [Moses] said to his servant: \"Bring us our mid-day meal; we have indeed suffered hardship on this [day of] our journey!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2202","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2202.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2202.mp3"]}},{"no":63,"arab":"قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهُ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ ۚ وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا","latin":"qaala ara-ayta idz awaynaa ilaa alshshakhrati fa-innii nasiitu alhuuta wamaa ansaaniihu illaa alsysyaythaanu an adzkurahu waittakhadza sabiilahu fii albahri 'ajabaan","translate":{"id":"Muridnya menjawab: \"Tahukah kamu tatkala kita mecari tempat berlindung di batu tadi, maka sesungguhnya aku lupa (menceritakan tentang) ikan itu dan tidak adalah yang melupakan aku untuk menceritakannya kecuali syaitan dan ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali\".\n","en":"Said [the servant]: \"Wouldst thou believe it? When we betook ourselves to that rock for a rest, behold, I forgot about the fish-and none but Satan made me thus forget it - and it took its way into the sea! How strange!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2203","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2203.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2203.mp3"]}},{"no":64,"arab":"قَالَ ذَٰلِكَ مَا كُنَّا نَبْغِ ۚ فَارْتَدَّا عَلَىٰ آثَارِهِمَا قَصَصًا","latin":"qaala dzaalika maa kunnaa nabghi fairtaddaa 'alaa aatsaarihimaa qashashaan","translate":{"id":"Musa berkata: \"Itulah (tempat) yang kita cari\". Lalu keduanya kembali, mengikuti jejak mereka semula.\n","en":"[Moses] exclaimed: \"That [was the place] which we were seeking!, And the two turned back, retracing their footsetps,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2204","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2204.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2204.mp3"]}},{"no":65,"arab":"فَوَجَدَا عَبْدًا مِنْ عِبَادِنَا آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا","latin":"fawajadaa 'abdan min 'ibaadinaa aataynaahu rahmatan min 'indinaa wa'allamnaahu min ladunnaa 'ilmaan","translate":{"id":"Lalu mereka bertemu dengan seorang hamba di antara hamba-hamba Kami, yang telah Kami berikan kepadanya rahmat dari sisi Kami, dan yang telah Kami ajarkan kepadanya ilmu dari sisi Kami .\n","en":"and found one of Our servants, on whom We had bestowed grace from Ourselves and unto whom We had imparted knowledge [issuing] from Ourselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2205","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2205.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2205.mp3"]}},{"no":66,"arab":"قَالَ لَهُ مُوسَىٰ هَلْ أَتَّبِعُكَ عَلَىٰ أَنْ تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا","latin":"qaala lahu muusaa hal attabi'uka 'alaa an tu'allimani mimmaa 'ullimta rusydaan","translate":{"id":"Musa berkata kepada Khidhr: \"Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu?\"\n","en":"Moses said unto him: \"May I follow thee on the understanding that thou wilt impart to me something of that consciousness of what is right which has been imparted to thee?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2206","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2206.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2206.mp3"]}},{"no":67,"arab":"قَالَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا","latin":"qaala innaka lan tastathii'a ma'iya shabraan","translate":{"id":"Dia menjawab: \"Sesungguhnya kamu sekali-kali tidak akan sanggup sabar bersama aku.\n","en":"[The other] answered: \"Behold, thou wilt never be able to have patience with me –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2207","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2207.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2207.mp3"]}},{"no":68,"arab":"وَكَيْفَ تَصْبِرُ عَلَىٰ مَا لَمْ تُحِطْ بِهِ خُبْرًا","latin":"wakayfa tashbiru 'alaa maa lam tuhith bihi khubraan","translate":{"id":"Dan bagaimana kamu dapat sabar atas sesuatu, yang kamu belum mempunyai pengetahuan yang cukup tentang hal itu?\"\n","en":"for how couldst thou be patient about something that thou canst not comprehend within the compass of (thy] experience?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2208","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2208.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2208.mp3"]}},{"no":69,"arab":"قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا","latin":"qaala satajidunii in syaa-a allaahu shaabiran walaa a'shii laka amraan","translate":{"id":"Musa berkata: \"Insya Allah kamu akan mendapati aku sebagai orang yang sabar, dan aku tidak akan menentangmu dalam sesuatu urusanpun\".\n","en":"Replied [Moses]: \"Thou wilt find me patient, if God so wills; and I shall not disobey thee in anything!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2209","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2209.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2209.mp3"]}},{"no":70,"arab":"قَالَ فَإِنِ اتَّبَعْتَنِي فَلَا تَسْأَلْنِي عَنْ شَيْءٍ حَتَّىٰ أُحْدِثَ لَكَ مِنْهُ ذِكْرًا","latin":"qaala fa-ini ittaba'tanii falaa tas-alnii 'an syay-in hattaa uhditsa laka minhu dzikraan","translate":{"id":"Dia berkata: \"Jika kamu mengikutiku, maka janganlah kamu menanyakan kepadaku tentang sesuatu apapun, sampai aku sendiri menerangkannya kepadamu\".\n","en":"Said [the sage]: \"Well, then, if thou art to follow me, do not question me about aught [that I may do] until I myself give thee an account thereof.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2210","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2210.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2210.mp3"]}},{"no":71,"arab":"فَانْطَلَقَا حَتَّىٰ إِذَا رَكِبَا فِي السَّفِينَةِ خَرَقَهَا ۖ قَالَ أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا","latin":"fainthalaqaa hattaa idzaa rakibaa fii alssafiinati kharaqahaa qaala akharaqtahaa litughriqa ahlahaa laqad ji/ta syay-an imraan","translate":{"id":"Maka berjalanlah keduanya, hingga tatkala keduanya menaiki perahu lalu Khidhr melobanginya. Musa berkata: \"Mengapa kamu melobangi perahu itu akibatnya kamu menenggelamkan enumpangnya?\" Sesungguhnya kamu telah berbuat sesuatu kesalahan yang besar.\n","en":"And so the two went on their way, till (they reached the seashore; and] when they disembarked from the boat [that had ferried them across], the sage made a hole in it-[whereupon Moses] exclaimed: \"Hast thou made a hole in it in order to drown the people who may be [travelling] in it? Indeed, thou hast done a grievous thing!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2211","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2211.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2211.mp3"]}},{"no":72,"arab":"قَالَ أَلَمْ أَقُلْ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا","latin":"qaala alam aqul innaka lan tastathii'a ma'iya shabraan","translate":{"id":"Dia (Khidhr) berkata: \"Bukankah aku telah berkata: \"Sesungguhnya kamu sekali-kali tidak akan sabar bersama dengan aku\".\n","en":"He replied: \"Did I not tell thee that thou wilt never be able to have patience with me?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2212","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2212.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2212.mp3"]}},{"no":73,"arab":"قَالَ لَا تُؤَاخِذْنِي بِمَا نَسِيتُ وَلَا تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا","latin":"qaala laa tu-aakhidznii bimaa nasiitu walaa turhiqnii min amrii 'usraan","translate":{"id":"Musa berkata: \"Janganlah kamu menghukum aku karena kelupaanku dan janganlah kamu membebani aku dengan sesuatu kesulitan dalam urusanku\".\n","en":"Said [Moses]: \"Take-me not to task for my having forgotten [myself], and be not hard on me on account of what I have done!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2213","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2213.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2213.mp3"]}},{"no":74,"arab":"فَانْطَلَقَا حَتَّىٰ إِذَا لَقِيَا غُلَامًا فَقَتَلَهُ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا","latin":"fainthalaqaa hattaa idzaa laqiyaa ghulaaman faqatalahu qaala aqatalta nafsan zakiyyatan bighayri nafsin laqad ji/ta syay-an nukraan","translate":{"id":"Maka berjalanlah keduanya; hingga tatkala keduanya berjumpa dengan seorang anak, maka Khidhr membunuhnya. Musa berkata: \"Mengapa kamu membunuh jiwa yang bersih, bukan karena dia membunuh orang lain? Sesungguhnya kamu telah melakukan suatu yang mungkar\".\n","en":"And so the two went on, till, when they met a young man, [the sage] slew him -(whereupon Moses] exclaimed: \"Hast thou slain an innocent human being without [his having taken] another man's life? Indeed, thou hast done a terrible thing!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2214","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2214.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2214.mp3"]}},{"no":75,"arab":"قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا","latin":"qaala alam aqul laka innaka lan tastathii'a ma'iya shabraan","translate":{"id":"Khidhr berkata: \"Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku?\"\n","en":"He replied: \"Did I not tell thee that thou wilt never be able to have patience with me?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2215","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2215.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2215.mp3"]}},{"no":76,"arab":"قَالَ إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي ۖ قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا","latin":"qaala in sa-altuka 'an syay-in ba'dahaa falaa tushaahibnii qad balaghta min ladunnii 'udzraan","translate":{"id":"Musa berkata: \"Jika aku bertanya kepadamu tentang sesuatu sesudah (kali) ini, maka janganlah kamu memperbolehkan aku menyertaimu, sesungguhnya kamu sudah cukup memberikan uzur padaku\".\n","en":"Said [Moses]: \"If, after this, I should ever question thee, keep me not in thy company: [for by] now thou hast heard enough excuses from me.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2216","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2216.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2216.mp3"]}},{"no":77,"arab":"فَانْطَلَقَا حَتَّىٰ إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ ۖ قَالَ لَوْ شِئْتَ لَاتَّخَذْتَ عَلَيْهِ أَجْرًا","latin":"fainthalaqaa hattaa idzaa atayaa ahla qaryatin istath'amaa ahlahaa fa-abaw an yudhayyifuuhumaa fawajadaa fiihaa jidaaran yuriidu an yanqadhdha fa-aqaamahu qaala law syi/ta laittakhadzta 'alayhi ajraan","translate":{"id":"Maka keduanya berjalan; hingga tatkala keduanya sampai kepada penduduk suatu negeri, mereka minta dijamu kepada penduduk negeri itu, tetapi penduduk negeri itu tidak mau menjamu mereka, kemudian keduanya mendapatkan dalam negeri itu dinding rumah yang hampir roboh, maka Khidhr menegakkan dinding itu. Musa berkata: \"Jikalau kamu mau, niscaya kamu mengambil upah untuk itu\".\n","en":"And so the two went on, till, when they came upon some village people, they asked them for food; but those [people] refused them all hospitality. And they saw in that (village] a wall which was on the point of tumbling down, and [the sage] rebuilt it [whereupon Moses] said: \"Hadst thou so wished, surely thou couldst [at least] have obtained some payment for it?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2217","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2217.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2217.mp3"]}},{"no":78,"arab":"قَالَ هَٰذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ۚ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا","latin":"qaala haadzaa firaaqu baynii wabaynika sa-unabbi-uka bita/wiili maa lam tastathi' 'alayhi shabraan","translate":{"id":"Khidhr berkata: \"Inilah perpisahan antara aku dengan kamu; kelak akan kuberitahukan kepadamu tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya.\n","en":"[The sage] replied: \"This is the parting of ways between me and thee. [And now] I shall let thee know the real meaning of all [those events] that thou wert unable to bear with patience:,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2218","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2218.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2218.mp3"]}},{"no":79,"arab":"أَمَّا السَّفِينَةُ فَكَانَتْ لِمَسَاكِينَ يَعْمَلُونَ فِي الْبَحْرِ فَأَرَدْتُ أَنْ أَعِيبَهَا وَكَانَ وَرَاءَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا","latin":"ammaa alssafiinatu fakaanat limasaakiina ya'maluuna fii albahri fa-aradtu an a'iibahaa wakaana waraa-ahum malikun ya/khudzu kulla safiinatin ghashbaan","translate":{"id":"Adapun bahtera itu adalah kepunyaan orang-orang miskin yang bekerja di laut, dan aku bertujuan merusakkan bahtera itu, karena di hadapan mereka ada seorang raja yang merampas tiap-tiap bahtera.\n","en":"\"As for that boat, it belonged to some needy people who toiled upon the sea -and I desired to damage it because (I knew that] behind them was a king who is wont to seize every boat by brute force."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2219","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2219.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2219.mp3"]}},{"no":80,"arab":"وَأَمَّا الْغُلَامُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَا أَنْ يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا","latin":"wa-ammaa alghulaamu fakaana abawaahu mu/minayni fakhasyiinaa an yurhiqahumaa thughyaanan wakufraan","translate":{"id":"Dan adapun anak muda itu, maka keduanya adalah orang-orang mu'min, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran.\n","en":"\"And as for that young man, his parents were [true] believers - whereas we had every reason to fear that he would bring bitter grief upon them by [his] overweening wickedness and denial of all truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2220","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2220.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2220.mp3"]}},{"no":81,"arab":"فَأَرَدْنَا أَنْ يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا","latin":"fa-aradnaa an yubdilahumaa rabbuhumaa khayran minhu zakaatan wa-aqraba ruhmaan","translate":{"id":"Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka dengan anak lain yang lebih baik kesuciannya dari anaknya itu dan lebih dalam kasih sayangnya (kepada ibu bapaknya).\n","en":"and so we desired that their Sustainer grant them in his stead [a child] of greater purity than him, and closer [to them] in loving tenderness."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2221","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2221.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2221.mp3"]}},{"no":82,"arab":"وَأَمَّا الْجِدَارُ فَكَانَ لِغُلَامَيْنِ يَتِيمَيْنِ فِي الْمَدِينَةِ وَكَانَ تَحْتَهُ كَنْزٌ لَهُمَا وَكَانَ أَبُوهُمَا صَالِحًا فَأَرَادَ رَبُّكَ أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا رَحْمَةً مِنْ رَبِّكَ ۚ وَمَا فَعَلْتُهُ عَنْ أَمْرِي ۚ ذَٰلِكَ تَأْوِيلُ مَا لَمْ تَسْطِعْ عَلَيْهِ صَبْرًا","latin":"wa-ammaa aljidaaru fakaana lighulaamayni yatiimayni fii almadiinati wakaana tahtahu kanzun lahumaa wakaana abuuhumaa shaalihan fa-araada rabbuka an yablughaa asyuddahumaa wayastakhrijaa kanzahumaa rahmatan min rabbika wamaa fa'altuhu 'an amrii dzaalika ta/wiilu maa lam tasthi' 'alayhi shabraan","translate":{"id":"Adapun dinding rumah adalah kepunyaan dua orang anak yatim di kota itu, dan di bawahnya ada harta benda simpanan bagi mereka berdua, sedang ayahnya adalah seorang yang saleh, maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya dan mengeluarkan simpanannya itu, sebagai rahmat dari Tuhanmu; dan bukanlah aku melakukannya itu menurut kemauanku sendiri. Demikian itu adalah tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya\".\n","en":"\"And as for that wall, it belonged to two orphan boys [living] in the town, and beneath it was [buried] a treasure belonging to them [by right]. Now their father had been a righteous man, and so thy Sustainer willed it that when they come of age they should bring forth their treasure by thy Sustainer's grace. \"And I did not do (any of] this of my own accord: this is the real meaning of all [those events] that thou wert unable to bear with patience.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2222","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2222.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2222.mp3"]}},{"no":83,"arab":"وَيَسْأَلُونَكَ عَنْ ذِي الْقَرْنَيْنِ ۖ قُلْ سَأَتْلُو عَلَيْكُمْ مِنْهُ ذِكْرًا","latin":"wayas-aluunaka 'an dzii alqarnayni qul sa-atluu 'alaykum minhu dzikraan","translate":{"id":"Mereka akan bertanya kepadamu (Muhammad) tentang Dzulkarnain. Katakanlah: \"Aku akan bacakan kepadamu cerita tantangnya\".\n","en":"AND THEY will ask thee about the Two-Horned One. Say: \"I will convey unto you something by which he ought to be remembered.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2223","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2223.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2223.mp3"]}},{"no":84,"arab":"إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ وَآتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا","latin":"innaa makkannaa lahu fii al-ardhi waaataynaahu min kulli syay-in sababaan","translate":{"id":"Sesungguhnya Kami telah memberi kekuasaan kepadanya di (muka","en":"Behold, We established him securely on earth, and endowed him with [the knowledge of] the right means to achieve anything [that he might set out to achieve];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2224","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2224.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2224.mp3"]}},{"no":85,"arab":"فَأَتْبَعَ سَبَبًا","latin":"fa-atba'a sababaan","translate":{"id":"maka diapun menempuh suatu jalan.\n","en":"and so he chose the right means [in whatever he did]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2225","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2225.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2225.mp3"]}},{"no":86,"arab":"حَتَّىٰ إِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِي عَيْنٍ حَمِئَةٍ وَوَجَدَ عِنْدَهَا قَوْمًا ۗ قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا","latin":"hattaa idzaa balagha maghriba alsysyamsi wajadahaa taghrubu fii 'aynin hami-atin wawajada 'indahaa qawman qulnaa yaa dzaa alqarnayni immaa an tu'adzdziba wa-immaa an tattakhidza fiihim husnaan","translate":{"id":"Hingga apabila dia telah sampai ketempat terbenam matahari, dia melihat matahari terbenam di dalam laut yang berlumpur hitam, dan dia mendapati di situ segolongan umat . Kami berkata: \"Hai Dzulkarnain, kamu boleh menyiksa atau boleh berbuat kebaikan terhadap mereka.\n","en":"[And he marched westwards] till, when he came to the setting of the sun, it appeared to him that it was setting in a dark, turbid sea; and nearby he found a people [given to every kind of wrongdoing]. We said: \"O thou Two-Horned One! Thou mayest either cause [them] to suffer or treat them with kindness!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2226","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2226.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2226.mp3"]}},{"no":87,"arab":"قَالَ أَمَّا مَنْ ظَلَمَ فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُكْرًا","latin":"qaala ammaa man zhalama fasawfa nu'adzdzibuhu tsumma yuraddu ilaa rabbihi fayu'adzdzibuhu 'adzaaban nukraan","translate":{"id":"Berkata Dzulkarnain: \"Adapun orang yang aniaya, maka kami kelak akan mengazabnya, kemudian dia kembalikan kepada Tuhannya, lalu Tuhan mengazabnya dengan azab yang tidak ada taranya.\n","en":"He answered: \"As for him who does wrong [unto others] - him shall we, in time, cause to suffer; and thereupon he shall be referred to his Sustainer, and He will cause him to suffer with unnameable suffering."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2227","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2227.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2227.mp3"]}},{"no":88,"arab":"وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاءً الْحُسْنَىٰ ۖ وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا","latin":"wa-ammaa man aamana wa'amila shaalihan falahu jazaa-an alhusnaa wasanaquulu lahu min amrinaa yusraan","translate":{"id":"Adapun orang-orang yang beriman dan beramal saleh, maka baginya pahala yang terbaik sebagai balasan, dan akan kami titahkan kepadanya (perintah) yang mudah dari perintah-perintah kami\".\n","en":"But as for him who believes and does righteous deeds - he will have the ultimate good [of the life to come] as his reward; and [as for us,] we shall make binding on him [only] that which is easy to fulfill.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2228","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2228.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2228.mp3"]}},{"no":89,"arab":"ثُمَّ أَتْبَعَ سَبَبًا","latin":"tsumma atba'a sababaan","translate":{"id":"Kemudian dia menempuh jalan (yang lain).\n","en":"And once again he chose the right means [to achieve a right end]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2229","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2229.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2229.mp3"]}},{"no":90,"arab":"حَتَّىٰ إِذَا بَلَغَ مَطْلِعَ الشَّمْسِ وَجَدَهَا تَطْلُعُ عَلَىٰ قَوْمٍ لَمْ نَجْعَلْ لَهُمْ مِنْ دُونِهَا سِتْرًا","latin":"hattaa idzaa balagha mathli'a alsysyamsi wajadahaa tathlu'u 'alaa qawmin lam naj'al lahum min duunihaa sitraan","translate":{"id":"Hingga apabila dia telah sampai ke tempat terbit matahari (sebelah Timur) dia mendapati matahari itu menyinari segolongan umat yang Kami tidak menjadikan bagi mereka sesuatu yang melindunginya dari (cahaya) matahari itu,\n","en":"[And then he marched eastwards] till, when he came to the rising of the sun he found that it was rising on a people for whom We had provided no coverings against it:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2230","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2230.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2230.mp3"]}},{"no":91,"arab":"كَذَٰلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا","latin":"kadzaalika waqad ahathnaa bimaa ladayhi khubraan","translate":{"id":"demikianlah. dan sesungguhnya ilmu Kami meliputi segala apa yang ada padanya.\n","en":"thus [We had made them, and thus he left them; and We did encompass with Our knowledge all that he had in mind"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2231","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2231.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2231.mp3"]}},{"no":92,"arab":"ثُمَّ أَتْبَعَ سَبَبًا","latin":"tsumma atba'a sababaan","translate":{"id":"Kemudian dia menempuh suatu jalan (yang lain lagi).\n","en":"And once again he chose the right means (to achieve a right end]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2232","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2232.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2232.mp3"]}},{"no":93,"arab":"حَتَّىٰ إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِنْ دُونِهِمَا قَوْمًا لَا يَكَادُونَ يَفْقَهُونَ قَوْلًا","latin":"hattaa idzaa balagha bayna alssaddayni wajada min duunihimaa qawman laa yakaaduuna yafqahuuna qawlaan","translate":{"id":"Hingga apabila dia telah sampai di antara dua buah gunung, dia mendapati di hadapan kedua bukit itu suatu kaum yang hampir tidak mengerti pembicaraan .\n","en":"[And he marched on] till, when he reached [a place] between the two mountain-barriers, he found beneath them a people who could scarcely understand a word [of his language]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2233","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2233.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2233.mp3"]}},{"no":94,"arab":"قَالُوا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلَىٰ أَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا","latin":"qaaluu yaa dzaa alqarnayni inna ya/juuja wama/juuja mufsiduuna fii al-ardhi fahal naj'alu laka kharjan 'alaa an taj'ala baynanaa wabaynahum saddaan","translate":{"id":"Mereka berkata: \"Hai Dzulkarnain, sesungguhnya Ya'juj dan Ma'juj itu orang-orang yang membuat kerusakan di muka bumi, maka dapatkah kami memberikan sesuatu pembayaran kepadamu, supaya kamu membuat dinding antara kami dan mereka?\"\n","en":"They said: \"O thou Two-Horned One! Behold, Gog and Magog\" are spoiling this land. May we, then, pay unto thee a tribute on the understanding that thou wilt erect a barrier between us and them?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2234","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2234.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2234.mp3"]}},{"no":95,"arab":"قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ فَأَعِينُونِي بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا","latin":"qaala maa makkannii fiihi rabbii khayrun fa-a'iinuunii biquwwatin aj'al baynakum wabaynahum radmaan","translate":{"id":"Dzulkarnain berkata: \"Apa yang telah dikuasakan oleh Tuhanku kepadaku terhadapnya adalah lebih baik, maka tolonglah aku dengan kekuatan (manusia dan alat-alat), agar aku membuatkan dinding antara kamu dan mereka,\n","en":"He answered: \"That wherein my Sustainer has so securely established me is better [than anything that you could give me]; hence, do but help me with [your labour's] strength, [and] I shall erect a rampart between you and them!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2235","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2235.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2235.mp3"]}},{"no":96,"arab":"آتُونِي زُبَرَ الْحَدِيدِ ۖ حَتَّىٰ إِذَا سَاوَىٰ بَيْنَ الصَّدَفَيْنِ قَالَ انْفُخُوا ۖ حَتَّىٰ إِذَا جَعَلَهُ نَارًا قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا","latin":"aatuunii zubara alhadiidi hattaa idzaa saawaa bayna alshadafayni qaala unfukhuu hattaa idzaa ja'alahu naaran qaala aatuunii ufrigh 'alayhi qithraan","translate":{"id":"berilah aku potongan-potongan besi\". Hingga apabila besi itu telah sama rata dengan kedua (puncak) gunung itu, berkatalah Dzulkarnain: \"Tiuplah (api itu)\". Hingga apabila besi itu sudah menjadi (merah seperti) api, diapun berkata: \"Berilah aku tembaga (yang mendidih) agar aku kutuangkan ke atas besi panas itu\".\n","en":"Bring me ingots of iron!\" Then, after he had [piled up the iron and] filled the gap between the two mountain-sides, he said: \"[Light a fire and] ply your bellows!\" At length, when he had made it [glow like] fire, he commanded: \"Bring me molten copper which I may pour upon it.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2236","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2236.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2236.mp3"]}},{"no":97,"arab":"فَمَا اسْطَاعُوا أَنْ يَظْهَرُوهُ وَمَا اسْتَطَاعُوا لَهُ نَقْبًا","latin":"famaa isthaa'uu an yazhharuuhu wamaa istathaa'uu lahu naqbaan","translate":{"id":"Maka mereka tidak bisa mendakinya dan mereka tidak bisa (pula) melobanginya.\n","en":"And thus [the rampart was built, and] their enemies were unable to scale it, and neither were they able to pierce it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2237","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2237.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2237.mp3"]}},{"no":98,"arab":"قَالَ هَٰذَا رَحْمَةٌ مِنْ رَبِّي ۖ فَإِذَا جَاءَ وَعْدُ رَبِّي جَعَلَهُ دَكَّاءَ ۖ وَكَانَ وَعْدُ رَبِّي حَقًّا","latin":"qaala haadzaa rahmatun min rabbii fa-idzaa jaa-a wa'du rabbii ja'alahu dakkaa-a wakaana wa'du rabbii haqqaan","translate":{"id":"Dzulkarnain berkata: \"Ini (dinding) adalah rahmat dari Tuhanku, maka apabila sudah datang janji Tuhanku, Dia akan menjadikannya hancur luluh; dan janji Tuhanku itu adalah benar\".\n","en":"Said [the King]: \"This is a mercy from my Sustainer! Yet when the time appointed by my Sustainer shall come, He will make this [rampart] level with the ground: and my Sustainer's promise always comes true!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2238","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2238.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2238.mp3"]}},{"no":99,"arab":"وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ يَمُوجُ فِي بَعْضٍ ۖ وَنُفِخَ فِي الصُّورِ فَجَمَعْنَاهُمْ جَمْعًا","latin":"wataraknaa ba'dhahum yawma-idzin yamuuju fii ba'dhin wanufikha fii alshshuuri fajama'naahum jam'aan","translate":{"id":"Kami biarkan mereka di hari itu bercampur aduk antara satu dengan yang lain, kemudian ditiup lagi sangkakala, lalu Kami kumpulkan mereka itu semuanya,\n","en":"AND ON that Day\" We shall [call forth all mankind and] leave them to surge like waves [that dash] against one another; and the trumpet [of judgment] will be blown, and We shall gather them all together."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2239","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2239.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2239.mp3"]}},{"no":100,"arab":"وَعَرَضْنَا جَهَنَّمَ يَوْمَئِذٍ لِلْكَافِرِينَ عَرْضًا","latin":"wa'aradhnaa jahannama yawma-idzin lilkaafiriina 'ardaan ","translate":{"id":"dan Kami nampakkan Jahannam pada hari itu kepada orang-orang kafir dengan jelas,\n","en":"And on that Day We shall place hell, for all to see, before those who denied the truth-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2240","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2240.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2240.mp3"]}},{"no":101,"arab":"الَّذِينَ كَانَتْ أَعْيُنُهُمْ فِي غِطَاءٍ عَنْ ذِكْرِي وَكَانُوا لَا يَسْتَطِيعُونَ سَمْعًا","latin":"alladziina kaanat a'yunuhum fii ghithaa-in 'an dzikrii wakaanuu laa yastathii'uuna sam'aan","translate":{"id":"yaitu orang-orang yang matanya dalam keadaan tertutup dari memperhatikan tanda-tanda kebesaran-Ku, dan adalah mereka tidak sanggup mendengar.\n","en":"those whose eyes had been veiled against any remembrance of Me because they could not bear to listen [to the voice of truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2241","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2241.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2241.mp3"]}},{"no":102,"arab":"أَفَحَسِبَ الَّذِينَ كَفَرُوا أَنْ يَتَّخِذُوا عِبَادِي مِنْ دُونِي أَوْلِيَاءَ ۚ إِنَّا أَعْتَدْنَا جَهَنَّمَ لِلْكَافِرِينَ نُزُلًا","latin":"afahasiba alladziina kafaruu an yattakhidzuu 'ibaadii min duunii awliyaa-a innaa a'tadnaa jahannama lilkaafiriina nuzulaan","translate":{"id":"maka apakah orang-orang kafir menyangka bahwa mereka (dapat) mengambil hamba-hamba-Ku menjadi penolong selain Aku? Sesungguhnya Kami telah menyediakan neraka Jahannam tempat tinggal bagi orang-orang kafir.\n","en":"Do they who are bent on denying the truth think, perchance, that they could take [any of] My creatures for protectors against Me? Verily, We have readied hell to welcome all who [thus] deny the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2242","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2242.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2242.mp3"]}},{"no":103,"arab":"قُلْ هَلْ نُنَبِّئُكُمْ بِالْأَخْسَرِينَ أَعْمَالًا","latin":"qul hal nunabbi-ukum bial-akhsariina a'maalaan","translate":{"id":"Katakanlah: \"Apakah akan Kami beritahukan kepadamu tentang orang-orang yang paling merugi perbuatannya?\"\n","en":"Say: \"Shall we tell you who are the greatest losers in whatever they may do?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2243","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2243.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2243.mp3"]}},{"no":104,"arab":"الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا","latin":"alladziina dhalla sa'yuhum fii alhayaati alddunyaa wahum yahsabuuna annahum yuhsinuuna shun'aan","translate":{"id":"Yaitu orang-orang yang telah sia-sia perbuatannya dalam kehidupan dunia ini, sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya.\n","en":"\"[It is] they whose labour has gone astray in [the pursuit of no more than] this world's life, and who none the less think that they are doing good works:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2244","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2244.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2244.mp3"]}},{"no":105,"arab":"أُولَٰئِكَ الَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ وَلِقَائِهِ فَحَبِطَتْ أَعْمَالُهُمْ فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا","latin":"ulaa-ika alladziina kafaruu bi-aayaati rabbihim waliqaa-ihi fahabithat a'maaluhum falaa nuqiimu lahum yawma alqiyaamati waznaan","translate":{"id":"Mereka itu orang-orang yang telah kufur terhadap ayat-ayat Tuhan mereka dan (kufur terhadap) perjumpaan dengan Dia , maka hapuslah amalan-amalan mereka, dan Kami tidak mengadakan suatu penilaian bagi (amalan) mereka pada hari kiamat.\n","en":"it is they who have chosen to deny their Sustainer's messages and the truth; that they are deseined to meet Him.\" Hence, all their [good] deeds come to nought, and no weight shall We assign to them on Resurrection Day."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2245","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2245.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2245.mp3"]}},{"no":106,"arab":"ذَٰلِكَ جَزَاؤُهُمْ جَهَنَّمُ بِمَا كَفَرُوا وَاتَّخَذُوا آيَاتِي وَرُسُلِي هُزُوًا","latin":"dzaalika jazaauhum jahannamu bimaa kafaruu waittakhadzuu aayaatii warusulii huzuwaan","translate":{"id":"Demikianlah balasan mereka itu neraka Jahannam, disebabkan kekafiran mereka dan disebabkan mereka menjadikan ayat-ayat-Ku dan rasul-rasul-Ku sebagai olok-olok.\n","en":"That will be their recompense - [their] hell -for having denied the truth and made My messages and My apostles a target of their mockery."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2246","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2246.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2246.mp3"]}},{"no":107,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَانَتْ لَهُمْ جَنَّاتُ الْفِرْدَوْسِ نُزُلًا","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati kaanat lahum jannaatu alfirdawsi nuzulaan","translate":{"id":"Sesungguhnya orang-orang yang beriman dan beramal saleh, bagi mereka adalah surga Firdaus menjadi tempat tinggal,\n","en":"[But,] verily, as for those who attain to faith and do righteous deeds - the gardens of paradise will be there to welcome them;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2247","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2247.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2247.mp3"]}},{"no":108,"arab":"خَالِدِينَ فِيهَا لَا يَبْغُونَ عَنْهَا حِوَلًا","latin":"khaalidiina fiihaa laa yabghuuna 'anhaa hiwalaan","translate":{"id":"mereka kekal di dalamnya, mereka tidak ingin berpindah dari padanya.\n","en":"therein will they abide, [and] never will they desire any change therefrom."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2248","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2248.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2248.mp3"]}},{"no":109,"arab":"قُلْ لَوْ كَانَ الْبَحْرُ مِدَادًا لِكَلِمَاتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِمَاتُ رَبِّي وَلَوْ جِئْنَا بِمِثْلِهِ مَدَدًا","latin":"qul law kaana albahru midaadan likalimaati rabbii lanafida albahru qabla an tanfada kalimaatu rabbii walaw ji/naa bimitslihi madadaan","translate":{"id":"Katakanlah: Sekiranya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku, sungguh habislah lautan itu sebelum habis (ditulis) kalimat-kalimat Tuhanku, meskipun Kami datangkan tambahan sebanyak itu (pula)\".\n","en":"SAY: \"If all the sea were ink for my Sustainer's words, the sea would indeed be exhausted ere my Sustainer's words are exhausted! And [thus it would be] if we were to add to it sea upon sea.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2249","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2249.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2249.mp3"]}},{"no":110,"arab":"قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَىٰ إِلَيَّ أَنَّمَا إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا","latin":"qul innamaa anaa basyarun mitslukum yuuhaa ilayya annamaa ilaahukum ilaahun waahidun faman kaana yarjuu liqaa-a rabbihi falya'mal 'amalan shaalihan walaa yusyrik bi'ibaadati rabbihi ahadaan","translate":{"id":"Katakanlah: Sesungguhnya aku ini manusia biasa seperti kamu, yang diwahyukan kepadaku: \"Bahwa sesungguhnya Tuhan kamu itu adalah Tuhan yang Esa\". Barangsiapa mengharap perjumpaan dengan Tuhannya, maka hendaklah ia mengerjakan amal yang saleh dan janganlah ia mempersekutukan seorangpun dalam beribadat kepada Tuhannya\".\n","en":"Say [O Prophet]: \"I am but a mortal man like all of you. It has been revealed unto me that your God is the One and Only God. Hence, whoever looks forward [with hope and awe] to meeting his Sustainer [on Judgment Day], let him do righteous deeds, and let him not ascribe unto anyone or anything a share in the worship due to his Sustainer!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2250","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2250.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2250.mp3"]}}]}