{"alquran":{"no":19,"name":"Maryam","arab":"مريم","start":2250,"count":98,"rukku":6,"type":"mecca","description":"Surat Maryam terdiri atas 98 ayat, termasuk golongan surat-surat Makkiyyah, karena hampir seluruh ayatnya diturunkan sebelum Nabi Muhammad s.a.w. hijrah ke Madinah, bahkan sebelum sahabat-sahabat beliau hijrah ke negeri Habsyi. Menurut riwayat Ibnu Mas'ud, Ja'far bin Abi Thalib membacakan permulaan surat Maryam ini kepada raja Najasyi dan pengikut-pengikutnya di waktu ia ikut hijrah bersama-sama sahabat-sahabat yang lain ke negeri Habsyi.<br>Surat ini dinamai <i>Maryam</i>, karena surat ini mengandung kisah Maryam, ibu Nabi Isa a.s. yang serba ajaib, yaitu melahirkan puteranya lsa a.s., sedang ia sebelumnya belum pernah dikawini atau dicampuri oleh seorang laki-laki pun. Kelahiran Isa a.s. tanpa bapa, merupakan suatu bukti kekuasaan Allah s.w.t.  Pengutaraan kisah Maryam sebagai kejadian yang luar biasa dan ajaib dalam surat ini, diawali dengan kisah kejadian yang luar biasa dan ajaib pula, yaitu dikabulkannya doa Zakaria a.s. oleh Allah s.w.t., agar beliau dianugerahi seorang putera sebagai pewaris dan pelanjut cita-cita dan kepercayaan beliau, sedang usia beliau sudah sangat tua dan isteri beliau seorang yang mandul yang menurut ukuran ilmu biologi tidak mungkin akan terjadi."},"surah":[{"no":1,"arab":" كهيعص","latin":"kaaf-haa-yaa-'ayn-shaad","translate":{"id":"Kaaf Haa Yaa 'Ain Shaad .\n","en":"Kaf. Ha. Ya. `Ayn. Sad."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2251","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2251.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2251.mp3"]}},{"no":2,"arab":"ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا","latin":"dzikru rahmati rabbika 'abdahu zakariyyaa","translate":{"id":"(Yang dibacakan ini adalah) penjelasan tentang rahmat Tuhan kamu kepada hamba-Nya, Zakaria,\n","en":"AN ACCOUNT of the grace which thy Sustainer bestowed upon His servant Zachariah:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2252","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2252.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2252.mp3"]}},{"no":3,"arab":"إِذْ نَادَىٰ رَبَّهُ نِدَاءً خَفِيًّا","latin":"idz naadaa rabbahu nidaa-an khafiyyaan","translate":{"id":"yaitu tatkala ia berdo'a kepada Tuhannya dengan suara yang lembut.\n","en":"When he called out to his Sustainer in the secrecy of his heart,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2253","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2253.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2253.mp3"]}},{"no":4,"arab":"قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُنْ بِدُعَائِكَ رَبِّ شَقِيًّا","latin":"qaala rabbi innii wahana al'azhmu minnii waisyta'ala alrra/su syayban walam akun bidu'aa-ika rabbi syaqiyyaan","translate":{"id":"Ia berkata \"Ya Tuhanku, sesungguhnya tulangku telah lemah dan kepalaku telah ditumbuhi uban, dan aku belum pernah kecewa dalam berdo'a kepada Engkau, ya Tuhanku.\n","en":"he prayed: \"O my Sustainer! Feeble have become my bones, and my head glistens with grey hair. But never yet, O my Lord, has my prayer unto Thee remained unanswered."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2254","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2254.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2254.mp3"]}},{"no":5,"arab":"وَإِنِّي خِفْتُ الْمَوَالِيَ مِنْ وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِرًا فَهَبْ لِي مِنْ لَدُنْكَ وَلِيًّا","latin":"wa-innii khiftu almawaaliya min waraa-ii wakaanati imra-atii 'aaqiran fahab lii min ladunka waliyyaan","translate":{"id":"Dan sesungguhnya aku khawatir terhadap mawaliku sepeninggalku, sedang isteriku adalah seorang yang mandul, maka anugerahilah aku dari sisi Engkau seorang putera,\n","en":"\"Now, behold, I am afraid of [what] my kinsfolk [will do] after I am gone, for my wife has always been barren. Bestow, then, upon me, out of Thy grace, the gift of a successor"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2255","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2255.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2255.mp3"]}},{"no":6,"arab":"يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ ۖ وَاجْعَلْهُ رَبِّ رَضِيًّا","latin":"yaritsunii wayaritsu min aali ya'quuba waij'alhu rabbi radhiyyaan","translate":{"id":"yang akan mewarisi aku dan mewarisi sebahagian keluarga Ya'qub; dan jadikanlah ia, ya Tuhanku, seorang yang diridhai\".\n","en":"who will be my heir as well as an heir [to the dignity] of the House of Jacob; and make him, O my Sustainer, well-pleasing to Thee!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2256","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2256.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2256.mp3"]}},{"no":7,"arab":"يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَىٰ لَمْ نَجْعَلْ لَهُ مِنْ قَبْلُ سَمِيًّا","latin":"yaa zakariyyaa innaa nubasysyiruka bighulaamin ismuhu yahyaa lam naj'al lahu min qablu samiyyaan","translate":{"id":"Hai Zakaria, sesungguhnya Kami memberi kabar gembira kepadamu akan (beroleh) seorang anak yang namanya Yahya, yang sebelumnya Kami belum pernah menciptakan orang yang serupa dengan dia.\n","en":"[Thereupon the angels called out unto him: \"O Zachariah! We bring thee the glad tiding of [the birth of] a son whose name shall be John. [And God says,] `Never have We given this name to anyone before him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2257","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2257.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2257.mp3"]}},{"no":8,"arab":"قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَكَانَتِ امْرَأَتِي عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا","latin":"qaala rabbi annaa yakuunu lii ghulaamun wakaanati imra-atii 'aaqiran waqad balaghtu mina alkibari 'itiyyaan","translate":{"id":"Zakaria berkata: \"Ya Tuhanku, bagaimana akan ada anak bagiku, padahal isteriku adalah seorang yang mandul dan aku (sendiri) sesungguhnya sudah mencapai umur yang sangat tua\".\n","en":"[Zachariah] exclaimed: \"O my Sustainer! How can I have a son when my wife has always been barren and I have become utterly infirm through old age?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2258","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2258.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2258.mp3"]}},{"no":9,"arab":"قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا","latin":"qaala kadzaalika qaala rabbuka huwa 'alayya hayyinun waqad khalaqtuka min qablu walam taku syay-aan","translate":{"id":"Tuhan berfirman: \"Demikianlah\". Tuhan berfirman: \"Hal itu adalah mudah bagi-Ku; dan sesunguhnya telah Aku ciptakan kamu sebelum itu, padahal kamu (di waktu itu) belum ada sama sekali\".\n","en":"Answered [the angel]: \"Thus. it is; [but] thy 'Sustainer says, `This is easy for Me -even as I have created thee aforetime out of nothing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2259","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2259.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2259.mp3"]}},{"no":10,"arab":"قَالَ رَبِّ اجْعَلْ لِي آيَةً ۚ قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيًّا","latin":"qaala rabbi ij'al lii aayatan qaala aayatuka allaa tukallima alnnaasa tsalaatsa layaalin sawiyyaan","translate":{"id":"Zakaria berkata: \"Ya Tuhanku, berilah aku suatu tanda\". Tuhan berfirman: \"Tanda bagimu ialah bahwa kamu tidak dapat bercakap-cakap dengan manusia selama tiga malam, padahal kamu sehat\".\n","en":"[Zachariah] prayed: \"O my Sustainer! Appoint a sign for me!\" Said [the angel]: \"Thy sign shall be that for full three nights [and days] thou wilt not speak unto men."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2260","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2260.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2260.mp3"]}},{"no":11,"arab":"فَخَرَجَ عَلَىٰ قَوْمِهِ مِنَ الْمِحْرَابِ فَأَوْحَىٰ إِلَيْهِمْ أَنْ سَبِّحُوا بُكْرَةً وَعَشِيًّا","latin":"fakharaja 'alaa qawmihi mina almihraabi fa-awhaa ilayhim an sabbihuu bukratan wa'asyiyyaan","translate":{"id":"Maka ia keluar dari mihrab menuju kaumnya, lalu ia memberi isyarat kepada mereka; hendaklah kamu bertasbih di waktu pagi dan petang.\n","en":"Thereupon he came out of the sanctuary unto his people and signified to them [by gestures]: \"Extol His limitless glory by day and by night!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2261","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2261.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2261.mp3"]}},{"no":12,"arab":"يَا يَحْيَىٰ خُذِ الْكِتَابَ بِقُوَّةٍ ۖ وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا","latin":"yaa yahyaa khudzi alkitaaba biquwwatin waaataynaahu alhukma shabiyyaan","translate":{"id":"Hai Yahya, ambillah Al Kitab (Taurat) itu dengan sungguh-sungguh. Dan kami berikan kepadanya hikmah selagi ia masih kanak-kanak,\n","en":"[And when the son was born and grew up, he was told,] \"O John! Hold fast unto the divine writ with [all thy] strength!\" - for We granted him wisdom \"while he was yet a little boy,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2262","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2262.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2262.mp3"]}},{"no":13,"arab":"وَحَنَانًا مِنْ لَدُنَّا وَزَكَاةً ۖ وَكَانَ تَقِيًّا","latin":"wahanaanan min ladunnaa wazakaatan wakaana taqiyyaan","translate":{"id":"dan rasa belas kasihan yang mendalam dari sisi Kami dan kesucian (dan dosa). Dan ia adalah seorang yang bertakwa,\n","en":"as well as, by Our grace, [the gift of] compassion and purity; and he was [always] conscious of Us"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2263","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2263.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2263.mp3"]}},{"no":14,"arab":"وَبَرًّا بِوَالِدَيْهِ وَلَمْ يَكُنْ جَبَّارًا عَصِيًّا","latin":"wabarran biwaalidayhi walam yakun jabbaaran 'ashiyyaan","translate":{"id":"dan seorang yang berbakti kepada kedua orang tuanya, dan bukanlah ia orang yang sombong lagi durhaka.\n","en":"and full of piety towards his parents; and never was he haughty or rebellious."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2264","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2264.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2264.mp3"]}},{"no":15,"arab":"وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا","latin":"wasalaamun 'alayhi yawma wulida wayawma yamuutu wayawma yub'atsu hayyaan","translate":{"id":"Kesejahteraan atas dirinya pada hari ia dilahirkan dan pada hari ia meninggal dan pada hari ia dibangkitkan hidup kembali.\n","en":"Hence, [God's] peace was upon him on the day when he was born, and on the day of his death, and. will be [upon him] on the day when he shall be raised to life [again]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2265","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2265.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2265.mp3"]}},{"no":16,"arab":"وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انْتَبَذَتْ مِنْ أَهْلِهَا مَكَانًا شَرْقِيًّا","latin":"waudzkur fii alkitaabi maryama idzi intabadzat min ahlihaa makaanan syarqiyyaan","translate":{"id":"Dan ceritakanlah (kisah) Maryam di dalam Al Qur'an, yaitu ketika ia menjauhkan diri dari keluarganya ke suatu tempat di sebelah timur,\n","en":"AND CALL to mind, through this divine writ, Mary. Lo! She withdrew from her family to an eastern place"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2266","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2266.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2266.mp3"]}},{"no":17,"arab":"فَاتَّخَذَتْ مِنْ دُونِهِمْ حِجَابًا فَأَرْسَلْنَا إِلَيْهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا","latin":"faittakhadzat min duunihim hijaaban fa-arsalnaa ilayhaa ruuhanaa fatamatstsala lahaa basyaran sawiyyaan","translate":{"id":"maka ia mengadakan tabir (yang melindunginya) dari mereka; lalu Kami mengutus roh Kami kepadanya, maka ia menjelma di hadapannya (dalam bentuk) manusia yang sempurna.\n","en":"and kept herself in seclusion from them, whereupon We sent unto her Our angel of revelation, who appeared to her in the shape of a well-made human being."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2267","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2267.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2267.mp3"]}},{"no":18,"arab":"قَالَتْ إِنِّي أَعُوذُ بِالرَّحْمَٰنِ مِنْكَ إِنْ كُنْتَ تَقِيًّا","latin":"qaalat innii a'uudzu bialrrahmaani minka in kunta taqiyyaan","translate":{"id":"Maryam berkata: \"Sesungguhnya aku berlindung dari padamu kepada Tuhan Yang Maha pemurah, jika kamu seorang yang bertakwa\".\n","en":"She exclaimed: \"Verily, 'I seek refuge from thee with the Most Gracious! [Approach me not] if thou art conscious of Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2268","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2268.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2268.mp3"]}},{"no":19,"arab":"قَالَ إِنَّمَا أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَامًا زَكِيًّا","latin":"qaala innamaa anaa rasuulu rabbiki li-ahaba laki ghulaaman zakiyyaan","translate":{"id":"Ia (jibril) berkata: \"Sesungguhnya aku ini hanyalah seorang utusan Tuhanmu, untuk memberimu seorang anak laki-laki yang suci\".\n","en":"[The angel] answered: \"I' am but a messenger of thy Sustainer, [who says,] `I shall bestow upon thee the gift of a son endowed with purity.'\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2269","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2269.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2269.mp3"]}},{"no":20,"arab":"قَالَتْ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيًّا","latin":"qaalat annaa yakuunu lii ghulaamun walam yamsasnii basyarun walam aku baghiyyaan","translate":{"id":"Maryam berkata: \"Bagaimana akan ada bagiku seorang anak laki-laki, sedang tidak pernah seorang manusiapun menyentuhku dan aku bukan (pula) seorang pezina!\"\n","en":"Said she: \"How can I have a son when no man has ever touched me? - for, never have I been a loose woman!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2270","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2270.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2270.mp3"]}},{"no":21,"arab":"قَالَ كَذَٰلِكِ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌ ۖ وَلِنَجْعَلَهُ آيَةً لِلنَّاسِ وَرَحْمَةً مِنَّا ۚ وَكَانَ أَمْرًا مَقْضِيًّا","latin":"qaala kadzaaliki qaala rabbuki huwa 'alayya hayyinun walinaj'alahu aayatan lilnnaasi warahmatan minnaa wakaana amran maqdhiyyaan","translate":{"id":"Jibril berkata: \"Demikianlah\". Tuhanmu berfirman: \"Hal itu adalah mudah bagiKu; dan agar dapat Kami menjadikannya suatu tanda bagi manusia dan sebagai rahmat dari Kami; dan hal itu adalah suatu perkara yang sudah diputuskan\".\n","en":"[The angel] answered: \"Thus it is; [but] thy Sustainer says, `This is easy for Me; and [thou shalt have a son,] so that We might make him a symbol unto mankind and an act of grace from US. And it was a thing decreed [by God]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2271","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2271.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2271.mp3"]}},{"no":22,"arab":"فَحَمَلَتْهُ فَانْتَبَذَتْ بِهِ مَكَانًا قَصِيًّا","latin":"fahamalat-hu faintabadzat bihi makaanan qashiyyaan","translate":{"id":"Maka Maryam mengandungnya, lalu ia menyisihkan diri dengan kandungannya itu ke tempat yang jauh.\n","en":"and in time she conceived him, and then she withdrew with him to a far-off place."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2272","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2272.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2272.mp3"]}},{"no":23,"arab":"فَأَجَاءَهَا الْمَخَاضُ إِلَىٰ جِذْعِ النَّخْلَةِ قَالَتْ يَا لَيْتَنِي مِتُّ قَبْلَ هَٰذَا وَكُنْتُ نَسْيًا مَنْسِيًّا","latin":"fa-ajaa-ahaa almakhaadu ilaa jidz'i alnnakhlati qaalat yaa laytanii mittu qabla haadzaa wakuntu nasyan mansiyyaan","translate":{"id":"Maka rasa sakit akan melahirkan anak memaksa ia (bersandar) pada pangkal pohon kurma, dia berkata: \"Aduhai, alangkah baiknya aku mati sebelum ini, dan aku menjadi barang yang tidak berarti, lagi dilupakan\".\n","en":"And [when] the throes of childbirth drove her to the trunk of a palm-tree, she exclaimed: \"Oh, would that I had died ere this, and had become a thing forgotten, utterly forgotten!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2273","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2273.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2273.mp3"]}},{"no":24,"arab":"فَنَادَاهَا مِنْ تَحْتِهَا أَلَّا تَحْزَنِي قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا","latin":"fanaadaahaa min tahtihaa allaa tahzanii qad ja'ala rabbuki tahtaki sariyyaan","translate":{"id":"Maka Jibril menyerunya dari tempat yang rendah: \"Janganlah kamu bersedih hati, sesungguhnya Tuhanmu telah menjadikan anak sungai di bawahmu.\n","en":"Thereupon [a voice] called out to her from beneath that [palm-tree]: \"Grieve not! Thy Sustainer has provided a rivulet [running] beneath thee;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2274","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2274.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2274.mp3"]}},{"no":25,"arab":"وَهُزِّي إِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسَاقِطْ عَلَيْكِ رُطَبًا جَنِيًّا","latin":"wahuzzii ilayki bijidz'i alnnakhlati tusaaqith 'alayki ruthaban janiyyaan","translate":{"id":"Dan goyanglah pangkal pohon kurma itu ke arahmu, niscaya pohon itu akan menggugurkan buah kurma yang masak kepadamu,\n","en":"and shake the trunk of the palm-tree towards thee: it will drop fresh, ripe dates upon thee."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2275","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2275.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2275.mp3"]}},{"no":26,"arab":"فَكُلِي وَاشْرَبِي وَقَرِّي عَيْنًا ۖ فَإِمَّا تَرَيِنَّ مِنَ الْبَشَرِ أَحَدًا فَقُولِي إِنِّي نَذَرْتُ لِلرَّحْمَٰنِ صَوْمًا فَلَنْ أُكَلِّمَ الْيَوْمَ إِنْسِيًّا","latin":"fakulii waisyrabii waqarrii 'aynan fa-immaa tarayinna mina albasyari ahadan faquulii innii nadzartu lilrrahmaani shawman falan ukallima alyawma insiyyaan","translate":{"id":"maka makan, minum dan bersenang hatilah kamu. Jika kamu melihat seorang manusia, maka katakanlah: \"Sesungguhnya aku telah bernazar berpuasa untuk Tuhan Yang Maha Pemurah, maka aku tidak akan berbicara dengan seorang manusiapun pada hari ini\".\n","en":"Eat, then, and drink, and let thine eye be gladdened! And if thou shouldst see any human being, convey this unto him: `Behold, abstinence from speech have I vowed unto the Most Gracious; hence, I may not speak today to any mortal."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2276","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2276.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2276.mp3"]}},{"no":27,"arab":"فَأَتَتْ بِهِ قَوْمَهَا تَحْمِلُهُ ۖ قَالُوا يَا مَرْيَمُ لَقَدْ جِئْتِ شَيْئًا فَرِيًّا","latin":"fa-atat bihi qawmahaa tahmiluhu qaaluu yaa maryamu laqad ji/ti syay-an fariyyaan","translate":{"id":"Maka Maryam membawa anak itu kepada kaumnya dengan menggendongnya. Kaumnya berkata: \"Hai Maryam, sesungguhnya kamu telah melakukan sesuatu yang amat mungkar.\n","en":"And in time she returned to her people, carrying the child with her. They said: \"O Mary! Thou hast indeed done an amazing thing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2277","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2277.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2277.mp3"]}},{"no":28,"arab":"يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا","latin":"yaa ukhta haaruuna maa kaana abuuki imra-a saw-in wamaa kaanat ummuki baghiyyaan","translate":{"id":"Hai saudara perempuan Harun , ayahmu sekali-kali bukanlah seorang yang jahat dan ibumu sekali-kali bukanlah seorang pezina\",\n","en":"O sister of Aaron! Thy father was not a wicked man, nor was thy mother a loose woman!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2278","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2278.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2278.mp3"]}},{"no":29,"arab":"فَأَشَارَتْ إِلَيْهِ ۖ قَالُوا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِي الْمَهْدِ صَبِيًّا","latin":"fa-asyaarat ilayhi qaaluu kayfa nukallimu man kaana fii almahdi shabiyyaan","translate":{"id":"maka Maryam menunjuk kepada anaknya. Mereka berkata: \"Bagaimana kami akan berbicara dengan anak kecil yang masih di dalam ayunan?\"\n","en":"Thereupon she pointed to him. They exclaimed: \"How can we talk to one who [as yet] is a little boy in the cradle?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2279","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2279.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2279.mp3"]}},{"no":30,"arab":"قَالَ إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا","latin":"qaala innii 'abdu allaahi aataaniya alkitaaba waja'alanii nabiyyaan","translate":{"id":"Berkata Isa: \"Sesungguhnya aku ini hamba Allah, Dia memberiku Al Kitab (Injil) dan Dia menjadikan aku seorang nabi,\n","en":"[But] he said: \"Behold, I am a servant of God. He has vouchsafed unto me revelation and made me a prophet,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2280","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2280.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2280.mp3"]}},{"no":31,"arab":"وَجَعَلَنِي مُبَارَكًا أَيْنَ مَا كُنْتُ وَأَوْصَانِي بِالصَّلَاةِ وَالزَّكَاةِ مَا دُمْتُ حَيًّا","latin":"waja'alanii mubaarakan aynamaa kuntu wa-awshaanii bialshshalaati waalzzakaati maa dumtu hayyaan","translate":{"id":"dan Dia menjadikan aku seorang yang diberkati di mana saja aku berada, dan Dia memerintahkan kepadaku (mendirikan) shalat dan (menunaikan) zakat selama aku hidup;\n","en":"and made me blessed wherever I may be; and He has enjoined upon me prayer and charity as long as I live,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2281","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2281.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2281.mp3"]}},{"no":32,"arab":"وَبَرًّا بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا","latin":"wabarran biwaalidatii walam yaj'alnii jabbaaran syaqiyyaan","translate":{"id":"dan berbakti kepada ibuku, dan Dia tidak menjadikan aku seorang yang sombong lagi celaka.\n","en":"and [has endowed me with] piety towards my mother; and He has not made me haughty or bereft of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2282","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2282.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2282.mp3"]}},{"no":33,"arab":"وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا","latin":"waalssalaamu 'alayya yawma wulidtu wayawma amuutu wayawma ub'atsu hayyaan","translate":{"id":"Dan kesejahteraan semoga dilimpahkan kepadaku, pada hari aku dilahirkan, pada hari aku meninggal dan pada hari aku dibangkitkan hidup kembali\".\n","en":"\"Hence, peace was upon me on the day when I was born, and [will be upon me] on the day of my death, and on the day when I shall be raised to life [again]!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2283","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2283.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2283.mp3"]}},{"no":34,"arab":"ذَٰلِكَ عِيسَى ابْنُ مَرْيَمَ ۚ قَوْلَ الْحَقِّ الَّذِي فِيهِ يَمْتَرُونَ","latin":"dzaalika 'iisaa ibnu maryama qawla alhaqqi alladzii fiihi yamtaruuna","translate":{"id":"Itulah Isa putera Maryam, yang mengatakan perkataan yang benar, yang mereka berbantah-bantahan tentang kebenarannya.\n","en":"SUCH WAS, in the words of truth, Jesus the son of Mary, about whose nature they so deeply disagree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2284","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2284.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2284.mp3"]}},{"no":35,"arab":"مَا كَانَ لِلَّهِ أَنْ يَتَّخِذَ مِنْ وَلَدٍ ۖ سُبْحَانَهُ ۚ إِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ","latin":"maa kaana lillaahi an yattakhidza min waladin subhaanahu idzaa qadaa amran fa-innamaa yaquulu lahu kun fayakuunu","translate":{"id":"Tidak layak bagi Allah mempunyai anak, Maha Suci Dia. Apabila Dia telah menetapkan sesuatu, maka Dia hanya berkata kepadanya: \"Jadilah\", maka jadilah ia.\n","en":"It is not conceivable that God should have taken unto Himself a son: limitless is He in His glory! When He wills a thing to be, He but says unto it \"Be\" -and it is!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2285","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2285.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2285.mp3"]}},{"no":36,"arab":"وَإِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ","latin":"wa-inna allaaha rabbii warabbukum fau'buduuhu haadzaa shiraathun mustaqiimun","translate":{"id":"Sesungguhnya Allah adalah Tuhanku dan Tuhanmu, maka sembahIah Dia oleh kamu sekalian. Ini adalah jalan yang lurus.\n","en":"And [thus it was that Jesus always said]: \"Verily, God is my Sustainer as well as your Sustainer; so worship [none but] Him: this (alone] is a straight way.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2286","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2286.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2286.mp3"]}},{"no":37,"arab":"فَاخْتَلَفَ الْأَحْزَابُ مِنْ بَيْنِهِمْ ۖ فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنْ مَشْهَدِ يَوْمٍ عَظِيمٍ","latin":"faikhtalafa al-ahzaabu min baynihim fawaylun lilladziina kafaruu min masyhadi yawmin 'azhiimin","translate":{"id":"Maka berselisihlah golongan-golongan (yang ada) di antara mereka . Maka kecelakaanlah bagi orang-orang kafir pada waktu menyaksikan hari yang besar.\n","en":"And yet, the sects [that follow the Bible] are at variance among themselves [about the nature of Jesus Woe, then, unto all who deny the truth when that awesome Day will appear!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2287","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2287.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2287.mp3"]}},{"no":38,"arab":"أَسْمِعْ بِهِمْ وَأَبْصِرْ يَوْمَ يَأْتُونَنَا ۖ لَٰكِنِ الظَّالِمُونَ الْيَوْمَ فِي ضَلَالٍ مُبِينٍ","latin":"asmi' bihim wa-abshir yawma ya/tuunanaa laakini alzhzhaalimuuna alyawma fii dhalaalin mubiinin","translate":{"id":"Alangkah terangnya pendengaran mereka dan alangkah tajamnya penglihatan mereka pada hari mereka datang kepada Kami. Tetapi orang-orang yang zalim pada hari ini (di dunia) berada dalam kesesatan yang nyata.\n","en":"How well will they hear and see [the truth] on the Day when they come before Us! Today, however, these evildoers are obviously lost in error:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2288","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2288.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2288.mp3"]}},{"no":39,"arab":"وَأَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الْأَمْرُ وَهُمْ فِي غَفْلَةٍ وَهُمْ لَا يُؤْمِنُونَ","latin":"wa-andzirhum yawma alhasrati idz qudhiya al-amru wahum fii ghaflatin wahum laa yu/minuuna","translate":{"id":"Dan berilah mereka peringatan tentang hari penyesalan, (yaitu) ketika segala perkara telah diputus. Dan mereka dalam kelalaian dan mereka tidak (pula) beriman.\n","en":"hence, warn them of [the coming of] the Day of Regrets, when everything will have been decided-for as yet they are heedless, and they do not believe [in it]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2289","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2289.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2289.mp3"]}},{"no":40,"arab":"إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ","latin":"innaa nahnu naritsu al-ardha waman 'alayhaa wa-ilaynaa yurja'uuna","translate":{"id":"Sesungguhnya Kami mewarisi bumi dan semua orang-orang yang ada di atasnya, dan hanya kepada Kamilah mereka dikembalikan.\n","en":"Behold, We alone shall remain after the earth and all who live on it have passed away, and (when] unto Us all will have been brought back."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2290","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2290.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2290.mp3"]}},{"no":41,"arab":"وَاذْكُرْ فِي الْكِتَابِ إِبْرَاهِيمَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَبِيًّا","latin":"waudzkur fii alkitaabi ibraahiima innahu kaana shiddiiqan nabiyyaan","translate":{"id":"Ceritakanlah (Hai Muhammad) kisah Ibrahim di dalam Al Kitab (Al Quraan) ini. Sesungguhnya ia adalah seorang yang sangat membenarkan lagi seorang Nabi.\n","en":"AND CALL to mind, through this divine writ, Abraham. Behold, he was a man of truth, [already] a prophet"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2291","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2291.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2291.mp3"]}},{"no":42,"arab":"إِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنْكَ شَيْئًا","latin":"idz qaala li-abiihi yaa abati lima ta'budu maa laa yasma'u walaa yubshiru walaa yughnii 'anka syay-aan","translate":{"id":"Ingatlah ketika ia berkata kepada bapaknya; \"Wahai bapakku, mengapa kamu menyembah sesuatu yang tidak mendengar, tidak melihat dan tidak dapat menolong kamu sedikitpun?\n","en":"when he spoke [thus] unto his father: \"O my father! Why dost thou worship something that neither hears nor sees and can be of no avail whatever to thee?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2292","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2292.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2292.mp3"]}},{"no":43,"arab":"يَا أَبَتِ إِنِّي قَدْ جَاءَنِي مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِي أَهْدِكَ صِرَاطًا سَوِيًّا","latin":"yaa abati innii qad jaa-anii mina al'ilmi maa lam ya/tika faittabi'nii ahdika shiraathan sawiyyaan","translate":{"id":"Wahai bapakku, sesungguhnya telah datang kepadaku sebahagian ilmu pengetahuan yang tidak datang kepadamu, maka ikutilah aku, niscaya aku akan menunjukkan kepadamu jalan yang lurus.\n","en":"\"O my father! Behold, there has indeed come to me [a ray] of knowledge such as has never yet come unto thee: follow me, then; I shall guide thee onto a perfect way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2293","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2293.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2293.mp3"]}},{"no":44,"arab":"يَا أَبَتِ لَا تَعْبُدِ الشَّيْطَانَ ۖ إِنَّ الشَّيْطَانَ كَانَ لِلرَّحْمَٰنِ عَصِيًّا","latin":"yaa abati laa ta'budi alsysyaythaana inna alsysyaythaana kaana lilrrahmaani 'ashiyyaan","translate":{"id":"Wahai bapakku, janganlah kamu menyembah syaitan. Sesungguhnya syaitan itu durhaka kepada Tuhan Yang Maha Pemurah.\n","en":"\"O my father! Do not worship Satan-for, verily, Satan is a rebel against the Most Gracious!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2294","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2294.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2294.mp3"]}},{"no":45,"arab":"يَا أَبَتِ إِنِّي أَخَافُ أَنْ يَمَسَّكَ عَذَابٌ مِنَ الرَّحْمَٰنِ فَتَكُونَ لِلشَّيْطَانِ وَلِيًّا","latin":"yaa abati innii akhaafu an yamassaka 'adzaabun mina alrrahmaani fatakuuna lilsysyyathaani waliyyaan","translate":{"id":"Wahai bapakku, sesungguhnya aku khawatir bahwa kamu akan ditimpa azab dari Tuhan Yang Maha Pemurah, maka kamu menjadi kawan bagi syaitan\".\n","en":"O my father! I dread lest a chastisement from the Most Gracious befall thee, and then thou wilt become [aware of having been] close unto Satan!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2295","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2295.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2295.mp3"]}},{"no":46,"arab":"قَالَ أَرَاغِبٌ أَنْتَ عَنْ آلِهَتِي يَا إِبْرَاهِيمُ ۖ لَئِنْ لَمْ تَنْتَهِ لَأَرْجُمَنَّكَ ۖ وَاهْجُرْنِي مَلِيًّا","latin":"qaala araaghibun anta 'an aalihatii yaa ibraahiimu la-in lam tantahi la-arjumannaka wauhjurnii maliyyaan","translate":{"id":"Berkata bapaknya: \"Bencikah kamu kepada tuhan-tuhanku, hai Ibrahim? Jika kamu tidak berhenti, maka niscaya kamu akan kurajam, dan tinggalkanlah aku buat waktu yang lama\".\n","en":"He answered: \"Dost thou dislike my gods, O Abraham? Indeed, if thou desist not, I shall most certainly cause thee to be stoned to death! Now begone from me for good!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2296","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2296.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2296.mp3"]}},{"no":47,"arab":"قَالَ سَلَامٌ عَلَيْكَ ۖ سَأَسْتَغْفِرُ لَكَ رَبِّي ۖ إِنَّهُ كَانَ بِي حَفِيًّا","latin":"qaala salaamun 'alayka sa-astaghfiru laka rabbii innahu kaana bii hafiyyaan","translate":{"id":"Berkata Ibrahim: \"Semoga keselamatan dilimpahkan kepadamu, aku akan memintakan ampun bagimu kepada Tuhanku. Sesungguhnya Dia sangat baik kepadaku.\n","en":"[Abraham] replied: \"Peace be upon thee! I shall ask my Sustainer to forgive thee: for, behold, He has always been kind unto me."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2297","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2297.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2297.mp3"]}},{"no":48,"arab":"وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِنْ دُونِ اللَّهِ وَأَدْعُو رَبِّي عَسَىٰ أَلَّا أَكُونَ بِدُعَاءِ رَبِّي شَقِيًّا","latin":"wa-a'tazilukum wamaa tad'uuna min duuni allaahi wa-ad'uu rabbii 'asaa allaa akuuna bidu'aa-i rabbii syaqiyyaan","translate":{"id":"Dan aku akan menjauhkan diri darimu dan dari apa yang kamu seru selain Allah, dan aku akan berdo'a kepada Tuhanku, mudah-mudahan aku tidak akan kecewa dengan berdo'a kepada Tuhanku\".\n","en":"But I shall withdraw from you all and from whatever you invoke instead of God, and shall invoke my Sustainer [alone]: it may well be that my prayer [for thee] will not remain unanswered by my Sustainer.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2298","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2298.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2298.mp3"]}},{"no":49,"arab":"فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ وَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۖ وَكُلًّا جَعَلْنَا نَبِيًّا","latin":"falammaa i'tazalahum wamaa ya'buduuna min duuni allaahi wahabnaa lahu ishaaqa waya'quuba wakullan ja'alnaa nabiyyaan","translate":{"id":"Maka ketika Ibrahim sudah menjauhkan diri dari mereka dan dari apa yang mereka sembah selain Allah, Kami anugerahkan kepadanya Ishak, dan Ya'qub. Dan masing-masingnya Kami angkat menjadi nabi.\n","en":"And after he had withdrawn from them and from all that they were worshipping instead of God, We bestowed upon him Isaac and Jacob, and made each of them a prophet;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2299","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2299.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2299.mp3"]}},{"no":50,"arab":"وَوَهَبْنَا لَهُمْ مِنْ رَحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا","latin":"wawahabnaa lahum min rahmatinaa waja'alnaa lahum lisaana shidqin 'aliyyaan","translate":{"id":"Dan Kami anugerahkan kepada mereka sebagian dari rahmat Kami dan Kami jadikan mereka buah tutur yang baik lagi tinggi.\n","en":"and We bestowed upon them [manifold] gifts out of Our grace, and granted them a lofty power to convey the truth [unto others]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2300","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2300.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2300.mp3"]}},{"no":51,"arab":"وَاذْكُرْ فِي الْكِتَابِ مُوسَىٰ ۚ إِنَّهُ كَانَ مُخْلَصًا وَكَانَ رَسُولًا نَبِيًّا","latin":"waudzkur fii alkitaabi muusaa innahu kaana mukhlashan wakaana rasuulan nabiyyaan","translate":{"id":"Dan ceritakanlah (hai Muhammad kepada mereka), kisah Musa di dalam Al Kitab (Al Quraan) ini. Sesungguhnya ia adalah seorang yang dipilih dan seorang rasul dan nabi.\n","en":"AND CALL to mind, through this divine writ, Moses. Behold, he was a chosen one, and was an apostle [of God], a prophet."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2301","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2301.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2301.mp3"]}},{"no":52,"arab":"وَنَادَيْنَاهُ مِنْ جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا","latin":"wanaadaynaahu min jaanibi alththhuuri al-aymani waqarrabnaahu najiyyaan","translate":{"id":"Dan Kami telah memanggilnya dari sebelah kanan gunung Thur dan Kami telah mendekatkannya kepada Kami di waktu dia munajat (kepada Kami).\n","en":"And [remember how] We called upon him from the right-hand slope of Mount Sinai and drew him near [unto Us] in mystic communion,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2302","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2302.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2302.mp3"]}},{"no":53,"arab":"وَوَهَبْنَا لَهُ مِنْ رَحْمَتِنَا أَخَاهُ هَارُونَ نَبِيًّا","latin":"wawahabnaa lahu min rahmatinaa akhaahu haaruuna nabiyyaan","translate":{"id":"Dan Kami telah menganugerahkan kepadanya sebagian rahmat Kami, yaitu saudaranya, Harun menjadi seorang nabi.\n","en":"and [how], out of Our grace, We granted unto him his brother Aaron, to be a prophet [by his side]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2303","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2303.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2303.mp3"]}},{"no":54,"arab":"وَاذْكُرْ فِي الْكِتَابِ إِسْمَاعِيلَ ۚ إِنَّهُ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُولًا نَبِيًّا","latin":"waudzkur fii alkitaabi ismaa'iila innahu kaana shaadiqa alwa'di wakaana rasuulan nabiyyaan","translate":{"id":"Dan ceritakanlah (hai Muhammad kepada mereka) kisah Ismail (yang tersebut) di dalam Al Quraan. Sesungguhnya ia adalah seorang yang benar janjinya, dan dia adalah seorang rasul dan nabi.\n","en":"AND CALL to mind, through this divine writ, Ishmael. Behold, he was always true to his promise, and was an apostle [of God], a prophet,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2304","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2304.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2304.mp3"]}},{"no":55,"arab":"وَكَانَ يَأْمُرُ أَهْلَهُ بِالصَّلَاةِ وَالزَّكَاةِ وَكَانَ عِنْدَ رَبِّهِ مَرْضِيًّا","latin":"wakaana ya/muru ahlahu bialshshalaati waalzzakaati wakaana 'inda rabbihi mardhiyyaan","translate":{"id":"Dan ia menyuruh ahlinya untuk bersembahyang dan menunaikan zakat, dan ia adalah seorang yang diridhai di sisi Tuhannya.\n","en":"who used to enjoin upon his people prayer and charity, and found favour in his Sustainer's sight."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2305","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2305.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2305.mp3"]}},{"no":56,"arab":"وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَبِيًّا","latin":"waudzkur fii alkitaabi idriisa innahu kaana shiddiiqan nabiyyaan","translate":{"id":"Dan ceritakanlah (hai Muhammad kepada mereka, kisah) Idris (yang tersebut) di dalam Al Quraan. Sesungguhnya ia adalah seorang yang sangat membenarkan dan seorang nabi.\n","en":"AND CALL to mind, through this divine writ, Idris. Behold, he was a man of truth, a prophet,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2306","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2306.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2306.mp3"]}},{"no":57,"arab":"وَرَفَعْنَاهُ مَكَانًا عَلِيًّا","latin":"warafa'naahu makaanan 'aliyyaan","translate":{"id":"Dan Kami telah mengangkatnya ke martabat yang tinggi.\n","en":"whom We exalted onto a lofty station."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2307","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2307.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2307.mp3"]}},{"no":58,"arab":"أُولَٰئِكَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ مِنْ ذُرِّيَّةِ آدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ وَمِنْ ذُرِّيَّةِ إِبْرَاهِيمَ وَإِسْرَائِيلَ وَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَا ۚ إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُ الرَّحْمَٰنِ خَرُّوا سُجَّدًا وَبُكِيًّا ۩","latin":"ulaa-ika alladziina an'ama allaahu 'alayhim mina alnnabiyyiina min dzurriyyati aadama wamimman hamalnaa ma'a nuuhin wamin dzurriyyati ibraahiima wa-israa-iila wamimman hadaynaa waijtabaynaa idzaa tutlaa 'alayhim aayaatu alrrahmaani kharruu sujjadan wabukiyyaan","translate":{"id":"Mereka itu adalah orang-orang yang telah diberi ni'mat oleh Allah, yaitu para nabi dari keturunan Adam, dan dari orang-orang yang Kami angkat bersama Nuh, dan dari keturunan Ibrahim dan Israil, dan dari orang-orang yang telah Kami beri petunjuk dan telah Kami pilih. Apabila dibacakan ayat-ayat Allah Yang Maha Pemurah kepada mereka, maka mereka menyungkur dengan bersujud dan menangis.\n","en":"THESE WERE some of the prophets upon whom God bestowed His blessings - [prophets] of the seed of Adam and of those whom We caused to be borne [in the ark] with Noah, and of the seed of Abraham and Israel and [all of them were] among those whom We had guided and elected; [and] whenever the messages of the Most Gracious were conveyed unto them, they would fall down [before Him], prostrating themselves and weeping."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2308","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2308.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2308.mp3"]}},{"no":59,"arab":"فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ ۖ فَسَوْفَ يَلْقَوْنَ غَيًّا","latin":"fakhalafa min ba'dihim khalfun adaa'uu alshshalaata waittaba'uu alsysyahawaati fasawfa yalqawna ghayyaan","translate":{"id":"Maka datanglah sesudah mereka, pengganti (yang jelek) yang menyia-nyiakan shalat dan memperturutkan hawa nafsunya, maka mereka kelak akan menemui kesesatan,\n","en":"Yet they were succeeded by generations [of people] who lost all [thought of] prayer and followed [but] their own lusts; and these will, in time, meet with utter disillusion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2309","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2309.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2309.mp3"]}},{"no":60,"arab":"إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ شَيْئًا","latin":"illaa man taaba waaamana wa'amila shaalihan faulaa-ika yadkhuluuna aljannata walaa yuzhlamuuna syay-aan","translate":{"id":"kecuali orang yang bertaubat, beriman dan beramal saleh, maka mereka itu akan masuk syurga dan tidak dianiaya (dirugikan) sedikitpun,\n","en":"Excepted, however, shall be those who repent and attain to faith and do righteous deeds: for it is they who will enter paradise and will not be wronged in any way:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2310","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2310.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2310.mp3"]}},{"no":61,"arab":"جَنَّاتِ عَدْنٍ الَّتِي وَعَدَ الرَّحْمَٰنُ عِبَادَهُ بِالْغَيْبِ ۚ إِنَّهُ كَانَ وَعْدُهُ مَأْتِيًّا","latin":"jannaati 'adnin allatii wa'ada alrrahmaanu 'ibaadahu bialghaybi innahu kaana wa'duhu ma/tiyyaan","translate":{"id":"yaitu syurga 'Adn yang telah dijanjikan oleh Tuhan Yang Maha Pemurah kepada hamba-hamba-Nya, sekalipun (syurga itu) tidak nampak. Sesungguhnya janji Allah itu pasti akan ditepati.\n","en":"[theirs will be the] gardens of perpetual bliss which the Most Gracious has promised unto His servants, in a realm which is beyond the reach of human perception: [and,] verily, His promise is ever sure of fulfilment!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2311","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2311.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2311.mp3"]}},{"no":62,"arab":"لَا يَسْمَعُونَ فِيهَا لَغْوًا إِلَّا سَلَامًا ۖ وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا","latin":"laa yasma'uuna fiihaa laghwan illaa salaaman walahum rizquhum fiihaa bukratan wa'asyiyyaan","translate":{"id":"Mereka tidak mendengar perkataan yang tak berguna di dalam syurga, kecuali ucapan salam. Bagi mereka rezkinya di syurga itu tiap-tiap pagi dan petang.\n","en":"No empty talk will they hear there-nothing but [tidings of] inner soundness and peace; and there will they have their sustenance by day and by night:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2312","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2312.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2312.mp3"]}},{"no":63,"arab":"تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا","latin":"tilka aljannatu allatii nuuritsu min 'ibaadinaa man kaana taqiyyaan","translate":{"id":"Itulah syurga yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa.\n","en":"this is the paradise which We grant as a heritage unto such of Our servants as are conscious of Us."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2313","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2313.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2313.mp3"]}},{"no":64,"arab":"وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ ۖ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَٰلِكَ ۚ وَمَا كَانَ رَبُّكَ نَسِيًّا","latin":"wamaa natanazzalu illaa bi-amri rabbika lahu maa bayna aydiinaa wamaa khalfanaa wamaa bayna dzaalika wamaa kaana rabbuka nasiyyaan","translate":{"id":"Dan tidaklah kami (Jibril) turun, kecuali dengan perintah Tuhanmu. Kepunyaan-Nya-lah apa-apa yang ada di hadapan kita, apa-apa yang ada di belakang kita dan apa-apa yang ada di antara keduanya, dan tidaklah Tuhanmu lupa.\n","en":"AND [the angels say]: \"We do not descend [with revelation], again and again, other than by thy Sustainer's command: unto Him belongs all that lies open before us and all that is hidden-from us and all that is in-between. And never does thy Sustainer forget [anything] –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2314","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2314.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2314.mp3"]}},{"no":65,"arab":"رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ ۚ هَلْ تَعْلَمُ لَهُ سَمِيًّا","latin":"rabbu alssamaawaati waal-ardhi wamaa baynahumaa fau'budhu waisthabir li'ibaadatihi hal ta'lamu lahu samiyyaan","translate":{"id":"Tuhan (yang menguasai) langit dan bumi dan apa-apa yang ada di antara keduanya, maka sembahlah Dia dan berteguh hatilah dalam beribadat kepada-Nya. Apakah kamu mengetahui ada seorang yang sama dengan Dia (yang patut disembah)?\n","en":"the Sustainer of the heavens and the earth and all that is between them! Worship, then, Him alone, and remain steadfast in His worship! Dost thou know any whose name is worthy to be mentioned side by side with His?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2315","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2315.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2315.mp3"]}},{"no":66,"arab":"وَيَقُولُ الْإِنْسَانُ أَإِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيًّا","latin":"wayaquulu al-insaanu a-idzaa maa mittu lasawfa ukhraju hayyaan","translate":{"id":"Dan berkata manusia: \"Betulkah apabila aku telah mati, bahwa aku sungguh-sungguh akan dibangkitkan menjadi hidup kembali?\"\n","en":"WITH ALL THIS, man [often] says, \"What! Once I am dead, shall I again be brought forth alive?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2316","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2316.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2316.mp3"]}},{"no":67,"arab":"أَوَلَا يَذْكُرُ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئًا","latin":"awa laa yadzkuru al-insaanu annaa khalaqnaahu min qablu walam yaku syay-aan","translate":{"id":"Dan tidakkah manusia itu memikirkan bahwa sesungguhnya Kami telah menciptakannya dahulu, sedang ia tidak ada sama sekali?\n","en":"But does man not bear in mind that We have created him aforetime out of nothing?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2317","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2317.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2317.mp3"]}},{"no":68,"arab":"فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا","latin":"fawarabbika lanahsyurannahum waalsysyayaathiina tsumma lanuhdirannahum hawla jahannama jitsiyyaan","translate":{"id":"Demi Tuhanmu, sesungguhnya akan Kami bangkitkan mereka bersama syaitan, kemudian akan Kami datangkan mereka ke sekeliling Jahannam dengan berlutut.\n","en":"And so, by thy Sustainer, [on Judgment Day] We shall most certainly bring them forth together with the satanic forces [which impelled them in life] and then We shall most certainly gather them, on their knees, around hell;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2318","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2318.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2318.mp3"]}},{"no":69,"arab":"ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَٰنِ عِتِيًّا","latin":"tsumma lananzi'anna min kulli syii'atin ayyuhum asyaddu 'alaa alrrahmaani 'itiyyaan","translate":{"id":"Kemudian pasti akan Kami tarik dari tiap-tiap golongan siapa di antara mereka yang sangat durhaka kepada Tuhan Yang Maha Pemurah.\n","en":"and thereupon We shall, indeed, draw forth from every group [of sinners] the ones that had been most determined in their disdainful rebellion against the Most Gracious:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2319","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2319.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2319.mp3"]}},{"no":70,"arab":"ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَىٰ بِهَا صِلِيًّا","latin":"tsumma lanahnu a'lamu bialladziina hum awlaa bihaa shiliyyaan","translate":{"id":"Dan kemudian Kami sungguh lebih mengetahui orang-orang yang seharusnya dimasukkan ke dalam neraka.\n","en":"for, indeed, We know best as to which of them is most deserving of the fires of hell."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2320","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2320.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2320.mp3"]}},{"no":71,"arab":"وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا ۚ كَانَ عَلَىٰ رَبِّكَ حَتْمًا مَقْضِيًّا","latin":"wa-in minkum illaa waariduhaa kaana 'alaa rabbika hatman maqdhiyyaan","translate":{"id":"Dan tidak ada seorangpun dari padamu, melainkan mendatangi neraka itu. Hal itu bagi Tuhanmu adalah suatu kemestian yang sudah ditetapkan.\n","en":"And every one of you will come within sight of it: this is, with thy Sustainer, a decree that must be fulfilled."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2321","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2321.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2321.mp3"]}},{"no":72,"arab":"ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا","latin":"tsumma nunajjii alladziina ittaqaw wanadzaru alzhzhaalimiina fiihaa jitsiyyaan","translate":{"id":"Kemudian Kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan orang-orang yang zalim di dalam neraka dalam keadaan berlutut.\n","en":"And once again: We shall save [from hell] those who have been conscious of Us; but We shall leave in it the evildoers, on their knees."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2322","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2322.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2322.mp3"]}},{"no":73,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقَامًا وَأَحْسَنُ نَدِيًّا","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa bayyinaatin qaala alladziina kafaruu lilladziina aamanuu ayyu alfariiqayni khayrun maqaaman wa-ahsanu nadiyyaan","translate":{"id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami yang terang (maksudnya), niscaya orang-orang yang kafir berkata kepada orang-orang yang beriman: \"Manakah di antara kedua golongan (kafir dan mu'min) yang lebih baik tempat tinggalnya dan lebih indah tempat pertemuan(nya)?\"\n","en":"AS IT IS, whenever Our messages are conveyed to them in all their clarity, those who are bent on denying the truth are wont to say unto those who have attained to faith: \"Which of the two kinds of man is in a stronger position and superior as a community?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2323","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2323.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2323.mp3"]}},{"no":74,"arab":"وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَحْسَنُ أَثَاثًا وَرِئْيًا","latin":"wakam ahlaknaa qablahum min qarnin hum ahsanu atsaatsan wari/yaan","translate":{"id":"Berapa banyak umat yang telah Kami binasakan sebelum mereka , sedang mereka adalah lebih bagus alat rumah tangganya dan lebih sedap di pandang mata.\n","en":"And yet, how many a generation have We destroyed before their time-[people] who surpassed them in material power and in outward show!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2324","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2324.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2324.mp3"]}},{"no":75,"arab":"قُلْ مَنْ كَانَ فِي الضَّلَالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمَٰنُ مَدًّا ۚ حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ إِمَّا الْعَذَابَ وَإِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَكَانًا وَأَضْعَفُ جُنْدًا","latin":"qul man kaana fii aldhdhalaalati falyamdud lahu alrrahmaanu maddan hattaa idzaa ra-aw maa yuu'aduuna immaa al'adzaaba wa-immaa alssaa'ata fasaya'lamuuna man huwa syarrun makaanan wa-adh'afu jundaan","translate":{"id":"Katakanlah: \"Barang siapa yang berada di dalam kesesatan, maka biarlah Tuhan yang Maha Pemurah memperpanjang tempo baginya ; sehingga apabila mereka telah melihat apa yang diancamkan kepadanya, baik siksa maupun kiamat, maka mereka akan mengetahui siapa yang lebih jelek kedudukannya dan lebih lemah penolong-penolongnya\".\n","en":"Say: \"As for him who lives in error, may the Most Gracious lengthen the span of his life! [And let them say whatever they say until the time when they behold that [doom] of which they were forewarned-whether it be suffering [in this world] or [at the coming of] the Last Hour -: for then they will understand which [of the two kinds of man] was worse in station and weaker in resources!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2325","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2325.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2325.mp3"]}},{"no":76,"arab":"وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى ۗ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَرَدًّا","latin":"wayaziidu allaahu alladziina ihtadaw hudan waalbaaqiyaatu alshshaalihaatu khayrun 'inda rabbika tsawaaban wakhayrun maraddaan","translate":{"id":"Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk. Dan amal-amal saleh yang kekal itu lebih baik pahalanya di sisi Tuhanmu dan lebih baik kesudahannya.\n","en":"And God endows those who avail themselves of [His] guidance with an ever-deeper consciousness of the right way; and good deeds, the fruit whereof endures forever, are, in thy Sustainer's sight, of far greater merit [than any worldly goods], and yield far better returns."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2326","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2326.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2326.mp3"]}},{"no":77,"arab":"أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا","latin":"afara-ayta alladzii kafara bi-aayaatinaa waqaala lauutayanna maalan wawaladaan","translate":{"id":"Maka apakah kamu telah melihat orang yang kafir kepada ayat-ayat Kami dan ia mengatakan: \"Pasti aku akan diberi harta dan anak\".\n","en":"And hast thou ever considered [the kind of man] who is bent on denying the truth of Our messages and says, \"I will surely be given wealth and children\"?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2327","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2327.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2327.mp3"]}},{"no":78,"arab":"أَطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِنْدَ الرَّحْمَٰنِ عَهْدًا","latin":"aththhala'a alghayba ami ittakhadza 'inda alrrahmaani 'ahdaan","translate":{"id":"Adakah ia melihat yang ghaib atau ia telah membuat perjanjian di sisi Tuhan Yang Maha Pemurah?,\n","en":"Has he, perchance, attained to a realm which is beyond the reach of a created being's perception? or has he concluded a covenant with the Most Gracious?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2328","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2328.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2328.mp3"]}},{"no":79,"arab":"كَلَّا ۚ سَنَكْتُبُ مَا يَقُولُ وَنَمُدُّ لَهُ مِنَ الْعَذَابِ مَدًّا","latin":"kallaa sanaktubu maa yaquulu wanamuddu lahu mina al'adzaabi maddaan","translate":{"id":"sekali-kali tidak, Kami akan menulis apa yang ia katakan, dan benar-benar Kami akan memperpanjang azab untuknya,\n","en":"Nay! We shall record what he says, and We shall lengthen the length of his suffering [in the hereafter],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2329","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2329.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2329.mp3"]}},{"no":80,"arab":"وَنَرِثُهُ مَا يَقُولُ وَيَأْتِينَا فَرْدًا","latin":"wanaritsuhu maa yaquulu waya/tiinaa fardaan","translate":{"id":"dan Kami akan mewarisi apa yang ia katakan itu , dan ia akan datang kepada Kami dengan seorang diri.\n","en":"and divest him of all that he is [now] speaking of: for [on Judgment Day] he will appear before Us in a lonely state."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2330","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2330.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2330.mp3"]}},{"no":81,"arab":"وَاتَّخَذُوا مِنْ دُونِ اللَّهِ آلِهَةً لِيَكُونُوا لَهُمْ عِزًّا","latin":"waittakhadzuu min duuni allaahi aalihatan liyakuunuu lahum 'izzaan","translate":{"id":"Dan mereka telah mengambil sembahan-sembahan selain Allah, agar sembahan-sembahan itu menjadi pelindung bagi mereka,\n","en":"For [such as] these have taken to worshipping deities other than God, hoping that they would be a [source of] strength for them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2331","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2331.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2331.mp3"]}},{"no":82,"arab":"كَلَّا ۚ سَيَكْفُرُونَ بِعِبَادَتِهِمْ وَيَكُونُونَ عَلَيْهِمْ ضِدًّا","latin":"kallaa sayakfuruuna bi'ibaadatihim wayakuunuuna 'alayhim dhiddaan","translate":{"id":"sekali-kali tidak. Kelak mereka (sembahan-sembahan) itu akan mengingkari penyembahan (pengikut-pengikutnya) terhadapnya, dan mereka (sembahan-sembahan) itu akan menjadi musuh bagi mereka.\n","en":"But nay! [On Judgment Day] these [very objects of adoration] will disavow the worship that was paid to them, and will turn against those [who had worshipped them]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2332","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2332.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2332.mp3"]}},{"no":83,"arab":"أَلَمْ تَرَ أَنَّا أَرْسَلْنَا الشَّيَاطِينَ عَلَى الْكَافِرِينَ تَؤُزُّهُمْ أَزًّا","latin":"alam tara annaa arsalnaa alsysyayaathiina 'alaa alkaafiriina tauzzuhum azzaan","translate":{"id":"Tidakkah kamu lihat, bahwasanya Kami telah mengirim syaitan-syaitan itu kepada orang-orang kafir untuk menghasung mereka berbuat ma'siat dengan sungguh-sungguh?,\n","en":"ART THOU NOT aware that We have let loose all [manner of] satanic forces upon those who deny the truth - [forces] that impel them [towards sin] with strong impulsion?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2333","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2333.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2333.mp3"]}},{"no":84,"arab":"فَلَا تَعْجَلْ عَلَيْهِمْ ۖ إِنَّمَا نَعُدُّ لَهُمْ عَدًّا","latin":"falaa ta'jal 'alayhim innamaa na'uddu lahum 'addaan","translate":{"id":"maka janganlah kamu tergesa-gesa memintakan siksa terhadap mereka, karena sesungguhnya Kami hanya menghitung datangnya (hari siksaan) untuk mereka dengan perhitungan yang teliti.\n","en":"Hence, be not in haste [to call down God's punishment] upon them: for We but number the number of their days."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2334","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2334.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2334.mp3"]}},{"no":85,"arab":"يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَٰنِ وَفْدًا","latin":"yawma nahsyuru almuttaqiina ilaa alrrahmaani wafdaan","translate":{"id":"(Ingatlah) hari (ketika) Kami mengumpulkan orang-orang yang takwa kepada Tuhan Yang Maha Pemurah sebagai perutusan yang terhormat,\n","en":"On the Day when We shall gather the Godconscious unto [Us,] the Most Gracious, as honoured guests,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2335","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2335.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2335.mp3"]}},{"no":86,"arab":"وَنَسُوقُ الْمُجْرِمِينَ إِلَىٰ جَهَنَّمَ وِرْدًا","latin":"wanasuuqu almujrimiina ilaa jahannama wirdaan","translate":{"id":"dan Kami akan menghalau orang-orang yang durhaka ke neraka Jahannam dalam keadaan dahaga.\n","en":"and drive those who were lost in sin unto hell as a thirsty herd is driven to a well –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2336","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2336.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2336.mp3"]}},{"no":87,"arab":"لَا يَمْلِكُونَ الشَّفَاعَةَ إِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمَٰنِ عَهْدًا","latin":"laa yamlikuuna alsysyafaa'ata illaa mani ittakhadza 'inda alrrahmaani 'ahdaan","translate":{"id":"Mereka tidak berhak mendapat syafa'at kecuali orang yang telah mengadakan perjanjian di sisi Tuhan Yang Maha Pemurah .\n","en":"[on that Day] none will have [the benefit of] intercession unless he has [in his lifetime] entered into a bond with the Most Gracious."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2337","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2337.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2337.mp3"]}},{"no":88,"arab":"وَقَالُوا اتَّخَذَ الرَّحْمَٰنُ وَلَدًا","latin":"waqaaluu ittakhadza alrrahmaanu waladaan","translate":{"id":"Dan mereka berkata: \"Tuhan Yang Maha Pemurah mengambil (mempunyai) anak\".\n","en":"As it is, some assert, \"The Most Gracious has taken unto Himself a son„!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2338","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2338.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2338.mp3"]}},{"no":89,"arab":"لَقَدْ جِئْتُمْ شَيْئًا إِدًّا","latin":"laqad ji/tum syay-an iddaan","translate":{"id":"Sesungguhnya kamu telah mendatangkan sesuatu perkara yang sangat mungkar,\n","en":"Indeed, [by this assertion] you have brought forth something monstrous,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2339","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2339.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2339.mp3"]}},{"no":90,"arab":"تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا","latin":"takaadu alssamaawaatu yatafaththharna minhu watansyaqqu al-ardhu watakhirru aljibaalu haddaan","translate":{"id":"hampir-hampir langit pecah karena ucapan itu, dan bumi belah, dan gunung-gunung runtuh,\n","en":"whereat the heavens might well-nigh be rent into fragments, and the earth be split asunder, and the mountains fall down in ruins!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2340","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2340.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2340.mp3"]}},{"no":91,"arab":"أَنْ دَعَوْا لِلرَّحْمَٰنِ وَلَدًا","latin":"an da'aw lilrrahmaani waladaan","translate":{"id":"karena mereka menda'wakan Allah Yang Maha Pemurah mempunyai anak.\n","en":"That men. should ascribe a son to the Most Gracious,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2341","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2341.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2341.mp3"]}},{"no":92,"arab":"وَمَا يَنْبَغِي لِلرَّحْمَٰنِ أَنْ يَتَّخِذَ وَلَدًا","latin":"wamaa yanbaghii lilrrahmaani an yattakhidza waladaan","translate":{"id":"Dan tidak layak bagi Tuhan Yang Maha Pemurah mengambil (mempunyai) anak.\n","en":"although it is inconceivable that the Most Gracious should take unto Himself a son!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2342","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2342.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2342.mp3"]}},{"no":93,"arab":"إِنْ كُلُّ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَٰنِ عَبْدًا","latin":"in kullu man fii alssamaawaati waal-ardhi illaa aatii alrrahmaani 'abdaan","translate":{"id":"Tidak ada seorangpun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah selaku seorang hamba.\n","en":"Not one of all [the beings] that are in the heavens or on earth appears before the Most Gracious other than as a servant:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2343","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2343.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2343.mp3"]}},{"no":94,"arab":"لَقَدْ أَحْصَاهُمْ وَعَدَّهُمْ عَدًّا","latin":"laqad ahsaahum wa'addahum 'addaan","translate":{"id":"Sesungguhnya Allah telah menentukan jumlah mereka dan menghitung mereka dengan hitungan yang teliti.\n","en":"indeed, He has full cognizance of them, and has numbered them with [unfailing] numbering;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2344","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2344.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2344.mp3"]}},{"no":95,"arab":"وَكُلُّهُمْ آتِيهِ يَوْمَ الْقِيَامَةِ فَرْدًا","latin":"wakulluhum aatiihi yawma alqiyaamati fardaan","translate":{"id":"Dan tiap-tiap mereka akan datang kepada Allah pada hari kiamat dengan sendiri-sendiri.\n","en":"and every one of them will appear before Him on Resurrection Day in a lonely state."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2345","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2345.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2345.mp3"]}},{"no":96,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَيَجْعَلُ لَهُمُ الرَّحْمَٰنُ وُدًّا","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati sayaj'alu lahumu alrrahmaanu wuddaan","translate":{"id":"Sesungguhnya orang-orang yang beriman dan beramal saleh, kelak Allah Yang Maha Pemurah akan menanamkan dalam (hati) mereka rasa kasih sayang.\n","en":"VERILY, those who attain to faith and do righteous deeds will the Most Gracious endow with love:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2346","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2346.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2346.mp3"]}},{"no":97,"arab":"فَإِنَّمَا يَسَّرْنَاهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِينَ وَتُنْذِرَ بِهِ قَوْمًا لُدًّا","latin":"fa-innamaa yassarnaahu bilisaanika litubasysyira bihi almuttaqiina watundzira bihi qawman luddaan","translate":{"id":"Maka sesungguhnya telah Kami mudahkan Al Quraan itu dengan bahasamu, agar kamu dapat memberi kabar gembira dengan Al Quraan itu kepada orang-orang yang bertakwa, dan agar kamu memberi peringatan dengannya kepada kaum yang membangkang.\n","en":"and only to this end have We made this [divine writ] easy to understand, in thine own tongue, [O Prophet,] so that thou might convey thereby a glad tiding to the God-conscious, and warn thereby those who are given to [futile] contention:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2347","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2347.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2347.mp3"]}},{"no":98,"arab":"وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هَلْ تُحِسُّ مِنْهُمْ مِنْ أَحَدٍ أَوْ تَسْمَعُ لَهُمْ رِكْزًا","latin":"wakam ahlaknaa qablahum min qarnin hal tuhissu minhum min ahadin aw tasma'u lahum rikzaan","translate":{"id":"Dan berapa banyak telah Kami binasakan umat-umat sebelum mereka. Adakah kamu melihat seorangpun dari mereka atau kamu dengar suara mereka yang samar-samar?\n","en":"for, how many a generation have We destroyed before their time - [and] canst thou perceive any one of them [now], or hear any whisper of them?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2348","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2348.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2348.mp3"]}}]}