{"alquran":{"no":22,"name":"Al-Hajj","arab":"الحج","start":2595,"count":78,"rukku":10,"type":"medina","description":"Surat Al Hajj, termasuk golongan surat-surat Madaniyyah, terdiri atas 78 ayat, sedang menurut pendapat sebahagian ahli tafsir termasuk golongan surat-surat Makkiyah. Sebab perbedaan ini ialah karena sebahagian ayat-ayat surat ini ada yang diturunkan di Mekah dan sebahagian lagi diturunkan di Madinah. <br>Dinamai surat ini <i>Al Hajj</i>, karena surat ini mengemukakan hal-hal yang berhubungan dengan ibadat haji, seperti ihram, thawaf, sa'i, wuquf di Arafah, mencukur rambut, syi'ar-syi'ar Allah, faedah-faedah dan hikmah-hikmah disyari'atkannya haji. Ditegaskan pula bahwa ibadat haji itu telah disyari'atkan di masa Nabi Ibrahim a.s., dan Ka'bah didirikan oleh Nabi Ibrahim a.s. bersama puteranya Ismail a.s.<br>Menurut Al Ghaznawi, surat Al Hajj termasuk di antara surat- surat yang ajaib, diturunkan di malam dan di siang hari, dalam musafir dan dalam keadaan tidak musafir, ada ayat-ayat yang diturunkan di Mekah dan ada pula yang diturunkan di Madinah, isinya ada yang berhubungan dengan peperangan dan ada pula yang berhubungan dengan perdamaian, ada ayat-ayatnya yang muhkam dan ada pula yang mutasyabihaat."},"surah":[{"no":1,"arab":" يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ","latin":"yaa ayyuhaa alnnaasu ittaquu rabbakum inna zalzalata alssaa'ati syay-un 'azhiimun","translate":{"id":"Hai manusia, bertakwalah kepada Tuhanmu; sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat).\n","en":"O men! Be conscious of your Sustainer: for, verily the violent convulsion of the Last Hour will be an awesome thing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2596","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2596.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2596.mp3"]}},{"no":2,"arab":"يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَىٰ وَمَا هُمْ بِسُكَارَىٰ وَلَٰكِنَّ عَذَابَ اللَّهِ شَدِيدٌ","latin":"yawma tarawnahaa tadzhalu kullu murdhi'atin 'ammaa ardha'at watadha'u kullu dzaati hamlin hamlahaa wataraa alnnaasa sukaaraa wamaa hum bisukaaraa walaakinna 'adzaaba allaahi syadiidun","translate":{"id":"(Ingatlah) pada hari (ketika) kamu melihat kegoncangan itu, lalailah semua wanita yang menyusui anaknya dari anak yang disusuinya dan gugurlah kandungan segala wanita yang hamil, dan kamu lihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, akan tetapi azab Allah itu sangat kerasnya.\n","en":"On the Day when you behold it, every woman that feeds a child at her breast will utterly forget her nursling, and every woman heavy with child will bring forth her burden [before her time]; and it will seem to thee that all mankind is drunk, although they will not be drunk - but vehement will be [their dread of] God’s chastisement."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2597","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2597.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2597.mp3"]}},{"no":3,"arab":"وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّبِعُ كُلَّ شَيْطَانٍ مَرِيدٍ","latin":"wamina alnnaasi man yujaadilu fii allaahi bighayri 'ilmin wayattabi'u kulla syaythaanin mariidin","translate":{"id":"Di antara manusia ada orang yang membantah tentang Allah tanpa ilmu pengetahuan dan mengikuti setiap syaitan yang jahat,\n","en":"And yet, among men there is many a one who argues about God without having any knowledge [of Him], and follows every rebellious satanic force"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2598","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2598.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2598.mp3"]}},{"no":4,"arab":"كُتِبَ عَلَيْهِ أَنَّهُ مَنْ تَوَلَّاهُ فَأَنَّهُ يُضِلُّهُ وَيَهْدِيهِ إِلَىٰ عَذَابِ السَّعِيرِ","latin":"kutiba 'alayhi annahu man tawallaahu fa-annahu yudhilluhu wayahdiihi ilaa 'adzaabi alssa'iiri","translate":{"id":"yang telah ditetapkan terhadap syaitan itu, bahwa barangsiapa yang berkawan dengan dia, tentu dia akan menyesatkannya, dan membawanya ke azab neraka.\n","en":"about which it has been decreed that whoever entrusts himself to it, him will it lead astray and guide towards the suffering of the blazing flame!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2599","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2599.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2599.mp3"]}},{"no":5,"arab":"يَا أَيُّهَا النَّاسُ إِنْ كُنْتُمْ فِي رَيْبٍ مِنَ الْبَعْثِ فَإِنَّا خَلَقْنَاكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُضْغَةٍ مُخَلَّقَةٍ وَغَيْرِ مُخَلَّقَةٍ لِنُبَيِّنَ لَكُمْ ۚ وَنُقِرُّ فِي الْأَرْحَامِ مَا نَشَاءُ إِلَىٰ أَجَلٍ مُسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ۖ وَمِنْكُمْ مَنْ يُتَوَفَّىٰ وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْ بَعْدِ عِلْمٍ شَيْئًا ۚ وَتَرَى الْأَرْضَ هَامِدَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ وَأَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ","latin":"yaa ayyuhaa alnnaasu in kuntum fii raybin mina alba'tsi fa-innaa khalaqnaakum min turaabin tsumma min nuthfatin tsumma min 'alaqatin tsumma min mudhghatin mukhallaqatin waghayri mukhallaqatin linubayyina lakum wanuqirru fii al-arhaami maa nasyaau ilaa ajalin musamman tsumma nukhrijukum thiflan tsumma litablughuu asyuddakum waminkum man yutawaffaa waminkum man yuraddu ilaa ardzali al'umuri likaylaa ya'lama min ba'di 'ilmin syay-an wataraa al-ardha haamidatan fa-idzaa anzalnaa 'alayhaa almaa-a ihtazzat warabat wa-anbatat min kulli zawjin bahiijin","translate":{"id":"Hai manusia, jika kamu dalam keraguan tentang kebangkitan (dari kubur), maka (ketahuilah) sesungguhnya Kami telah menjadikan kamu dari tanah, kemudian dari setetes mani, kemudian dari segumpal darah, kemudian dari segumpal daging yang sempurna kejadiannya dan yang tidak sempurna, agar Kami jelaskan kepada kamu dan Kami tetapkan dalam rahim, apa yang Kami kehendaki sampai waktu yang sudah ditentukan, kemudian Kami keluarkan kamu sebagai bayi, kemudian (dengan berangsur-angsur) kamu sampailah kepada kedewasaan, dan di antara kamu ada yang diwafatkan dan (adapula) di antara kamu yang dipanjangkan umurnya sampai pikun, supaya dia tidak mengetahui lagi sesuatupun yang dahulunya telah diketahuinya. Dan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air di atasnya, hiduplah bumi itu dan suburlah dan menumbuhkan berbagai macam tumbuh-tumbuhan yang indah.\n","en":"O MEN! If you are in doubt as to the [truth of] resurrection, [remember that,] verily, We have created [every one of] you out of dust, then out of a drop of sperm, then out of a germ-cell, then out of an embryonic lump complete [in itself] and yet incom­plete so that We might make [your origin] clear unto you. And whatever We will [to be born] We cause to rest in the [mothers’] wombs for a term set [by Us], and then We bring you forth as infants and [allow you to live] so that [some of] you might attain to maturity: for among you are such as are caused to die [in childhood], just as many a one of you is reduced in old age to a most abject state, ceasing to know anything of what he once knew so well. And [if, O man, thou art still in doubt as to resur­rection, consider this:] thou canst see the earth dry and lifeless - and [suddenly,] when We send down waters upon it, it stirs and swells and puts forth every kind of lovely plant!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2600","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2600.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2600.mp3"]}},{"no":6,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّهُ يُحْيِي الْمَوْتَىٰ وَأَنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"dzaalika bi-anna allaaha huwa alhaqqu wa-annahu yuhyii almawtaa wa-annahu 'alaa kulli syay-in qadiirun","translate":{"id":"Yang demikian itu, karena sesungguhnya Allah, Dialah yang haq dan sesungguhnya Dialah yang menghidupkan segala yang mati dan sesungguhnya Allah Maha Kuasa atas segala sesuatu,\n","en":"All this [happens] because God alone is the Ultimate Truth, and because He alone brings the dead to life, and because He has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2601","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2601.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2601.mp3"]}},{"no":7,"arab":"وَأَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيهَا وَأَنَّ اللَّهَ يَبْعَثُ مَنْ فِي الْقُبُورِ","latin":"wa-anna alssaa'ata aatiyatun laa rayba fiihaa wa-anna allaaha yab'atsu man fii alqubuuri","translate":{"id":"dan sesungguhnya hari kiamat itu pastilah datang, tak ada keraguan padanya; dan bahwasanya Allah membangkitkan semua orang di dalam kubur.\n","en":"And [know, O man] that the Last Hour is bound to come, beyond any doubt, and that God will [in­deed] resurrect all who are in their graves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2602","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2602.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2602.mp3"]}},{"no":8,"arab":"وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ","latin":"wamina alnnaasi man yujaadilu fii allaahi bighayri 'ilmin walaa hudan walaa kitaabin muniirin","translate":{"id":"Dan di antara manusia ada orang-orang yang membantah tentang Allah tanpa ilmu pengetahuan, tanpa petunjuk dan tanpa kitab (wahyu) yang bercahaya ,\n","en":"And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2603","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2603.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2603.mp3"]}},{"no":9,"arab":"ثَانِيَ عِطْفِهِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ ۖ لَهُ فِي الدُّنْيَا خِزْيٌ ۖ وَنُذِيقُهُ يَوْمَ الْقِيَامَةِ عَذَابَ الْحَرِيقِ","latin":"tsaaniya 'ithfihi liyudhilla 'an sabiili allaahi lahu fii alddunyaa khizyun wanudziiquhu yawma alqiyaamati 'adzaaba alhariiqi","translate":{"id":"dengan memalingkan lambungnya untuk menyesatkan manusia dari jalan Allah. Ia mendapat kehinaan di dunia dan dihari kiamat Kami merasakan kepadanya azab neraka yang membakar.\n","en":"scornfully turning aside [from the truth] so as to lead [others] astray from the path of God. Disgrace [of the spirit] is in store for him in this world; and on the Day of Resurrection We shall make him taste suffering through fire;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2604","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2604.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2604.mp3"]}},{"no":10,"arab":"ذَٰلِكَ بِمَا قَدَّمَتْ يَدَاكَ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ","latin":"dzaalika bimaa qaddamat yadaaka wa-anna allaaha laysa bizhallaamin lil'abiidi","translate":{"id":"(Akan dikatakan kepadanya): \"Yang demikian itu, adalah disebabkan perbuatan yang dikerjakan oleh kedua tangan kamu dahulu dan sesungguhnya Allah sekali-kali bukanlah penganiaya hamba-hamba-Nya\".\n","en":"[and he shall be told:] “This is an outcome of what thine own hands have wrought - for, never does God do the least wrong to His creatures!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2605","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2605.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2605.mp3"]}},{"no":11,"arab":"وَمِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلَىٰ حَرْفٍ ۖ فَإِنْ أَصَابَهُ خَيْرٌ اطْمَأَنَّ بِهِ ۖ وَإِنْ أَصَابَتْهُ فِتْنَةٌ انْقَلَبَ عَلَىٰ وَجْهِهِ خَسِرَ الدُّنْيَا وَالْآخِرَةَ ۚ ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ","latin":"wamina alnnaasi man ya'budu allaaha 'alaa harfin fa-in ashaabahu khayrun ithma-anna bihi wa-in ashaabat-hu fitnatun inqalaba 'alaa wajhihi khasira alddunyaa waal-aakhirata dzaalika huwa alkhusraanu almubiinu","translate":{"id":"Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi ; maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang . Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata.\n","en":"And there is, too, among men many a one who worships God on the border-line [of faith]: thus, if good befalls him, he is satisfied with Him; but if a trial assails him, he turns away utterly, losing [thereby both] this world and the life to come: [and] this, indeed, is a loss beyond compare!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2606","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2606.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2606.mp3"]}},{"no":12,"arab":"يَدْعُو مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُ وَمَا لَا يَنْفَعُهُ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ","latin":"yad'uu min duuni allaahi maa laa yadhurruhu wamaa laa yanfa'uhu dzaalika huwa aldhdhalaalu alba'iidu","translate":{"id":"Ia menyeru selain Allah, sesuatu yang tidak dapat memberi mudharat dan tidak (pula) memberi manfa'at kepadanya. Yang demikian itu adalah kesesatan yang jauh.\n","en":"[By behaving thus,] he invokes, instead of God, something that can neither harm nor benefit him: [and] this is indeed the utmost one can go astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2607","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2607.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2607.mp3"]}},{"no":13,"arab":"يَدْعُو لَمَنْ ضَرُّهُ أَقْرَبُ مِنْ نَفْعِهِ ۚ لَبِئْسَ الْمَوْلَىٰ وَلَبِئْسَ الْعَشِيرُ","latin":"yad'uu laman dharruhu aqrabu min naf'ihi labi/sa almawlaa walabi/sa al'asyiiru","translate":{"id":"Ia menyeru sesuatu yang sebenarnya mudharatnya lebih dekat dari manfa'atnya. Sesungguhnya yang diserunya itu adalah sejahat-jahat kawan.\n","en":"[And sometimes] he invokes [another human being] one that is far more likely to cause harm than benefit: vile, indeed, is such a patron and vile the follower!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2608","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2608.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2608.mp3"]}},{"no":14,"arab":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ","latin":"inna allaaha yudkhilu alladziina aamanuu wa'amiluu alshshaalihaati jannaatin tajrii min tahtihaa al-anhaaru inna allaaha yaf'alu maa yuriidu","translate":{"id":"Sesungguhnya Allah memasukkan orang-orang yang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Sesungguhnya Allah berbuat apa yang Dia kehendaki.\n","en":"VERILY, God will admit those who have attained to faith and have done righteous deeds into gardens through which running waters flow: for, behold, God does whatever He wills."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2609","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2609.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2609.mp3"]}},{"no":15,"arab":"مَنْ كَانَ يَظُنُّ أَنْ لَنْ يَنْصُرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ إِلَى السَّمَاءِ ثُمَّ لْيَقْطَعْ فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهُ مَا يَغِيظُ","latin":"man kaana yazhunnu an lan yanshurahu allaahu fii alddunyaa waal-aakhirati falyamdud bisababin ilaa alssamaa-i tsumma liyaqtha' falyanzhur hal yudzhibanna kayduhu maa yaghiizhu","translate":{"id":"Barangsiapa yang menyangka bahwa Allah sekali-kali tiada menolongnya (Muhammad) di dunia dan akhirat, maka hendaklah ia merentangkan tali ke langit, kemudian hendaklah ia melaluinya, kemudian hendaklah ia pikirkan apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan hatinya .\n","en":"If anyone thinks that God will not succour him in this world and in the life to come, let him reach out unto heaven by any [other] means and [thus try to] make headway: and then let him see whether this scheme of his will indeed do away with the cause of his anguish."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2610","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2610.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2610.mp3"]}},{"no":16,"arab":"وَكَذَٰلِكَ أَنْزَلْنَاهُ آيَاتٍ بَيِّنَاتٍ وَأَنَّ اللَّهَ يَهْدِي مَنْ يُرِيدُ","latin":"wakadzaalika anzalnaahu aayaatin bayyinaatin wa-anna allaaha yahdii man yuriidu","translate":{"id":"Dan demikianlah Kami telah menurunkan Al Qur'an yang merupakan ayat-ayat yang nyata, dan bahwasanya Allah memberikan petunjuk kepada siapa yang Dia kehendaki.\n","en":"And thus have We bestowed from on high this [divine writ] in the shape of clear messages: for [thus it is] that God guides him who wills [to be guided]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2611","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2611.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2611.mp3"]}},{"no":17,"arab":"إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَىٰ وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ","latin":"inna alladziina aamanuu waalladziina haaduu waalshshaabi-iina waalnnashaaraa waalmajuusa waalladziina asyrakuu inna allaaha yafshilu baynahum yawma alqiyaamati inna allaaha 'alaa kulli syay-in syahiidun","translate":{"id":"Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, orang-orang Shaabi-iin orang-orang Nasrani, orang-orang Majusi dan orang-orang musyrik, Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu.\n","en":"Verily, as for those who have attained to faith [in this divine writ], and those who follow the Jewish faith, and the Sabians, and the Christians, and the Magians, [on the one hand,] and those who are bent on ascribing divinity to aught but God, [on the other,] verily, God will decide between them on Resurrection Day: for, behold, God is witness unto everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2612","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2612.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2612.mp3"]}},{"no":18,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُومُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَابُّ وَكَثِيرٌ مِنَ النَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ الْعَذَابُ ۗ وَمَنْ يُهِنِ اللَّهُ فَمَا لَهُ مِنْ مُكْرِمٍ ۚ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ۩","latin":"alam tara anna allaaha yasjudu lahu man fii alssamaawaati waman fii al-ardhi waalsysyamsu waalqamaru waalnnujuumu waaljibaalu waalsysyajaru waalddawaabbu wakatsiirun mina alnnaasi wakatsiirun haqqa 'alayhi al'adzaabu waman yuhini allaahu famaa lahu min mukrimin inna allaaha yaf'alu maa yasyaa/u","translate":{"id":"Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi, matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata dan sebagian besar daripada manusia? Dan banyak di antara manusia yang telah ditetapkan azab atasnya. Dan barangsiapa yang dihinakan Allah maka tidak seorangpun yang memuliakannya. Sesungguhnya Allah berbuat apa yang Dia kehendaki.\n","en":"ART THOU NOT aware that before God prostrate themselves all [things and beings] that are in the heavens and all that are on earth the sun, and the moon, and the stars, and the mountains, and the trees, and the beasts? And many human beings [submit to God con­sciously], whereas many [others, having defied Him,] will inevitably have to suffer [in the life to come]; and he whom God shall scorn [on Resur­rection Day] will have none who could bestow honour on him: for, verily, God does what He wills."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2613","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2613.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2613.mp3"]}},{"no":19,"arab":"هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ۖ فَالَّذِينَ كَفَرُوا قُطِّعَتْ لَهُمْ ثِيَابٌ مِنْ نَارٍ يُصَبُّ مِنْ فَوْقِ رُءُوسِهِمُ الْحَمِيمُ","latin":"haadzaani khashmaani ikhtashamuu fii rabbihim faalladziina kafaruu quththhi'at lahum tsiyaabun min naarin yushabbu min fawqi ruuusihimu alhamiimu","translate":{"id":"Inilah dua golongan (golongan mu'min dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Tuhan mereka. Maka orang kafir akan dibuatkan untuk mereka pakaian-pakaian dari api neraka. Disiramkan air yang sedang mendidih ke atas kepala mereka.\n","en":"These two contrary kinds of man have become engrossed in contention about their Sus­tainer! But [thus it is:] as for those who are bent on denying the truth garments of fire shall be cut out for them [in the life to come]; burning despair will be poured over their heads,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2614","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2614.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2614.mp3"]}},{"no":20,"arab":"يُصْهَرُ بِهِ مَا فِي بُطُونِهِمْ وَالْجُلُودُ","latin":"yushharu bihi maa fii buthuunihim waaljuluudu","translate":{"id":"Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka).\n","en":"causing all that is within their bodies, as well as the skins, to melt away."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2615","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2615.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2615.mp3"]}},{"no":21,"arab":"وَلَهُمْ مَقَامِعُ مِنْ حَدِيدٍ","latin":"walahum maqaami'u min hadiidin","translate":{"id":"Dan untuk mereka cambuk-cambuk dari besi.\n","en":"And they shall be held [in this state as if] by iron grips;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2616","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2616.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2616.mp3"]}},{"no":22,"arab":"كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ","latin":"kullamaa araaduu an yakhrujuu minhaa min ghammin u'iiduu fiihaa wadzuuquu 'adzaaba alhariiqi","translate":{"id":"Setiap kali mereka hendak ke luar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan), \"Rasailah azab yang membakar ini\".\n","en":"and every time they try in their anguish to come out of it, they shall be returned thereto and [be told]: “Taste suffering through fire [to the full]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2617","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2617.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2617.mp3"]}},{"no":23,"arab":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ","latin":"inna allaaha yudkhilu alladziina aamanuu wa'amiluu alshshaalihaati jannaatin tajrii min tahtihaa al-anhaaru yuhallawna fiihaa min asaawira min dzahabin walu/lu-an walibaasuhum fiihaa hariirun","translate":{"id":"Sesungguhnya Allah memasukkan orang-orang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas dan mutiara, dan pakaian mereka adalah sutera.\n","en":"[As against this,] behold, God will admit those who attain to faith and do righteous deeds into gar­dens through which running waters flow, wherein they will be adorned with bracelets of gold and pearls, and where silk will be their raiment:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2618","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2618.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2618.mp3"]}},{"no":24,"arab":"وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَىٰ صِرَاطِ الْحَمِيدِ","latin":"wahuduu ilaa alththhayyibi mina alqawli wahuduu ilaa shiraathi alhamiidi","translate":{"id":"Dan mereka diberi petunjuk kepada ucapan-ucapan yang baik dan ditunjuki (pula) kepada jalan (Allah) yang terpuji.\n","en":"for they were [willing to be] guided towards the best of all tenets, and so they were guided onto the way that leads to the One unto whom all praise is due."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2619","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2619.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2619.mp3"]}},{"no":25,"arab":"إِنَّ الَّذِينَ كَفَرُوا وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِي جَعَلْنَاهُ لِلنَّاسِ سَوَاءً الْعَاكِفُ فِيهِ وَالْبَادِ ۚ وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ","latin":"inna alladziina kafaruu wayashudduuna 'an sabiili allaahi waalmasjidi alharaami alladzii ja'alnaahu lilnnaasi sawaa-an al'aakifu fiihi waalbaadi waman yurid fiihi bi-ilhaadin bizhulmin nudziqhu min 'adzaabin aliimin","translate":{"id":"Sesungguhnya orang-orang yang kafir dan menghalangi manusia dari jalan Allah dan Masjidilharam yang telah Kami jadikan untuk semua manusia, baik yang bermukim di situ maupun di padang pasir dan siapa yang bermaksud di dalamnya melakukan kejahatan secara zalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih.\n","en":"BEHOLD, as for those who are bent on denying the truth and bar [others] from the path of God and from the Inviolable House of Worship which We have set up for all people alike - [both] those who dwell there and those who come from abroad - and all who seek to profane it by [deliberate] evildoing: [all] such shall We cause to taste grievous suffering in the life to come.]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2620","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2620.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2620.mp3"]}},{"no":26,"arab":"وَإِذْ بَوَّأْنَا لِإِبْرَاهِيمَ مَكَانَ الْبَيْتِ أَنْ لَا تُشْرِكْ بِي شَيْئًا وَطَهِّرْ بَيْتِيَ لِلطَّائِفِينَ وَالْقَائِمِينَ وَالرُّكَّعِ السُّجُودِ","latin":"wa-idz bawwa/naa li-ibraahiima makaana albayti an laa tusyrik bii syay-an wathahhir baytiya lilththaa-ifiina waalqaa-imiina waalrrukka'i alssujuudi","translate":{"id":"Dan (ingatlah), ketika Kami memberikan tempat kepada Ibrahim di tempat Baitullah (dengan mengatakan): \"Janganlah kamu memperserikatkan sesuatupun dengan Aku dan sucikanlah rumahKu ini bagi orang-orang yang thawaf, dan orang-orang yang beribadat dan orang-orang yang ruku' dan sujud.\n","en":"For, when We assigned unto Abraham the site of this Temple, [We said unto him:] “Do not ascribe divinity to aught beside Me!” and: “Purify My Temple for those who will walk around it, and those who will stand before it [in meditation], and those who will bow down and prostrate themselves [in prayer].”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2621","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2621.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2621.mp3"]}},{"no":27,"arab":"وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَىٰ كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ","latin":"wa-adzdzin fii alnnaasi bialhajji ya/tuuka rijaalan wa'alaa kulli daamirin ya/tiina min kulli fajjin 'amiiqin","translate":{"id":"Dan berserulah kepada manusia untuk mengerjakan haji, niscaya mereka akan datang kepadamu dengan berjalan kaki, dan mengendarai unta yang kurus yang datang dari segenap penjuru yang jauh,\n","en":"Hence, [O Muhammad,] proclaim thou unto all people the [duty of] pilgrimage: they will come unto thee on foot and on every [kind of] fast mount, coming from every far-away point [on earth],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2622","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2622.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2622.mp3"]}},{"no":28,"arab":"لِيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ عَلَىٰ مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ ۖ فَكُلُوا مِنْهَا وَأَطْعِمُوا الْبَائِسَ الْفَقِيرَ","latin":"liyasyhaduu manaafi'a lahum wayadzkuruu isma allaahi fii ayyaamin ma'luumaatin 'alaa maa razaqahum min bahiimati al-an'aami fakuluu minhaa wa-ath'imuu albaa-isa alfaqiira","translate":{"id":"supaya mereka menyaksikan berbagai manfaat bagi mereka dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan atas rezki yang Allah telah berikan kepada mereka berupa binatang ternak . Maka makanlah sebahagian daripadanya dan (sebahagian lagi) berikanlah untuk dimakan orang-orang yang sengsara dan fakir.\n","en":"so that they might experience much that shall be of benefit to them, and that they might extol the name of God on the days appointed [for sacrifice], over whatever heads of cattle He may have provided for them [to this end]: eat, then, thereof, and feed the unfortunate poor."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2623","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2623.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2623.mp3"]}},{"no":29,"arab":"ثُمَّ لْيَقْضُوا تَفَثَهُمْ وَلْيُوفُوا نُذُورَهُمْ وَلْيَطَّوَّفُوا بِالْبَيْتِ الْعَتِيقِ","latin":"tsumma lyaqdhuu tafatsahum walyuufuu nudzuurahum walyaththhawwafuu bialbayti al'atiiqi","translate":{"id":"Kemudian, hendaklah mereka menghilangkan kotoran yang ada pada badan mereka dan hendaklah mereka menyempurnakan nazar-nazar mereka dan hendaklah mereka melakukan melakukan thawaf sekeliling rumah yang tua itu (Baitullah).\n","en":"Thereafter let them bring to an end their state of self-denial, and let them fulfill the vows which they [may] have made, and let them walk [once again] around the Most Ancient Temple."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2624","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2624.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2624.mp3"]}},{"no":30,"arab":"ذَٰلِكَ وَمَنْ يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ ۗ وَأُحِلَّتْ لَكُمُ الْأَنْعَامُ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ ۖ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ","latin":"dzaalika waman yu'azhzhim hurumaati allaahi fahuwa khayrun lahu 'inda rabbihi wauhillat lakumu al-an'aamu illaa maa yutlaa 'alaykum faijtanibuu alrrijsa mina al-awtsaani waijtanibuu qawla alzzuuri","translate":{"id":"Demikianlah (perintah Allah). Dan barangsiapa mengagungkan apa-apa yang terhormat di sisi Allah maka itu adalah lebih baik baginya di sisi Tuhannya. Dan telah dihalalkan bagi kamu semua binatang ternak, terkecuali yang diterangkan kepadamu keharamannya, maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta.\n","en":"All this [is ordained by God]; and if one houours God’s sacred commandments, it will redound to his own good in his Sustainer’s sight. And all [kinds of] cattle have been made lawful to you [for sacrifice and food], save what is mentioned to you [as forbidden]. Shun, then, [all that God has forbidden and, most of all,] the loathsome evil of idolatrous beliefs and practices; and shun every word that is untrue,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2625","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2625.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2625.mp3"]}},{"no":31,"arab":"حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَكَأَنَّمَا خَرَّ مِنَ السَّمَاءِ فَتَخْطَفُهُ الطَّيْرُ أَوْ تَهْوِي بِهِ الرِّيحُ فِي مَكَانٍ سَحِيقٍ","latin":"hunafaa-a lillaahi ghayra musyrikiina bihi waman yusyrik biallaahi faka-annamaa kharra mina alssamaa-i fatakhthafuhu alththhayru aw tahwii bihi alrriihu fii makaanin sahiiqin","translate":{"id":"dengan ikhlas kepada Allah, tidak mempersekutukan sesuatu dengan Dia. Barangsiapa mempersekutukan sesuatu dengan Allah, maka adalah ia seolah-olah jatuh dari langit lalu disambar oleh burung, atau diterbangkan angin ke tempat yang jauh.\n","en":"[inclining] towards God, [and] turning away from all that is false, without ascribing divine qualities to aught beside Him: for he who ascribes divinity to aught but God is like one who is hurtling down from the skies - whereupon the birds carry him off, or the wind blows him away onto a far-off place."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2626","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2626.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2626.mp3"]}},{"no":32,"arab":"ذَٰلِكَ وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ","latin":"dzaalika waman yu'azhzhim sya'aa-ira allaahi fa-innahaa min taqwaa alquluubi","translate":{"id":"Demikianlah (perintah Allah). Dan barangsiapa mengagungkan syi'ar-syi'ar Allah , maka sesungguhnya itu timbul dari ketakwaan hati.\n","en":"This is [to be borne in mind]. And anyone who honours the symbols set up by God [shall know that] verily, these [symbols derive their value] from the God-consciousness in the [believers’] hearts."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2627","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2627.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2627.mp3"]}},{"no":33,"arab":"لَكُمْ فِيهَا مَنَافِعُ إِلَىٰ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ","latin":"lakum fiihaa manaafi'u ilaa ajalin musamman tsumma mahilluhaa ilaa albayti al'atiiqi","translate":{"id":"Bagi kamu pada binatang-binatang hadyu itu ada beberapa manfa'at , sampai kepada waktu yang ditentukan, kemudian tempat wajib (serta akhir masa) menyembelihnya ialah setelah sampai ke Baitul Atiq (Baitullah).\n","en":"In that [God-consciousness] you shall find benefits until a term set [by Him is fulfilled], and [you shall know that] its goal and end is the Most Ancient Temple."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2628","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2628.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2628.mp3"]}},{"no":34,"arab":"وَلِكُلِّ أُمَّةٍ جَعَلْنَا مَنْسَكًا لِيَذْكُرُوا اسْمَ اللَّهِ عَلَىٰ مَا رَزَقَهُمْ مِنْ بَهِيمَةِ الْأَنْعَامِ ۗ فَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَلَهُ أَسْلِمُوا ۗ وَبَشِّرِ الْمُخْبِتِينَ","latin":"walikulli ummatin ja'alnaa mansakan liyadzkuruu isma allaahi 'alaa maa razaqahum min bahiimati al-an'aami fa-ilaahukum ilaahun waahidun falahu aslimuu wabasysyiri almukhbitiina","translate":{"id":"Dan bagi tiap-tiap umat telah Kami syariatkan penyembelihan (kurban), supaya mereka menyebut nama Allah terhadap binatang ternak yang telah direzkikan Allah kepada mereka, maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserah dirilah kamu kepada-Nya. Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah),\n","en":"And [thus it is:] unto every community [that has ever believed in Us] have We appointed [sacrifice as] an act of worship, so that they might extol the name of God over whatever heads of cattle He may have provided for them [to this end]. And (always bear in mind:) your God is the One and Only God: hence, surrender yourselves unto Him. And give thou the glad tiding [of God’s acceptance] unto all who are humble –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2629","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2629.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2629.mp3"]}},{"no":35,"arab":"الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَالصَّابِرِينَ عَلَىٰ مَا أَصَابَهُمْ وَالْمُقِيمِي الصَّلَاةِ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ","latin":"alladziina idzaa dzukira allaahu wajilat quluubuhum waalshshaabiriina 'alaa maa ashaabahum waalmuqiimii alshshalaati wamimmaa razaqnaahum yunfiquuna","translate":{"id":"(yaitu) orang-orang yang apabila disebut nama Allah gemetarlah hati mereka, orang-orang yang sabar terhadap apa yang menimpa mereka, orang-orang yang mendirikan sembahyang dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezkikan kepada mereka.\n","en":"all whose hearts tremble with awe whenever God is mentioned, and all who patiently bear whatever ill befalls them, and all who are constant in prayer and spend on others out of what We provide for them as sustenance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2630","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2630.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2630.mp3"]}},{"no":36,"arab":"وَالْبُدْنَ جَعَلْنَاهَا لَكُمْ مِنْ شَعَائِرِ اللَّهِ لَكُمْ فِيهَا خَيْرٌ ۖ فَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهَا صَوَافَّ ۖ فَإِذَا وَجَبَتْ جُنُوبُهَا فَكُلُوا مِنْهَا وَأَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ ۚ كَذَٰلِكَ سَخَّرْنَاهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُونَ","latin":"waalbudna ja'alnaahaa lakum min sya'aa-iri allaahi lakum fiihaa khayrun faudzkuruu isma allaahi 'alayhaa shawaaffa fa-idzaa wajabat junuubuhaa fakuluu minhaa wa-ath'imuu alqaani'a waalmu'tarra kadzaalika sakhkharnaahaa lakum la'allakum tasykuruuna","translate":{"id":"Dan telah Kami jadikan untuk kamu unta-unta itu sebahagian dari syi'ar Allah, kamu memperoleh kebaikan yang banyak padanya, maka sebutlah olehmu nama Allah ketika kamu menyembelihnya dalam keadaan berdiri (dan telah terikat). Kemudian apabila telah roboh (mati), maka makanlah sebahagiannya dan beri makanlah orang yang rela dengan apa yang ada padanya (yang tidak meminta-minta) dan orang yang meminta. Demikianlah Kami telah menundukkan untua-unta itu kepada kamu, mudah-mudahan kamu bersyukur.\n","en":"And as for the sacrifice of cattle, We have ordained it for you as one of the symbols set up by God, in which there is [much] good for you. Hence, extol the name of God over them when they are lined up [for sacrifice]; and after they have fallen lifeless to the ground, eat of their flesh, and feed the poor who is contented with his lot (and does not beg), as well as him who is forced to beg. It is to this end that We have made them subservient to your needs, so that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2631","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2631.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2631.mp3"]}},{"no":37,"arab":"لَنْ يَنَالَ اللَّهَ لُحُومُهَا وَلَا دِمَاؤُهَا وَلَٰكِنْ يَنَالُهُ التَّقْوَىٰ مِنْكُمْ ۚ كَذَٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ ۗ وَبَشِّرِ الْمُحْسِنِينَ","latin":"lan yanaala allaaha luhuumuhaa walaa dimaauhaa walaakin yanaaluhu alttaqwaa minkum kadzaalika sakhkharahaa lakum litukabbiruu allaaha 'alaa maa hadaakum wabasysyiri almuhsiniina","translate":{"id":"Daging-daging unta dan darahnya itu sekali-kali tidak dapat mencapai (keridhaan) Allah, tetapi ketakwaan dari kamulah yang dapat mencapainya. Demikianlah Allah telah menundukkannya untuk kamu supaya kamu mengagungkan Allah terhadap hidayah-Nya kepada kamu. Dan berilah kabar gembira kepada orang-orang yang berbuat baik.\n","en":"[But bear in mind:] never does their flesh reach God, and neither their blood: it is only your God-consciousness that reaches Him. It is to this end that We have made them subservient to your needs, so that you might glorify God for all the guidance with which He has graced you. And give thou this glad tiding unto the doers of good:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2632","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2632.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2632.mp3"]}},{"no":38,"arab":"إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا ۗ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ","latin":"inna allaaha yudaafi'u 'ani alladziina aamanuu inna allaaha laa yuhibbu kulla khawwaanin kafuurin","translate":{"id":"Sesungguhnya Allah membela orang-orang yang telah beriman. Sesungguhnya Allah tidak menyukai tiap-tiap orang yang berkhianat lagi mengingkari ni'mat.\n","en":"Verily, God will ward off [all evil] from those who attain to faith; [and,] verily, God does not love anyone who betrays his trust and is bereft of gratitude."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2633","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2633.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2633.mp3"]}},{"no":39,"arab":"أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا ۚ وَإِنَّ اللَّهَ عَلَىٰ نَصْرِهِمْ لَقَدِيرٌ","latin":"udzina lilladziina yuqaataluuna bi-annahum zhulimuu wa-inna allaaha 'alaa nashrihim laqadiirun","translate":{"id":"Telah diizinkan (berperang) bagi orang-orang yang diperangi, karena sesungguhnya mereka telah dianiaya. Dan sesungguhnya Allah, benar-benar Maha Kuasa menolong mereka itu,\n","en":"PERMISSION [to fight] is given to those against whom war is being wrongfully waged and, verily, God has indeed the power to succour them -:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2634","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2634.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2634.mp3"]}},{"no":40,"arab":"الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ بِغَيْرِ حَقٍّ إِلَّا أَنْ يَقُولُوا رَبُّنَا اللَّهُ ۗ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَصَلَوَاتٌ وَمَسَاجِدُ يُذْكَرُ فِيهَا اسْمُ اللَّهِ كَثِيرًا ۗ وَلَيَنْصُرَنَّ اللَّهُ مَنْ يَنْصُرُهُ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ","latin":"alladziina ukhrijuu min diyaarihim bighayri haqqin illaa an yaquuluu rabbunaa allaahu walawlaa daf'u allaahi alnnaasa ba'dhahum biba'dhin lahuddimat shawaami'u wabiya'un washalawaatun wamasaajidu yudzkaru fiihaa ismu allaahi katsiiran walayanshuranna allaahu man yanshuruhu inna allaaha laqawiyyun 'aziizun","translate":{"id":"(yaitu) orang-orang yang telah diusir dari kampung halaman mereka tanpa alasan yang benar, kecuali karena mereka berkata: \"Tuhan kami hanyalah Allah\". Dan sekiranya Allah tiada menolak (keganasan) sebagian manusia dengan sebagian yang lain, tentulah telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadat orang Yahudi dan masjid-masjid, yang di dalamnya banyak disebut nama Allah. Sesungguhnya Allah pasti menolong orang yang menolong (agama)-Nya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa,\n","en":"those who have been driven from their homelands against all right for no other reason than their saying. “Our Sustainer is God!” For, if God had not enabled people to defend themselves against one another, all] monasteries and churches and synagogues and mosques - in [all of] which Gods name is abundantly extolled - would surely have been destroyed [ere now]. And God will most certainly succour him who suc­cours His cause: for, verily, God is most powerful, almighty,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2635","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2635.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2635.mp3"]}},{"no":41,"arab":"الَّذِينَ إِنْ مَكَّنَّاهُمْ فِي الْأَرْضِ أَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ وَأَمَرُوا بِالْمَعْرُوفِ وَنَهَوْا عَنِ الْمُنْكَرِ ۗ وَلِلَّهِ عَاقِبَةُ الْأُمُورِ","latin":"alladziina in makkannaahum fii al-ardhi aqaamuu alshshalaata waaatawuu alzzakaata wa-amaruu bialma'ruufi wanahaw 'ani almunkari walillaahi 'aaqibatu al-umuuri","translate":{"id":"(yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi niscaya mereka mendirikan sembahyang, menunaikan zakat, menyuruh berbuat ma'ruf dan mencegah dari perbuatan yang mungkar; dan kepada Allah-lah kembali segala urusan.\n","en":"[well aware of] those who, [even] if We firmly establish them on earth, remain constant in prayer, and give in charity, and enjoin the doing of what is right and forbid the doing of what is wrong; but with God rests the final outcome of all events."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2636","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2636.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2636.mp3"]}},{"no":42,"arab":"وَإِنْ يُكَذِّبُوكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَثَمُودُ","latin":"wa-in yukadzdzibuuka faqad kadzdzabat qablahum qawmu nuuhin wa'aadun watsamuudu","translate":{"id":"Dan jika mereka (orang-orang musyrik) mendustakan kamu, maka sesungguhnya telah mendustakan juga sebelum mereka kaum Nuh, 'Aad dan Tsamud,\n","en":"AND IF THEY [who are bent on denying the truth] give thee the lie, [O Muhammad, remember that, long] before their time, the people of Noah and [the tribes of] Ad and Thamud gave the lie [to their prophets],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2637","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2637.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2637.mp3"]}},{"no":43,"arab":"وَقَوْمُ إِبْرَاهِيمَ وَقَوْمُ لُوطٍ","latin":"waqawmu ibraahiima waqawmu luuthin","translate":{"id":"dan kaum Ibrahim dan kaum Luth,\n","en":"as did the people of Abraham, and the people of Lot,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2638","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2638.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2638.mp3"]}},{"no":44,"arab":"وَأَصْحَابُ مَدْيَنَ ۖ وَكُذِّبَ مُوسَىٰ فَأَمْلَيْتُ لِلْكَافِرِينَ ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ نَكِيرِ","latin":"wa-ash-haabu madyana wakudzdziba muusaa fa-amlaytu lilkaafiriina tsumma akhadztuhum fakayfa kaana nakiiri","translate":{"id":"dan penduduk Madyan, dan telah didustakan Musa, lalu Aku tangguhkan (azab-Ku) untuk orang-orang kafir, kemudian Aku azab mereka, maka (lihatlah) bagaimana besarnya kebencian-Ku (kepada mereka itu).\n","en":"and the dwellers of Madyan; and [so, too,] Moses was given the lie [by Pharaoh]. And [in every ease] I gave rein, for a while, to the deniers of the truth: but then I took them to task - and how awesome was My denial [of them,]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2639","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2639.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2639.mp3"]}},{"no":45,"arab":"فَكَأَيِّنْ مِنْ قَرْيَةٍ أَهْلَكْنَاهَا وَهِيَ ظَالِمَةٌ فَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَبِئْرٍ مُعَطَّلَةٍ وَقَصْرٍ مَشِيدٍ","latin":"faka-ayyin min qaryatin ahlaknaahaa wahiya zhaalimatun fahiya khaawiyatun 'alaa 'uruusyihaa wabi/rin mu'aththhalatin waqashrin masyiidin","translate":{"id":"Berapalah banyaknya kota yang Kami telah membinasakannya, yang penduduknya dalam keadaan zalim, maka (tembok-tembok) kota itu roboh menutupi atap-atapnya dan (berapa banyak pula) sumur yang telah ditinggalkan dan istana yang tinggi,\n","en":"And how many a township have We destroyed because it had been immersed in evildoing - and now they [all] lie deserted, with their roofs caved in! And how many a well lies abandoned, and how many a castle that [once] stood high!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2640","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2640.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2640.mp3"]}},{"no":46,"arab":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَتَكُونَ لَهُمْ قُلُوبٌ يَعْقِلُونَ بِهَا أَوْ آذَانٌ يَسْمَعُونَ بِهَا ۖ فَإِنَّهَا لَا تَعْمَى الْأَبْصَارُ وَلَٰكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ","latin":"afalam yasiiruu fii al-ardhi fatakuuna lahum quluubun ya'qiluuna bihaa aw aatsaanun yasma'uuna bihaa fa-innahaa laa ta'maa al-abshaaru walaakin ta'maa alquluubu allatii fii alshshuduuri","translate":{"id":"maka apakah mereka tidak berjalan di muka bumi, lalu mereka mempunyai hati yang dengan itu mereka dapat memahami atau mempunyai telinga yang dengan itu mereka dapat mendengar? Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada.\n","en":"Have they, then, never journeyed about the earth, letting their hearts gain wisdom, and causing their ears to hear? Yet, verily, it is not their eyes that have become blind - but blind have become the hearts that are in their breasts!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2641","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2641.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2641.mp3"]}},{"no":47,"arab":"وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ وَلَنْ يُخْلِفَ اللَّهُ وَعْدَهُ ۚ وَإِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ","latin":"wayasta'jiluunaka bial'adzaabi walan yukhlifa allaahu wa'dahu wa-inna yawman 'inda rabbika ka-alfi sanatin mimmaa ta'udduuna","translate":{"id":"Dan mereka meminta kepadamu agar azab itu disegerakan, padahal Allah sekali-kali tidak akan menyalahi janji-Nya. Sesungguhnya sehari disisi Tuhanmu adalah seperti seribu menurut perhitunganmu.\n","en":"And [so, O Muhammad,] they challenge thee to hasten the coming upon them of [God’s] chastisement: but God never fails to fulfill His promise - and, behold, in thy Sustainer’s sight a day is like a thousand years of your reckoning."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2642","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2642.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2642.mp3"]}},{"no":48,"arab":"وَكَأَيِّنْ مِنْ قَرْيَةٍ أَمْلَيْتُ لَهَا وَهِيَ ظَالِمَةٌ ثُمَّ أَخَذْتُهَا وَإِلَيَّ الْمَصِيرُ","latin":"waka-ayyin min qaryatin amlaytu lahaa wahiya zhaalimatun tsumma akhadztuhaa wa-ilayya almashiiru","translate":{"id":"Dan berapalah banyaknya kota yang Aku tangguhkan (azab-Ku) kepadanya, yang penduduknya berbuat zalim, kemudian Aku azab mereka, dan hanya kepada-Kulah kembalinya (segala sesuatu).\n","en":"And to how many a community that was im­mersed in evildoing have I given rein for a while! But then I took it to task: for with Me is all journeys’ end!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2643","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2643.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2643.mp3"]}},{"no":49,"arab":"قُلْ يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا لَكُمْ نَذِيرٌ مُبِينٌ","latin":"qul yaa ayyuhaa alnnaasu innamaa anaa lakum nadziirun mubiinun","translate":{"id":"Katakanlah: \"Hai manusia, sesungguhnya aku adalah seorang pemberi peringatan yang nyata kepada kamu\".\n","en":"SAY [O Muhammad]: “O men! I am but a plain warner [sent by God] unto you!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2644","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2644.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2644.mp3"]}},{"no":50,"arab":"فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","latin":"faalladziina aamanuu wa'amiluu alshshaalihaati lahum maghfiratun warizqun kariimun","translate":{"id":"Maka orang-orang yang beriman dan beramal saleh, bagi mereka ampunan dan rezki yang mulia.\n","en":"And [know that] those who attain to faith and do righteous deeds shall be granted forgiveness of sins and a most excellent sustenance;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2645","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2645.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2645.mp3"]}},{"no":51,"arab":"وَالَّذِينَ سَعَوْا فِي آيَاتِنَا مُعَاجِزِينَ أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ","latin":"waalladziina sa'aw fii aayaatinaa mu'aajiziina ulaa-ika ash-haabu aljahiimi","translate":{"id":"Dan orang-orang yang berusaha dengan maksud menentang ayat-ayat Kami dengan melemahkan (kemauan untuk beriman); mereka itu adalah penghuni-penghuni neraka.\n","en":"whereas those who strive against Our messages, seeking to defeat their purpose - they are destined for the blazing fire."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2646","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2646.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2646.mp3"]}},{"no":52,"arab":"وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ وَلَا نَبِيٍّ إِلَّا إِذَا تَمَنَّىٰ أَلْقَى الشَّيْطَانُ فِي أُمْنِيَّتِهِ فَيَنْسَخُ اللَّهُ مَا يُلْقِي الشَّيْطَانُ ثُمَّ يُحْكِمُ اللَّهُ آيَاتِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","latin":"wamaa arsalnaa min qablika min rasuulin walaa nabiyyin illaa idzaa tamannaa alqaa alsysyaythaanu fii umniyyatihi fayansakhu allaahu maa yulqii alsysyaythaanu tsumma yuhkimu allaahu aayaatihi waallaahu 'aliimun hakiimun","translate":{"id":"Dan Kami tidak mengutus sebelum kamu seorang rasulpun dan tidak (pula) seorang nabi, melainkan apabila ia mempunyai sesuatu keinginan, syaitanpun memasukkan godaan-godaan terhadap keinginan itu, Allah menghilangkan apa yang dimasukkan oleh syaitan itu, dan Allah menguatkan ayat-ayat-Nya. Dan Allah Maha Mengetahui lagi Maha Bijaksana,\n","en":"Yet whenever We sent forth any apostle or prophet before thee, and he was hoping [that his warnings would be heeded], Satan would cast an asper­sion on his innermost aims: but God renders null and void whatever aspersion Satan may cast; and God makes His messages clear in and by themselves for God is all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2647","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2647.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2647.mp3"]}},{"no":53,"arab":"لِيَجْعَلَ مَا يُلْقِي الشَّيْطَانُ فِتْنَةً لِلَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْقَاسِيَةِ قُلُوبُهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَفِي شِقَاقٍ بَعِيدٍ","latin":"liyaj'ala maa yulqii alsysyaythaanu fitnatan lilladziina fii quluubihim maradhun waalqaasiyati quluubuhum wa-inna alzhzhaalimiina lafii syiqaaqin ba'iidin","translate":{"id":"agar Dia menjadikan apa yang dimasukkan oleh syaitan itu, sebagai cobaan bagi orang-orang yang di dalam hatinya ada penyakit dan yang kasar hatinya. Dan sesungguhnya orang-orang yang zalim itu, benar-benar dalam permusuhan yang sangat,\n","en":"[And He allows doubts to arise] so that He might cause whatever aspersion Satan may cast [against His prophets] to become a trial for all in whose hearts is disease and all whose hearts are hardened: for, verily, all who are [thus] sinning [against themselves] are most deeply in the wrong."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2648","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2648.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2648.mp3"]}},{"no":54,"arab":"وَلِيَعْلَمَ الَّذِينَ أُوتُوا الْعِلْمَ أَنَّهُ الْحَقُّ مِنْ رَبِّكَ فَيُؤْمِنُوا بِهِ فَتُخْبِتَ لَهُ قُلُوبُهُمْ ۗ وَإِنَّ اللَّهَ لَهَادِ الَّذِينَ آمَنُوا إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"waliya'lama alladziina uutuu al'ilma annahu alhaqqu min rabbika fayu/minuu bihi fatukhbita lahu quluubuhum wa-inna allaaha lahaadi alladziina aamanuu ilaa shiraathin mustaqiimin","translate":{"id":"dan agar orang-orang yang telah diberi ilmu, meyakini bahwasanya Al Qur'an itulah yang hak dari Tuhan-mu lalu mereka beriman dan tunduk hati mereka kepadanya dan sesungguhnya Allah adalah Pemberi Petunjuk bagi orang-orang yang beriman kepada jalan yang lurus.\n","en":"And [God renders Satan’s aspersions null and void] so that they who are endowed with [innate] knowledge might know that this [divine writ] is the truth from thy Sustainer, and that they aught believe in it, and that their hearts might humbly submit unto Him. For, behold, God does guide onto a straight way those who have attained to faith –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2649","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2649.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2649.mp3"]}},{"no":55,"arab":"وَلَا يَزَالُ الَّذِينَ كَفَرُوا فِي مِرْيَةٍ مِنْهُ حَتَّىٰ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً أَوْ يَأْتِيَهُمْ عَذَابُ يَوْمٍ عَقِيمٍ","latin":"walaa yazaalu alladziina kafaruu fii miryatin minhu hattaa ta/tiyahumu alssaa'atu baghtatan aw ya/tiyahum 'adzaabu yawmin 'aqiimin","translate":{"id":"Dan senantiasalah orang-orang kafir itu berada dalam keragu-raguan terhadap Al Qur'an, hingga datang kepada mereka saat (kematiannya) dengan tiba-tiba atau datang kepada mereka azab hari kiamat.\n","en":"whereas those who are bent on denying the truth will not cease to be in doubt about Him until the Last Hour comes suddenly upon them and [supreme] suffering befalls them on a Day void of all hope."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2650","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2650.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2650.mp3"]}},{"no":56,"arab":"الْمُلْكُ يَوْمَئِذٍ لِلَّهِ يَحْكُمُ بَيْنَهُمْ ۚ فَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي جَنَّاتِ النَّعِيمِ","latin":"almulku yawma-idzin lillaahi yahkumu baynahum faalladziina aamanuu wa'amiluu alshshaalihaati fii jannaati alnna'iimi","translate":{"id":"Kekuasaan di hari itu ada pada Allah, Dia memberi keputusan di antara mereka. Maka orang-orang yang beriman dan beramal saleh adalah di dalam syurga yang penuh keni'matan.\n","en":"On that Day, all dominion shall [visibly] belong to God, He shall judge [all men and make a distinction] between them: thus, all who had attained to faith and did righteous deeds shall find themselves in gardens of bliss,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2651","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2651.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2651.mp3"]}},{"no":57,"arab":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا فَأُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ","latin":"waalladziina kafaruu wakadzdzabuu bi-aayaatinaa faulaa-ika lahum 'adzaabun muhiinun","translate":{"id":"Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, maka bagi mereka azab yang menghinakan.\n","en":"whereas for those who were bent on denying the truth and gave the lie to Our messages, there shall be shameful suffering in store."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2652","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2652.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2652.mp3"]}},{"no":58,"arab":"وَالَّذِينَ هَاجَرُوا فِي سَبِيلِ اللَّهِ ثُمَّ قُتِلُوا أَوْ مَاتُوا لَيَرْزُقَنَّهُمُ اللَّهُ رِزْقًا حَسَنًا ۚ وَإِنَّ اللَّهَ لَهُوَ خَيْرُ الرَّازِقِينَ","latin":"waalladziina haajaruu fii sabiili allaahi tsumma qutiluu aw maatuu layarzuqannahumu allaahu rizqan hasanan wa-inna allaaha lahuwa khayru alrraaziqiina","translate":{"id":"Dan orang-orang yang berhijrah di jalan Allah, kemudian mereka di bunuh atau mati, benar-benar Allah akan memberikan kepada mereka rezki yang baik (surga). Dan sesungguhnya Allah adalah sebaik-baik pemberi rezki.\n","en":"AND AS FOR those who forsake the domain of evil (and strive) in God’s cause, and then are slain or die - God will most certainly provide for them a goodly sustenance [in the life to come] for, verily, God - He alone - is the best of providers;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2653","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2653.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2653.mp3"]}},{"no":59,"arab":"لَيُدْخِلَنَّهُمْ مُدْخَلًا يَرْضَوْنَهُ ۗ وَإِنَّ اللَّهَ لَعَلِيمٌ حَلِيمٌ","latin":"layudkhilannahum mudkhalan yardhawnahu wa-inna allaaha la'aliimun haliimun","translate":{"id":"Sesungguhnya Allah akan memasukkan mereka ke dalam suatu tempat (syurga) yang mereka menyukainya. Dan sesungguhnya Allah Maha mengetahui lagi Maha Penyantun.\n","en":"[and] He will most certainly cause them to enter upon a state (of being) that shall please them well: for, verily, God is all-knowing, most forbearing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2654","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2654.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2654.mp3"]}},{"no":60,"arab":"ذَٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِ ثُمَّ بُغِيَ عَلَيْهِ لَيَنْصُرَنَّهُ اللَّهُ ۗ إِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ","latin":"dzaalika waman 'aaqaba bimitsli maa 'uuqiba bihi tsumma bughiya 'alayhi layanshurannahu allaahu inna allaaha la'afuwwun ghafuurun","translate":{"id":"Demikianlah, dan barangsiapa membalas seimbang dengan penganiayaan yang pernah ia derita kemudian ia dianiaya (lagi), pasti Allah akan menolongnya. Sesungguhnya Allah benar-benar Maha Pema'af lagi Maha Pengampun.\n","en":"Thus shall it be. And as for him who responds to aggression only to the extent of the attack levelled against him, and is thereupon [again] treacherously attacked - God will most certainly succour him: for, behold, God is indeed an absolver of sins, much-forgiving."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2655","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2655.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2655.mp3"]}},{"no":61,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَأَنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","latin":"dzaalika bi-anna allaaha yuuliju allayla fii alnnahaari wayuuliju alnnahaara fii allayli wa-anna allaaha samii'un bashiirun","translate":{"id":"Yang demikian itu, adalah karena sesungguhnya Allah (kuasa) memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan bahwasanya Allah Maha Mendengar lagi Maha Melihat.\n","en":"Thus it is, because God [is almighty the One who] makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night; and because God is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2656","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2656.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2656.mp3"]}},{"no":62,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ هُوَ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ","latin":"dzaalika bi-anna allaaha huwa alhaqqu wa-anna maa yad'uuna min duunihi huwa albaathilu wa-anna allaaha huwa al'aliyyu alkabiiru","translate":{"id":"(Kuasa Allah) yang demikian itu, adalah karena sesungguhnya Allah, Dialah (Tuhan) Yang Haq dan sesungguhnya apa saja yang mereka seru selain dari Allah, itulah yang batil, dan sesungguhnya Allah, Dialah Yang Maha Tinggi lagi Maha Besar.\n","en":"Thus it is, because God alone is the Ultimate Truth, so that all that men invoke beside Him is sheer falsehood, and because God alone is exalted, great!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2657","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2657.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2657.mp3"]}},{"no":63,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَتُصْبِحُ الْأَرْضُ مُخْضَرَّةً ۗ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ","latin":"alam tara anna allaaha anzala mina alssamaa-i maa-an fatushbihu al-ardhu mukhdharratan inna allaaha lathiifun khabiirun","translate":{"id":"Apakah kamu tiada melihat, bahwasanya Allah menurunkan air dari langit, lalu jadilah bumi itu hijau? Sesungguhnya Allah Maha Halus lagi Maha Mengetahui.\n","en":"Art thou not aware that it’s God who sends down water from the skies, whereupon the earth becomes green? Verily, God is unfathomable [in His wisdom], all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2658","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2658.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2658.mp3"]}},{"no":64,"arab":"لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنَّ اللَّهَ لَهُوَ الْغَنِيُّ الْحَمِيدُ","latin":"lahu maa fii alssamaawaati wamaa fii al-ardhi wa-inna allaaha lahuwa alghaniyyu alhamiidu","translate":{"id":"Kepunyaan Allah-lah segala yang ada di langit dan segala yang ada di bumi. Dan sesungguhnya Allah benar-benar Maha Kaya lagi Maha Terpuji.\n","en":"Unto Him belongs all that is in the heavens and all that is on earth; and, verily, God - He alone - is self-sufficient, the One to whom all praise is due."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2659","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2659.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2659.mp3"]}},{"no":65,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي الْأَرْضِ وَالْفُلْكَ تَجْرِي فِي الْبَحْرِ بِأَمْرِهِ وَيُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ ۗ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ","latin":"alam tara anna allaaha sakhkhara lakum maa fii al-ardhi waalfulka tajrii fii albahri bi-amrihi wayumsiku alssamaa-a an taqa'a 'alaa al-ardhi illaa bi-idznihi inna allaaha bialnnaasi larauufun rahiimun","translate":{"id":"Apakah kamu tiada melihat bahwasanya Allah menundukkan bagimu apa yang ada di bumi dan bahtera yang berlayar di lautan dengan perintah-Nya. Dan Dia menahan (benda-benda) langit jatuh ke bumi, melainkan dengan izin-Nya? Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang kepada Manusia.\n","en":"Art thou not aware that it is God who has made subservient to you all that is on earth, and the ships that sail through the sea at His behest - and [that it is He who] holds the celestial bodies [in their orbits], so that they may not fall upon the earth otherwise than by His leave? Verily, God is most compassionate towards men, a dispenser of grace –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2660","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2660.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2660.mp3"]}},{"no":66,"arab":"وَهُوَ الَّذِي أَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۗ إِنَّ الْإِنْسَانَ لَكَفُورٌ","latin":"wahuwa alladzii ahyaakum tsumma yumiitukum tsumma yuhyiikum inna al-insaana lakafuurun","translate":{"id":"Dan Dialah Allah yang telah menghidupkan kamu, kemudian mematikan kamu, kemudian menghidupkan kamu (lagi), sesungguhnya manusia itu, benar-benar sangat mengingkari ni'mat.\n","en":"seeing that it is He who gave you life, and then will cause you to die, and then will bring you back to life: [but,] verily, bereft of all gratitude is man!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2661","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2661.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2661.mp3"]}},{"no":67,"arab":"لِكُلِّ أُمَّةٍ جَعَلْنَا مَنْسَكًا هُمْ نَاسِكُوهُ ۖ فَلَا يُنَازِعُنَّكَ فِي الْأَمْرِ ۚ وَادْعُ إِلَىٰ رَبِّكَ ۖ إِنَّكَ لَعَلَىٰ هُدًى مُسْتَقِيمٍ","latin":"likulli ummatin ja'alnaa mansakan hum naasikuuhu falaa yunaazi'unnaka fii al-amri waud'u ilaa rabbika innaka la'alaa hudan mustaqiimin","translate":{"id":"Bagi tiap-tiap umat telah Kami tetapkan syari'at tertentu yang mereka lakukan, maka janganlah sekali-kali mereka membantah kamu dalam urusan (syari'at) ini dan serulah kepada (agama) Tuhanmu. Sesungguhnya kamu benar-benar berada pada jalan yang lurus.\n","en":"UNTO every community have We appointed [different] ways of worship, which they ought to observe. Hence, [O believer,] do not let those [who follow ways other than thine] draw thee into disputes on this score, but summon [them all] unto thy Sustainer: for, behold, thou art indeed on the right way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2662","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2662.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2662.mp3"]}},{"no":68,"arab":"وَإِنْ جَادَلُوكَ فَقُلِ اللَّهُ أَعْلَمُ بِمَا تَعْمَلُونَ","latin":"wa-in jaadaluuka faquli allaahu a'lamu bimaa ta'maluuna","translate":{"id":"Dan jika mereka membantah kamu, maka katakanlah: \"Allah lebih mengetahui tentang apa yang kamu kerjakan\".\n","en":"And if they [try to] argue with thee, say [only]: “God knows best what you are doing.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2663","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2663.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2663.mp3"]}},{"no":69,"arab":"اللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ فِيمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ","latin":"allaahu yahkumu baynakum yawma alqiyaamati fiimaa kuntum fiihi takhtalifuuna","translate":{"id":"Allah akan mengadili di antara kamu pada hari kiamat tentang apa yang kamu dahulu selalu berselisih padanya.\n","en":"[For, indeed,] God will judge between you [all] on Resurrection Day with regard to all on which you were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2664","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2664.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2664.mp3"]}},{"no":70,"arab":"أَلَمْ تَعْلَمْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاءِ وَالْأَرْضِ ۗ إِنَّ ذَٰلِكَ فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","latin":"alam ta'lam anna allaaha ya'lamu maa fii alssamaa-i waal-ardhi inna dzaalika fii kitaabin inna dzaalika 'alaa allaahi yasiirun","translate":{"id":"Apakah kamu tidak mengetahui bahwa sesungguhnya Allah mengetahui apa saja yang ada di langit dan di bumi?; bahwasanya yang demikian itu terdapat dalam sebuah kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu amat mudah bagi Allah.\n","en":"Dost thou not know that God knows all that occurs in heaven as well as on earth? All this, behold, is in [God’s] record: verily, [to know] all this is easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2665","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2665.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2665.mp3"]}},{"no":71,"arab":"وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا وَمَا لَيْسَ لَهُمْ بِهِ عِلْمٌ ۗ وَمَا لِلظَّالِمِينَ مِنْ نَصِيرٍ","latin":"waya'buduuna min duuni allaahi maa lam yunazzil bihi sulthaanan wamaa laysa lahum bihi 'ilmun wamaa lilzhzhaalimiina min nashiirin","translate":{"id":"Dan mereka menyembah selain Allah, apa yang Allah tidak menurunkan keterangan tentang itu, dan apa yang mereka sendiri tiada mempunyai pengetahuan terhadapnya. Dan bagi orang-orang yang zalim sekali-kali tidak ada seorang penolongpun.\n","en":"And yet they [who claim to believe in Him often] worship [other beings or forces] beside God - something for which He has never bestoweed any warrant from on high, and [of the reality] whereof they cannot have any knowledge: and such evildoers shall have none to succour them [on Judgment Day]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2666","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2666.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2666.mp3"]}},{"no":72,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ تَعْرِفُ فِي وُجُوهِ الَّذِينَ كَفَرُوا الْمُنْكَرَ ۖ يَكَادُونَ يَسْطُونَ بِالَّذِينَ يَتْلُونَ عَلَيْهِمْ آيَاتِنَا ۗ قُلْ أَفَأُنَبِّئُكُمْ بِشَرٍّ مِنْ ذَٰلِكُمُ ۗ النَّارُ وَعَدَهَا اللَّهُ الَّذِينَ كَفَرُوا ۖ وَبِئْسَ الْمَصِيرُ","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa bayyinaatin ta'rifu fii wujuuhi alladziina kafaruu almunkara yakaaduuna yasthuuna bialladziina yatluuna 'alayhim aayaatinaa qul afa-unabbi-ukum bisyarrin min dzaalikum alnnaaru wa'adahaa allaahu alladziina kafaruu wabi/sa almashiiru","translate":{"id":"Dan apabila dibacakan di hadapan mereka ayat-ayat Kami yang terang, niscaya kamu melihat tanda-tanda keingkaran pada muka orang-orang yang kafir itu. Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami di hadapan mereka. Katakanlah: \"Apakah akan aku kabarkan kepadamu yang lebih buruk daripada itu, yaitu neraka?\" Allah telah mengancamkannya kepada orang-orang yang kafir. Dan neraka itu adalah seburuk-buruknya tempat kembali.\n","en":"As it is, whenever Our messages are conveyed unto them in all their clarity, thou canst perceive utter repugnance on the faces of those who are bent on denying the truth: they would almost assault those who convey Our messages unto them! Say: “Shall I, then, tell you of something worse than what you feel at present? It is the fire [of the hereafter] that God has promised to those who are bent on denying the truth: and how vile a journey’s end!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2667","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2667.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2667.mp3"]}},{"no":73,"arab":"يَا أَيُّهَا النَّاسُ ضُرِبَ مَثَلٌ فَاسْتَمِعُوا لَهُ ۚ إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا ذُبَابًا وَلَوِ اجْتَمَعُوا لَهُ ۖ وَإِنْ يَسْلُبْهُمُ الذُّبَابُ شَيْئًا لَا يَسْتَنْقِذُوهُ مِنْهُ ۚ ضَعُفَ الطَّالِبُ وَالْمَطْلُوبُ","latin":"yaa ayyuhaa alnnaasu dhuriba matsalun faistami'uu lahu inna alladziina tad'uuna min duuni allaahi lan yakhluquu dzubaaban walawi ijtama'uu lahu wa-in yaslubuhumu aldzdzubaabu syay-an laa yastanqidzuuhu minhu dha'ufa alththaalibu waalmathluubu","translate":{"id":"Hai manusia, telah dibuat perumpamaan, maka dengarkanlah olehmu perumpamaan itu. Sesungguhnya segala yang kamu seru selain Allah sekali-kali tidak dapat menciptakan seekor lalatpun, walaupun mereka bersatu menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, tiadalah mereka dapat merebutnya kembali dari lalat itu. Amat lemahlah yang menyembah dan amat lemah (pulalah) yang disembah.\n","en":"O MEN! A parable is set forth [herewith]; hearken, then, to it! Behold, those beings whom you invoke instead of God cannot create [as much as] a fly, even were they to join all their forces to that end! And if a fly robs them of anything, they cannot [even] rescue it from him! Weak indeed is the seeker, and [weak] the sought!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2668","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2668.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2668.mp3"]}},{"no":74,"arab":"مَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ ۗ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ","latin":"maa qadaruu allaaha haqqa qadrihi inna allaaha laqawiyyun 'aziizun","translate":{"id":"Mereka tidak mengenal Allah dengan sebenar-benarnya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa.\n","en":"No true understanding of God have they [who err in this way]: for, verily, God is most powerful, almighty!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2669","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2669.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2669.mp3"]}},{"no":75,"arab":"اللَّهُ يَصْطَفِي مِنَ الْمَلَائِكَةِ رُسُلًا وَمِنَ النَّاسِ ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","latin":"allaahu yasthafii mina almalaa-ikati rusulan wamina alnnaasi inna allaaha samii'un bashiirun","translate":{"id":"Allah memilih utusan-utusan-(Nya) dari malaikat dan dari manusia; sesungguhnya Allah Maha Mendengar lagi Maha Melihat.\n","en":"[In His almightiness,] God chooses message-bearers from among the angels as well as from among men. But, behold, God [alone] is all-hearing, all-see­ing:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2670","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2670.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2670.mp3"]}},{"no":76,"arab":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","latin":"ya'lamu maa bayna aydiihim wamaa khalfahum wa-ilaa allaahi turja'u al-umuuru","translate":{"id":"Allah mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka. Dan hanya kepada Allah dikembalikan semua urusan.\n","en":"[whereas their knowledge is limited,] He knows all that lies open before them and all that is hidden from them for all things go back to God [as their source]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2671","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2671.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2671.mp3"]}},{"no":77,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ ۩","latin":"yaa ayyuhaa alladziina aamanuu irka'uu wausjuduu wau'buduu rabbakum waif'aluu alkhayra la'allakum tuflihuuna","translate":{"id":"Hai orang-orang yang beriman, ruku'lah kamu, sujudlah kamu, sembahlah Tuhanmu dan perbuatlah kebajikan, supaya kamu mendapat kemenangan.\n","en":"O YOU who have attained to faith! Bow down and prostrate yourselves, and worship your Sustainer [alone], and do good, so that you might attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2672","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2672.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2672.mp3"]}},{"no":78,"arab":"وَجَاهِدُوا فِي اللَّهِ حَقَّ جِهَادِهِ ۚ هُوَ اجْتَبَاكُمْ وَمَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ ۚ مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ ۚ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ مِنْ قَبْلُ وَفِي هَٰذَا لِيَكُونَ الرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ ۚ فَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَاعْتَصِمُوا بِاللَّهِ هُوَ مَوْلَاكُمْ ۖ فَنِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ","latin":"wajaahiduu fii allaahi haqqa jihaadihi huwa ijtabaakum wamaa ja'ala 'alaykum fii alddiini min harajin millata abiikum ibraahiima huwa sammaakumu almuslimiina min qablu wafii haadzaa liyakuuna alrrasuulu syahiidan 'alaykum watakuunuu syuhadaa-a 'alaa alnnaasi fa-aqiimuu alshshalaata waaatuu alzzakaata wai'tashimuu biallaahi huwa mawlaakum fani'ma almawlaa wani'ma alnnashiiru","translate":{"id":"Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya. Dia telah memilih kamu dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan. (Ikutilah) agama orang tuamu Ibrahim. Dia (Allah) telah menamai kamu sekalian orang-orang muslim dari dahulu , dan (begitu pula) dalam (Al Qur'an) ini, supaya Rasul itu menjadi saksi atas dirimu dan supaya kamu semua menjadi saksi atas segenap manusia, maka dirikanlah sembahyang, tunaikanlah zakat dan berpeganglah kamu pada tali Allah. Dia adalah Pelindungmu, maka Dialah sebaik-baik Pelindung dan sebaik-baik Penolong.\n","en":"And strive hard in God’s cause with all the striving that is due to Him: it is He who has elected you [to carry His message], and has laid no hardship on you in [anything that pertains to religion, [and made you follow] the creed of your forefather Abraham. It is He who has named you in bygone times as well as in this [divine writ] – “those who have surrendered themselves to God”, so that the Apostle might bear witness to the truth before you, and that you might bear witness to it before all mankind. Thus, be constant in prayer, and render the purifying dues, and hold fast unto God. He is your Lord Supreme: and how excellent is this Lord Supreme, and how excellent this Giver of Succour!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2673","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2673.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2673.mp3"]}}]}