{"alquran":{"no":25,"name":"Al-Furqaan","arab":"الفرقان","start":2855,"count":77,"rukku":6,"type":"mecca","description":"Surat ini terdiri atas 77 ayat, termasuk golongan surat-surat Makkiyah. Dinamai <i>Al Furqaan</i> yang artinya <i>pembeda</i>, diambil dari kata <i>Al Furqaan</i> yang terdapat pada ayat pertama surat ini. Yang dimaksud dengan Al Furqaan dalam ayat ini ialah Al Quran.<br> Al Quran dinamakan Al Furqaan karena dia membedakan antara yang haq dengan yang batil. MAka pada surat ini pun terdapat ayat-ayat yang membedakan antara kebenaran ke-esaan Allah s.w.t. dengan kebatilan kepercayaan syirik."},"surah":[{"no":1,"arab":" تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَىٰ عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا","latin":"tabaaraka alladzii nazzala alfurqaana 'alaa 'abdihi liyakuuna lil'aalamiina nadziiraan","translate":{"id":"Maha suci Allah yang telah menurunkan Al Furqaan (Al Qur'an) kepada hamba-Nya, agar dia menjadi pemberi peringatan kepada seluruh alam ,\n","en":"Hallowed is He who from on high, step by step, has bestowed upon His servant the standard by which to discern the true from the false, so that to all the world it might be a warning:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2856","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2856.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2856.mp3"]}},{"no":2,"arab":"الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا","latin":"alladzii lahu mulku alssamaawaati waal-ardhi walam yattakhidz waladan walam yakun lahu syariikun fii almulki wakhalaqa kulla syay-in faqaddarahu taqdiiraan","translate":{"id":"yang kepunyaan-Nya-lah kerajaan langit dan bumi, dan Dia tidak mempunyai anak, dan tidak ada sekutu bagiNya dalam kekuasaan(Nya), dan dia telah menciptakan segala sesuatu, dan Dia menetapkan ukuran-ukurannya dengan serapi-rapinya .\n","en":"He to whom the dominion over the heavens and the earth belongs, and who begets no offspring, and has no partner in His dominion: for it is He who creates every thing and determines its nature in accordance with [His own] design."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2857","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2857.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2857.mp3"]}},{"no":3,"arab":"وَاتَّخَذُوا مِنْ دُونِهِ آلِهَةً لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ وَلَا يَمْلِكُونَ لِأَنْفُسِهِمْ ضَرًّا وَلَا نَفْعًا وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا","latin":"waittakhadzuu min duunihi aalihatan laa yakhluquuna syay-an wahum yukhlaquuna walaa yamlikuuna li-anfusihim dharran walaa naf'an walaa yamlikuuna mawtan walaa hayaatan walaa nusyuuraan","translate":{"id":"Kemudian mereka mengambil tuhan-tuhan selain daripada-Nya (untuk disembah), yang tuhan-tuhan itu tidak menciptakan apapun, bahkan mereka sendiri diciptakan dan tidak kuasa untuk (menolak) sesuatu kemudharatan dari dirinya dan tidak (pula untuk mengambil) suatu kemanfaatanpun dan (juga) tidak kuasa mematikan, menghidupkan dan tidak (pula) membangkitkan.\n","en":"And yet, some choose to worship, instead of Him, imaginary deities that cannot create anything but are themselves created, and have it not within their power to avert harm from, or bring benefit to, themselves, and have no power over death, nor over life, nor over resurrection!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2858","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2858.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2858.mp3"]}},{"no":4,"arab":"وَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آخَرُونَ ۖ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا","latin":"waqaala alladziina kafaruu in haadzaa illaa ifkun iftaraahu wa-a'aanahu 'alayhi qawmun aakharuuna faqad jaauu zhulman wazuuraan","translate":{"id":"Dan orang-orang kafir berkata: \"Al Qur'an ini tidak lain hanyalah kebohongan yang diada-adakan oleh Muhammad dan dia dibantu oleh kaum yang lain \"; maka sesungguhnya mereka telah berbuat suatu kezaliman dan dusta yang besar.\n","en":"Moreover, those who are bent on denying the truth are wont to say, “This [Qur’an] is nothing but a lie, which he [himself] has devised with the help of other people, who thereupon have perverted the truth and brought a falsehood into being.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2859","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2859.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2859.mp3"]}},{"no":5,"arab":"وَقَالُوا أَسَاطِيرُ الْأَوَّلِينَ اكْتَتَبَهَا فَهِيَ تُمْلَىٰ عَلَيْهِ بُكْرَةً وَأَصِيلًا","latin":"waqaaluu asaathiiru al-awwaliina iktatabahaa fahiya tumlaa 'alayhi bukratan wa-ashiilaan","translate":{"id":"Dan mereka berkata: \"Dongengan-dongengan orang-orang dahulu, dimintanya supaya dituliskan, maka dibacakanlah dongengan itu kepadanya setiap pagi dan petang.\"\n","en":"And they say, “Fables of ancient times which he has caused to be written down, so that they might be read out to him at morn and evening!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2860","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2860.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2860.mp3"]}},{"no":6,"arab":"قُلْ أَنْزَلَهُ الَّذِي يَعْلَمُ السِّرَّ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ كَانَ غَفُورًا رَحِيمًا","latin":"qul anzalahu alladzii ya'lamu alssirra fii alssamaawaati waal-ardhi innahu kaana ghafuuran rahiimaan","translate":{"id":"Katakanlah: \"Al Qur'an itu diturunkan oleh (Allah) yang mengetahui rahasia di langit dan di bumi. Sesungguhnya Dia adalah Maha Pengampun lagi Maha Penyayang.\"\n","en":"Say [O Muhammad]: “He who knows all the mysteries of the heavens and the earth has bestowed from on high this [Qur’an upon me]! Verily, He is much-forgiving, a dispenser of grace!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2861","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2861.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2861.mp3"]}},{"no":7,"arab":"وَقَالُوا مَالِ هَٰذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الْأَسْوَاقِ ۙ لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا","latin":"waqaaluu maali haadzaa alrrasuuli ya/kulu alththha'aama wayamsyii fii al-aswaaqi lawlaa unzila ilayhi malakun fayakuuna ma'ahu nadziiraan","translate":{"id":"Dan mereka berkata: \"Mengapa rasul itu memakan makanan dan berjalan di pasar-pasar? Mengapa tidak diturunkan kepadanya seorang malaikat agar malaikat itu memberikan peringatan bersama-sama dengan dia?,\n","en":"Yet they say: What sort of apostle is this [man] who eats food [like all other mortals] and goes about in the market places? Why has not an angel [visibly] been sent down unto him, to act as a warner together with him?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2862","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2862.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2862.mp3"]}},{"no":8,"arab":"أَوْ يُلْقَىٰ إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا ۚ وَقَالَ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا","latin":"aw yulqaa ilayhi kanzun aw takuunu lahu jannatun ya/kulu minhaa waqaala alzhzhaalimuuna in tattabi'uuna illaa rajulan mashuuraan","translate":{"id":"atau (mengapa tidak) diturunkan kepadanya perbendaharaan, atau (mengapa tidak) ada kebun baginya, yang dia dapat makan dari (hasil)nya?\" Dan orang-orang yang zalim itu berkata: \"Kamu sekalian tidak lain hanyalah mengikuti seorang lelaki yang kena sihir\".\n","en":"Or: “[Why has not] a treasure been granted to him [by God]?” Or: “He should [at least] have a [bountiful] garden, so that he could eat thereof [without effort]!” And so these evildoers say [unto one another], “If you were to follow [Muhammad, you would follow] but a man bewitched!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2863","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2863.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2863.mp3"]}},{"no":9,"arab":"انْظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا","latin":"unzhur kayfa dharabuu laka al-amtsaala fadhalluu falaa yastathii'uuna sabiilaan","translate":{"id":"Perhatikanlah, bagaimana mereka membuat perbandingan-perbandingan tentang kamu, lalu sesatlah mereka, mereka tidak sanggup (mendapatkan) jalan (untuk menentang kerasulanmu).\n","en":"See to what they liken thee, [O Prophet, simply] because they have gone astray and are now unable to find a way to the truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2864","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2864.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2864.mp3"]}},{"no":10,"arab":"تَبَارَكَ الَّذِي إِنْ شَاءَ جَعَلَ لَكَ خَيْرًا مِنْ ذَٰلِكَ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَيَجْعَلْ لَكَ قُصُورًا","latin":"tabaaraka alladzii in syaa-a ja'ala laka khayran min dzaalika jannaatin tajrii min tahtihaa al-anhaaru wayaj'al laka qushuuraan","translate":{"id":"Maha Suci (Allah) yang jika Dia menghendaki, niscaya dijadikan-Nya bagimu yang lebih baik dari yang demikian, (yaitu) surga-surga yang mengalir sungai-sungai di bawahnya, dan dijadikan-Nya (pula) untukmu istana-istana .\n","en":"Hallowed is He who, if it be His will, shall give thee something better than that [whereof they speak] - gardens through which running waters flow - and shall assign to thee mansions [of bliss in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2865","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2865.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2865.mp3"]}},{"no":11,"arab":"بَلْ كَذَّبُوا بِالسَّاعَةِ ۖ وَأَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِيرًا","latin":"bal kadzdzabuu bialssaa'ati wa-a'tadnaa liman kadzdzaba bialssaa'ati sa'iiraan","translate":{"id":"Bahkan mereka mendustakan hari kiamat. Dan kami menyediakan neraka yang menyala-nyala bagi siapa yang mendustakan hari kiamat.\n","en":"But nay! It is [the very coming of] the Last Hour to which they give the lie! However, for such as give the lie to [the announce­ment of] the Last Hour We have readied a blazing flame:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2866","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2866.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2866.mp3"]}},{"no":12,"arab":"إِذَا رَأَتْهُمْ مِنْ مَكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا","latin":"idzaa ra-at-hum min makaanin ba'iidin sami'uu lahaa taghayyuzhan wazafiiraan","translate":{"id":"Apabila neraka itu melihat mereka dari tempat yang jauh, mereka mendengar kegeramannya dan suara nyalanya.\n","en":"when it shall face them from afar, they will hear its angry roar and its hiss;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2867","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2867.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2867.mp3"]}},{"no":13,"arab":"وَإِذَا أُلْقُوا مِنْهَا مَكَانًا ضَيِّقًا مُقَرَّنِينَ دَعَوْا هُنَالِكَ ثُبُورًا","latin":"wa-idzaa ulquu minhaa makaanan dhayyiqan muqarraniina da'aw hunaalika tsubuuraan","translate":{"id":"Dan apabila mereka dilemparkan ke tempat yang sempit di neraka itu dengan dibelenggu, mereka di sana mengharapkan kebinasaan .\n","en":"and when they are flung, linked [all] together, into a tight space within, they will pray for extinction there and then!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2868","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2868.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2868.mp3"]}},{"no":14,"arab":"لَا تَدْعُوا الْيَوْمَ ثُبُورًا وَاحِدًا وَادْعُوا ثُبُورًا كَثِيرًا","latin":"laa tad'uu alyawma tsubuuran waahidan waud'uu tsubuuran katsiiraan","translate":{"id":"(Akan dikatakan kepada mereka): \"Jangan kamu sekalian mengharapkan satu kebinasaan, melainkan harapkanlah kebinasaan yang banyak\" .\n","en":"[But they will be told:] “Pray not today for one single extinction, but pray for many extinctions!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2869","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2869.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2869.mp3"]}},{"no":15,"arab":"قُلْ أَذَٰلِكَ خَيْرٌ أَمْ جَنَّةُ الْخُلْدِ الَّتِي وُعِدَ الْمُتَّقُونَ ۚ كَانَتْ لَهُمْ جَزَاءً وَمَصِيرًا","latin":"qul adzaalika khayrun am jannatu alkhuldi allatii wu'ida almuttaquuna kaanat lahum jazaa-an wamashiiraan","translate":{"id":"Katakanlah: \"Apa (azab) yang demikian itukah yang baik, atau surga yang kekal yang telah dijanjikan kepada orang-orang yang bertaqwa?\" Dia menjadi balasan dan tempat kembali bagi mereka?\".\n","en":"Say: “Which is better - that, or the paradise of life abiding which has been promised to the God-conscious as their reward and their journey’s end –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2870","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2870.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2870.mp3"]}},{"no":16,"arab":"لَهُمْ فِيهَا مَا يَشَاءُونَ خَالِدِينَ ۚ كَانَ عَلَىٰ رَبِّكَ وَعْدًا مَسْئُولًا","latin":"lahum fiihaa maa yasyaauuna khaalidiina kaana 'alaa rabbika wa'dan mas-uulaan","translate":{"id":"Bagi mereka di dalam surga itu apa yang mereka kehendaki, sedang mereka kekal (di dalamnya). (Hal itu) adalah janji dari Tuhanmu yang patut dimohonkan (kepada-Nya).\n","en":"a promise given by thy Sustainer, [always] to be prayed for?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2871","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2871.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2871.mp3"]}},{"no":17,"arab":"وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ فَيَقُولُ أَأَنْتُمْ أَضْلَلْتُمْ عِبَادِي هَٰؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ","latin":"wayawma yahsyuruhum wamaa ya'buduuna min duuni allaahi fayaquulu a-antum adhlaltum 'ibaadii haaulaa-i am hum dhalluu alssabiila","translate":{"id":"Dan (ingatlah) suatu hari (ketika) Allah menghimpunkan mereka beserta apa yang mereka sembah selain Allah, lalu Allah berkata (kepada yang disembah); \"Apakah kamu yang menyesatkan hamba-hamba-Ku itu, atau mereka sendirikah yang sesat dari jalan (yang benar)?\".\n","en":"BUT [as for people who are oblivious of thy Sus­tainer’s oneness -] one Day He will gather them together with all that they [now] worship instead of God, and will ask [those to whom divinity was falsely ascribed]: “Was it you who led these My creatures astray, or did they by themselves stray from the right path?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2872","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2872.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2872.mp3"]}},{"no":18,"arab":"قَالُوا سُبْحَانَكَ مَا كَانَ يَنْبَغِي لَنَا أَنْ نَتَّخِذَ مِنْ دُونِكَ مِنْ أَوْلِيَاءَ وَلَٰكِنْ مَتَّعْتَهُمْ وَآبَاءَهُمْ حَتَّىٰ نَسُوا الذِّكْرَ وَكَانُوا قَوْمًا بُورًا","latin":"qaaluu subhaanaka maa kaana yanbaghii lanaa an nattakhidza min duunika min awliyaa-a walaakin matta'tahum waaabaa-ahum hattaa nasuu aldzdzikra wakaanuu qawman buuraan","translate":{"id":"Mereka (yang disembah itu) menjawab: \"Maha Suci Engkau, tidaklah patut bagi kami mengambil selain engkau (untuk jadi) pelindung , akan tetapi Engkau telah memberi mereka dan bapak-bapak mereka keni'matan hidup, sampai mereka lupa mengingati (Engkau); dan mereka adalah kaum yang binasa\".\n","en":"They will answer: “Limitless art Thou in Thy glory! It was inconceivable for us to take for our masters anyone but Thyself! But [as for them -] Thou didst allow them and their forefathers to enjoy [the pleasures of] life to such an extent that they forgot all remembrance [of Thee]: for they were people devoid of all good.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2873","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2873.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2873.mp3"]}},{"no":19,"arab":"فَقَدْ كَذَّبُوكُمْ بِمَا تَقُولُونَ فَمَا تَسْتَطِيعُونَ صَرْفًا وَلَا نَصْرًا ۚ وَمَنْ يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَابًا كَبِيرًا","latin":"faqad kadzdzabuukum bimaa taquuluuna famaa tastathii'uuna sharfan walaa nashran waman yazhlim minkum nudziqhu 'adzaaban kabiiraan","translate":{"id":"maka sesungguhnya mereka (yang disembah itu) telah mendustakan kamu tentang apa yang kamu katakan maka kamu tidak akan dapat menolak (azab) dan tidak (pula) menolong (dirimu), dan barang siapa di antara kamu yang berbuat zalim, niscaya Kami rasakan kepadanya azab yang besar.\n","en":"[Thereupon God will say:] “And now, they [whom you regarded as divine] have given the lie to all your [past] assertions, and you can neither ward off [your punishment] nor obtain any succour! For, whoever of you has committed [such] evil, him shall We cause to taste great suffering!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2874","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2874.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2874.mp3"]}},{"no":20,"arab":"وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلَّا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الْأَسْوَاقِ ۗ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً أَتَصْبِرُونَ ۗ وَكَانَ رَبُّكَ بَصِيرًا","latin":"wamaa arsalnaa qablaka mina almursaliina illaa innahum laya/kuluuna alththha'aama wayamsyuuna fii al-aswaaqi waja'alnaa ba'dhakum liba'dhin fitnatan atashbiruuna wakaana rabbuka bashiiraan","translate":{"id":"Dan Kami tidak mengutus rasul-rasul sebelummu, melainkan mereka sungguh memakan makanan dan berjalan di pasar-pasar. Dan kami jadikan sebahagian kamu cobaan bagi sebahagian yang lain. Maukah kamu bersabar?; dan adalah Tuhanmu maha Melihat.\n","en":"AND [even] before thee, [O Muhammad,] We never sent as Our message-bearers any but [mortal men] who indeed ate food [like other human beings] and went about in the market places: for [it is thus that] We cause you [human beings] to be a means of testing one another. Are you able to endure [this test] with patience? For [remember, O man,] thy Sustainer is truly all-seeing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2875","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2875.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2875.mp3"]}},{"no":21,"arab":"وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا","latin":"waqaala alladziina laa yarjuuna liqaa-anaa lawlaa unzila 'alaynaa almalaa-ikatu aw naraa rabbanaa laqadi istakbaruu fii anfusihim wa'ataw 'utuwwan kabiiraan","translate":{"id":"Berkatalah orang-orang yang tidak menanti-nanti pertemuan(nya) dengan Kami: \"Mengapakah tidak diturunkan kepada kita malaikat atau (mengapa) kita (tidak) melihat Tuhan kita?\" Sesungguhnya mereka memandang besar tentang diri mereka dan mereka benar-benar telah melampaui batas(dalam melakukan) kezaliman\".\n","en":"But those who do not believe that they are destined to meet Us are wont to say, “Why have no angels been sent down to us?” – or, “Why do we not see our Sustainer?” Indeed, they are far too proud of themselves, hav­ing rebelled [against God’s truth] with utter disdain!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2876","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2876.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2876.mp3"]}},{"no":22,"arab":"يَوْمَ يَرَوْنَ الْمَلَائِكَةَ لَا بُشْرَىٰ يَوْمَئِذٍ لِلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَحْجُورًا","latin":"yawma yarawna almalaa-ikata laa busyraa yawma-idzin lilmujrimiina wayaquuluuna hijran mahjuuraan","translate":{"id":"Pada hari mereka melihat malaikat dihari itu tidak ada kabar gembira bagi orang-orang yang berdosa mereka berkata: \"Hijraan mahjuuraa .\n","en":"[Yet] on that Day - the Day on which they shall see the angels there will be no glad tiding for those who were lost in sin; and they will exclaim, “By a forbidding ban [are we from God’s grace debarred]!” –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2877","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2877.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2877.mp3"]}},{"no":23,"arab":"وَقَدِمْنَا إِلَىٰ مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَنْثُورًا","latin":"waqadimnaa ilaa maa 'amiluu min 'amalin faja'alnaahu habaa-an mantsuuraan","translate":{"id":"Dan kami hadapi segala amal yang mereka kerjakan , lalu kami jadikan amal itu (bagaikan) debu yang berterbangan.\n","en":"for We shall have turned towards all the [supposedly good] deeds they ever wrought, and shall have transformed them into scattered dust –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2878","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2878.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2878.mp3"]}},{"no":24,"arab":"أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا","latin":"ash-haabu aljannati yawma-idzin khayrun mustaqarran wa-ahsanu maqiilaan","translate":{"id":"Penghuni-penghuni surga pada hari itu palig baik tempat tinggalnya dan paling indah tempat istirahatnya.\n","en":"[whereas] on that same Day those who are destined for paradise will be graced with the best of abodes and the fairest place of repose."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2879","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2879.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2879.mp3"]}},{"no":25,"arab":"وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا","latin":"wayawma tasyaqqaqu alssamaau bialghamaami wanuzzila almalaa-ikatu tanziilaan","translate":{"id":"Dan (ingatlah) hari (ketika) langit pecah belah mengeluarkan kabut putih dan diturunkanlah malaikat bergelombang-gelombang.\n","en":"And on the Day on which the skies, together with the clouds, shall burst asunder, and the angels are made to descend in a mighty descent –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2880","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2880.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2880.mp3"]}},{"no":26,"arab":"الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمَٰنِ ۚ وَكَانَ يَوْمًا عَلَى الْكَافِرِينَ عَسِيرًا","latin":"almulku yawma-idzin alhaqqu lilrrahmaani wakaana yawman 'alaa alkaafiriina 'asiiraan","translate":{"id":"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah. Dan adalah (hari itu), satu hari penuh kesukaran bagi orang-orang kafir.\n","en":"on that Day [it will become obvious to all that] true sover­eignty belongs to the Most Gracious [alone]: hence, a Day of distress will it be for all who deny the truth,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2881","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2881.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2881.mp3"]}},{"no":27,"arab":"وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَىٰ يَدَيْهِ يَقُولُ يَا لَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا","latin":"wayawma ya'adhdhu alzhzhaalimu 'alaa yadayhi yaquulu yaa laytanii ittakhadztu ma'a alrrasuuli sabiilaan","translate":{"id":"Dan (ingatlah) hari (ketika itu) orang yang zalim menggigit dua tangannya , seraya berkata: \"Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul\".\n","en":"and a Day on which the evildoer will bite his hands [in despair], exclaiming: “Oh, would that I had followed the path shown to me by the apostle!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2882","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2882.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2882.mp3"]}},{"no":28,"arab":"يَا وَيْلَتَىٰ لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا","latin":"yaa waylataa laytanii lam attakhidz fulaanan khaliilaan","translate":{"id":"Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku).\n","en":"Oh, woe is me! Would that I had not taken so-and-so for a friend!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2883","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2883.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2883.mp3"]}},{"no":29,"arab":"لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي ۗ وَكَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا","latin":"laqad adhallanii 'ani aldzdzikri ba'da idz jaa-anii wakaana alsysyaythaanu lil-insaani khadzuulaan","translate":{"id":"Sesungguhnya dia telah menyesatkan aku dari Al Qur'an ketika Al Qur'an itu telah datang kepadaku. Dan adalah syaitan itu tidak mau menolong manusia.\n","en":"Indeed, he led me astray from the remembrance [of God] after it had come unto me!” For [thus it is:] Satan is ever a betrayer of man."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2884","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2884.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2884.mp3"]}},{"no":30,"arab":"وَقَالَ الرَّسُولُ يَا رَبِّ إِنَّ قَوْمِي اتَّخَذُوا هَٰذَا الْقُرْآنَ مَهْجُورًا","latin":"waqaala alrrasuulu yaa rabbi inna qawmii ittakhadzuu haadzaa alqur-aana mahjuuraan","translate":{"id":"Berkatalah Rasul: \"Ya Tuhanku, sesungguhnya kaumku menjadikan Al Qur'an itu sesuatu yang tidak diacuhkan\".\n","en":"AND [on that Day] the Apostle will say: “O my Sustainer! Behold, [some of] my people have come to regard this Qur’an as something [that ought to be] discarded!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2885","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2885.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2885.mp3"]}},{"no":31,"arab":"وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ ۗ وَكَفَىٰ بِرَبِّكَ هَادِيًا وَنَصِيرًا","latin":"wakadzaalika ja'alnaa likulli nabiyyin 'aduwwan mina almujrimiina wakafaa birabbika haadiyan wanashiiraan","translate":{"id":"Dan seperti itulah, telah Kami adakan bagi tiap-tiap nabi, musuh dari orang-orang yang berdosa. Dan cukuplah Tuhanmu menjadi Pemberi petunjuk dan Penolong.\n","en":"For so it is that against every prophet We have set up enemies from among those who are lost in sin: yet none can guide and give succour as thy Sustainer does!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2886","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2886.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2886.mp3"]}},{"no":32,"arab":"وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً ۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ ۖ وَرَتَّلْنَاهُ تَرْتِيلًا","latin":"waqaala alladziina kafaruu lawlaa nuzzila 'alayhi alqur-aanu jumlatan waahidatan kadzaalika linutsabbita bihi fu-aadaka warattalnaahu tartiilaan","translate":{"id":"Berkatalah orang-orang yang kafir: \"Mengapa Al Qur'an itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar).\n","en":"Now they who are bent on denying the truth are wont to ask. “Why has not the Qur’an been bestowed on him from on high in one single re­velation?” [it has been revealed] in this manner so that We might strengthen thy heart thereby - for We have so arranged its component parts that they form one consistent whole -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2887","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2887.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2887.mp3"]}},{"no":33,"arab":"وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا","latin":"walaa ya/tuunaka bimatsalin illaa ji/naaka bialhaqqi wa-ahsana tafsiiraan","translate":{"id":"Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya .\n","en":"and [that] they [who deny the truth] might never taunt thee with any deceptive half-truth without Our conveying to thee the [full] truth and [providing thee] with the best explanation."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2888","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2888.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2888.mp3"]}},{"no":34,"arab":"الَّذِينَ يُحْشَرُونَ عَلَىٰ وُجُوهِهِمْ إِلَىٰ جَهَنَّمَ أُولَٰئِكَ شَرٌّ مَكَانًا وَأَضَلُّ سَبِيلًا","latin":"alladziina yuhsyaruuna 'alaa wujuuhihim ilaa jahannama ulaa-ika syarrun makaanan wa-adhallu sabiilaan","translate":{"id":"Orang-orang yang dihimpunkan ke neraka Jahannam dengan diseret atas muka-muka mereka, mereka itulah orang yang paling buruk tempatnya dan paling sesat jalannya.\n","en":"[And so, tell those who are bent on denying the truth that] they who shall be gathered unto hell upon their faces – it is they who [in the life to come] will be worst in station and still farther astray from the path [of truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2889","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2889.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2889.mp3"]}},{"no":35,"arab":"وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَا مَعَهُ أَخَاهُ هَارُونَ وَزِيرًا","latin":"walaqad aataynaa muusaa alkitaaba waja'alnaa ma'ahu akhaahu haaruuna waziiraan","translate":{"id":"Dan sesungguhnya kami telah memberikan Al Kitab (Taurat) kepada Musa dan Kami telah menjadikan Harun saudaranya, menyertai dia sebagai wazir (pembantu).\n","en":"AND, INDEED, [long before Muhammad] We vouchsafed revelation unto Moses, and appointed his brother Aaron to help him to bear his burden;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2890","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2890.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2890.mp3"]}},{"no":36,"arab":"فَقُلْنَا اذْهَبَا إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَدَمَّرْنَاهُمْ تَدْمِيرًا","latin":"faqulnaa idzhabaa ilaa alqawmi alladziina kadzdzabuu bi-aayaatinaa fadammarnaahum tadmiiraan","translate":{"id":"Kemudian Kami berfirman kepada keduanya: \"Pergilah kamu berdua kepada kaum yang mendustakan ayat-ayat Kami\". Maka Kami membinasakan mereka sehancur-hancurnya.\n","en":"and We said, “Go you both unto the people who have given the lie to Our messages!” - and thereupon We broke those [sinners] to smithereens."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2891","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2891.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2891.mp3"]}},{"no":37,"arab":"وَقَوْمَ نُوحٍ لَمَّا كَذَّبُوا الرُّسُلَ أَغْرَقْنَاهُمْ وَجَعَلْنَاهُمْ لِلنَّاسِ آيَةً ۖ وَأَعْتَدْنَا لِلظَّالِمِينَ عَذَابًا أَلِيمًا","latin":"waqawma nuuhin lammaa kadzdzabuu alrrusula aghraqnaahum waja'alnaahum lilnnaasi aayatan wa-a'tadnaa lilzhzhaalimiina 'adzaaban aliimaan","translate":{"id":"Dan (telah Kami binasakan) kaum Nuh tatkala mereka mendustakan rasul-rasul. Kami tenggelamkan mereka dan kami jadikan (cerita) mereka itu pelajaran bagi manusia. Dan Kami telah menyediakan bagi orang-orang zalim azab yang pedih;\n","en":"And [think of] the people of Noah: when they gave the lie to [one of] the apostles, We caused them to drown, and made them a symbol for all mankind: for, grievous suffering have We readied for all who [knowingly] do wrong!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2892","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2892.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2892.mp3"]}},{"no":38,"arab":"وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَٰلِكَ كَثِيرًا","latin":"wa'aadan watsamuuda wa-ash-haaba alrrassi waquruunan bayna dzaalika katsiiraan","translate":{"id":"dan (Kami binasakan) kaum 'Aad dan Tsamud dan penduduk Rass dan banyak (lagi) generasi-generasi di antara kaum-kaum tersebut.\n","en":"And [remember how We punished the tribes of] Ad and Thamud and the people of Ar-Rass, and many generations [of sinners] in-between:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2893","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2893.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2893.mp3"]}},{"no":39,"arab":"وَكُلًّا ضَرَبْنَا لَهُ الْأَمْثَالَ ۖ وَكُلًّا تَبَّرْنَا تَتْبِيرًا","latin":"wakullan dharabnaa lahu al-amtsaala wakullan tabbarnaa tatbiiraan","translate":{"id":"Dan Kami jadikan bagi masing-masing mereka perumpamaan dan masing-masing mereka itu benar benar telah Kami binasakan dengan sehancur-hancurnya.\n","en":"and unto each of them did We proffer lessons and each of them did We destroy with utter destruction."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2894","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2894.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2894.mp3"]}},{"no":40,"arab":"وَلَقَدْ أَتَوْا عَلَى الْقَرْيَةِ الَّتِي أُمْطِرَتْ مَطَرَ السَّوْءِ ۚ أَفَلَمْ يَكُونُوا يَرَوْنَهَا ۚ بَلْ كَانُوا لَا يَرْجُونَ نُشُورًا","latin":"walaqad ataw 'alaa alqaryati allatii umthirat mathara alssaw-i afalam yakuunuu yarawnahaa bal kaanuu laa yarjuuna nusyuuraan","translate":{"id":"Dan sesungguhnya mereka (kaum musyrik Mekah) telah melalui sebuah negeri (Sadum) yang (dulu) dihujani dengan hujan yang sejelek-jeleknya (hujan batu). Maka apakah mereka tidak menyaksikan runtuhan itu; bahkan adalah mereka itu tidak mengharapkan akan kebangkitan.\n","en":"And they [who now deny Our messages] must surely have come across that town which was rained upon by a rain of evil: have they, then, never beheld it [with their minds eye]? But nay, they would not believe in resurrection!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2895","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2895.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2895.mp3"]}},{"no":41,"arab":"وَإِذَا رَأَوْكَ إِنْ يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا الَّذِي بَعَثَ اللَّهُ رَسُولًا","latin":"wa-idzaa ra-awka in yattakhidzuunaka illaa huzuwan ahaadzaa alladzii ba'atsa allaahu rasuulaan","translate":{"id":"Dan apabila mereka melihat kamu (Muhammad), mereka hanyalah menjadikan kamu sebagai ejekan (dengan mengatakan): \"Inikah orangnya yang di utus Allah sebagai Rasul?.\n","en":"Hence, whenever they consider thee, [O Muhammad,] they but make thee a target of their mockery, [saying:] “Is this the one whom God has sent as an apostle?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2896","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2896.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2896.mp3"]}},{"no":42,"arab":"إِنْ كَادَ لَيُضِلُّنَا عَنْ آلِهَتِنَا لَوْلَا أَنْ صَبَرْنَا عَلَيْهَا ۚ وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ مَنْ أَضَلُّ سَبِيلًا","latin":"in kaada layudhillunaa 'an aalihatinaa lawlaa an shabarnaa 'alayhaa wasawfa ya'lamuuna hiina yarawna al'adzaaba man adhallu sabiilaan","translate":{"id":"Sesungguhnya hampirlah ia menyesatkan kita dari sembahan-sembahan kita, seandainya kita tidak sabar(menyembah)nya\" dan mereka kelak akan mengetahui di saat mereka melihat azab, siapa yang paling sesat jalannya.\n","en":"Indeed, he would well-nigh have led us astray from our deities, had we not been [so] steadfastly attached to them!” But in time, when they see the suffering [that awaits them], they will come to know who it was that went farthest astray from the path [of truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2897","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2897.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2897.mp3"]}},{"no":43,"arab":"أَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ أَفَأَنْتَ تَكُونُ عَلَيْهِ وَكِيلًا","latin":"ara-ayta mani ittakhadza ilaahahu hawaahu afa-anta takuunu 'alayhi wakiilaan","translate":{"id":"Terangkanlah kepadaku tentang orang yang menjadikan hawa nafsunya sebagai tuhannya. Maka apakah kamu dapat menjadi pemelihara atasnya?,\n","en":"Hast thou ever considered [the kind of man] who makes his own desires his deity? Couldst thou, then, [O Prophet,] be held responsible for him?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2898","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2898.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2898.mp3"]}},{"no":44,"arab":"أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ ۚ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ ۖ بَلْ هُمْ أَضَلُّ سَبِيلًا","latin":"am tahsabu anna aktsarahum yasma'uuna aw ya'qiluuna in hum illaa kaal-an'aami bal hum adhallu sabiilaan","translate":{"id":"atau apakah kamu mengira bahwa kebanyakan mereka itu mendengar atau memahami. Mereka itu tidak lain, hanyalah seperti binatang ternak, bahkan mereka lebih sesat jalannya (dari binatang ternak itu).\n","en":"Or dost thou think that most of them listen [to thy message] and use their reason? Nay, they are but like cattle - nay, they are even less conscious of the right way!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2899","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2899.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2899.mp3"]}},{"no":45,"arab":"أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلًا","latin":"alam tara ilaa rabbika kayfa madda alzhzhilla walaw syaa-a laja'alahu saakinan tsumma ja'alnaa alsysyamsa 'alayhi daliilaan","translate":{"id":"Apakah kamu tidak memperhatikan (penciptaan) Tuhanmu, bagaimana Dia memanjangkan (dan memendekkan) bayang-bayang dan kalau Dia menghendaki niscaya Dia menjadikan tetap bayang-bayang itu, kemudian Kami jadikan matahari sebagai petunjuk atas bayang-bayang itu,\n","en":"Art thou not aware of thy Sustainer [through His works]? - how He causes the shadow to lengthen [towards the night] when, had He so willed, He could indeed have made it stand still: but then, We have made the sun its guide;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2900","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2900.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2900.mp3"]}},{"no":46,"arab":"ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا","latin":"tsumma qabadhnaahu ilaynaa qabdhan yasiiraan","translate":{"id":"kemudian Kami menarik bayang-bayang itu kepada kami dengan tarikan yang perlahan-lahan.\n","en":"and then, [after having caused it to lengthen,] We draw it in towards Our­selves with a gradual drawing-in."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2901","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2901.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2901.mp3"]}},{"no":47,"arab":"وَهُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِبَاسًا وَالنَّوْمَ سُبَاتًا وَجَعَلَ النَّهَارَ نُشُورًا","latin":"wahuwa alladzii ja'ala lakumu allayla libaasan waalnnawma subaatan waja'ala alnnahaara nusyuuraan","translate":{"id":"Dialah yang menjadikan untukmu malam (sebagai) pakaian, dan tidur untuk istirahat, dan Dia menjadikan siang untuk bangun berusaha.\n","en":"And He it is who makes the night a garment for you, and [your] sleep a rest, and causes every [new] day to be a resurrection."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2902","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2902.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2902.mp3"]}},{"no":48,"arab":"وَهُوَ الَّذِي أَرْسَلَ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا","latin":"wahuwa alladzii arsala alrriyaaha busyran bayna yaday rahmatihi wa-anzalnaa mina alssamaa-i maa-an thahuuraan","translate":{"id":"Dia lah yang meniupkan angin (sebagai) pembawa kabar gembira dekat sebelum kedatangan rahmat-nya (hujan); dan Kami turunkan dari langit air yang amat bersih,\n","en":"And He it is who sends forth the winds as a glad tiding of His coming grace; and [thus, too,] We cause pure water to descend from the skies,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2903","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2903.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2903.mp3"]}},{"no":49,"arab":"لِنُحْيِيَ بِهِ بَلْدَةً مَيْتًا وَنُسْقِيَهُ مِمَّا خَلَقْنَا أَنْعَامًا وَأَنَاسِيَّ كَثِيرًا","latin":"linuhyiya bihi baldatan maytan wanusqiyahu mimmaa khalaqnaa an'aaman wa-anaasiyya katsiiraan","translate":{"id":"agar Kami menghidupkan dengan air itu negeri (tanah) yang mati, dan agar Kami memberi minum dengan air itu sebagian besar dari makhluk Kami, binatang-binatang ternak dan manusia yang banyak.\n","en":"so that We may bring dead land to life thereby, and give to drink thereof to many [beings] of Our creation, beasts as well as humans."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2904","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2904.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2904.mp3"]}},{"no":50,"arab":"وَلَقَدْ صَرَّفْنَاهُ بَيْنَهُمْ لِيَذَّكَّرُوا فَأَبَىٰ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا","latin":"walaqad sharrafnaahu baynahum liyadzdzakkaruu fa-abaa aktsaru alnnaasi illaa kufuuraan","translate":{"id":"Dan sesungguhnya Kami telah mempergilirkan hujan itu diantara manusia supaya mereka mengambil pelajaran (dari padanya); maka kebanyakan manusia itu tidak mau kecuali mengingkari (ni'mat).\n","en":"And, indeed, many times have We repeated [all] this unto men, so that they might take it to heart: but most men refuse to be aught but ingrate."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2905","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2905.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2905.mp3"]}},{"no":51,"arab":"وَلَوْ شِئْنَا لَبَعَثْنَا فِي كُلِّ قَرْيَةٍ نَذِيرًا","latin":"walaw syi/naa laba'atsnaa fii kulli qaryatin nadziiraan","translate":{"id":"Dan andaikata Kami menghendaki benar-benarlah Kami utus pada tiap-tiap negeri seorang yang memberi peringatan (rasul).\n","en":"Now had We so willed. We could have [con­tinued as before and] raised up a [separate] warner in every single community:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2906","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2906.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2906.mp3"]}},{"no":52,"arab":"فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُمْ بِهِ جِهَادًا كَبِيرًا","latin":"falaa tuthi'i alkaafiriina wajaahidhum bihi jihaadan kabiiraan","translate":{"id":"Maka janganlah kamu mengikuti orang-orang kafir, dan berjihadlah terhadap mereka dengan Al Qur'an dengan jihad yang besar.\n","en":"hence, do not defer to [the likes and dislikes of] those who deny the truth, but strive hard against them, by means of this [divine writ], with utmost striving."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2907","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2907.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2907.mp3"]}},{"no":53,"arab":"وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَٰذَا عَذْبٌ فُرَاتٌ وَهَٰذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَحْجُورًا","latin":"wahuwa alladzii maraja albahrayni haadzaa 'adzbun furaatun wahaadzaa milhun ujaajun waja'ala baynahumaa barzakhan wahijran mahjuuraan","translate":{"id":"Dan Dialah yang membiarkan dua laut yang mengalir (berdampingan); yang ini tawar lagi segar dan yang lain asin lagi pahit; dan Dia jadikan antara keduanya dinding dan batas yang menghalangi.\n","en":"AND HE it is who has given freedom of movement to the two great bodies of water – the one sweet and thirst-allaying, and the other salty and bitter - and yet has wrought between them a barrier and a forbidding ban."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2908","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2908.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2908.mp3"]}},{"no":54,"arab":"وَهُوَ الَّذِي خَلَقَ مِنَ الْمَاءِ بَشَرًا فَجَعَلَهُ نَسَبًا وَصِهْرًا ۗ وَكَانَ رَبُّكَ قَدِيرًا","latin":"wahuwa alladzii khalaqa mina almaa-i basyaran faja'alahu nasaban washihran wakaana rabbuka qadiiraan","translate":{"id":"Dan Dia (pula) yang menciptakan manusia dari air lalu dia jadikan manusia itu (punya) keturunan dan mushaharah dan adalah Tuhanmu Maha Kuasa.\n","en":"And He it is who out of this [very] water has created man, and has endowed him with [the con­sciousness of] descent and marriage-tie: for thy Sustainer is ever infinite in His power."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2909","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2909.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2909.mp3"]}},{"no":55,"arab":"وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُهُمْ وَلَا يَضُرُّهُمْ ۗ وَكَانَ الْكَافِرُ عَلَىٰ رَبِّهِ ظَهِيرًا","latin":"waya'buduuna min duuni allaahi maa laa yanfa'uhum walaa yadhurruhum wakaana alkaafiru 'alaa rabbihi zhahiiraan","translate":{"id":"Dan mereka menyembah selain Allah apa yang tidak memberi manfa'at kepada mereka dan tidak (pula) memberi mudharat kepada mereka. Adalah orang-orang kafir itu penolong (syaitan untuk berbuat durhaka) terhadap Tuhannya.\n","en":"And yet, some people worship, instead of God, things that can neither benefit them nor harm them: thus, he who denies the truth does indeed turn his back on his Sustainer!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2910","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2910.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2910.mp3"]}},{"no":56,"arab":"وَمَا أَرْسَلْنَاكَ إِلَّا مُبَشِّرًا وَنَذِيرًا","latin":"wamaa arsalnaaka illaa mubasysyiran wanadziiraan","translate":{"id":"Dan tidaklah Kami mengutus kamu melainkan hanya sebagai pembawa kabar gembira dan pemberi peringatan.\n","en":"Yet [withal, O Prophet,] We have sent thee only as a herald of glad tidings and a warner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2911","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2911.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2911.mp3"]}},{"no":57,"arab":"قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلَّا مَنْ شَاءَ أَنْ يَتَّخِذَ إِلَىٰ رَبِّهِ سَبِيلًا","latin":"qul maa as-alukum 'alayhi min ajrin illaa man syaa-a an yattakhidza ilaa rabbihi sabiilaan","translate":{"id":"Katakanlah: \"Aku tidak meminta upah sedikitpun kepada kamu dalam menyampaikan risalah itu, melainkan (mengharapkan kepatuhan) orang-orang yang mau mengambil jalan kepada Tuhan nya.\n","en":"Say: “For this, no reward do I ask of you [- no reward] other than that he who so wills may unto his Sustainer find a way!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2912","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2912.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2912.mp3"]}},{"no":58,"arab":"وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِ ۚ وَكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا","latin":"watawakkal 'alaa alhayyi alladzii laa yamuutu wasabbih bihamdihi wakafaa bihi bidzunuubi 'ibaadihi khabiiraan","translate":{"id":"Dan bertawakkallah kepada Allah yang hidup (kekal) Yang tidak mati, dan bertasbihlah dengan memuji-Nya. Dan cukuplah Dia Maha Mengetahui dosa-dosa hamba-hamba-Nya.\n","en":"Hence, place thy trust in the Living One who dies not, and extol His limitless glory and praise: for none is as aware as His creatures’ sins as He –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2913","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2913.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2913.mp3"]}},{"no":59,"arab":"الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ الرَّحْمَٰنُ فَاسْأَلْ بِهِ خَبِيرًا","latin":"alladzii khalaqa alssamaawaati waal-ardha wamaa baynahumaa fii sittati ayyaamin tsumma istawaa 'alaa al'arsyi alrrahmaanu fais-al bihi khabiiraan","translate":{"id":"Yang menciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, kemudian dia bersemayam di atas Arsy , (Dialah) Yang Maha Pemurah, maka tanyakanlah (tentang Allah) kepada yang lebih mengetahui (Muhammad) tentang Dia.\n","en":"He who has created the heavens and the earth and all that is between them in six aeons, and is established on the throne of His almightiness: the Most Gracious! Ask, then, about Him, [the] One who is [truly] aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2914","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2914.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2914.mp3"]}},{"no":60,"arab":"وَإِذَا قِيلَ لَهُمُ اسْجُدُوا لِلرَّحْمَٰنِ قَالُوا وَمَا الرَّحْمَٰنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا ۩","latin":"wa-idzaa qiila lahumu usjuduu lilrrahmaani qaaluu wamaa alrrahmaanu anasjudu limaa ta/murunaa wazaadahum nufuuraan","translate":{"id":"Dan apabila dikatakan kepada mereka: \"Sujudlah kamu sekalian kepada yang Maha Penyayang\", mereka menjawab:\"Siapakah yang Maha Penyayang itu? Apakah kami akan sujud kepada Tuhan Yang kamu perintahkan kami(bersujud kepada-Nya)?\", dan (perintah sujud itu) menambah mereka jauh (dari iman).\n","en":"Yet when they [who are bent on denying the truth! are told, “Prostrate yourselves before the Most Gracious.” they are wont to ask, “And [who and] what is the Most Gracious? Are we to prostrate ourselves before whatever thou biddest us [to worship]?” - and so [thy call] but increases their aversion,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2915","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2915.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2915.mp3"]}},{"no":61,"arab":"تَبَارَكَ الَّذِي جَعَلَ فِي السَّمَاءِ بُرُوجًا وَجَعَلَ فِيهَا سِرَاجًا وَقَمَرًا مُنِيرًا","latin":"tabaaraka alladzii ja'ala fii alssamaa-i buruujan waja'ala fiihaa siraajan waqamaran muniiraan","translate":{"id":"Maha Suci Allah yang menjadikan di langit gugusan-gugusan bintang dan Dia menjadikan juga padanya matahari dan bulan yang bercahaya.\n","en":"HALLOWED is He who has set up in the skies great constellations, and has placed among them a [radiant] lamp and a light-giving moon."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2916","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2916.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2916.mp3"]}},{"no":62,"arab":"وَهُوَ الَّذِي جَعَلَ اللَّيْلَ وَالنَّهَارَ خِلْفَةً لِمَنْ أَرَادَ أَنْ يَذَّكَّرَ أَوْ أَرَادَ شُكُورًا","latin":"wahuwa alladzii ja'ala allayla waalnnahaara khilfatan liman araada an yadzdzakkara aw araada syukuuraan","translate":{"id":"Dan Dia (pula) yang menjadikan malam dan siang silih berganti bagi orang yang ingin mengambil pelajaran atau orang yang ingin bersyukur.\n","en":"And He it is who causes the night and the day to succeed one another, [revealing Himself in His works] unto him who has the will to take thought - that is has the will to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2917","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2917.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2917.mp3"]}},{"no":63,"arab":"وَعِبَادُ الرَّحْمَٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا","latin":"wa'ibaadu alrrahmaani alladziina yamsyuuna 'alaa al-ardhi hawnan wa-idzaa khaathabahumu aljaahiluuna qaaluu salaamaan","translate":{"id":"Dan hamba-hamba Tuhan yang Maha Penyayang itu (ialah) orang-orang yang berjalan di atas bumi dengan rendah hati dan apabila orang-orang jahil menyapa mereka, mereka mengucapkan kata-kata (yang mengandung) keselamatan.\n","en":"For, [true] servants of the Most Gracious are [only] they who walk gently on earth, and who, whenever the foolish address them, reply with [words of] peace;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2918","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2918.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2918.mp3"]}},{"no":64,"arab":"وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا","latin":"waalladziina yabiituuna lirabbihim sujjadan waqiyaamaan","translate":{"id":"Dan orang yang melalui malam hari dengan bersujud dan berdiri untuk Tuhan mereka .\n","en":"and who remember their Sustainer far into the night, prostrating themselves and standing;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2919","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2919.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2919.mp3"]}},{"no":65,"arab":"وَالَّذِينَ يَقُولُونَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا","latin":"waalladziina yaquuluuna rabbanaa ishrif 'annaa 'adzaaba jahannama inna 'adzaabahaa kaana gharaamaan","translate":{"id":"Dan orang-orang yang berkata: \"Ya Tuhan kami, jauhkan azab jahannam dari kami, sesungguhnya azabnya itu adalah kebinasaan yang kekal\".\n","en":"and who pray: “O our Sustainer, avert from us the suffering of hell - for, verily, the suffering caused by it is bound to be a torment dire:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2920","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2920.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2920.mp3"]}},{"no":66,"arab":"إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا","latin":"nnahaa saa-at mustaqarran wamuqaamaan","translate":{"id":"Sesungguhnya jahannam itu seburuk-buruk tempat menetap dan tempat kediaman.\n","en":"verily, how evil an abode and a station!” -;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2921","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2921.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2921.mp3"]}},{"no":67,"arab":"وَالَّذِينَ إِذَا أَنْفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا","latin":"waalladziina idzaa anfaquu lam yusrifuu walam yaqturuu wakaana bayna dzaalika qawaamaan","translate":{"id":"Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir, dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian.\n","en":"and who, whenever they spend on others, are neither wasteful nor niggardly but [remember that] there is always a just mean between those [two extremes];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2922","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2922.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2922.mp3"]}},{"no":68,"arab":"وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَٰهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا","latin":"waalladziina laa yad'uuna ma'aa allaahi ilaahan aakhara walaa yaqtuluuna alnnafsa allatii harrama allaahu illaa bialhaqqi walaa yaznuuna waman yaf'al dzaalika yalqa atsaamaan","translate":{"id":"Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar, dan tidak berzina, barang siapa yang melakukan yang demikian itu, niscaya dia mendapat (pembalasan) dosa(nya),\n","en":"and who never invoke any [imaginary] deity side by side with God, and do not take any human beings life - [the life] which God has willed to be sacred - otherwise than in [the pursuit of] justice, and do not commit adultery. And [know that] he who commits aught thereof shall [not only] meet with a full requital"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2923","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2923.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2923.mp3"]}},{"no":69,"arab":"يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا","latin":"yudaa'af lahu al'adzaabu yawma alqiyaamati wayakhlud fiihi muhaanaan","translate":{"id":"(yakni) akan dilipat gandakan azab untuknya pada hari kiamat dan dia akan kekal dalam azab itu, dalam keadaan terhina,\n","en":"[but] shall have his suffering doubled on Resurrection Day: for on that [Day] he shall abide in ignominy."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2924","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2924.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2924.mp3"]}},{"no":70,"arab":"إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"illaa man taaba waaamana wa'amila 'amalan shaalihan faulaa-ika yubaddilu allaahu sayyi-aatihim hasanaatin wakaana allaahu ghafuuran rahiimaan","translate":{"id":"kecuali orang-orang yang bertaubat, beriman dan mengerjakan amal saleh; maka itu kejahatan mereka diganti Allah dengan kebajikan. Dan adalah Allah maha Pengampun lagi Maha Penyayang.\n","en":"Excepted, however, shall be they who repent and attain to faith and do righteous deeds: for it is they whose [erstwhile] bad deeds God will transform into good ones - seeing that God is indeed much-forgiving, a dispenser of grace,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2925","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2925.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2925.mp3"]}},{"no":71,"arab":"وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا","latin":"waman taaba wa'amila shaalihan fa-innahu yatuubu ilaa allaahi mataabaan","translate":{"id":"Dan orang-orang yang bertaubat dan mengerjakan amal saleh, maka sesungguhnya dia bertaubat kepada Allah dengan taubat yang sebenar-benarnya.\n","en":"and seeing that he who repents and [thenceforth] does what is right has truly turned unto God by [this very act of] repent­ance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2926","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2926.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2926.mp3"]}},{"no":72,"arab":"وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ وَإِذَا مَرُّوا بِاللَّغْوِ مَرُّوا كِرَامًا","latin":"waalladziina laa yasyhaduuna alzzuura wa-idzaa marruu biallaghwi marruu kiraamaan","translate":{"id":"Dan orang-orang yang tidak memberikan persaksian palsu, dan apabila mereka bertemu dengan (orang-orang) yang mengerjakan perbuatan-perbuatan yang tidak berfaedah, mereka lalui (saja) dengan menjaga kehormatan dirinya.\n","en":"And [know that true servants of God are only] those who never bear witness to what is false, and [who], whenever they pass by [people engaged in] frivolity, pass on with dignity;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2927","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2927.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2927.mp3"]}},{"no":73,"arab":"وَالَّذِينَ إِذَا ذُكِّرُوا بِآيَاتِ رَبِّهِمْ لَمْ يَخِرُّوا عَلَيْهَا صُمًّا وَعُمْيَانًا","latin":"waalladziina idzaa dzukkiruu bi-aayaati rabbihim lam yakhirruu 'alayhaa shumman wa'umyaanaan","translate":{"id":"Dan orang-orang yang apabila diberi peringatan dengan ayat-ayat Tuhan mereka, mereka tidaklah menghadapinya sebagai orang-orang yang tuli dan buta.\n","en":"and who, whenever they are reminded of their Sustainer’s messages, do not throw themselves upon them [as if] deaf and blind;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2928","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2928.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2928.mp3"]}},{"no":74,"arab":"وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا","latin":"waalladziina yaquuluuna rabbanaa hab lanaa min azwaajinaa wadzurriyyaatinaa qurrata a'yunin waij'alnaa lilmuttaqiina imaamaan","translate":{"id":"Dan orang orang yang berkata: \"Ya Tuhan kami, anugrahkanlah kepada kami isteri-isteri kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami imam bagi orang-orang yang bertakwa.\n","en":"and who pray “O our Sustainer! Grant that our spouses and our offspring be a joy to our eyes, and cause us to be foremost among those who are conscious of Thee!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2929","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2929.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2929.mp3"]}},{"no":75,"arab":"أُولَٰئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا","latin":"ulaa-ika yujzawna alghurfata bimaa shabaruu wayulaqqawna fiihaa tahiyyatan wasalaamaan","translate":{"id":"Mereka itulah orang yang dibalasi dengan martabat yang tinggi (dalam syurga) karena kesabaran mereka dan mereka disambut dengan penghormatan dan ucapan selamat di dalamnya,\n","en":"[Such as] these will be rewarded for all their patient endurance [in life] with a high station [in paradise], and will be met therein with a greeting of welcome and peace,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2930","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2930.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2930.mp3"]}},{"no":76,"arab":"خَالِدِينَ فِيهَا ۚ حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا","latin":"khaalidiina fiihaa hasunat mustaqarran wamuqaamaan","translate":{"id":"mereka kekal di dalamnya. Syurga itu sebaik-baik tempat menetap dan tempat kediaman.\n","en":"therein to abide: [and] how goodly an abode and [how high] a station!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2931","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2931.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2931.mp3"]}},{"no":77,"arab":"قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ ۖ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا","latin":"qul maa ya'bau bikum rabbii lawlaa du'aaukum faqad kadzdzabtum fasawfa yakuunu lizaamaan","translate":{"id":"Katakanlah (kepada orang-orang musyrik): \"Tuhanku tidak mengindahkan kamu, melainkan kalau ada ibadatmu. (Tetapi bagaimana kamu beribadat kepada-Nya), padahal kamu sungguh telah mendustakan-Nya? karena itu kelak (azab) pasti (menimpamu)\".\n","en":"SAY [unto those who believe]: “No weight or value would my Sustainer attach to you were it not for your faith [in Him]!” And say unto those who deny the truth:] “You have indeed given the lie [to God’s message], and in time this [sin] will cleave unto you!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/2932","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/2932.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/2932.mp3"]}}]}