{"alquran":{"no":27,"name":"An-Naml","arab":"النمل","start":3159,"count":93,"rukku":7,"type":"mecca","description":"Surat An Naml terdiri atas 98 ayat, termasuk golongan surat- surat Makkiyyah dan diturunkan sesudah surat Asy Syu'araa'. Dinamai dengan <i>An Naml</i>, karena pada ayat 18 dan 19 terdapat perkataan <i>An Naml</i> (semut), di mana raja semut mengatakan kepada anak buahnya agar masuk sarangnya masing-masing, supaya jangan terpijak oleh Nabi Sulaiman a.s. dan tentaranya yang akan lalu di tempat itu. Mendengar perintah raja semut kepada anak buahnya itu, Nabi Sulaiman tersenyum dan ta'jub atas keteraturan kerajaan semut itu dan beliau mengucapkan syukur kepada Tuhan Yang Maba Kuasa yang telah melimpahkan nikmat kepadanya, berupa kerajaan, kekayaan, memahami ucapan-ucapan binatang, mempunyai tentara yang terdiri atas jin, manusia, burung dan sebagainya. Nabi Sulaiman a.s. yang telah diberi Allah nikmat yang besar itu tidak merasa takabur dan sombong dan sebagai seorang hamba Allah mohon agar Allah memasukkannya ke dalam golongan orang-orang yang saleh. Allah s.w.t. menyebut binatang semut dalam surat ini agar manusia mengambil pelajaran dari kehidupan semut itu. Semut adalah binatang yang hidup berkelompok di dalam tanah, membuat liang dan ruang yang bertingkat-tingkat sebagai rumah dan gudang tempat menyimpan makanan musim dingin. Kerapian dan kedisiplinan yang terdapat dalam kerajaan semut ini, dinyatakan Allah dalam ayat ini dengan bagaimana rakyat semut mencari perlindungan segera agar jangan terpijak oleh Nabi Sulaiman a.s dan tentaranya, setelah menerima peringatan dari rajanya. Secara tidak langsung Allah mengingatkan juga kepada manusia agar dalam berusaha untuk mencukupkan kebutuhan sehari-hari, mementingkan pula kemaslahatan bersama dan sebagainya, rakyat semut mempunyai organisasi dan kerja sama yang baik pula. Dengan mengisahkan kisah Nabi Sulaiman a.s. dalam surat ini Allah mengisyaratkan hari depan dan kebesaran Nabi Muhammad s.a.w. Nabi Sulaiman a.s. sebagai seorang nabi, rasul dan raja yang dianugerahi kekayaan yang melimpah ruah, begitu pula Nabi Muhammad s.a.w. sebagai seorang nabi, rasul dan seoramg kepala negara yang ummi' dan miskin akan berhasil membawa dan memimpin umatnya ke jalan Allah."},"surah":[{"no":1,"arab":" طس ۚ تِلْكَ آيَاتُ الْقُرْآنِ وَكِتَابٍ مُبِينٍ","latin":"thaa-siin tilka aayaatu alqur-aani wakitaabin mubiinin","translate":{"id":"Thaa Siin (Surat) ini adalah ayat-ayat Al Quraan, dan (ayat-ayat) Kitab yang menjelaskan,\n","en":"Ta. Sin. THESE ARE MESSAGES of the Qur’an - a di­vine writ clear in itself and clearly showing the truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3160","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3160.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3160.mp3"]}},{"no":2,"arab":"هُدًى وَبُشْرَىٰ لِلْمُؤْمِنِينَ","latin":"hudan wabusyraa lilmu/miniina","translate":{"id":"untuk menjadi petunjuk dan berita gembira untuk orang-orang yang beriman,\n","en":"a guidance and a glad tiding to the believers"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3161","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3161.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3161.mp3"]}},{"no":3,"arab":"الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ يُوقِنُونَ","latin":"alladziina yuqiimuuna alshshalaata wayu/tuuna alzzakaata wahum bial-aakhirati hum yuuqinuuna","translate":{"id":"(yaitu) orang-orang yang mendirikan sembahyang dan menunaikan zakat dan mereka yakin akan adanya negeri akhirat.\n","en":"who are constant in prayer and spend in charity: for it is they, they who in their innermost are certain of the life to come!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3162","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3162.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3162.mp3"]}},{"no":4,"arab":"إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ زَيَّنَّا لَهُمْ أَعْمَالَهُمْ فَهُمْ يَعْمَهُونَ","latin":"inna alladziina laa yu/minuuna bial-aakhirati zayyannaa lahum a'maalahum fahum ya'mahuuna","translate":{"id":"Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat, Kami jadikan mereka memandang indah perbuatan-perbuatan mereka, maka mereka bergelimang (dalam kesesatan).\n","en":"As for those who will not believe in the life to come - behold, goodly have We made their own doings appear unto them, and so they stumble blindly to and fro"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3163","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3163.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3163.mp3"]}},{"no":5,"arab":"أُولَٰئِكَ الَّذِينَ لَهُمْ سُوءُ الْعَذَابِ وَهُمْ فِي الْآخِرَةِ هُمُ الْأَخْسَرُونَ","latin":"ulaa-ika alladziina lahum suu-u al'adzaabi wahum fii al-aakhirati humu al-akhsaruuna","translate":{"id":"Mereka itulah orang-orang yang mendapat (di dunia) azab yang buruk dan mereka di akhirat adalah orang-orang yang paling merugi.\n","en":"It is they whom the worst of suffering awaits: for it is they, they who in the life to come shall be the greatest losers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3164","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3164.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3164.mp3"]}},{"no":6,"arab":"وَإِنَّكَ لَتُلَقَّى الْقُرْآنَ مِنْ لَدُنْ حَكِيمٍ عَلِيمٍ","latin":"wa-innaka latulaqqaa alqur-aana min ladun hakiimin 'aliimin","translate":{"id":"Dan sesungguhnya kamu benar-benar diberi Al Quraan dari sisi (Allah) Yang Maha Bijaksana lagi Maha Mengetahui.\n","en":"But [as for thee, O believer,] verily, thou hast received this Qur’an out of the grace of One who is wise, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3165","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3165.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3165.mp3"]}},{"no":7,"arab":"إِذْ قَالَ مُوسَىٰ لِأَهْلِهِ إِنِّي آنَسْتُ نَارًا سَآتِيكُمْ مِنْهَا بِخَبَرٍ أَوْ آتِيكُمْ بِشِهَابٍ قَبَسٍ لَعَلَّكُمْ تَصْطَلُونَ","latin":"idz qaala muusaa li-ahlihi innii aanastu naaran saaatiikum minhaa bikhabarin aw aatiikum bisyihaabin qabasin la'allakum tasthaluuna","translate":{"id":"(Ingatlah) ketika Musa berkata kepada keluarganya: \"Sesungguhnya aku melihat api. Aku kelak akan membawa kepadamu khabar daripadanya, atau aku membawa kepadamu suluh api supaya kamu dapat berdiang\".\n","en":"Lo! [While lost in the desert,] Moses said to his family: “Behold, I perceive a fire [far away]; I may bring you from there some tiding [as to which way we arc to pursue], or bring you [at least] a burning brand so that you might warm yourselves.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3166","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3166.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3166.mp3"]}},{"no":8,"arab":"فَلَمَّا جَاءَهَا نُودِيَ أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا وَسُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ","latin":"falammaa jaa-ahaa nuudiya an buurika man fii alnnaari waman hawlahaa wasubhaana allaahi rabbi al'aalamiina","translate":{"id":"Maka tatkala dia tiba di (tempat) api itu, diserulah dia: \"Bahwa telah diberkati orang-orang yang berada di dekat api itu, dan orang-orang yang berada di sekitarnya. Dan Maha Suci Allah, Tuhan semesta alam\".\n","en":"But when he came close to it, a call was sounded: “Blessed are all who are within [reach of] this fire, and all who are near it! And limitless in His glory is God, the Sustainer of all the worlds!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3167","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3167.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3167.mp3"]}},{"no":9,"arab":"يَا مُوسَىٰ إِنَّهُ أَنَا اللَّهُ الْعَزِيزُ الْحَكِيمُ","latin":"yaa muusaa innahu anaa allaahu al'aziizu alhakiimu","translate":{"id":"(Allah berfirman): \"Hai Musa, sesungguhnya, Akulah Allah, Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"[And God spoke thus:] “O Moses! Verily I alone am God, the Almighty, the Wise!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3168","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3168.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3168.mp3"]}},{"no":10,"arab":"وَأَلْقِ عَصَاكَ ۚ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَا مُوسَىٰ لَا تَخَفْ إِنِّي لَا يَخَافُ لَدَيَّ الْمُرْسَلُونَ","latin":"wa-alqi 'ashaaka falammaa raaahaa tahtazzu ka-annahaa jaannun wallaa mudbiran walam yu'aqqib yaa muusaa laa takhaf innii laa yakhaafu ladayya almursaluuna","translate":{"id":"dan lemparkanlah tongkatmu\". Maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seperti dia seekor ular yang gesit, larilah ia berbalik ke belakang tanpa menoleh. \"Hai Musa, janganlah kamu takut. Sesungguhnya orang yang dijadikan rasul, tidak takut di hadapan-Ku.\n","en":"[And then He said:] “Now throw down thy staff!” But when he saw it move rapidly, as if it were a serpent, he drew back [in terror], and did not [dare to] return. [And God spoke to him again:] O Moses! Fear not - for, behold, no fear need the message-bearers have in My Presence,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3169","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3169.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3169.mp3"]}},{"no":11,"arab":"إِلَّا مَنْ ظَلَمَ ثُمَّ بَدَّلَ حُسْنًا بَعْدَ سُوءٍ فَإِنِّي غَفُورٌ رَحِيمٌ","latin":"illaa man zhalama tsumma baddala husnan ba'da suu-in fa-innii ghafuurun rahiimun","translate":{"id":"tetapi orang yang berlaku zalim, kemudian ditukarnya kezalimannya dengan kebaikan (Allah akan mengampuninya); maka seaungguhnya Aku Maha Pangampun lagi Maha Penyayang.\n","en":"and neither need anyone who has done wrong and then has replaced the wrong with good: for, verily, I am much-forgiving, a dis­penser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3170","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3170.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3170.mp3"]}},{"no":12,"arab":"وَأَدْخِلْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ ۖ فِي تِسْعِ آيَاتٍ إِلَىٰ فِرْعَوْنَ وَقَوْمِهِ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","latin":"wa-adkhil yadaka fii jaybika takhruj baydhaa-a min ghayri suu-in fii tis'i aayaatin ilaa fir'awna waqawmihi innahum kaanuu qawman faasiqiina","translate":{"id":"Dan masukkanlah tanganmu ke leher bajumu , niscaya ia akan ke luar putih (bersinar) bukan karena penyakit. (Kedua mu'jizat ini) termasuk sembilan buah mu'jizat (yang akan dikemukakan) kepada Fir'aun dan kaumnya. Sesungguhnya mereka adalah kaum yang fasik\".\n","en":"“Now place thy hand into thy bosom: it will come forth [shining] white, without blemish!” [And thou shalt go] with nine [of My] messages unto Pharaoh and his people for, verily, they are people depraved!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3171","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3171.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3171.mp3"]}},{"no":13,"arab":"فَلَمَّا جَاءَتْهُمْ آيَاتُنَا مُبْصِرَةً قَالُوا هَٰذَا سِحْرٌ مُبِينٌ","latin":"falammaa jaa-at-hum aayaatunaa mubshiratan qaaluu haadzaa sihrun mubiinun","translate":{"id":"Maka tatkala mu'jizat-mu'jizat Kami yang jelas itu sampai kepada mereka, berkatalah mereka: \"Ini adalah sihir yang nyata\".\n","en":"But when Our light-giving messages came unto them, they said, “This is clearly [but] spellbinding deception!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3172","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3172.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3172.mp3"]}},{"no":14,"arab":"وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا ۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ","latin":"wajahaduu bihaa waistayqanat-haa anfusuhum zhulman wa'uluwwan faunzhur kayfa kaana 'aaqibatu almufsidiina","translate":{"id":"Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya. Maka perhatikanlah betapa kesudahan orang-orang yang berbuat kebinasaan.\n","en":"- and in their wickedness and self-exaltation they rejected them, although their minds were convinced of their truth: and behold what hap­pened in the end to those spreaders of corruption!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3173","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3173.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3173.mp3"]}},{"no":15,"arab":"وَلَقَدْ آتَيْنَا دَاوُودَ وَسُلَيْمَانَ عِلْمًا ۖ وَقَالَا الْحَمْدُ لِلَّهِ الَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٍ مِنْ عِبَادِهِ الْمُؤْمِنِينَ","latin":"walaqad aataynaa daawuuda wasulaymaana 'ilman waqaalaa alhamdu lillaahi alladzii fadhdhalanaa 'alaa katsiirin min 'ibaadihi almu/miniina","translate":{"id":"Dan sesungguhnya Kami telah memberi ilmu kepada Daud dan Sulaiman; dan keduanya mengucapkan: \"Segala puji bagi Allah yang melebihkan kami dari kebanyakan hamba-hambanya yang beriman\".\n","en":"AND, INDEED, We granted [true] knowledge unto David and Solomon [as well]; and both were wont to say: All praise is due to God, who has [thus] favoured us above many of His believing servants!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3174","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3174.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3174.mp3"]}},{"no":16,"arab":"وَوَرِثَ سُلَيْمَانُ دَاوُودَ ۖ وَقَالَ يَا أَيُّهَا النَّاسُ عُلِّمْنَا مَنْطِقَ الطَّيْرِ وَأُوتِينَا مِنْ كُلِّ شَيْءٍ ۖ إِنَّ هَٰذَا لَهُوَ الْفَضْلُ الْمُبِينُ","latin":"wawaritsa sulaymaanu daawuuda waqaala yaa ayyuhaa alnnaasu 'ullimnaa manthiqa alththhayri wauutiinaa min kulli syay-in inna haadzaa lahuwa alfadhlu almubiinu","translate":{"id":"Dan Sulaiman telah mewarisi Daud , dan dia berkata: \"Hai Manusia, kami telah diberi pengertian tentang suara burung dan kami diberi segala sesuatu. Sesungguhnya (semua) ini benar-benar suatu kurnia yang nyata\".\n","en":"And [in this insight] Solomon was [truly] David’s heir; and he would say: “O you people! We have been taught the speech of birds, and have been given [in abundance] of all [good] things: this, behold, is indeed a manifest favour [from God]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3175","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3175.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3175.mp3"]}},{"no":17,"arab":"وَحُشِرَ لِسُلَيْمَانَ جُنُودُهُ مِنَ الْجِنِّ وَالْإِنْسِ وَالطَّيْرِ فَهُمْ يُوزَعُونَ","latin":"wahusyira lisulaymaana junuuduhu mina aljinni waal-insi waalththhayri fahum yuuza'uuna","translate":{"id":"Dan dihimpunkan untuk Sulaiman tentaranya dari jin, manusia dan burung lalu mereka itu diatur dengan tertib (dalam barisan).\n","en":"And [one day] there were assembled before Solomon his hosts of invisible beings, and of men, and of birds; and then they were led forth in orderly ranks,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3176","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3176.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3176.mp3"]}},{"no":18,"arab":"حَتَّىٰ إِذَا أَتَوْا عَلَىٰ وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ","latin":"hattaa idzaa ataw 'alaa waadi alnnamli qaalat namlatun yaa ayyuhaa alnnamlu udkhuluu masaakinakum laa yahthimannakum sulaymaanu wajunuuduhu wahum laa yasy'uruuna","translate":{"id":"Hingga apabila mereka sampai di lembah semut berkatalah seekor semut: Hai semut-semut, masuklah ke dalam sarang-sarangmu, agar kamu tidak diinjak oleh Sulaiman dan tentaranya, sedangkan mereka tidak menyadari\";\n","en":"till, when they came upon a valley [full] of ants, an ant exclaimed: “O you ants! Get into your dwellings, lest Solomon and his hosts crush you without [even] being aware [of you]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3177","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3177.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3177.mp3"]}},{"no":19,"arab":"فَتَبَسَّمَ ضَاحِكًا مِنْ قَوْلِهَا وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ","latin":"fatabassama dahikan min qawlihaa waqaala rabbi awzi'nii an asykura ni'mataka allatii an'amta 'alayya wa'alaa waalidayya wa-an a'mala shaalihan tardaahu wa-adkhilnii birahmatika fii 'ibaadika alshshaalihiina","translate":{"id":"maka dia tersenyum dengan tertawa karena (mendengar) perkataan semut itu. Dan dia berdo'a: \"Ya Tuhanku berilah aku ilham untuk tetap mensyukuri ni'mat Mu yang telah Engkau anugerahkan kepadaku dan kepada dua orang ibu bapakku dan untuk mengerjakan amal saleh yang Engkau ridhai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh\".\n","en":"Thereupon [Solomon] smiled joyously at her words, and said: “O my Sustainer! Inspire me so that I may forever be grateful for those blessings of Thine with which Thou hast graced me and my parents, and that I may do what is right [in a manner] that will please Thee; and include me, by Thy grace, among Thy righteous servants!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3178","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3178.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3178.mp3"]}},{"no":20,"arab":"وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ","latin":"watafaqqada alththhayra faqaala maa liya laa araa alhudhuda am kaana mina alghaa-ibiina","translate":{"id":"Dan dia memeriksa burung-burung lalu berkata: \"Mengapa aku tidak melihat hud-hud , apakah dia termasuk yang tidak hadir.\n","en":"And [one day] he looked in vain for [a parti­cular one of] the birds; and so he said: How is it that I do not see the hoopoe? Or could he be among the absent?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3179","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3179.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3179.mp3"]}},{"no":21,"arab":"لَأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُبِينٍ","latin":"lau'adzdzibannahu 'adzaaban syadiidan aw la-adzbahannahu aw laya/tiyannii bisulthaanin mubiinin","translate":{"id":"Sungguh aku benar-benar akan mengazabnya dengan azab yang keras atau benar-benar menyembelihnya kecuali jika benar-benar dia datang kepadaku dengan alasan yang terang\".\n","en":"[If so,] I will punish him most severely or will kill him unless he bring me a convincing excuse!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3180","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3180.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3180.mp3"]}},{"no":22,"arab":"فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِنْ سَبَإٍ بِنَبَإٍ يَقِينٍ","latin":"famakatsa ghayra ba'iidin faqaala ahathtu bimaa lam tuhith bihi waji/tuka min saba-in binaba-in yaqiinin","translate":{"id":"Maka tidak lama kemudian (datanglah hud-hud), lalu ia berkata: \"Aku telah mengetahui sesuatu yang kamu belum mengetahuinya; dan kubawa kepadamu dari negeri Saba suatu berita penting yang diyakini.\n","en":"But [the hoopoe] tarried but a short while; and [when it came] it said: “I have encompassed [with my knowledge] something that thou hast never yet encompassed [with thine] - for I have come to thee from Sheba with a tiding sure!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3181","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3181.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3181.mp3"]}},{"no":23,"arab":"إِنِّي وَجَدْتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِنْ كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ","latin":"innii wajadtu imra-atan tamlikuhum wauutiyat min kulli syay-in walahaa 'arsyun 'azhiimun","translate":{"id":"Sesungguhnya aku menjumpai seorang wanita yang memerintah mereka, dan dia dianugerahi segala sesuatu serta mempunyai singgasana yang besar.\n","en":"“Behold, I found there a woman ruling over them; and she has been given [abundance] of all [good] things, and hers is a mighty throne,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3182","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3182.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3182.mp3"]}},{"no":24,"arab":"وَجَدْتُهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِنْ دُونِ اللَّهِ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ فَهُمْ لَا يَهْتَدُونَ","latin":"wajadtuhaa waqawmahaa yasjuduuna lilsysyamsi min duuni allaahi wazayyana lahumu alsysyaythaanu a'maalahum fashaddahum 'ani alssabiili fahum laa yahtaduuna","translate":{"id":"Aku mendapati dia dan kaumnya menyembah matahari, selain Allah; dan syaitan telah menjadikan mereka memandang indah perbuatan-perbuatan mereka lalu menghalangi mereka dari jalan (Allah), sehingga mereka tidak dapat petunjuk,\n","en":"And I found her and her people adoring the sun instead of God; and Satan has made these doings of theirs seem goodly to them, and [thus] has barred them from the path [of God], so that they cannot find the right way:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3183","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3183.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3183.mp3"]}},{"no":25,"arab":"أَلَّا يَسْجُدُوا لِلَّهِ الَّذِي يُخْرِجُ الْخَبْءَ فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ","latin":"allaa yasjuduu lillaahi alladzii yukhriju alkhaba-a fii alssamaawaati waal-ardhi waya'lamu maa tukhfuuna wamaa tu'linuuna","translate":{"id":"agar mereka tidak menyembah Allah Yang mengeluarkan apa yang terpendam di langit dan di bumi dan Yang mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan.\n","en":"[for they have come to believe] that they ought not to adore God [although it is He] who brings forth all that is hidden in the heavens and on earth, and knows all that you would conceal as well as all that you bring into the open:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3184","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3184.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3184.mp3"]}},{"no":26,"arab":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ ۩","latin":"allaahu laa ilaaha illaa huwa rabbu al'arsyi al'azhiimi","translate":{"id":"Allah, tiada Tuhan Yang disembah kecuali Dia, Tuhan Yang mempunyai 'Arsy yang besar\".\n","en":"God, save whom there is no deity - the Sustainer, in awesome almightiness enthroned!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3185","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3185.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3185.mp3"]}},{"no":27,"arab":"قَالَ سَنَنْظُرُ أَصَدَقْتَ أَمْ كُنْتَ مِنَ الْكَاذِبِينَ","latin":"qaala sananzhuru ashadaqta am kunta mina alkaadzibiina","translate":{"id":"Berkata Sulaiman: \"Akan kami lihat, apa kamu benar, ataukah kamu termasuk orang-orang yang berdusta.\n","en":"Said [Solomon]: “We shall see whether thou hast told the truth or art one of the liars!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3186","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3186.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3186.mp3"]}},{"no":28,"arab":"اذْهَبْ بِكِتَابِي هَٰذَا فَأَلْقِهْ إِلَيْهِمْ ثُمَّ تَوَلَّ عَنْهُمْ فَانْظُرْ مَاذَا يَرْجِعُونَ","latin":"idzhab bikitaabii haadzaa fa-alqih ilayhim tsumma tawalla 'anhum faunzhur maatsaa yarji'uuna","translate":{"id":"Pergilah dengan (membawa) suratku ini, lalu jatuhkan kepada mereka, kemudian berpalinglah dari mereka, lalu perhatikanlah apa yang mereka bicarakan\"\n","en":"Go with this my letter and convey it to them; and thereafter withdraw from them and see what [answer] they return.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3187","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3187.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3187.mp3"]}},{"no":29,"arab":"قَالَتْ يَا أَيُّهَا الْمَلَأُ إِنِّي أُلْقِيَ إِلَيَّ كِتَابٌ كَرِيمٌ","latin":"qaalat yaa ayyuhaa almalau innii ulqiya ilayya kitaabun kariimun","translate":{"id":"Berkata ia (Balqis): \"Hai pembesar-pembesar, sesungguhnya telah dijatuhkan kepadaku sebuah surat yang mulia.\n","en":"[When the Queen had read Solomon’s letter,] she said: “O you nobles! A truly distinguished letter has been conveyed unto me."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3188","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3188.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3188.mp3"]}},{"no":30,"arab":"إِنَّهُ مِنْ سُلَيْمَانَ وَإِنَّهُ ","latin":"innahu min sulaymaana wa-innahu bismi allaahi alrrahmaani alrrahiimi","translate":{"id":"Sesungguhnya surat itu, dari SuIaiman dan sesungguhnya (isi)nya: \"Dengan menyebut nama Allah Yang Maha Pemurah lagi Maha Penyayang.\n","en":"Behold, it is from Solomon, and it says, ‘In the name of God, the Most Gracious, the Dispenser of Grace:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3189","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3189.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3189.mp3"]}},{"no":31,"arab":"أَلَّا تَعْلُوا عَلَيَّ وَأْتُونِي مُسْلِمِينَ","latin":"allaa ta'luu 'alayya wa/tuunii muslimiina","translate":{"id":"Bahwa janganlah kamu sekalian berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri\".\n","en":"[God says:] Exalt not yourselves against Me, but come unto Me in willing surrender!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3190","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3190.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3190.mp3"]}},{"no":32,"arab":"قَالَتْ يَا أَيُّهَا الْمَلَأُ أَفْتُونِي فِي أَمْرِي مَا كُنْتُ قَاطِعَةً أَمْرًا حَتَّىٰ تَشْهَدُونِ","latin":"qaalat yaa ayyuhaa almalau aftuunii fii amrii maa kuntu qaathi'atan amran hattaa tasyhaduuna","translate":{"id":"Berkata dia (Balqis): \"Hai para pembesar berilah aku pertimbangan dalam urusanku (ini) aku tidak pernah memutuskan sesuatu persoalan sebelum kamu berada dalam majelis(ku)\".\n","en":"She added: “O you nobles! Give me your opinion on the problem with which I am now faced; I would never make a [weighty] decision unless you are present with me.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3191","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3191.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3191.mp3"]}},{"no":33,"arab":"قَالُوا نَحْنُ أُولُو قُوَّةٍ وَأُولُو بَأْسٍ شَدِيدٍ وَالْأَمْرُ إِلَيْكِ فَانْظُرِي مَاذَا تَأْمُرِينَ","latin":"qaaluu nahnu uluu quwwatin wauluu ba/sin syadiidin waal-amru ilayki faunzhurii maatsaa ta/muriina","translate":{"id":"Mereka menjawab: \"Kita adalah orang-orang yang memiliki kekuatan dan (juga) memiliki keberanian yang sangat (dalam peperangan), dan keputusan berada ditanganmu: maka pertimbangkanlah apa yang akan kamu perintahkan\".\n","en":"They answered: “We are endowed with power and with mighty prowess in war - but the command is thine; consider, then, what thou wouldst command.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3192","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3192.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3192.mp3"]}},{"no":34,"arab":"قَالَتْ إِنَّ الْمُلُوكَ إِذَا دَخَلُوا قَرْيَةً أَفْسَدُوهَا وَجَعَلُوا أَعِزَّةَ أَهْلِهَا أَذِلَّةً ۖ وَكَذَٰلِكَ يَفْعَلُونَ","latin":"qaalat inna almuluuka idzaa dakhaluu qaryatan afsaduuhaa waja'aluu a'izzata ahlihaa adzillatan wakadzaalika yaf'aluuna","translate":{"id":"Dia berkata: \"Sesungguhnya raja-raja apabila memasuki suatu negeri, niscaya mereka membinasakannya, dan menjadikan penduduknya yang mulia jadi hina; dan demikian pulalah yang akan mereka perbuat.\n","en":"Said she: “Verily, whenever kings enter a country they corrupt it, and turn the noblest of its people into the most abject. And this is the way they [always] behave?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3193","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3193.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3193.mp3"]}},{"no":35,"arab":"وَإِنِّي مُرْسِلَةٌ إِلَيْهِمْ بِهَدِيَّةٍ فَنَاظِرَةٌ بِمَ يَرْجِعُ الْمُرْسَلُونَ","latin":"wa-innii mursilatun ilayhim bihadiyyatin fanaatsiratun bima yarji'u almursaluuna","translate":{"id":"Dan sesungguhnya aku akan mengirim utusan kepada mereka dengan (membawa) hadiah, dan (aku akan) menunggu apa yang akan dibawa kembali oleh utusan-utusan itu\".\n","en":"Hence, behold, I am going to send a gift to those [people], and await whatever [answer] the envoys bring back.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3194","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3194.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3194.mp3"]}},{"no":36,"arab":"فَلَمَّا جَاءَ سُلَيْمَانَ قَالَ أَتُمِدُّونَنِ بِمَالٍ فَمَا آتَانِيَ اللَّهُ خَيْرٌ مِمَّا آتَاكُمْ بَلْ أَنْتُمْ بِهَدِيَّتِكُمْ تَفْرَحُونَ","latin":"falammaa jaa-a sulaymaana qaala atumidduunani bimaalin famaa aataaniya allaahu khayrun mimmaa aataakum bal antum bihadiyyatikum tafrahuuna","translate":{"id":"Maka tatkala utusan itu sampai kepada Sulaiman, Sulaiman berkata: \"Apakah (patut) kamu menolong aku dengan harta? maka apa yang diberikan Allah kepadaku lebih baik daripada apa yang diberikan-Nya kepadamu; tetapi kamu merasa bangga dengan hadiahmu.\n","en":"Now when [the Queen’s messenger] came unto Solomon, he said: “Do you people mean to add to my wealth? But that which God has given me is [so much] better than all that He has given you! Nay, it is [only such as] you that would rejoice in this gift of yours!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3195","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3195.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3195.mp3"]}},{"no":37,"arab":"ارْجِعْ إِلَيْهِمْ فَلَنَأْتِيَنَّهُمْ بِجُنُودٍ لَا قِبَلَ لَهُمْ بِهَا وَلَنُخْرِجَنَّهُمْ مِنْهَا أَذِلَّةً وَهُمْ صَاغِرُونَ","latin":"falammaa jaa-a sulaymaana qaala atumidduunani bimaalin famaa aataaniya allaahu khayrun mimmaa aataakum bal antum bihadiyyatikum tafrahuuna","translate":{"id":"Kembalilah kepada mereka sungguh kami akan mendatangi mereka dengan balatentara yang mereka tidak kuasa melawannya, dan pasti kami akan mengusir mereka dari negeri itu (Saba) dengan terhina dan mereka menjadi (tawanan-tawanan) yang hina dina\".\n","en":"“Go thou back unto them [that have sent thee]! For, [God says:] ‘We shall most certainly come upon them with forces which they will never be able to withstand, and shall most certainly cause them to be driven from that [land of theirs], despicable and humbled!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3196","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3196.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3196.mp3"]}},{"no":38,"arab":"قَالَ يَا أَيُّهَا الْمَلَأُ أَيُّكُمْ يَأْتِينِي بِعَرْشِهَا قَبْلَ أَنْ يَأْتُونِي مُسْلِمِينَ","latin":"qaala yaa ayyuhaa almalau ayyukum ya/tiinii bi'arsyihaa qabla an ya/tuunii muslimiina","translate":{"id":"Berkata Sulaiman: \"Hai pembesar-pembesar, siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri\".\n","en":"[When Solomon learned that the Queen of Sheba was coming,] he said [to his council]: “O you nobles! Which of you can bring me her throne ere she and her followers come unto me in willing surrender to God?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3197","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3197.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3197.mp3"]}},{"no":39,"arab":"قَالَ عِفْرِيتٌ مِنَ الْجِنِّ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ تَقُومَ مِنْ مَقَامِكَ ۖ وَإِنِّي عَلَيْهِ لَقَوِيٌّ أَمِينٌ","latin":"qaala 'ifriitun mina aljinni anaa aatiika bihi qabla an taquuma min maqaamika wa-inne 'alayhi laqawiyyun amiinun","translate":{"id":"Berkata 'Ifrit (yang cerdik) dari golongan jin: \"Aku akan datang kepadamu dengan membawa singgsana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat untuk membawanya lagi dapat dipercaya\".\n","en":"Said a bold one of the invisible beings [subject to Solomon]: “I shall bring it to thee ere thou rise from thy council-seat - for, behold, I am powerful enough to do it, [and] worthy of trust!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3198","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3198.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3198.mp3"]}},{"no":40,"arab":"قَالَ الَّذِي عِنْدَهُ عِلْمٌ مِنَ الْكِتَابِ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ ۚ فَلَمَّا رَآهُ مُسْتَقِرًّا عِنْدَهُ قَالَ هَٰذَا مِنْ فَضْلِ رَبِّي لِيَبْلُوَنِي أَأَشْكُرُ أَمْ أَكْفُرُ ۖ وَمَنْ شَكَرَ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ ۖ وَمَنْ كَفَرَ فَإِنَّ رَبِّي غَنِيٌّ كَرِيمٌ","latin":"qaala alladzii 'indahu 'ilmun mina alkitaabi anaa aatiika bihi qabla an yartadda ilayka tharfuka falammaa raaahu mustaqirran 'indahu qaala haadzaa min fadhli rabbii liyabluwanii a-asykuru am akfuru waman syakara fa-innamaa yasykuru linafsihi waman kafara fa-inna rabbii ghaniyyun kariimun","translate":{"id":"Berkatalah seorang yang mempunyai ilmu dari AI Kitab : \"Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip\". Maka tatkala Sulaiman melihat singgasana itu terletak di hadapannya, iapun berkata: \"Ini termasuk kurnia Tuhanku untuk mencoba aku apakah aku bersyukur atau mengingkari (akan ni'mat-Nya). Dan barangsiapa yang bersyukur maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri dan barangsiapa yang ingkar, maka sesungguhnya Tuhanku Maha Kaya lagi Maha Mulia\".\n","en":"Answered he who was illumined by revela­tion: “[Nay,] as for me - I shall bring it to thee ere the twinkling of thy eye ceases!” And when he saw it truly before him, he exclaimed: “This is [an outcome] of my Sustainer’s bounty, to test me as to whether I am grateful or ungrateful! However, he who is grateful [to God] is but grateful for his own good; and he who is ungrate­ful [should know that], verily, my Sustainer is self-sufficient, most generous in giving!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3199","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3199.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3199.mp3"]}},{"no":41,"arab":"قَالَ نَكِّرُوا لَهَا عَرْشَهَا نَنْظُرْ أَتَهْتَدِي أَمْ تَكُونُ مِنَ الَّذِينَ لَا يَهْتَدُونَ","latin":"qaala nakkiruu lahaa 'arsyahaa nanzhur atahtadii am takuunu mina alladziina laa yahtaduuna","translate":{"id":"Dia berkata: \"Robahlah baginya singgasananya; maka kita akan melihat apakah dia mengenal ataukah dia termasuk orang-orang yang tidak mengenal(nya)\".\n","en":"[And] he continued: Alter her throne so that she may not know it as hers: let us see whether she allows herself to be guided [to the truth] or remains one of those who will not be guided.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3200","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3200.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3200.mp3"]}},{"no":42,"arab":"فَلَمَّا جَاءَتْ قِيلَ أَهَٰكَذَا عَرْشُكِ ۖ قَالَتْ كَأَنَّهُ هُوَ ۚ وَأُوتِينَا الْعِلْمَ مِنْ قَبْلِهَا وَكُنَّا مُسْلِمِينَ","latin":"falammaa jaa-at qiila ahaakadzaa 'arsyuki qaalat ka-annahu huwa wauutiinaa al'ilma min qablihaa wakunnaa muslimiina","translate":{"id":"Dan ketika Balqis datang, ditanyakanlah kepadanya: \"Serupa inikah singgasanamu?\" Dia menjawab: \"Seakan-akan singgasana ini singgasanaku, kami telah diberi pengetahuan sebelumnya dan kami adalah orang-orang yang berserah diri\".\n","en":"And so, as soon as she arrived, she was asked: “Is thy throne like this?” She answered: “It is as though it were the same!” [And Solomon said to his nobles: “She has arrived at the truth without any help from us,] although it is we who have been given [divine] knowledge before her, and have [long ago] surrendered ourselves unto God!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3201","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3201.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3201.mp3"]}},{"no":43,"arab":"وَصَدَّهَا مَا كَانَتْ تَعْبُدُ مِنْ دُونِ اللَّهِ ۖ إِنَّهَا كَانَتْ مِنْ قَوْمٍ كَافِرِينَ","latin":"washaddahaa maa kaanat ta'budu min duuni allaahi innahaa kaanat min qawmin kaafiriina","translate":{"id":"Dan apa yang disembahnya selama ini selain Allah, mencegahnya (untuk melahirkan keislamannya), karena sesungguhnya dia dahulunya termasuk orang-orang yang kafir.\n","en":"[And she has recognized the truth] although that which she has been wont to worship instead of God had kept her away [from the right path]: for, behold, she is descended of people who deny the truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3202","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3202.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3202.mp3"]}},{"no":44,"arab":"قِيلَ لَهَا ادْخُلِي الصَّرْحَ ۖ فَلَمَّا رَأَتْهُ حَسِبَتْهُ لُجَّةً وَكَشَفَتْ عَنْ سَاقَيْهَا ۚ قَالَ إِنَّهُ صَرْحٌ مُمَرَّدٌ مِنْ قَوَارِيرَ ۗ قَالَتْ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي وَأَسْلَمْتُ مَعَ سُلَيْمَانَ لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"qiila lahaa udkhulii alshsharha falammaa ra-at-hu hasibat-hu lujjatan wakasyafat 'an saaqayhaa qaala innahu sharhun mumarradun min qawaariira qaalat rabbi innii zhalamtu nafsii wa-aslamtu ma'a sulaymaana lillaahi rabbi al'aalamiina","translate":{"id":"Dikatakan kepadanya: \"Masuklah ke dalam istana\". Maka tatkala dia melihat lantai istana itu, dikiranya kolam air yang besar, dan disingkapkannya kedua betisnya. Berkatalah Sulaiman: \"Sesungguhnya ia adalah istana licin terbuat dari kaca\". Berkatalah Balqis: \"Ya Tuhanku, sesungguhnya aku telah berbuat zalim terhadap diriku dan aku berserah diri bersama Sulaiman kepada Allah, Tuhan semesta alam\".\n","en":"[After a while] she was told: “Enter this court!” - but when she saw it, she thought that it was a fathomless expanse of water, and she bared her legs. Said he: “Behold, it is [but] a court smoothly paved with glass!” Cried she: “O my Sustainer! I have been sinning against myself thy worshipping aught but Thee]: but [now] I have surrendered myself, with Solomon, unto the Sustainer of all the worlds!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3203","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3203.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3203.mp3"]}},{"no":45,"arab":"وَلَقَدْ أَرْسَلْنَا إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا أَنِ اعْبُدُوا اللَّهَ فَإِذَا هُمْ فَرِيقَانِ يَخْتَصِمُونَ","latin":"walaqad arsalnaa ilaa tsamuuda akhaahum shaalihan ani u'buduu allaaha fa-idzaa hum fariiqaani yakhtashimuuna","translate":{"id":"Dan sesungguhnya Kami telah mengutus kepada (kaum) Tsamud saudara mereka Shaleh (yang berseru): \"Sembahlah Allah\". Tetapi tiba-tiba mereka (jadi) dua golongan yang bermusuhan.\n","en":"AND [likewise], indeed, We sent unto [the tribe of] Thamud their brother Salih [with this message]: “Worship God alone!” and, behold, they were [split into] two factions contending with one another."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3204","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3204.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3204.mp3"]}},{"no":46,"arab":"قَالَ يَا قَوْمِ لِمَ تَسْتَعْجِلُونَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ ۖ لَوْلَا تَسْتَغْفِرُونَ اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ","latin":"qaala yaa qawmi lima tasta'jiluuna bialssayyi-ati qabla alhasanati lawlaa tastaghfiruuna allaaha la'allakum turhamuuna","translate":{"id":"Dia berkata: \"Hai kaumku mengapa kamu minta disegerakan keburukan sebelum (kamu minta) kebaikan? Hendaklah kamu meminta ampun kepada Allah, agar kamu mendapat rahmat\".\n","en":"Said [Salih to the erring ones]: Why do you seek to hasten the coming upon you of evil instead of hoping for the good?” Why do you not, rather, ask God to forgive you your sins, so that you might be graced with His mercy?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3205","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3205.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3205.mp3"]}},{"no":47,"arab":"قَالُوا اطَّيَّرْنَا بِكَ وَبِمَنْ مَعَكَ ۚ قَالَ طَائِرُكُمْ عِنْدَ اللَّهِ ۖ بَلْ أَنْتُمْ قَوْمٌ تُفْتَنُونَ","latin":"qaaluu iththhayyarnaa bika wabiman ma'aka qaala thaa-irukum 'inda allaahi bal antum qawmun tuftanuuna","translate":{"id":"Mereka menjawab: \"Kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang besertamu\". Shaleh berkata: \"Nasibmu ada pada sisi Allah, (bukan kami yang menjadi sebab), tetapi kamu kaum yang diuji\".\n","en":"They answered: “We augur evil from thee and those that follow thee!” Said he: “Your destiny, good or evil, rests with God yea, you are people undergoing a test!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3206","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3206.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3206.mp3"]}},{"no":48,"arab":"وَكَانَ فِي الْمَدِينَةِ تِسْعَةُ رَهْطٍ يُفْسِدُونَ فِي الْأَرْضِ وَلَا يُصْلِحُونَ","latin":"wakaana fii almadiinati tis'atu rahthin yufsiduuna fii al-ardhi walaa yushlihuuna","translate":{"id":"Dan adalah di kota itu sembilan orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan.\n","en":"Now there were in the city nine men who were wont to commit deeds of depravity all over the land, and would not reform;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3207","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3207.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3207.mp3"]}},{"no":49,"arab":"قَالُوا تَقَاسَمُوا بِاللَّهِ لَنُبَيِّتَنَّهُ وَأَهْلَهُ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِ مَا شَهِدْنَا مَهْلِكَ أَهْلِهِ وَإِنَّا لَصَادِقُونَ","latin":"qaaluu taqaasamuu biallaahi lanubayyitannahu wa-ahlahu tsumma lanaquulanna liwaliyyihi maa syahidnaa mahlika ahlihi wa-innaa lashaadiquuna","translate":{"id":"Mereka berkata: \"Bersumpahlah kamu dengan nama Allah, bahwa kita sungguh-sungguh akan menyerangnya dengan tiba-tiba beserta keluarganya di malam hari, kemudian kita katakan kepada warisnya (bahwa) kita tidak menyaksikan kematian keluarganya itu, dan sesungguhnya kita adalah orang-orang yang benar\".\n","en":"[and] after having bound one another by an oath in God’s name, they said: “Indeed, we shall suddenly fall upon him and his household by night [and slay them all]; and then we shall boldly say to his next of kin, ‘We did not witness the destruction of his household - and, behold, we are indeed men of truth!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3208","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3208.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3208.mp3"]}},{"no":50,"arab":"وَمَكَرُوا مَكْرًا وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ","latin":"wamakaruu makran wamakarnaa makran wahum laa yasy'uruuna","translate":{"id":"Dan merekapun merencanakan makar dengan sungguh-sungguh dan Kami merencanakan makar (pula), sedang mereka tidak menyadari.\n","en":"And so they devised an evil scheme; but We devised a subtle scheme (of Our own), and they perceived it not."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3209","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3209.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3209.mp3"]}},{"no":51,"arab":"فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ مَكْرِهِمْ أَنَّا دَمَّرْنَاهُمْ وَقَوْمَهُمْ أَجْمَعِينَ","latin":"faunzhur kayfa kaana 'aaqibatu makrihim annaa dammarnaahum waqawmahum ajma'iina","translate":{"id":"Maka perhatikanlah betapa sesungguhnya akibat makar mereka itu, bahwasanya Kami membinasakan mereka dan kaum mereka semuanya.\n","en":"Behold, then, what all their scheming came to in the end: We utterly destroyed them and their people, all of them;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3210","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3210.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3210.mp3"]}},{"no":52,"arab":"فَتِلْكَ بُيُوتُهُمْ خَاوِيَةً بِمَا ظَلَمُوا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَعْلَمُونَ","latin":"fatilka buyuutuhum khaawiyatan bimaa zhalamuu inna fii dzaalika laaayatan liqawmin ya'lamuuna","translate":{"id":"Maka itulah rumah-rumah mereka dalam keadaan runtuh disebabkan kezaliman mereka. Sesungguhnya pada yang demikian itu (terdapat) pelajaran bagi kaum yang mengetahui.\n","en":"and [now] those dwellings of theirs are empty, [ruined] as an outcome of their evil deeds. In this, behold, there is a message indeed for peo­ple of [innate] knowledge –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3211","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3211.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3211.mp3"]}},{"no":53,"arab":"وَأَنْجَيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","latin":"wa-anjaynaa alladziina aamanuu wakaanuu yattaquuna","translate":{"id":"Dan telah Kami selamatkan orang-orang yang beriman dan mereka itu selalu bertakwa.\n","en":"seeing that We saved those who had attained to faith and were conscious of Us,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3212","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3212.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3212.mp3"]}},{"no":54,"arab":"وَلُوطًا إِذْ قَالَ لِقَوْمِهِ أَتَأْتُونَ الْفَاحِشَةَ وَأَنْتُمْ تُبْصِرُونَ","latin":"waluuthan idz qaala liqawmihi ata/tuuna alfaahisyata wa-antum tubshiruuna","translate":{"id":"Dan (ingatlah kisah) Luth, ketika dia berkata kepada kaumnya: \"Mengapa kamu mengerjakan perbuatan fahisyah itu sedang kamu memperlihatkan(nya)?\"\n","en":"AND [thus, too, did We save] Lot, when he said unto his people: “Would you commit this abomination with your eyes open (to its being against all nature)?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3213","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3213.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3213.mp3"]}},{"no":55,"arab":"أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً مِنْ دُونِ النِّسَاءِ ۚ بَلْ أَنْتُمْ قَوْمٌ تَجْهَلُونَ","latin":"a-innakum lata/tuuna alrrijaala syahwatan min duuni alnnisaa-i bal antum qawmun tajhaluuna","translate":{"id":"\"Mengapa kamu mendatangi laki-laki untuk (memenuhi) nafsu (mu), bukan (mendatangi) wanita? Sebenarnya kamu adalah kaum yang tidak mengetahui (akibat perbuatanmu)\".\n","en":"Must you really approach men with lust instead of women? Nay, but you are people without any awareness (of right and wrong)!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3214","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3214.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3214.mp3"]}},{"no":56,"arab":"فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا أَخْرِجُوا آلَ لُوطٍ مِنْ قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ","latin":"famaa kaana jawaaba qawmihi illaa an qaaluu akhrijuu aala luuthin min qaryatikum innahum unaasun yatathahharuuna","translate":{"id":"Maka tidak lain jawaban kaumnya melainkan mengatakan: \"Usirlah Luth beserta keluarganya dari negerimu; karena sesungguhnya mereka itu orang-orang yang (menda'wakan dirinya) bersih \".\n","en":"But his people’s only answer was this: “Expel [Lot and] Lot’s followers from your township! Verily, they are folk who make themselves out to be pure!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3215","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3215.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3215.mp3"]}},{"no":57,"arab":"فَأَنْجَيْنَاهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ قَدَّرْنَاهَا مِنَ الْغَابِرِينَ","latin":"fa-anjaynaahu wa-ahlahu illaa imra-atahu qaddarnaahaa mina alghaabiriina","translate":{"id":"Maka Kami selamatkan dia beserta keluarganya, kecuali isterinya. Kami telah mentakdirkan dia termasuk orang-orang yang tertinggal (dibinasakan).\n","en":"Thereupon We saved him and his household - all but his wife, whom We willed to be among those that stayed behind -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3216","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3216.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3216.mp3"]}},{"no":58,"arab":"وَأَمْطَرْنَا عَلَيْهِمْ مَطَرًا ۖ فَسَاءَ مَطَرُ الْمُنْذَرِينَ","latin":"wa-amtharnaa 'alayhim matharan fasaa-a matharu almundzariina","translate":{"id":"Dan Kami turunkan hujan atas mereka (hujan batu), maka amat buruklah hujan yang ditimpakan atas orang-orang yang diberi peringatan itu.\n","en":"the while We rained a rain [of destruction] upon the others: and dire is such rain upon all who let themselves be warned [to no avail]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3217","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3217.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3217.mp3"]}},{"no":59,"arab":"قُلِ الْحَمْدُ لِلَّهِ وَسَلَامٌ عَلَىٰ عِبَادِهِ الَّذِينَ اصْطَفَىٰ ۗ آللَّهُ خَيْرٌ أَمَّا يُشْرِكُونَ","latin":"quli alhamdu lillaahi wasalaamun 'alaa 'ibaadihi alladziina isthafaa aallaahu khayrun ammaa yusyrikuuna","translate":{"id":"Katakanlah: \"Segala puji bagi Allah dan kesejahteraan atas hamba-hamba-Nya yang dipilih-Nya. Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan Dia?\"\n","en":"SAY: “All praise is due to God, and peace be upon those servants of His whom He chose [to be His message-bearers]!” Is not God far better than anything to which men [falsely] ascribe a share in His divinity?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3218","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3218.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3218.mp3"]}},{"no":60,"arab":"أَمَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنْزَلَ لَكُمْ مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا بِهِ حَدَائِقَ ذَاتَ بَهْجَةٍ مَا كَانَ لَكُمْ أَنْ تُنْبِتُوا شَجَرَهَا ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ بَلْ هُمْ قَوْمٌ يَعْدِلُونَ","latin":"amman khalaqa alssamaawaati waal-ardha wa-anzala lakum mina alssamaa-i maa-an fa-anbatnaa bihi hadaa-iqa dzaata bahjatin maa kaana lakum an tunbituu syajarahaa a-ilaahun ma'a allaahi bal hum qawmun ya'diluuna","translate":{"id":"Atau siapakah yang telah menciptakan langit dan bumi dan yang menurunkan air untukmu dari langit, lalu Kami tumbuhkan dengan air itu kebun-kebun yang berpemandangan indah, yang kamu sekali-kali tidak mampu menumbuhkan pohon-pohonnya? Apakah disamping Allah ada tuhan (yang lain)? Bahkan (sebenarnya) mereka adalah orang-orang yang menyimpang (dari kebenaran).\n","en":"Nay - who is it that has created the heavens and the earth, and sends down for you [life-giving] water from the skies? For it is by this means that We cause gardens of shining beauty to grow - [whereas] it is not in your power to cause [even one single of] its trees to grow! Could there be any divine power besides God? Nay, they [who think so] are people who swerve [from the path of reason]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3219","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3219.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3219.mp3"]}},{"no":61,"arab":"أَمَّنْ جَعَلَ الْأَرْضَ قَرَارًا وَجَعَلَ خِلَالَهَا أَنْهَارًا وَجَعَلَ لَهَا رَوَاسِيَ وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","latin":"amman ja'ala al-ardha qaraaran waja'ala khilaalahaa anhaaran waja'ala lahaa rawaasiya waja'ala bayna albahrayni haajizan a-ilaahun ma'a allaahi bal aktsaruhum laa ya'lamuuna","translate":{"id":"Atau siapakah yang telah menjadikan bumi sebagai tempat berdiam, dan yang menjadikan sungai-sungai di celah-celahnya, dan yang menjadikan gunung-gunung untuk (mengkokohkan)nya dan menjadikan suatu pemisah antara dua laut ? Apakah disamping Allah ada tuhan (yang lain)? Bahkan (sebenarnya) kebanyakan dari mereka tidak mengetahui.\n","en":"Nay - who is it that has made the earth a fitting abode [for living things], and has caused running waters [to flow] in its midst, and has set upon it moun­tains firm, and has placed a barrier between the two great bodies of water? Could there be any divine power besides God? Nay, most of those [who think so] do not know [what they are saying]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3220","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3220.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3220.mp3"]}},{"no":62,"arab":"أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ قَلِيلًا مَا تَذَكَّرُونَ","latin":"amman yujiibu almudtharra idzaa da'aahu wayaksyifu alssuu-a wayaj'alukum khulafaa-a al-ardhi a-ilaahun ma'a allaahi qaliilan maa tadzakkaruuna","translate":{"id":"Atau siapakah yang memperkenankan (do'a) orang yang dalam kesulitan apabila ia berdo'a kepada-Nya, dan yang menghilangkan kesusahan dan yang menjadikan kamu (manusia) sebagai khalifah di bumi ? Apakah disamping Allah ada tuhan (yang lain)? Amat sedikitlah kamu mengingati(Nya).\n","en":"Nay - who is it that responds to the distressed when he calls out to Him, and who removes the ill [that caused the distress], and has made you inherit the earth? Could there be any divine power besides God? How seldom do you keep this in mind!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3221","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3221.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3221.mp3"]}},{"no":63,"arab":"أَمَّنْ يَهْدِيكُمْ فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ وَمَنْ يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ تَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ","latin":"amman yahdiikum fii zhulumaati albarri waalbahri waman yursilu alrriyaaha busyran bayna yaday rahmatihi a-ilaahun ma'a allaahi ta'aalaa allaahu 'ammaa yusyrikuuna","translate":{"id":"Atau siapakah yang memimpin kamu dalam kegelapan di dataran dan lautan dan siapa (pula)kah yang mendatangkan angin sebagai kabar gembira sebelum (kedatangan) rahmat-Nya ? Apakah disamping Allah ada tuhan (yang lain)? Maha Tinggi Allah terhadap apa yang mereka persekutukan (dengan-Nya).\n","en":"Nay - who is it that guides you in the midst of the deep darkness of land and sea, and sends forth the winds as a glad tiding of His coming grace? Could there be any divine power besides God? Sublimely exalted is God above anything to which men may ascribe a share in His divinity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3222","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3222.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3222.mp3"]}},{"no":64,"arab":"أَمَّنْ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَمَنْ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ ۗ أَإِلَٰهٌ مَعَ اللَّهِ ۚ قُلْ هَاتُوا بُرْهَانَكُمْ إِنْ كُنْتُمْ صَادِقِينَ","latin":"amman yabdau alkhalqa tsumma yu'iiduhu waman yarzuqukum mina alssamaa-i waal-ardhi a-ilaahun ma'a allaahi qul haatuu burhaanakum in kuntum shaadiqiina","translate":{"id":"Atau siapakah yang menciptakan (manusia dari permulaannya), kemudian mengulanginya (lagi), dan siapa (pula) yang memberikan rezki kepadamu dari langit dan bumi? Apakah disamping Allah ada tuhan (yang lain)?. Katakanlah: \"Unjukkanlah bukti kebenaranmu, jika kamu memang orang-orang yang benar\".\n","en":"Nay - who is it that creates [all life] in the first instance, and then brings it forth anew? And who is it that provides you with sustenance out of heaven and earth? Could there be any divine power besides God? Say: “[If you think so,] produce your evidence - if you truly believe in your claim!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3223","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3223.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3223.mp3"]}},{"no":65,"arab":"قُلْ لَا يَعْلَمُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ الْغَيْبَ إِلَّا اللَّهُ ۚ وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ","latin":"qul laa ya'lamu man fii alssamaawaati waal-ardhi alghayba illaa allaahu wamaa yasy'uruuna ayyaana yub'atsuuna","translate":{"id":"Katakanlah: \"Tidak ada seorangpun di langit dan di bumi yang mengetahui perkara yang ghaib, kecuali Allah\", dan mereka tidak mengetahui bila mereka akan dibangkitkan.\n","en":"Say: “None in the heavens or on earth knows the hidden reality [of anything that exists: none knows it] save God.” And neither can they [who are living] perceive when they shall be raised from the dead:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3224","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3224.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3224.mp3"]}},{"no":66,"arab":"بَلِ ادَّارَكَ عِلْمُهُمْ فِي الْآخِرَةِ ۚ بَلْ هُمْ فِي شَكٍّ مِنْهَا ۖ بَلْ هُمْ مِنْهَا عَمُونَ","latin":"bali iddaaraka 'ilmuhum fii al-aakhirati bal hum fii syakkin minhaa bal hum minhaa 'amuuna","translate":{"id":"Sebenarnya pengetahuan mereka tentang akhirat tidak sampai (kesana) malahan mereka ragu-ragu tentang akhirat itu, lebih-lebih lagi mereka buta daripadanya.\n","en":"nay, their knowledge of the life to come stops short of the truth: nay, they are [often] in doubt as to its reality: nay, they are blind to it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3225","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3225.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3225.mp3"]}},{"no":67,"arab":"وَقَالَ الَّذِينَ كَفَرُوا أَإِذَا كُنَّا تُرَابًا وَآبَاؤُنَا أَئِنَّا لَمُخْرَجُونَ","latin":"waqaala alladziina kafaruu a-idzaa kunnaa turaaban waaabaaunaa a-innaa lamukhrajuuna","translate":{"id":"Berkatalah orang-orang yang kafir: \"Apakah setelah kita menjadi tanah dan (begitu pula) bapak-bapak kita; apakah sesungguhnya kita akan dikeluarkan (dari kubur)?\n","en":"And so, they who are bent on denying the truth are saying: “What! After we have become dust - we and our forefathers - shall we [all], forsooth, be brought forth [from the dead]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3226","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3226.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3226.mp3"]}},{"no":68,"arab":"لَقَدْ وُعِدْنَا هَٰذَا نَحْنُ وَآبَاؤُنَا مِنْ قَبْلُ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","latin":"laqad wu'idnaa haadzaa nahnu waaabaaunaa min qablu in haadzaa illaa asaathiiru al-awwaliina","translate":{"id":"Sesungguhnya kami telah diberi ancaman dengan ini dan (juga) bapak-bapak kami dahulu; ini tidak lain hanyalah dongengan-dongengan orang dahulu kala\".\n","en":"Indeed, we were promised this - we and our forefathers - in the past as well; it is nothing but fables of ancient times!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3227","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3227.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3227.mp3"]}},{"no":69,"arab":"قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُجْرِمِينَ","latin":"qul siiruu fii al-ardhi faunzhuruu kayfa kaana 'aaqibatu almujrimiina","translate":{"id":"Katakanlah: \"Berjalanlah kamu (di muka) bumi, lalu perhatikanlah bagaimana akibat orang-orang yang berdosa.\n","en":"Say: “Go all over the earth and behold what happened in the end to those [who were thus] lost in sin!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3228","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3228.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3228.mp3"]}},{"no":70,"arab":"وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُنْ فِي ضَيْقٍ مِمَّا يَمْكُرُونَ","latin":"walaa tahzan 'alayhim walaa takun fii dhayqin mimmaa yamkuruuna","translate":{"id":"Dan janganlah kamu berduka cita terhadap mereka, dan janganlah (dadamu) merasa sempit terhadap apa yang mereka tipudayakan\".\n","en":"But do not grieve over them, and neither be distressed by the false arguments which they devise [against Gods messages]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3229","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3229.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3229.mp3"]}},{"no":71,"arab":"وَيَقُولُونَ مَتَىٰ هَٰذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ","latin":"wayaquuluuna mataa haadzaa alwa'du in kuntum shaadiqiina","translate":{"id":"Dan mereka (orang-orang kafir) berkata: \"Bilakah datangnya azab itu, jika memang kamu orang-orang yang benar\".\n","en":"And [when] they ask, “When is this promise [of resurrection] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!” –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3230","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3230.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3230.mp3"]}},{"no":72,"arab":"قُلْ عَسَىٰ أَنْ يَكُونَ رَدِفَ لَكُمْ بَعْضُ الَّذِي تَسْتَعْجِلُونَ","latin":"qul 'asaa an yakuuna radifa lakum ba'dhu alladzii tasta'jiluuna","translate":{"id":"Katakanlah: \"Mungkin telah hampir datang kepadamu sebagian dari (azab) yang kamu minta (supaya) disegerakan itu .\n","en":"say thou: “It may well be that something of that which [in your ignorance] you so hastily demands has already drawn close unto you.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3231","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3231.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3231.mp3"]}},{"no":73,"arab":"وَإِنَّ رَبَّكَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ","latin":"wa-inna rabbaka ladzuu fadhlin 'alaa alnnaasi walaakinna aktsarahum laa yasykuruuna","translate":{"id":"Dan sesungguhnya Tuhanmu benar-benar mempunyai kurnia yang besar (yang diberikan-Nya) kepada manusia, tetapi kebanyakan mereka tidak mensyukuri(nya).\n","en":"Now, verily, thy Sustainer is indeed limitless in His bounty unto men - but most of them are bereft of gratitude."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3232","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3232.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3232.mp3"]}},{"no":74,"arab":"وَإِنَّ رَبَّكَ لَيَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ","latin":"wa-inna rabbaka laya'lamu maa tukinnu shuduuruhum wamaa yu'linuuna","translate":{"id":"Dan sesungguhnya Tuhanmu, benar-benar mengetahui apa yang disembunyikan hati mereka dan apa yang mereka nyatakan.\n","en":"But, verily, thy Sustainer knows all that their hearts conceal as well as all that they bring into the open:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3233","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3233.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3233.mp3"]}},{"no":75,"arab":"وَمَا مِنْ غَائِبَةٍ فِي السَّمَاءِ وَالْأَرْضِ إِلَّا فِي كِتَابٍ مُبِينٍ","latin":"wamaa min ghaa-ibatin fii alssamaa-i waal-ardhi illaa fii kitaabin mubiinin","translate":{"id":"Tiada sesuatupun yang ghaib di langit dan di bumi, melainkan (terdapat) dalam kitab yang nyata (Lauhul Mahfuzh).\n","en":"for there is nothing [so deeply] hidden in the heavens or on earth but is recorded in [His] clear decree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3234","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3234.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3234.mp3"]}},{"no":76,"arab":"إِنَّ هَٰذَا الْقُرْآنَ يَقُصُّ عَلَىٰ بَنِي إِسْرَائِيلَ أَكْثَرَ الَّذِي هُمْ فِيهِ يَخْتَلِفُونَ","latin":"inna haadzaa alqur-aana yaqushshu 'alaa banii israa-iila aktsara alladzii hum fiihi yakhtalifuuna","translate":{"id":"Sesungguhnya Al Quraan ini menjelaskan kepada Bani lsrailebahagian besar dari (perkara-perkara) yang mereka berselisih tentangnya.\n","en":"BEHOLD, this Qur’an explains to the children of Israel most [of that] whereon they hold divergent views;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3235","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3235.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3235.mp3"]}},{"no":77,"arab":"وَإِنَّهُ لَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ","latin":"wa-innahu lahudan warahmatun lilmu/miniina","translate":{"id":"Dan sesungguhnya AI Quraan itu benar-benar menjadi petunjuk dan rahmat bagi orang-orang yang beriman.\n","en":"and, verily, it is a guidance and a grace unto all who believe [in it]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3236","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3236.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3236.mp3"]}},{"no":78,"arab":"إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ بِحُكْمِهِ ۚ وَهُوَ الْعَزِيزُ الْعَلِيمُ","latin":"inna rabbaka yaqdhii baynahum bihukmihi wahuwa al'aziizu al'aliimu","translate":{"id":"Sesungguhnya Tuhanmu akan menyelesaikan perkara antara mereka dengan keputusan-Nya, dan Dia Maha Perkasa lagi Maha Mengetahui.\n","en":"Verily, [O believer,] thy Sustainer will judge between them in His wisdom - for He alone is almighty, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3237","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3237.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3237.mp3"]}},{"no":79,"arab":"فَتَوَكَّلْ عَلَى اللَّهِ ۖ إِنَّكَ عَلَى الْحَقِّ الْمُبِينِ","latin":"fatawakkal 'alaa allaahi innaka 'alaa alhaqqi almubiini","translate":{"id":"Sebab itu bertakwalah kepada Allah, sesungguhnya kamu berada di atas kebenaran yang nyata.\n","en":"Hence, place thy trust in God [alone] - for, behold, that in which thou believest is truth self-evident."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3238","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3238.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3238.mp3"]}},{"no":80,"arab":"إِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَاءَ إِذَا وَلَّوْا مُدْبِرِينَ","latin":"innaka laa tusmi'u almawtaa walaa tusmi'u alshshumma alddu'aa-a idzaa wallaw mudbiriina","translate":{"id":"Sesungguhnya kamu tidak dapat menjadikan orang-orang yang mati mendengar dan (tidak pula) menjadikan orang-orang yang tuli mendengar panggilan, apabila mereka telah berpaling membelakang.\n","en":"[But,] verily, thou canst not make the dead hear: and [so, too,] thou canst not make the deaf [of heart] hear this call when they turn their backs [on thee] and go away,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3239","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3239.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3239.mp3"]}},{"no":81,"arab":"وَمَا أَنْتَ بِهَادِي الْعُمْيِ عَنْ ضَلَالَتِهِمْ ۖ إِنْ تُسْمِعُ إِلَّا مَنْ يُؤْمِنُ بِآيَاتِنَا فَهُمْ مُسْلِمُونَ","latin":"wamaa anta bihaadii al'umyi 'an dhalaalatihim in tusmi'u illaa man yu/minu bi-aayaatinaa fahum muslimuuna","translate":{"id":"Dan kamu sekali-kali tidak dapat memimpin (memalingkan) orang-orang buta dari kesesatan mereka. Kamu tidak dapat menjadikan (seorangpun) mendengar, kecuali orang-orang yang beriman kepada ayat-ayat Kami, lalu mereka berserah diri.\n","en":"just as thou canst not lead the blind [of heart] out of their error; none canst thou make hear save such as [are willing to] believe in Our messages, and thus surrender themselves unto Us."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3240","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3240.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3240.mp3"]}},{"no":82,"arab":"وَإِذَا وَقَعَ الْقَوْلُ عَلَيْهِمْ أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ","latin":"wa-idzaa waqa'a alqawlu 'alayhim akhrajnaa lahum daabbatan mina al-ardhi tukallimuhum anna alnnaasa kaanuu bi-aayaatinaa laa yuuqinuuna","translate":{"id":"Dan apabila perkataan telah jatuh atas mereka, Kami keluarkan sejenis binatang melata dari bumi yang akan mengatakan kepada mereka, bahwa sesungguhnya manusia dahulu tidak yakin kepada ayat-ayat Kami .\n","en":"Now, [as for the deaf and blind of heart –] when the word [of truth] stands revealed against them, We shall bring forth unto them out of the earth a creature, which will tell them that mankind had no real faith in Our messages."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3241","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3241.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3241.mp3"]}},{"no":83,"arab":"وَيَوْمَ نَحْشُرُ مِنْ كُلِّ أُمَّةٍ فَوْجًا مِمَّنْ يُكَذِّبُ بِآيَاتِنَا فَهُمْ يُوزَعُونَ","latin":"wayawma nahsyuru min kulli ummatin fawjan mimman yukadzdzibu bi-aayaatinaa fahum yuuza'uuna","translate":{"id":"Dan (ingatlah) hari (ketika) Kami kumpulkan dari tiap-tiap umat segolongan orang-orang yang mendustakan ayat-ayat Kami, lalu mereka dibagi-bagi (dalam kelompok-kelompok).\n","en":"And on that Day We shall gather from within every community a host of those who gave the lie to Our messages; and they will be grouped [according to the gravity of their sins]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3242","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3242.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3242.mp3"]}},{"no":84,"arab":"حَتَّىٰ إِذَا جَاءُوا قَالَ أَكَذَّبْتُمْ بِآيَاتِي وَلَمْ تُحِيطُوا بِهَا عِلْمًا أَمَّاذَا كُنْتُمْ تَعْمَلُونَ","latin":"hattaa idzaa jaauu qaala akadzdzabtum bi-aayaatii walam tuhiithuu bihaa 'ilman ammaatsaa kuntum ta'maluuna","translate":{"id":"Hingga apabila mereka datang, Allah berfirman: \"Apakah kamu telah mendustakan ayat-ayat-Ku, padahal ilmu kamu tidak meliputinya , atau apakah yang telah kamu kerjakan?\".\n","en":"until such a time as they shall come [to be judged. And] He will say: “Did you give the lie to My messages even though you failed to encompass them with [your] knowledge? Or what was it that [you thought] you were doing?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3243","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3243.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3243.mp3"]}},{"no":85,"arab":"وَوَقَعَ الْقَوْلُ عَلَيْهِمْ بِمَا ظَلَمُوا فَهُمْ لَا يَنْطِقُونَ","latin":"wawaqa'a alqawlu 'alayhim bimaa zhalamuu fahum laa yanthiquuna","translate":{"id":"Dan jatuhlah perkataan (azab) atas mereka disebabkan kezaliman mereka, maka mereka tidak dapat berkata (apa-apa).\n","en":"And the word [of truth] will stand revealed against them in the face of all the wrong which they had committed, and they will not [be able to] utter a single word [of excuse]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3244","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3244.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3244.mp3"]}},{"no":86,"arab":"أَلَمْ يَرَوْا أَنَّا جَعَلْنَا اللَّيْلَ لِيَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ","latin":"alam yaraw annaa ja'alnaa allayla liyaskunuu fiihi waalnnahaara mubshiran inna fii dzaalika laaayaatin liqawmin yu/minuuna","translate":{"id":"Apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan malam supaya mereka beristirahat padanya dan siang yang menerangi? Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman.\n","en":"for, were they not aware that it is We who had made the night for them, so that they might rest therein, and the day, to make [them] see? In this, behold, there are messages indeed for peo­ple who will believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3245","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3245.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3245.mp3"]}},{"no":87,"arab":"وَيَوْمَ يُنْفَخُ فِي الصُّورِ فَفَزِعَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۚ وَكُلٌّ أَتَوْهُ دَاخِرِينَ","latin":"wayawma yunfakhu fii alshshuuri fafazi'a man fii alssamaawaati waman fii al-ardhi illaa man syaa-a allaahu wakullun atawhu daakhiriina","translate":{"id":"Dan (ingatlah) hari (ketika) ditiup sangkakala, maka terkejutlah segala yang di langit dan segala yang di bumi, kecuali siapa yang dikehendaki Allah. Dan semua mereka datang menghadap-Nya dengan merendahkan diri.\n","en":"And on that Day the trumpet [of judgment] will be sounded, and all [creatures] that are in the heavens and all that are on earth will be stricken with terror, except such as God wills [to exempt]: and in utter lowliness all will come unto Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3246","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3246.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3246.mp3"]}},{"no":88,"arab":"وَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ ۚ صُنْعَ اللَّهِ الَّذِي أَتْقَنَ كُلَّ شَيْءٍ ۚ إِنَّهُ خَبِيرٌ بِمَا تَفْعَلُونَ","latin":"wataraa aljibaala tahsabuhaa jaamidatan wahiya tamurru marra alssahaabi shun'a allaahi alladzii atqana kulla syay-in innahu khabiirun bimaa taf'aluuna","translate":{"id":"Dan kamu lihat gunung-gunung itu, kamu sangka dia tetap di tempatnya, padahal ia berjalan sebagai jalannya awan. (Begitulah) perbuatan Allah yang membuat dengan kokoh tiap-tiap sesuatu; sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"And thou wilt see the mountains, which [now] thou deemest so firm, pass away as clouds pass away: a work of God, who has ordered all things to per­fection! Verily, He is fully aware of all that you do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3247","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3247.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3247.mp3"]}},{"no":89,"arab":"مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْهَا وَهُمْ مِنْ فَزَعٍ يَوْمَئِذٍ آمِنُونَ","latin":"man jaa-a bialhasanati falahu khayrun minhaa wahum min faza'in yawma-idzin aaminuuna","translate":{"id":"Barangsiapa yang membawa kebaikan, maka ia memperoleh (balasan) yang lebih baik dari padanya, sedang mereka itu adalah orang-orang yang aman tenteram dari pada kejutan yang dahsyat pada hari itu.\n","en":"Whoever shall come [before Him] with a good deed will gain [further] good there from; and they will be secure from the terror of that Day."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3248","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3248.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3248.mp3"]}},{"no":90,"arab":"وَمَنْ جَاءَ بِالسَّيِّئَةِ فَكُبَّتْ وُجُوهُهُمْ فِي النَّارِ هَلْ تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ","latin":"waman jaa-a bialssayyi-ati fakubbat wujuuhuhum fii alnnaari hal tujzawna illaa maa kuntum ta'maluuna","translate":{"id":"Dan barang siapa yang membawa kejahatan, maka disungkurkanlah muka mereka ke dalam neraka. Tiadalah kamu dibalasi, melainkan (setimpal) dengan apa yang dahulu kamu kerjakan.\n","en":"But they who shall come with evil deeds – their faces will be thrust into the fire, [and they will be asked:] “Is this aught but a just requital for what you were doing [in life]?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3249","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3249.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3249.mp3"]}},{"no":91,"arab":"إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ","latin":"innamaa umirtu an a'buda rabba haadzihi albaldati alladzii harramahaa walahu kullu syay-in waumirtu an akuuna mina almuslimiina","translate":{"id":"Aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah) Yang telah menjadikannya suci dan kepunyaan-Nya-lah segala sesuatu, dan aku diperintahkan supaya aku termasuk orang-orang yang berserah diri.\n","en":"[SAY, O Muhammad:] “I have been bidden to worship the Sustainer of this City – Him who has made it sacred, and unto whom all things belong: and I have been bidden to be of those who surrender themselves to Him,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3250","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3250.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3250.mp3"]}},{"no":92,"arab":"وَأَنْ أَتْلُوَ الْقُرْآنَ ۖ فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَقُلْ إِنَّمَا أَنَا مِنَ الْمُنْذِرِينَ","latin":"wa-an atluwa alqur-aana famani ihtadaa fa-innamaa yahtadii linafsihi waman dhalla faqul innamaa anaa mina almundziriina","translate":{"id":"Dan supaya aku membacakan Al Quraan (kepada manusia). Maka barangsiapa yang mendapat petunjuk maka sesungguhnya ia hanyalah mendapat petunjuk untuk (kebaikan) dirinya, dan barangsiapa yang sesat maka katakanlah: \"Sesungguhnya aku (ini) tidak lain hanyalah salah seorang pemberi peringatan\".\n","en":"and to convey this Qur’an [to the world].” Whoever, therefore, chooses to follow the right path, follows it but for his own good; and if any wills to go astray, say [unto him]: “I am only a warner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3251","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3251.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3251.mp3"]}},{"no":93,"arab":"وَقُلِ الْحَمْدُ لِلَّهِ سَيُرِيكُمْ آيَاتِهِ فَتَعْرِفُونَهَا ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ","latin":"waquli alhamdu lillaahi sayuriikum aayaatihi fata'rifuunahaa wamaa rabbuka bighaafilin 'ammaa ta'maluuna","translate":{"id":"Dan katakanlah: \"Segala puji bagi Allah, Dia akan memperlihatkan kepadamu tanda-tanda kebesaran-Nya, maka kamu akan mengetahuinya. Dan Tuhanmu tiada lalai dari apa yang kamu kerjakan\".\n","en":"And say: “All praise is due to God! In time He will make you see [the truth of] His messages, and then you shall know them [for what they are].” And thy Sustainer is not unmindful of whatever you all may do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3252","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3252.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3252.mp3"]}}]}