{"alquran":{"no":29,"name":"Al-Ankaboot","arab":"العنكبوت","start":3340,"count":69,"rukku":7,"type":"mecca","description":"Surat Al 'Ankabuut terdiri atas 69 ayat, termasuk golongan surat-surrat Makkiyah. Dinamai <i>Al 'Ankabuut</i> berhubung terdapatnya perkataan <i>Al 'Ankabuut</i> yang berarti <i>laba-laba</i> pada ayat 41 surat ini, dimana Allah mengumpamakan penyembah-penyembah berhala-berhala itu, dengan laba-laba yang percaya kepada kekuatan rumahnya sebagai tempat ia berlindung dan tempat ia menjerat mangsanya, padahal kalau dihembus angin atau ditimpa oleh suatu barang yang kecil saja, rumah itu akan hancur. Begitu pula halnya dengan kaum musyrikin yang percaya kepada kekuatan sembahan-sembahan mereka sebagai tempat berlindung dan tempat meminta sesuatu yang mereka ingini, padahal sembahan-sembahan mereka itu tidak mampu sedikit juga menolong mereka dari azab Allah waktu di dunia, seperti yang terjadi pada kaum Nuh, kaum Ibrahim, kaum Luth, kaum Syu'aib, kaum Saleh, dan lain-lain. Apalagi menghadapi azab Allah di akhirat nanti, sembahan-sembahan mereka itu lebih tidak mampu menghindarkan dan melindungi mereka."},"surah":[{"no":1,"arab":" الم","latin":"alif-laam-miim","translate":{"id":"Alif laam miim ","en":"Alif. Lam. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3341","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3341.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3341.mp3"]}},{"no":2,"arab":"أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ","latin":"ahasiba alnnaasu an yutrakuu an yaquuluu aamannaa wahum laa yuftanuuna","translate":{"id":"Apakah manusia itu mengira bahwa mereka dibiarkan (saja) mengatakan : \"Kami telah beriman\", sedang mereka tidak diuji lagi?\n","en":"DO MEN THINK that on their [mere] saying, “We have attained to faith”, they will be left to themselves, and will not be put to a test?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3342","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3342.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3342.mp3"]}},{"no":3,"arab":"وَلَقَدْ فَتَنَّا الَّذِينَ مِنْ قَبْلِهِمْ ۖ فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ","latin":"walaqad fatannaa alladziina min qablihim falaya'lamanna allaahu alladziina shadaquu walaya'lamanna alkaadzibiina","translate":{"id":"Dan sesungguhnya kami telah menguji orang-orang yang sebelum mereka, maka sesungguhnya Allah mengetahui orang-orang yang benar dan sesungguhnya Dia mengetahui orang-orang yang dusta.\n","en":"Yea, indeed, We did test those who lived before them; and so, [too, shall be tested the people now living: and] most certainly will God mark out those who prove themselves true, and most certainly will He mark out those who are lying."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3343","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3343.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3343.mp3"]}},{"no":4,"arab":"أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ","latin":"am hasiba alladziina ya'maluuna alssayyi-aati an yasbiquunaa saa-a maa yahkumuuna","translate":{"id":"Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput (dari azab) Kami? Amatlah buruk apa yang mereka tetapkan itu.\n","en":"Or do they think - they who do evil deeds [while claiming to have attained to faith] - that they can escape Us? Bad, indeed, is their judgment!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3344","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3344.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3344.mp3"]}},{"no":5,"arab":"مَنْ كَانَ يَرْجُو لِقَاءَ اللَّهِ فَإِنَّ أَجَلَ اللَّهِ لَآتٍ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","latin":"man kaana yarjuu liqaa-a allaahi fa-inna ajala allaahi laaatin wahuwa alssamii'u al'aliimu","translate":{"id":"Barangsiapa yang mengharap pertemuan dengan Allah, maka sesungguhnya waktu (yang dijanjikan) Allah itu, pasti datang. Dan Dialah Yang Maha mendengar lagi Maha Mengetahui.\n","en":"Whoever looks forward [with hope and awe] to meeting God [on Resurrection Day, let him be ready for it]: for, behold, the end set by God [for every­one’s life] is bound to come - and He alone is all-hearing, all-knowing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3345","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3345.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3345.mp3"]}},{"no":6,"arab":"وَمَنْ جَاهَدَ فَإِنَّمَا يُجَاهِدُ لِنَفْسِهِ ۚ إِنَّ اللَّهَ لَغَنِيٌّ عَنِ الْعَالَمِينَ","latin":"waman jaahada fa-innamaa yujaahidu linafsihi inna allaaha laghaniyyun 'ani al'aalamiina","translate":{"id":"Dan barangsiapa yang berjihad, maka sesungguhnya jihadnya itu adalah untuk dirinya sendiri. Sesungguhnya Allah benar-benar Maha Kaya (tidak memerlukan sesuatu) dari semesta alam.\n","en":"Hence, whoever strives hard [in God’s cause] does so only for his own good: for, verily, God does not stand in need of anything in all the worlds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3346","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3346.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3346.mp3"]}},{"no":7,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلَنَجْزِيَنَّهُمْ أَحْسَنَ الَّذِي كَانُوا يَعْمَلُونَ","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati lanukaffiranna 'anhum sayyi-aatihim walanajziyannahum ahsana alladzii kaanuu ya'maluuna","translate":{"id":"Dan orang-orang yang beriman dan beramal saleh, benar-benar akan Kami hapuskan dari mereka dosa-dosa mereka dan benar-benar akan Kami beri mereka balasan yang lebih baik dari apa yang mereka kerjakan.\n","en":"And as for those who attain to faith and do righteous deeds, We shall most certainly efface their [previous] bad deeds, and shall most certainly reward them in accordance with the best that they ever did."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3347","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3347.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3347.mp3"]}},{"no":8,"arab":"وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِنْ جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۚ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"wawashshaynaa al-insaana biwaalidayhi husnan wa-in jaahadaaka litusyrika bii maa laysa laka bihi 'ilmun falaa tuthi'humaa ilayya marji'ukum fa-unabbi-ukum bimaa kuntum ta'maluuna","translate":{"id":"Dan Kami wajibkan manusia (berbuat) kebaikan kepada dua orang ibu-bapaknya. Dan jika keduanya memaksamu untuk mempersekutukan Aku dengan sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya. Hanya kepada-Ku-lah kembalimu, lalu Aku kabarkan kepadamu apa yang telah kamu kerjakan.\n","en":"Now [among the best of righteous deeds which] We have enjoined upon man [is] goodness towards his parents; yet [even so,] should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey then, not: [for] it is unto Me that you all must return, whereupon I shall make you [truly] understand [the right and wrong of] all that you were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3348","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3348.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3348.mp3"]}},{"no":9,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُدْخِلَنَّهُمْ فِي الصَّالِحِينَ","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati lanudkhilannahum fii alshshaalihiina","translate":{"id":"Dan orang-orang yang beriman dan mengerjakan amal saleh benar-benar akan Kami masukkan mereka ke dalam (golongan) orang-orang yang saleh.\n","en":"But as for those who have attained to faith and have done righteous deeds, We shall most certainly cause them to join the righteous [in the hereafter as well]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3349","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3349.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3349.mp3"]}},{"no":10,"arab":"وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ فَإِذَا أُوذِيَ فِي اللَّهِ جَعَلَ فِتْنَةَ النَّاسِ كَعَذَابِ اللَّهِ وَلَئِنْ جَاءَ نَصْرٌ مِنْ رَبِّكَ لَيَقُولُنَّ إِنَّا كُنَّا مَعَكُمْ ۚ أَوَلَيْسَ اللَّهُ بِأَعْلَمَ بِمَا فِي صُدُورِ الْعَالَمِينَ","latin":"wamina alnnaasi man yaquulu aamannaa biallaahi fa-idzaa uudziya fii allaahi ja'ala fitnata alnnaasi ka'adzaabi allaahi wala-in jaa-a nashrun min rabbika layaquulunna innaa kunnaa ma'akum awa laysa allaahu bi-a'lama bimaa fii shuduuri al'aalamiina","translate":{"id":"Dan di antara manusia ada orang yang berkata: \"Kami beriman kepada Allah\", maka apabila ia disakiti (karena ia beriman) kepada Allah, ia menganggap fitnah manusia itu sebagai azab Allah . Dan sungguh jika datang pertolongan dari Tuhanmu, mereka pasti akan berkata: \"Sesungguhnya kami adalah besertamu\". Bukankah Allah lebih mengetahui apa yang ada dalam dada semua manusia?\n","en":"Now there is among men many a one who says [of himself and of others like him], “We do believe in God” - but whenever he is made to suffer in God’s cause, he thinks that persecution at the hands of man is as [much to be feared, or even more than,] God’s chastisement; whereas, if succour from thy Sustainer comes [to those who truly believe] he is sure to say. “Behold, we have always been with you!” Is not God fully aware of what is in the hearts of all creatures?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3350","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3350.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3350.mp3"]}},{"no":11,"arab":"وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ آمَنُوا وَلَيَعْلَمَنَّ الْمُنَافِقِينَ","latin":"walaya'lamanna allaahu alladziina aamanuu walaya'lamanna almunaafiqiina","translate":{"id":"Dan sesungguhnya Allah benar-benar mengetahui orang-orang yang beriman: dan sesungguhnya Dia mengetahui orang-orang yang munafik.\n","en":"[Yea-] and most certainly will God mark out those who have [truly] attained to faith, and most certainly will He mark out the hypocrites."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3351","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3351.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3351.mp3"]}},{"no":12,"arab":"وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا اتَّبِعُوا سَبِيلَنَا وَلْنَحْمِلْ خَطَايَاكُمْ وَمَا هُمْ بِحَامِلِينَ مِنْ خَطَايَاهُمْ مِنْ شَيْءٍ ۖ إِنَّهُمْ لَكَاذِبُونَ","latin":"waqaala alladziina kafaruu lilladziina aamanuu ittabi'uu sabiilanaa walnahmil khathaayaakum wamaa hum bihaamiliina min khathaayaahum min syay-in innahum lakaadzibuuna","translate":{"id":"Dan berkatalah orang-orang kafir kepada orang-orang yang beriman: \"Ikutilah jalan kami, dan nanti kami akan memikul dosa-dosamu\", dan mereka (sendiri) sedikitpun tidak (sanggup), memikul dosa-dosa mereka. Sesungguhnya mereka adalah benar-benar orang pendusta.\n","en":"And [He is aware, too, that] they who are bent on denying the truth speak [thus, as it were,] to those who have attained to faith: “Follow our way [of life], and we shall indeed take your sins upon ourselves!” But never could they take upon themselves aught of the sins of those [whom they would thus mislead]: behold, they are liars indeed!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3352","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3352.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3352.mp3"]}},{"no":13,"arab":"وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ ۖ وَلَيُسْأَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كَانُوا يَفْتَرُونَ","latin":"walayahmilunna atsqaalahum wa-atsqaalan ma'a atsqaalihim walayus-alunna yawma alqiyaamati 'ammaa kaanuu yaftaruuna","translate":{"id":"Dan sesungguhnya mereka akan memikul beban (dosa) mereka, dan beban-beban (dosa yang lain) di samping beban-beban mereka sendiri, dan sesungguhnya mereka akan ditanya pada hari kiamat tentang apa yang selalu mereka ada-adakan.\n","en":"Yet most certainly will they have to bear their own burdens, and other burdens besides their own; and most certainly will they be called to account on Resurrection Day for all their false assertions!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3353","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3353.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3353.mp3"]}},{"no":14,"arab":"وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ","latin":"walaqad arsalnaa nuuhan ilaa qawmihi falabitsa fiihim alfa sanatin illaa khamsiina 'aaman fa-akhadzahumu alththhuufaanu wahum zhaalimuuna","translate":{"id":"Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya, maka ia tinggal di antara mereka seribu tahun kurang lima puluh tahun. Maka mereka ditimpa banjir besar, dan mereka adalah orang-orang yang zalim.\n","en":"And, indeed, [in times long past] We sent forth Noah unto his people, and he dwelt among them a thousand years bar fifty; and then the floods over­whelmed them while they were still lost in evildoing:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3354","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3354.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3354.mp3"]}},{"no":15,"arab":"فَأَنْجَيْنَاهُ وَأَصْحَابَ السَّفِينَةِ وَجَعَلْنَاهَا آيَةً لِلْعَالَمِينَ","latin":"fa-anjaynaahu wa-ash-haaba alssafiinati waja'alnaahaa aayatan lil'aalamiina","translate":{"id":"Maka Kami selamatkan Nuh dan penumpang-penumpang bahtera itu dan Kami jadikan peristiwa itu pelajaran bagi semua umat manusia.\n","en":"but We saved him, together with all who were in the ark, which We then set up as a symbol [of Our grace] for all people [to remember]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3355","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3355.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3355.mp3"]}},{"no":16,"arab":"وَإِبْرَاهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ ۖ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","latin":"wa-ibraahiima idz qaala liqawmihi u'buduu allaaha waittaquuhu dzaalikum khayrun lakum in kuntum ta'lamuuna","translate":{"id":"Dan (ingatlah) Ibrahim, ketika ia berkata kepada kaumnya: \"Sembahlah olehmu Allah dan bertakwalah kepada-Nya. Yang demikian itu adalah lebih baik bagimu, jika kamu mengetahui.\n","en":"And Abraham, [too, was inspired by Us] when he said unto his people: “Worship God, and be conscious of Him: this is the best for you, if you but knew it!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3356","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3356.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3356.mp3"]}},{"no":17,"arab":"إِنَّمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا ۚ إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ ۖ إِلَيْهِ تُرْجَعُونَ","latin":"innamaa ta'buduuna min duuni allaahi awtsaanan watakhluquuna ifkan inna alladziina ta'buduuna min duuni allaahi laa yamlikuuna lakum rizqan faibtaghuu 'inda allaahi alrrizqa wau'buduuhu wausykuruu lahu ilayhi turja'uuna","translate":{"id":"Sesungguhnya apa yang kamu sembah selain Allah itu adalah berhala, dan kamu membuat dusta . Sesungguhnya yang kamu sembah selain Allah itu tidak mampu memberikan rezki kepadamu; maka mintalah rezki itu di sisi Allah, dan sembahlah Dia dan bersyukurlah kepada-Nya. Hanya kepada-Nyalah kamu akan dikembalikan.\n","en":"You worship only [lifeless] idols instead of God, and [thus] you give visible shape to a lie! Behold, those [things and beings] that you worship instead of God have it not in their power to provide sustenance for you: seek, then, all [your] sustenance from God, and worship Him [alone] and be grateful to Him: [for] unto Him you shall be brought back!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3357","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3357.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3357.mp3"]}},{"no":18,"arab":"وَإِنْ تُكَذِّبُوا فَقَدْ كَذَّبَ أُمَمٌ مِنْ قَبْلِكُمْ ۖ وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ","latin":"wa-in tukadzdzibuu faqad kadzdzaba umamun min qablikum wamaa 'alaa alrrasuuli illaa albalaaghu almubiinu","translate":{"id":"Dan jika kamu (orang kafir) mendustakan, maka umat yang sebelum kamu juga telah mendustakan. Dan kewajiban rasul itu, tidak lain hanyalah menyampaikan (agama Allah) dengan seterang-terangnya.\"\n","en":"“And if you give [me] the lie - well, [other] communities have given the lie [to Gods prophets] before your time: but no more is an apostle bound to do than clearly deliver the message [entrusted to him].”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3358","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3358.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3358.mp3"]}},{"no":19,"arab":"أَوَلَمْ يَرَوْا كَيْفَ يُبْدِئُ اللَّهُ الْخَلْقَ ثُمَّ يُعِيدُهُ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","latin":"awa lam yaraw kayfa yubdi-u allaahu alkhalqa tsumma yu'iiduhu inna dzaalika 'alaa allaahi yasiirun","translate":{"id":"Dan apakah mereka tidak memperhatikan bagaimana Allah menciptakan (manusia) dari permulaannya, kemudian mengulanginya (kembali). Sesungguhnya yang demikian itu adalah mudah bagi Allah.\n","en":"Are then they [who deny the truth] not aware of how God creates [life] in the first instance, and then brings it forth anew? This, verily, is easy for God!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3359","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3359.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3359.mp3"]}},{"no":20,"arab":"قُلْ سِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ بَدَأَ الْخَلْقَ ۚ ثُمَّ اللَّهُ يُنْشِئُ النَّشْأَةَ الْآخِرَةَ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"qul siiruu fii al-ardhi faunzhuruu kayfa bada-a alkhalqa tsumma allaahu yunsyi-u alnnasy-ata al-aakhirata inna allaaha 'alaa kulli syay-in qadiirun","translate":{"id":"Katakanlah: \"Berjalanlah di (muka) bumi, maka perhatikanlah bagaimana Allah menciptakan (manusia) dari permulaannya, kemudian Allah menjadikannya sekali lagi . Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\n","en":"Say: “Go all over the earth and behold how [wondrously] He has created [man] in the first in­stance: and thus, too, will God bring into being your second life for, verily, God has the power to will anything!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3360","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3360.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3360.mp3"]}},{"no":21,"arab":"يُعَذِّبُ مَنْ يَشَاءُ وَيَرْحَمُ مَنْ يَشَاءُ ۖ وَإِلَيْهِ تُقْلَبُونَ","latin":"yu'adzdzibu man yasyaau wayarhamu man yasyaau wa-ilayhi tuqlabuuna","translate":{"id":"Allah mengazab siapa yang dikehendaki-Nya, dan memberi rahmat kepada siapa yang dikehendaki-Nya, dan hanya kepada-Nya-lah kamu akan dikembalikan.\n","en":"He causes to suffer whomever He wills, and bestows His mercy on whomever He wills; and unto Him you shall be made to return:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3361","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3361.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3361.mp3"]}},{"no":22,"arab":"وَمَا أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ ۖ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ","latin":"wamaa antum bimu'jiziina fii al-ardhi walaa fii alssamaa-i wamaa lakum min duuni allaahi min waliyyin walaa nashiirin","translate":{"id":"Dan kamu sekali-kali tidak dapat melepaskan diri (dari azab Allah) di bumi dan tidak (pula) di langit dan sekali-kali tiadalah bagimu pelindung dan penolong selain Allah.\n","en":"and never - not on earth and not in the skies - can you [hope to] elude Him: and you have none to protect you from God, and none to bring you succour.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3362","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3362.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3362.mp3"]}},{"no":23,"arab":"وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ وَلِقَائِهِ أُولَٰئِكَ يَئِسُوا مِنْ رَحْمَتِي وَأُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ","latin":"waalladziina kafaruu bi-aayaati allaahi waliqaa-ihi ulaa-ika ya-isuu min rahmatii waulaa-ika lahum 'adzaabun aliimun","translate":{"id":"Dan orang-orang yang kafir terhadap ayat-ayat Allah dan pertemuan dengan Dia, mereka putus asa dari rahmat-Ku, dan mereka itu mendapat azab yang pedih.\n","en":"And [thus it is:] they who are bent on denying the truth of God’s messages and of their [ultimate] meeting with Him - it is they who abandon all hope of My grace and mercy: and it is they whom grievous suffering awaits [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3363","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3363.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3363.mp3"]}},{"no":24,"arab":"فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا اقْتُلُوهُ أَوْ حَرِّقُوهُ فَأَنْجَاهُ اللَّهُ مِنَ النَّارِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ","latin":"famaa kaana jawaaba qawmihi illaa an qaaluu uqtuluuhu aw harriquuhu fa-anjaahu allaahu mina alnnaari inna fii dzaalika laaayaatin liqawmin yu/minuuna","translate":{"id":"Maka tidak adalah jawaban kaum Ibrahim, selain mengatakan: \"Bunuhlah atau bakarlah dia\", lalu Allah menyelamatkannya dari api. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran Allah bagi orang-orang yang beriman.\n","en":"Now [as for Abraham,] his people’s only answer was, “Slay him, or burn him!” – but God saved him from the fire. Behold, in this [story] there are messages indeed for people who will believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3364","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3364.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3364.mp3"]}},{"no":25,"arab":"وَقَالَ إِنَّمَا اتَّخَذْتُمْ مِنْ دُونِ اللَّهِ أَوْثَانًا مَوَدَّةَ بَيْنِكُمْ فِي الْحَيَاةِ الدُّنْيَا ۖ ثُمَّ يَوْمَ الْقِيَامَةِ يَكْفُرُ بَعْضُكُمْ بِبَعْضٍ وَيَلْعَنُ بَعْضُكُمْ بَعْضًا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُمْ مِنْ نَاصِرِينَ","latin":"waqaala innamaa ittakhadztum min duuni allaahi awtsaanan mawaddata baynikum fii alhayaati alddunyaa tsumma yawma alqiyaamati yakfuru ba'dhukum biba'dhin wayal'anu ba'dhukum ba'dhan wama-waakumu alnnaaru wamaa lakum min naasiriina","translate":{"id":"Dan berkata Ibrahim: \"Sesungguhnya berhala-berhala yang kamu sembah selain Allah adalah untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan dunia ini kemudian di hari kiamat sebahagian kamu mengingkari sebahagian (yang lain) dan sebahagian kamu mela'nati sebahagian (yang lain); dan tempat kembalimu ialah neraka, dan sekali-kali tak ada bagimu para penolongpun.\n","en":"And [Abraham] said: “You have chosen to worship idols instead of God for no other reason than to have a bond of love in the life of this world, between yourselves [and your forebears]: but then, on Resurrection Day, you shall disown one another and curse one another - for the goal of you all will be the fire, and you will have none to succour you."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3365","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3365.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3365.mp3"]}},{"no":26,"arab":"فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي ۖ إِنَّهُ هُوَ الْعَزِيزُ الْحَكِيمُ","latin":"faaamana lahu luuthun waqaala innii muhaajirun ilaa rabbii innahu huwa al'aziizu alhakiimu","translate":{"id":"Maka Luth membenarkan (kenabian)nya. Dan berkatalah Ibrahim: \"Sesungguhnya aku akan berpindah ke (tempat yang diperintahkan) Tuhanku (kepadaku); sesungguhnya Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"Thereupon [his brother’s son] Lot came to believe in him and said: “Verily, I [too] shall forsake the domain of evil [and turn] to my Sustainer: for, verily, He alone is almighty, truly wise!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3366","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3366.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3366.mp3"]}},{"no":27,"arab":"وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ وَآتَيْنَاهُ أَجْرَهُ فِي الدُّنْيَا ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ","latin":"wawahabnaa lahu ishaaqa waya'quuba waja'alnaa fii dzurriyyatihi alnnubuwwata waalkitaaba waaataynaahu ajrahu fii alddunyaa wa-innahu fii al-aakhirati lamina alshshaalihiina","translate":{"id":"Dan Kami anugrahkan kepda Ibrahim, Ishak dan Ya'qub, dan Kami jadikan kenabian dan Al Kitab pada keturunannya, dan Kami berikan kepadanya balasannya di dunia ; dan sesungguhnya dia di akhirat, benar-benar termasuk orang-orang yang saleh.\n","en":"And [as for Abraham,] We bestowed upon him Isaac and [Isaac’s son] Jacob, and caused pro­phethood and revelation to continue among his offspring. And We vouchsafed him his reward in this world; and, verily, in the life to come [too] he shall find himself among the righteous."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3367","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3367.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3367.mp3"]}},{"no":28,"arab":"وَلُوطًا إِذْ قَالَ لِقَوْمِهِ إِنَّكُمْ لَتَأْتُونَ الْفَاحِشَةَ مَا سَبَقَكُمْ بِهَا مِنْ أَحَدٍ مِنَ الْعَالَمِينَ","latin":"waluuthan idz qaala liqawmihi innakum lata/tuuna alfaahisyata maa sabaqakum bihaa min ahadin mina al'aalamiina","translate":{"id":"Dan (ingatlah) ketika Luth berkata pepada kaumnya: \"Sesungguhnya kamu benar-benar mengerjakan perbuatan yang amat keji yang belum pernah dikerjakan oleh seorangpun dari umat-umat sebelum kamu\".\n","en":"And Lot, [too, was inspired by Us] when he said unto his people: “Verily, you commit abominations such as none in all the world has ever committed before you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3368","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3368.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3368.mp3"]}},{"no":29,"arab":"أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ وَتَقْطَعُونَ السَّبِيلَ وَتَأْتُونَ فِي نَادِيكُمُ الْمُنْكَرَ ۖ فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا ائْتِنَا بِعَذَابِ اللَّهِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ","latin":"a-innakum lata/tuuna alrrijaala wataqtha'uuna alssabiila wata/tuuna fii naadiikumu almunkara famaa kaana jawaaba qawmihi illaa an qaaluu i/tinaa bi'adzaabi allaahi in kunta mina alshshaadiqiina","translate":{"id":"Apakah sesungguhnya kamu patut mendatangi laki-laki, menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu? Maka jawaban kaumnya tidak lain hanya mengatakan: \"Datangkanlah kepada kami azab Allah, jika kamu termasuk orang-orang yang benar\".\n","en":"Must you indeed approach men [with lust], and thus cut across the way [of nature]? and must you commit these shameful deeds in your open] assemblies?” But his people’s only answer was, “Bring down upon us God’s chastisement, if thou art a man of truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3369","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3369.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3369.mp3"]}},{"no":30,"arab":"قَالَ رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ","latin":"qaala rabbi unshurnii 'alaa alqawmi almufsidiina","translate":{"id":"Luth berdo'a: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\".\n","en":"[And] he prayed: “O my Sustainer! Succour Thou me against these people who spread corrup­tion!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3370","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3370.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3370.mp3"]}},{"no":31,"arab":"وَلَمَّا جَاءَتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُشْرَىٰ قَالُوا إِنَّا مُهْلِكُو أَهْلِ هَٰذِهِ الْقَرْيَةِ ۖ إِنَّ أَهْلَهَا كَانُوا ظَالِمِينَ","latin":"walammaa jaa-at rusulunaa ibraahiima bialbusyraa qaaluu innaa muhlikuu ahli haadzihi alqaryati inna ahlahaa kaanuu zhaalimiina","translate":{"id":"Dan tatkala utusan Kami (para malaikat) datang kepada Ibrahim membawa kabar gembira , mereka mengatakan: \"Sesungguhnya kami akan menghancurkan penduduk negeri (Sodom) ini; sesungguhnya penduduknya adalah orang-orang yang zalim\".\n","en":"And so, when Our [heavenly] messengers came to Abraham with the glad tiding [of the birth of Isaac], they [also] said, “Behold, we are about to destroy the people of that land, for its people are truly evildoers!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3371","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3371.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3371.mp3"]}},{"no":32,"arab":"قَالَ إِنَّ فِيهَا لُوطًا ۚ قَالُوا نَحْنُ أَعْلَمُ بِمَنْ فِيهَا ۖ لَنُنَجِّيَنَّهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ","latin":"qaala inna fiihaa luuthan qaaluu nahnu a'lamu biman fiihaa lanunajjiyannahu wa-ahlahu illaa imra-atahu kaanat mina alghaabiriina","translate":{"id":"Berkata Ibrahim: \"Sesungguhnya di kota itu ada Luth\". Para malaikat berkata : \"Kami lebih mengetahui siapa yang ada di kota itu. Kami sungguh-sungguh akan menyelamatkan dia dan pengikut-pengikutnya kecuali isterinya. Dia adalah termasuk orang-orang yang tertinggal (dibinasakan).\n","en":"[And when Abraham] exclaimed, “But Lot lives there!” - they answered: We know fully well who is there; most certainly we shall save him and his household - all but his wife: she will indeed be among those that stay behind.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3372","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3372.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3372.mp3"]}},{"no":33,"arab":"وَلَمَّا أَنْ جَاءَتْ رُسُلُنَا لُوطًا سِيءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالُوا لَا تَخَفْ وَلَا تَحْزَنْ ۖ إِنَّا مُنَجُّوكَ وَأَهْلَكَ إِلَّا امْرَأَتَكَ كَانَتْ مِنَ الْغَابِرِينَ","latin":"walammaa an jaa-at rusulunaa luuthan sii-a bihim wadaaqa bihim dzar'an waqaaluu laa takhaf walaa tahzan innaa munajjuuka wa-ahlaka illaa imra-ataka kaanat mina alghaabiriina","translate":{"id":"Dan tatkala datang utusan-utusan Kami (para malaikat) itu kepada Luth, dia merasa susah karena (kedatangan) mereka , dan (merasa) tidak punya kekuatan untuk melindungi mereka dan mereka berkata: \"Janganlah kamu takut dan jangan (pula) susah. Sesungguhnya kami akan menyelamatkan kamu dan pengikut-pengikutmu, kecuali isterimu, dia adalah termasuk orang-orang yang tertinggal (dibinasakan)\".\n","en":"And when Our messengers came unto Lot, he was sorely grieved on their account, seeing that it was beyond his power to shield them; but they said: “Fear not, and grieve not! Behold, we shall save thee and thy household - all but thy wife: she will indeed be among those that stay behind."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3373","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3373.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3373.mp3"]}},{"no":34,"arab":"إِنَّا مُنْزِلُونَ عَلَىٰ أَهْلِ هَٰذِهِ الْقَرْيَةِ رِجْزًا مِنَ السَّمَاءِ بِمَا كَانُوا يَفْسُقُونَ","latin":"innaa munziluuna 'alaa ahli haadzihi alqaryati rijzan mina alssamaa-i bimaa kaanuu yafsuquuna","translate":{"id":"Sesungguhnya Kami akan menurunkan azab dari langit atas penduduk kota ini karena mereka berbuat fasik.\n","en":"Verily, we shall bring down upon the people of this land a horror from heaven in requital of all their iniquitous doings!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3374","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3374.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3374.mp3"]}},{"no":35,"arab":"وَلَقَدْ تَرَكْنَا مِنْهَا آيَةً بَيِّنَةً لِقَوْمٍ يَعْقِلُونَ","latin":"walaqad taraknaa minhaa aayatan bayyinatan liqawmin ya'qiluuna","translate":{"id":"Dan sesungguhnya Kami tinggalkan daripadanya satu tanda yang nyata bagi orang-orang yang berakal.\n","en":"And [so it happened; and] thereof, indeed, We have left a clear sign for people who use their reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3375","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3375.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3375.mp3"]}},{"no":36,"arab":"وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ وَارْجُوا الْيَوْمَ الْآخِرَ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ","latin":"wa-ilaa madyana akhaahum syu'ayban faqaala yaa qawmi u'buduu allaaha waurjuu alyawma al-aakhira walaa ta'tsaw fii al-ardhi mufsidiina","translate":{"id":"Dan (Kami telah mengutus) kepada penduduk Mad-yan, saudara mereka Syu'aib, maka ia berkata: \"Hai kaumku, sembahlah olehmu Allah, harapkanlah (pahala) hari akhir, dan jangan kamu berkeliaran di muka bumi berbuat kerusakan\".\n","en":"AND UNTO [the people of] Madyan [We sent] their brother Shu’ayb who thereupon said: “O my peo­ple! Worship God [alone], and look forward to the Last Day, and do not act wickedly on earth by spreading corruption!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3376","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3376.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3376.mp3"]}},{"no":37,"arab":"فَكَذَّبُوهُ فَأَخَذَتْهُمُ الرَّجْفَةُ فَأَصْبَحُوا فِي دَارِهِمْ جَاثِمِينَ","latin":"fakadzdzabuuhu fa-akhadzat-humu alrrajfatu fa-ashbahuu fii daarihim jaatsimiina","translate":{"id":"Maka mereka mendustakan Syu'aib, lalu mereka ditimpa gempa yang dahsyat, dan jadilah mereka mayat-mayat yang bergelimpangan di tempat-tempat tinggal mereka.\n","en":"But they gave him the lie. Thereupon an earthquake overtook them: and then they lay lifeless, in their very homes, on the ground."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3377","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3377.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3377.mp3"]}},{"no":38,"arab":"وَعَادًا وَثَمُودَ وَقَدْ تَبَيَّنَ لَكُمْ مِنْ مَسَاكِنِهِمْ ۖ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ وَكَانُوا مُسْتَبْصِرِينَ","latin":"wa'aadan watsamuuda waqad tabayyana lakum min masaakinihim wazayyana lahumu alsysyaythaanu a'maalahum fashaddahum 'ani alssabiili wakaanuu mustabshiriina","translate":{"id":"Dan (juga) kaum 'Aad dan Tsamud, dan sungguh telah nyata bagi kamu (kehancuran mereka) dari (puing-puing) tempat tinggal mereka. Dan syaitan menjadikan mereka memandang baik perbuatan-perbuatan mereka, lalu ia menghalangi mereka dari jalan (Allah), sedangkan mereka adalah orang-orang berpandangan tajam,\n","en":"AND [the tribes of] Ad and Thamud [too, did We destroy -] as should have become obvious to you from [whatever there remains of] their dwellings. [They perished] because Satan had made their [sinful] doings seem goodly to them, and thus had barred them from the path [of God] despite their having been endowed with the ability to perceive the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3378","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3378.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3378.mp3"]}},{"no":39,"arab":"وَقَارُونَ وَفِرْعَوْنَ وَهَامَانَ ۖ وَلَقَدْ جَاءَهُمْ مُوسَىٰ بِالْبَيِّنَاتِ فَاسْتَكْبَرُوا فِي الْأَرْضِ وَمَا كَانُوا سَابِقِينَ","latin":"waqaaruuna wafir'awna wahaamaana walaqad jaa-ahum muusaa bialbayyinaati faistakbaruu fii al-ardhi wamaa kaanuu saabiqiina","translate":{"id":"dan (juga) Karun, Fir'aun dan Haman. Dan sesungguhnya telah datang kepada mereka Musa dengan (membawa bukti-bukti) keterangan-keterangan yang nyata. Akan tetapi mereka berlaku sombong di (muka) bumi, dan tiadalah mereka orang-orang yang luput (dari kehancuran itu).\n","en":"And [thus, too, did We deal with] Qarun and Pharaoh, and Haman: to them had come Moses with all evidence of the truth, but they behaved arrogantly on earth [and rejected him]; and withal, they could not escape [Us]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3379","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3379.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3379.mp3"]}},{"no":40,"arab":"فَكُلًّا أَخَذْنَا بِذَنْبِهِ ۖ فَمِنْهُمْ مَنْ أَرْسَلْنَا عَلَيْهِ حَاصِبًا وَمِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَمِنْهُمْ مَنْ خَسَفْنَا بِهِ الْأَرْضَ وَمِنْهُمْ مَنْ أَغْرَقْنَا ۚ وَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ","latin":"fakullan akhadznaa bidzanbihi faminhum man arsalnaa 'alayhi hasiban waminhum man akhadzat-hu alshshayhatu waminhum man khasafnaa bihi al-ardha waminhum man aghraqnaa wamaa kaana allaahu liyazhlimahum walaakin kaanuu anfusahum yazhlimuuna","translate":{"id":"Maka masing-masing (mereka itu) Kami siksa disebabkan dosanya, maka di antara mereka ada yang Kami timpakan kepadanya hujan batu kerikil dan di antara mereka ada yang ditimpa suara keras yang mengguntur, dan di antara mereka ada yang Kami benamkan ke dalam bumi, dan di antara mereka ada yang Kami tenggelamkan, dan Allah sekali-kali tidak hendak menganiaya mereka, akan tetapi merekalah yang menganiaya diri mereka sendiri.\n","en":"For, every one of them, did We take to task for his sin: and so, upon some of them We let loose a deadly storm wind; and some of them were overtaken by a [sudden] blast; and some of them We caused to be swallowed by the earth: and some of them We caused to drown. And it was not God who wronged them, but it was they who had wronged themselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3380","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3380.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3380.mp3"]}},{"no":41,"arab":"مَثَلُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ كَمَثَلِ الْعَنْكَبُوتِ اتَّخَذَتْ بَيْتًا ۖ وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنْكَبُوتِ ۖ لَوْ كَانُوا يَعْلَمُونَ","latin":"matsalu alladziina ittakhadzuu min duuni allaahi awliyaa-a kamatsali al'ankabuuti ittakhadzat baytan wa-inna awhana albuyuuti labaytu al'ankabuuti law kaanuu ya'lamuuna","translate":{"id":"Perumpamaan orang-orang yang mengambil pelindung-pelindung selain Allah adalah seperti laba-laba yang membuat rumah. Dan sesungguhnya rumah yang paling lemah adalah rumah laba-laba kalau mereka mengetahui.\n","en":"The parable of those who take [beings or forces] other than God for their protectors is that of the spider which makes for itself a house: for, behold, the frailest of all houses is the spiders house. Could they but understand this!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3381","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3381.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3381.mp3"]}},{"no":42,"arab":"إِنَّ اللَّهَ يَعْلَمُ مَا يَدْعُونَ مِنْ دُونِهِ مِنْ شَيْءٍ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"inna allaaha ya'lamu maa yad'uuna min duunihi min syay-in wahuwa al'aziizu alhakiimu","translate":{"id":"Sesungguhnya Allah mengetahui apa saja yang mereka seru selain Allah. Dan Dia Maha Perkasa lagi Maha Bijaksana.\n","en":"Verily, God knows whatever it is that men invoke instead of Him for He alone is almighty, truly wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3382","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3382.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3382.mp3"]}},{"no":43,"arab":"وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ ۖ وَمَا يَعْقِلُهَا إِلَّا الْعَالِمُونَ","latin":"watilka al-amtsaalu nadhribuhaa lilnnaasi wamaa ya'qiluhaa illaa al'aalimuuna","translate":{"id":"Dan perumpamaan=perumpamaan ini Kami buat untuk manusia; dan tiada yang memahaminya kecuali orang-orang yang berilmu.\n","en":"And so We propound these parables unto man: but none can grasp their innermost meaning save those who [of Us] are aware"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3383","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3383.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3383.mp3"]}},{"no":44,"arab":"خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِلْمُؤْمِنِينَ","latin":"khalaqa allaahu alssamaawaati waal-ardha bialhaqqi inna fii dzaalika laaayatan lilmu-miniina","translate":{"id":"Allah menciptakan langit dan bumi dengan hak . Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi orang-orang mu'min.\n","en":"[and hence are certain that] God has created the heavens and the earth in accordance with [an inner] truth: for, behold, in this [very creation] there is a message indeed for all who believe [in Him]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3384","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3384.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3384.mp3"]}},{"no":45,"arab":"اتْلُ مَا أُوحِيَ إِلَيْكَ مِنَ الْكِتَابِ وَأَقِمِ الصَّلَاةَ ۖ إِنَّ الصَّلَاةَ تَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ ۗ وَلَذِكْرُ اللَّهِ أَكْبَرُ ۗ وَاللَّهُ يَعْلَمُ مَا تَصْنَعُونَ","latin":"utlu maa uuhiya ilayka mina alkitaabi wa-aqimi alshshalaata inna alshshalaata tanhaa 'ani alfahsyaa-i waalmunkari waladzikru allaahi akbaru waallaahu ya'lamu maa tashna'uuna","translate":{"id":"Bacalah apa yang telah diwahyukan kepadamu, yaitu Al Kitab (Al Qur'an) dan dirikanlah shalat. Sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar. Dan sesungguhnya mengingat Allah (shalat) adalah lebih besar (keutamaannya dari ibadat-ibadat yang lain). Dan Allah mengetahui apa yang kamu kerjakan.\n","en":"CONVEY [unto others] whatever of this divine writ has been revealed unto thee, and be constant in prayer: for, behold, prayer restrains [man] from loathsome deeds and from all that runs counter to reason; and remembrance of God is indeed the greatest [good]. And God knows all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3385","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3385.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3385.mp3"]}},{"no":46,"arab":"وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ","latin":"walaa tujaadiluu ahla alkitaabi illaa biallatii hiya ahsanu illaa alladziina zhalamuu minhum waquuluu aamannaa bialladzii unzila ilaynaa waunzila ilaykum wa-ilaahunaa wa-ilaahukum waahidun wanahnu lahu muslimuuna","translate":{"id":"Dan janganlah kamu berdebat dengan Ahli Kitab, melainkan dengan cara yang paling baik, kecuali dengan orang-orang zalim di antara mereka , dan katakanlah: \"Kami telah beriman kepada (kitab-kitab) yang diturunkan kepada kami dan yang diturunkan kepadamu; Tuhan kami dan Tuhanmu adalah satu; dan kami hanya kepada-Nya berserah diri\".\n","en":"And do not argue with the followers of earlier revelation otherwise than in a most kindly manner - unless it be such of them as are bent on evildoing and say: “We believe in that which has been be­stowed from on high upon us, as well as that which has been bestowed upon you: or our God and your God is one and the same, and it is unto Him that We [all] surrender ourselves.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3386","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3386.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3386.mp3"]}},{"no":47,"arab":"وَكَذَٰلِكَ أَنْزَلْنَا إِلَيْكَ الْكِتَابَ ۚ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ ۖ وَمِنْ هَٰؤُلَاءِ مَنْ يُؤْمِنُ بِهِ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ","latin":"wakadzaalika anzalnaa ilayka alkitaaba faalladziina aataynaahumu alkitaaba yu/minuuna bihi wamin haaulaa-i man yu/minu bihi wamaa yajhadu bi-aayaatinaa illaa alkaafiruuna","translate":{"id":"Dan demikian (pulalah) Kami turunkan kepadamu Al Kitab (Al Qur'an). Maka orang-orang yang telah kami berikan kepada mereka Al-Kitab (Taurat) mereka beriman kepadanya (Al Qur'an) ; dan di antara mereka (orang-orang kafir Mekah) ada yang beriman kepadanya. Dan tiadalah yang mengingkari ayat-ayat kami selain orang-orang kafir.\n","en":"For it is thus that We have bestowed this divine writ from on high upon thee [O Muhammad]. And they to whom we have vouchsafed this divine writ believe in it just as among those [followers of earlier revelation] there are some who believe in it. And none could knowingly reject Our messages unless it be such as would deny [an obvious] truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3387","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3387.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3387.mp3"]}},{"no":48,"arab":"وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ ۖ إِذًا لَارْتَابَ الْمُبْطِلُونَ","latin":"wamaa kunta tatluu min qablihi min kitaabin walaa takhuththhuhu biyamiinika idzan lairtaaba almubthiluuna","translate":{"id":"Dan kamu tidak pernah membaca sebelumnya (Al Qur'an) sesuatu Kitabpun dan kamu tidak (pernah) menulis suatu Kitab dengan tangan kananmu; andaikata (kamu pernah membaca dan menulis), benar-benar ragulah orang yang mengingkari(mu).\n","en":"for, [O Muhammad,] thou hast never been able to recite any divine writ ere this one [was revealed], nor didst thou ever transcribe one with your own hand or else, they who try to disprove the truth [of thy revelation] might indeed have had cause to doubt [it]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3388","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3388.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3388.mp3"]}},{"no":49,"arab":"بَلْ هُوَ آيَاتٌ بَيِّنَاتٌ فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الظَّالِمُونَ","latin":"bal huwa aayaatun bayyinaatun fii shuduuri alladziina uutuu al'ilma wamaa yajhadu bi-aayaatinaa illaa alzhzhaalimuuna","translate":{"id":"Sebenarnya, Al Qur'an itu adalah ayat-ayat yang nyata di dalam dada orang-orang yang diberi ilmu . Dan tidak ada yang mengingkari ayat-ayat Kami kecuali orang-orang yang zalim.\n","en":"Nay, but this [divine writ] consists of messages clear to the hearts of all who are gifted with [innate] knowledge and none could knowingly reject Our messages unless it be such as would do wrong [to themselves]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3389","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3389.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3389.mp3"]}},{"no":50,"arab":"وَقَالُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَاتٌ مِنْ رَبِّهِ ۖ قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ","latin":"waqaaluu lawlaa unzila 'alayhi aayaatun min rabbihi qul innamaa al-aayaatu 'inda allaahi wa-innamaa anaa nadziirun mubiinun","translate":{"id":"Dan orang-orang kafir Mekah berkata: \"Mengapa tidak diturunkan kepadanya mu'jizat-mu'jizat dari Tuhannya?\" Katakanlah: \"Sesungguhnya mu'jizat-mu'jizat itu terserah kepada Allah. Dan sesungguhnya aku hanya seorang pemberi peringatan yang nyata\".\n","en":"And yet they say, “Why have no miraculous signs ever been bestowed upon him from on high by his Sustainer?” Say: “Miracles are in the power of God alone; and as for me - I am but a plain warner.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3390","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3390.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3390.mp3"]}},{"no":51,"arab":"أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَىٰ عَلَيْهِمْ ۚ إِنَّ فِي ذَٰلِكَ لَرَحْمَةً وَذِكْرَىٰ لِقَوْمٍ يُؤْمِنُونَ","latin":"awa lam yakfihim annaa anzalnaa 'alayka alkitaaba yutlaa 'alayhim inna fii dzaalika larahmatan wadzikraa liqawmin yu/minuuna","translate":{"id":"Dan apakah tidak cukup bagi mereka bahwasanya Kami telah menurunkan kepadamu Al Kitab (Al Qur'an) sedang dia dibacakan kepada mereka? Sesungguhnya dalam (Al Qur'an) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman.\n","en":"Why - is it not enough for them that We have bestowed this divine writ on thee from on high, to be conveyed [by thee] to them? For, verily, in it is [manifested Our] grace, and a reminder to people who will believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3391","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3391.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3391.mp3"]}},{"no":52,"arab":"قُلْ كَفَىٰ بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيدًا ۖ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","latin":"qul kafaa biallaahi baynii wabaynakum syahiidan ya'lamu maa fii alssamaawaati waal-ardhi waalladziina aamanuu bialbaathili wakafaruu biallaahi ulaa-ika humu alkhaasiruuna","translate":{"id":"Katakanlah: \"Cukuplah Allah menjadi saksi antaraku dan antaramu. Dia mengetahui apa yang di langit dan di bumi. Dan orang-orang yang percaya kepada yang batil dan ingkar kepada Allah, mereka itulah orang-orang yang merugi.\n","en":"Say [unto those who will not believe]: “God is witness enough between me and you! He knows all that is in the heavens and on earth; and they who are bent on believing in what is false and vain, and thus on denying God - it is they, they who shall be the losers!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3392","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3392.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3392.mp3"]}},{"no":53,"arab":"وَيَسْتَعْجِلُونَكَ بِالْعَذَابِ ۚ وَلَوْلَا أَجَلٌ مُسَمًّى لَجَاءَهُمُ الْعَذَابُ وَلَيَأْتِيَنَّهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","latin":"wayasta'jiluunaka bial'adzaabi walawlaa ajalun musamman lajaa-ahumu al'adzaabu walaya/tiyannahum baghtatan wahum laa yasy'uruuna","translate":{"id":"Dan mereka meminta kepadamu supaya segera diturunkan azab. Kalau tidaklah karena waktu yang telah ditetapkan , benar-benar telah datang azab kepada mereka, dan azab itu benar-benar akan datang kepada mereka dengan tiba-tiba, sedang mereka tidak menyadarinya.\n","en":"Now they challenge thee to hasten the coming upon them of [God’s] chastisement: and indeed, had not a term been set [for it by God], that suffering would already have come upon them! But indeed, it will most certainly come upon them of a sudden, and they will be taken unawares."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3393","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3393.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3393.mp3"]}},{"no":54,"arab":"يَسْتَعْجِلُونَكَ بِالْعَذَابِ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ","latin":"wayasta'jiluunaka bial'adzaabi walawlaa ajalun musamman lajaa-ahumu al'adzaabu walaya/tiyannahum baghtatan wahum laa yasy'uruuna","translate":{"id":"Mereka meminta kepadamu supaya segera diturunkan azab. Dan sesungguhnya Jahannam benar-benar meliputi orang-orang yang kafir,\n","en":"They challenge thee to hasten the coming upon them of [God’s] chastisement: but, verily, hell is bound to encompass all who deny the truth –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3394","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3394.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3394.mp3"]}},{"no":55,"arab":"يَوْمَ يَغْشَاهُمُ الْعَذَابُ مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ وَيَقُولُ ذُوقُوا مَا كُنْتُمْ تَعْمَلُونَ","latin":"yawma yaghsyaahumu al'adzaabu min fawqihim wamin tahti arjulihim wayaquulu dzuuquu maa kuntum ta'maluuna","translate":{"id":"pada hari mereka ditutup oleh azab dari atas mereka dan dari bawah kaki mereka dan Allah berkata (kepada mereka): \"Rasailah (pembalasan dari) apa yang telah kamu kerjakan\".\n","en":"[encompass them] on the Day when suffering will overwhelm them from above them and from beneath their feet, whereupon He shall say: “Taste [now the fruit of] your own doings!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3395","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3395.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3395.mp3"]}},{"no":56,"arab":"يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ","latin":"yaa 'ibaadiya alladziina aamanuu inna ardhii waasi'atun fa-iyyaaya fau'buduuni","translate":{"id":"Hai hamba-hamba-Ku yang beriman, sesungguhnya bumi-Ku luas, maka sembahlah Aku saja.\n","en":"O YOU servants of Mine who have attained to faith! Behold, wide is Mine earth: worship Me, then, Me alone!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3396","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3396.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3396.mp3"]}},{"no":57,"arab":"كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ ۖ ثُمَّ إِلَيْنَا تُرْجَعُونَ","latin":"kullu nafsin dzaa-iqatu almawti tsumma ilaynaa turja'uuna","translate":{"id":"Tiap-tiap yang berjiwa akan merasakan mati. Kemudian hanyalah kepada Kami kamu dikembalikan.\n","en":"Every human being is bound to taste death, [and] in the end unto Us shall all be brought back:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3397","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3397.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3397.mp3"]}},{"no":58,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَنُبَوِّئَنَّهُمْ مِنَ الْجَنَّةِ غُرَفًا تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ نِعْمَ أَجْرُ الْعَامِلِينَ","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati lanubawwi-annahum mina aljannati ghurafan tajrii min tahtihaa al-anhaaru khaalidiina fiihaa ni'ma ajru al'aamiliina","translate":{"id":"Dan orang-orang yang beriman dan mengerjakan amal-amal yang saleh, sesungguhnya akan Kami tempatkan mereka pada tempat-tempat yang tinggi di dalam syurga, yang mengalir sungai-sungai di bawahnya, mereka kekal di dalamnya. Itulah sebaik-baik pembalasan bagi orang-orang yang beramal,\n","en":"whereupon unto those who have attained to faith and wrought good works We shall most certainly assign mansions in that paradise through which run­ning waters flow, therein to abide: how excellent a reward for those who labour –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3398","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3398.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3398.mp3"]}},{"no":59,"arab":"الَّذِينَ صَبَرُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","latin":"alladziina shabaruu wa'alaa rabbihim yatawakkaluuna","translate":{"id":"(yaitu) yang bersabar dan bertawakkal kepada Tuhannya.\n","en":"those who are patient in adversity and in their Sustainer place their trust!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3399","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3399.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3399.mp3"]}},{"no":60,"arab":"وَكَأَيِّنْ مِنْ دَابَّةٍ لَا تَحْمِلُ رِزْقَهَا اللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","latin":"waka-ayyin min daabbatin laa tahmilu rizqahaa allaahu yarzuquhaa wa-iyyaakum wahuwa alssamii'u al'aliimu","translate":{"id":"Dan berapa banyak binatang yang tidak (dapat) membawa (mengurus) rezkinya sendiri. Allah-lah yang memberi rezki kepadanya dan kepadamu dan Dia Maha Mendengar lagi Maha Mengetahui.\n","en":"And how many a living creature is there that takes no thought of its own sustenance; [the while] God provides for it as [He provides] for you - since He alone is all-hearing, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3400","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3400.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3400.mp3"]}},{"no":61,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ","latin":"wala-in sa-altahum man khalaqa alssamaawaati waal-ardha wasakhkhara alsysyamsa waalqamara layaquulunna allaahu fa-annaa yu/fakuuna","translate":{"id":"Dan sesungguhnya jika kamu tanyakan kepada mereka: \"Siapakah yang menjadikan langit dan bumi dan menundukkan matahari dan bulan?\" Tentu mereka akan menjawab: \"Allah\", maka betapakah mereka (dapat) dipalingkan (dari jalan yang benar).\n","en":"And thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth, and made the sun and the moon subservi­ent [to His laws]?” - they will surely answer, “God.” How perverted, then, are their minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3401","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3401.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3401.mp3"]}},{"no":62,"arab":"اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"allaahu yabsuthu alrrizqa liman yasyaau min 'ibaadihi wayaqdiru lahu inna allaaha bikulli syay-in 'aliimun","translate":{"id":"Allah melapangkan rezki bagi siapa yang dikehendaki-Nya di antara hamba-hamba-Nya dan Dia (pula) yang menyempitkan baginya. Sesungguhnya Allah Maha Mengetahui segala sesuatu.\n","en":"God grants abundant sustenance, or gives it in scant measure, to whichever He wills of His crea­tures: for, behold, God has full knowledge of every­thing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3402","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3402.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3402.mp3"]}},{"no":63,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ نَزَّلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ مِنْ بَعْدِ مَوْتِهَا لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْقِلُونَ","latin":"wala-in sa-altahum man nazzala mina alssamaa-i maa-an fa-ahyaa bihi al-ardha min ba'di mawtihaa layaquulunna allaahu quli alhamdu lillaahi bal aktsaruhum laa ya'qiluuna","translate":{"id":"Dan sesungguhnya jika kamu menanyakan kepada mereka: \"Siapakah yang menurunkan air dari langit lalu menghidupkan dengan air itu bumi sesudah matinya?\" Tentu mereka akan menjawab: \"Allah\", Katakanlah: \"Segala puji bagi Allah\", tetapi kebanyakan mereka tidak memahami(nya).\n","en":"And thus it is: if thou ask them, “Who is it that sends down water from the skies, giving life thereby to the earth after it had been lifeless?” - they will surely answer, “God.” Say thou: “[Since this is so,] all praise is due to God [alone]!” But most of them will not use their reason:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3403","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3403.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3403.mp3"]}},{"no":64,"arab":"وَمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا إِلَّا لَهْوٌ وَلَعِبٌ ۚ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوَانُ ۚ لَوْ كَانُوا يَعْلَمُونَ","latin":"wamaa haadzihi alhayaatu alddunyaa illaa lahwun wala'ibun wa-inna alddaara al-aakhirata lahiya alhayawaanu law kaanuu ya'lamuuna","translate":{"id":"Dan tiadalah kehidupan dunia ini melainkan senda gurau dan main-main. Dan sesungguhnya akhirat itulah yang sebenarnya kehidupan, kalau mereka mengetahui.\n","en":"for, [if they did, they would know that] the life of this world is nothing but a passing delight and a play - whereas, behold, the life in the hereafter is indeed the only [true] life: if they but knew this!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3404","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3404.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3404.mp3"]}},{"no":65,"arab":"فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ","latin":"fa-idzaa rakibuu fii alfulki da'awuu allaaha mukhlishiina lahu alddiina falammaa najjaahum ilaa albarri idzaa hum yusyrikuuna","translate":{"id":"Maka apabila mereka naik kapal mereka mendo'a kepada Allah dengan memurnikan keta'atan kepada-Nya ; maka tatkala Allah menyelamatkan mereka sampai ke darat, tiba-tiba mereka (kembali) mempersekutukan (Allah)\n","en":"And so, when they embark on a ship [and find themselves in danger], they call unto God, [at that moment] sincere in their faith in Him alone; but as soon as He has brought them safe ashore, they [begin to] ascribe to imaginary powers a share in His divinity:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3405","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3405.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3405.mp3"]}},{"no":66,"arab":"لِيَكْفُرُوا بِمَا آتَيْنَاهُمْ وَلِيَتَمَتَّعُوا ۖ فَسَوْفَ يَعْلَمُونَ","latin":"liyakfuruu bimaa aataynaahum waliyatamatta'uu fasawfa ya'lamuuna","translate":{"id":"agar mereka mengingkari nikmat yang telah Kami berikan kepada mereka dan agar mereka (hidup) bersenang-senang (dalam kekafiran). Kelak mereka akan mengetahui (akibat perbuatannya).\n","en":"and thus they show utter ingratitude for all that We have vouchsafed them, and go on [thoughtlessly] enjoying their worldly life."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3406","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3406.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3406.mp3"]}},{"no":67,"arab":"أَوَلَمْ يَرَوْا أَنَّا جَعَلْنَا حَرَمًا آمِنًا وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ يَكْفُرُونَ","latin":"awa lam yaraw annaa ja'alnaa haraman aaminan wayutakhaththhafu alnnaasu min hawlihim afabialbaathili yu/minuuna wabini'mati allaahi yakfuruuna","translate":{"id":"Dan apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan (negeri mereka) tanah suci yang aman, sedang manusia sekitarnya rampok-merampok. Maka mengapa (sesudah nyata kebenaran) mereka masih percaya kepada yang bathil dan ingkar kepada nikmat Allah?\n","en":"Are they, then, not aware that We have set up a sanctuary secure [for those who believe in Us], the while all around them men are being carried away [by fear and despair]? Will they, then, [continue to] believe in things false and vain, and thus deny God’s blessings."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3407","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3407.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3407.mp3"]}},{"no":68,"arab":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِالْحَقِّ لَمَّا جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ","latin":"waman azhlamu mimmani iftaraa 'alaa allaahi kadziban aw kadzdzaba bialhaqqi lammaa jaa-ahu alaysa fii jahannama matswan lilkaafiriina","translate":{"id":"Dan siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kedustaan terhadap Allah atau mendustakan yang hak tatkala yang hak itu datang kepadanya? Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang kafir?\n","en":"And who could be more wicked than he who attributes his own lying inventions to God, or gives the lie to the truth when it comes unto him [through revelation]? Is not hell the [proper] abode for all who [thus] deny the truth?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3408","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3408.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3408.mp3"]}},{"no":69,"arab":"وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا ۚ وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ","latin":"waalladziina jaahaduu fiinaa lanahdiyannahum subulanaa wa-inna allaaha lama'a almuhsiniina","translate":{"id":"Dan orang-orang yang berjihad untuk (mencari keridhaan) Kami, benar-benar akan Kami tunjukkan kepada mereka jalan-jalan Kami. Dan sesungguhnya Allah benar-benar beserta orang-orang yang berbuat baik.\n","en":"But as for those who strive hard in Our cause -We shall most certainly guide them onto paths that lead unto Us: for, behold, God is indeed with the doers of good."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3409","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3409.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3409.mp3"]}}]}