{"alquran":{"no":31,"name":"Luqman","arab":"لقمان","start":3469,"count":34,"rukku":3,"type":"mecca","description":"Surat  Luqman  terdiri   dari   34   ayat,   termasuk   golongan   surat-surat Makkiyyah, diturunkan sesudah surat Ash Shaffaat. <br>Dinamai <i>Luqman</i> karena pada  ayat  12   disebutkan   bahwa   <i>Luqman</i>   telah diberi   oleh   Allah   nikmat   dan   ilmu   pengetahuan,  oleh sebab itu dia bersyukur kepadaNya atas nikmat yang  diberikan  itu.   Dan   pada   ayat   13 sampai 19 terdapat nasihat-nasihat Luqman kepada anaknya.<br>Ini adalah sebagai  isyarat   daripada   Allah   supaya   setiap   ibu   bapak melaksanakan  pula terhadap anak-anak mereka sebagai yang telah dilakukan oleh Luqman."},"surah":[{"no":1,"arab":" الم","latin":"alif-laam-miim","translate":{"id":"Alif Laam Miim ","en":"Alif. Lam. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3470","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3470.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3470.mp3"]}},{"no":2,"arab":"تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ","latin":"tilka aayaatu alkitaabi alhakiimi","translate":{"id":"Inilah ayat-ayat Al Quraan yang mengandung hikmat,\n","en":"THESE ARE MESSAGES of the divine writ, full of wisdom,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3471","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3471.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3471.mp3"]}},{"no":3,"arab":"هُدًى وَرَحْمَةً لِلْمُحْسِنِينَ","latin":"hudan warahmatan lilmuhsiniina","translate":{"id":"menjadi petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan,\n","en":"providing guidance and grace unto the doers of good"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3472","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3472.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3472.mp3"]}},{"no":4,"arab":"الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ يُوقِنُونَ","latin":"alladziina yuqiimuuna alshshalaata wayu/tuuna alzzakaata wahum bial-aakhirati hum yuuqinuuna","translate":{"id":"(yaitu) orang-orang yang mendirikan shalat, menunaikan zakat dan mereka yakin akan adanya negeri akhirat.\n","en":"who are constant in prayer and dispense charity: for it is they, they who in their innermost are certain of the life to come!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3473","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3473.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3473.mp3"]}},{"no":5,"arab":"أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","latin":"ulaa-ika 'alaa hudan min rabbihim waulaa-ika humu almuflihuuna","translate":{"id":"Mereka itulah orang-orang yang tetap mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung.\n","en":"It is they who follow the guidance [that comes to them] from their Sustainer; and it is they, they who shall attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3474","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3474.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3474.mp3"]}},{"no":6,"arab":"وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ","latin":"wamina alnnaasi man yasytarii lahwa alhadiitsi liyudhilla 'an sabiili allaahi bighayri 'ilmin wayattakhidzahaa huzuwan ulaa-ika lahum 'adzaabun muhiinun","translate":{"id":"Dan di antara manusia (ada) orang yang mempergunakan perkataan yang tidak berguna untuk menyesatkan (manusia) dari jalan Allah tanpa pengetahuan dan menjadikan jalan Allah itu olok-olokan. Mereka itu akan memperoleh azab yang menghinakan.\n","en":"But among men there is many a one that prefers a mere play with words [to divine guidance], so as to lead [those] without knowledge astray from the path of God, and to turn it to ridicule: for such there is shameful suffering in store."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3475","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3475.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3475.mp3"]}},{"no":7,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا وَلَّىٰ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا كَأَنَّ فِي أُذُنَيْهِ وَقْرًا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ","latin":"wa-idzaa tutlaa 'alayhi aayaatunaa wallaa mustakbiran ka-an lam yasma'haa ka-anna fii udzunayhi waqran fabasysyirhu bi'adzaabin aliimin","translate":{"id":"Dan apabila dibacakan kepadanya ayat-ayat Kami dia berpaling dengan menyombongkan diri seolah-olah dia belum mendengarnya, seakan-akan ada sumbat di kedua telinganya; maka beri kabar gembiralah dia dengan azab yang pedih.\n","en":"For, whenever Our messages are conveyed to such a one, he turns away in his arrogance as though he had not heard them - as though there were deafness in his ears. Give him, then, the tiding of grievous suffering [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3476","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3476.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3476.mp3"]}},{"no":8,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati lahum jannaatu alnna'iimi","translate":{"id":"Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh, bagi mereka syurga-syurga yang penuh keni'matan,\n","en":"[As against this,] verily, those who attain to faith and do righteous deeds shall have gardens of bliss,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3477","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3477.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3477.mp3"]}},{"no":9,"arab":"خَالِدِينَ فِيهَا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"khaalidiina fiihaa wa'da allaahi haqqan wahuwa al'aziizu alhakiimu","translate":{"id":"Kekal mereka di dalamnya; sebagai janji Allah yang benar. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"to abide therein in accordance with God’s true promise: for He alone is almighty, truly wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3478","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3478.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3478.mp3"]}},{"no":10,"arab":"خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ","latin":"khalaqa alssamaawaati bighayri 'amadin tarawnahaa wa-alqaa fii al-ardhi rawaasiya an tamiida bikum wabatstsa fiihaa min kulli daabbatin wa-anzalnaa mina alssamaa-i maa-an fa-anbatnaa fiihaa min kulli zawjin kariimin","translate":{"id":"Dia menciptakan langit tanpa tiang yang kamu melihatnya dan Dia meletakkan gunung-gunung (di permukaan) bumi supaya bumi itu tidak menggoyangkan kamu; dan memperkembang biakkan padanya segala macam jenis binatang. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik.\n","en":"He [it is who] has created the skies without any supports that you could see, and has placed firm mountains upon the earth, lest it sway with you, and has caused all manner of living creatures to multiply thereon. And We send down water from the skies, and thus We cause every noble kind [of life] to grow on earth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3479","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3479.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3479.mp3"]}},{"no":11,"arab":"هَٰذَا خَلْقُ اللَّهِ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ ۚ بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ","latin":"haadzaa khalqu allaahi fa-aruunii maatsaa khalaqa alladziina min duunihi bali alzhzhaalimuuna fii dhalaalin mubiinin","translate":{"id":"Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku apa yang telah diciptakan oleh sembahan-sembahan(mu) selain Allah. Sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata.\n","en":"[All] this is God’s creation: show Me, then, what others than He may have created! Nay, but the evildoers are obviously lost in error!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3480","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3480.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3480.mp3"]}},{"no":12,"arab":"وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ ۚ وَمَنْ يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ ۖ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيدٌ","latin":"walaqad aataynaa luqmaana alhikmata ani usykur lillaahi waman yasykur fa-innamaa yasykuru linafsihi waman kafara fa-inna allaaha ghaniyyun hamiidun","translate":{"id":"Dan sesungguhnya telah Kami berikan hikmat kepada Luqman, yaitu: \"Bersyukurlah kepada Allah. Dan barangsiapa yang bersyukur (kepada Allah), maka sesungguhnya ia bersyukur untuk dirinya sendiri; dan barangsiapa yang tidak bersyukur, maka sesungguhnya Allah Maha Kaya lagi Maha Terpuji\".\n","en":"and, indeed, we granted this wisdom unto Luq­man: “Be grateful unto God - for he who is grateful [unto Him] is but grateful for the good of his own self; whereas he who chooses to be ungrateful [ought to know that], verily, God is self-sufficient, ever to be praised!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3481","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3481.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3481.mp3"]}},{"no":13,"arab":"وَإِذْ قَالَ لُقْمَانُ لِابْنِهِ وَهُوَ يَعِظُهُ يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ ۖ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ","latin":"wa-idz qaala luqmaanu liibnihi wahuwa ya'izhuhu yaa bunayya laa tusyrik biallaahi inna alsysyirka lazhulmun 'azhiimun","translate":{"id":"Dan (ingatlah) ketika Luqman berkata kepada anaknya, di waktu ia memberi pelajaran kepadanya: \"Hai anakku, janganlah kamu mempersekutukan Allah, sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar\".\n","en":"And, lo, Luqman spoke thus unto his son, admonishing him: “O my dear son! Do not ascribe divine powers to aught beside God: for, behold, such [a false] ascribing of divinity is indeed an awesome wrong!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3482","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3482.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3482.mp3"]}},{"no":14,"arab":"وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ","latin":"wawashshaynaa al-insaana biwaalidayhi hamalat-hu ummuhu wahnan 'alaa wahnin wafishaaluhu fii 'aamayni ani usykur lii waliwaalidayka ilayya almashiiru","translate":{"id":"Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapanya; ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam dua tahun . Bersyukurlah kepadaKu dan kepada dua orang ibu bapakmu, hanya kepada-Kulah kembalimu.\n","en":"“And [God says:] ‘We have enjoined upon man goodness towards his parents: his mother bore him by bearing strain upon strain, and his utter dependence on her lasted two years: [hence, O man,] be grateful towards Me and towards thy parents, [and remember that] with Me is all journeys’ end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3483","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3483.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3483.mp3"]}},{"no":15,"arab":"وَإِنْ جَاهَدَاكَ عَلَىٰ أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا ۖ وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ ۚ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"wa-in jaahadaaka 'alaa an tusyrika bii maa laysa laka bihi 'ilmun falaa tuthi'humaa washaahibhumaa fii alddunyaa ma'ruufan waittabi' sabiila man anaaba ilayya tsumma ilayya marji'ukum fa-unabbi-ukum bimaa kuntum ta'maluuna","translate":{"id":"Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku, kemudian hanya kepada-Kulah kembalimu, maka Kuberitakan kepadamu apa yang telah kamu kerjakan.\n","en":"“‘[Revere thy parents;] yet should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey them not; but [even then] bear them company in this world’s life with kindness, and follow the path of those who turn towards Me. In the end, unto Me you all must return; and thereupon I shall make you [truly] understand all that you were doing [in life].’"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3484","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3484.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3484.mp3"]}},{"no":16,"arab":"يَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ ۚ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ","latin":"yaa bunayya innahaa in taku mitsqaala habbatin min khardalin fatakun fii shakhratin aw fii alssamaawaati aw fii al-ardhi ya/ti bihaa allaahu inna allaaha lathiifun khabiirun","translate":{"id":"(Luqman berkata): \"Hai anakku, sesungguhnya jika ada (sesuatu perbuatan) seberat biji sawi, dan berada dalam batu atau di langit atau di dalam bumi, niscaya Allah akan mendatangkannya (membalasinya). Sesungguhnya Allah Maha Halus lagi Maha Mengetahui.\n","en":"“O my dear son,” [continued Luqman,] “verily, if there be but the weight of a mustard-seed, and though it be [hidden] in a rock, or in the skies, or in the earth, God will bring it to light: for, behold, God is unfathomable [in His wisdom], all-aware"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3485","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3485.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3485.mp3"]}},{"no":17,"arab":"يَا بُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ ۖ إِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ","latin":"yaa bunayya aqimi alshshalaata wa/mur bialma'ruufi wainha 'ani almunkari waishbir 'alaa maa ashaabaka inna dzaalika min 'azmi al-umuuri","translate":{"id":"Hai anakku, dirikanlah shalat dan suruhlah (manusia) mengerjakan yang baik dan cegahlah (mereka) dari perbuatan yang mungkar dan bersabarlah terhadap apa yang menimpa kamu. Sesungguhnya yang demikian itu termasuk hal-hal yang diwajibkan (oleh Allah).\n","en":"“O my dear son! Be constant in prayer, and enjoin the doing of what is right and forbid the doing of what is wrong, and bear in patience whatever [ill] may befall thee: this, behold, is something to set one’s heart upon!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3486","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3486.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3486.mp3"]}},{"no":18,"arab":"وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا ۖ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ","latin":"walaa tusha''ir khaddaka lilnnaasi walaa tamsyi fii al-ardhi marahan inna allaaha laa yuhibbu kulla mukhtaalin fakhuurin","translate":{"id":"Dan janganlah kamu memalingkan mukamu dari manusia (karena sombong) dan janganlah kamu berjalan di muka bumi dengan angkuh. Sesungguhnya Allah tidak menyukai orang-orang yang sombong lagi membanggakan diri.\n","en":"“And turn not thy cheek away from people in [false] pride, and walk not haughtily on earth: for, behold, God does not love anyone who, out of self- conceit, acts in a boastful manner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3487","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3487.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3487.mp3"]}},{"no":19,"arab":"وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَ ۚ إِنَّ أَنْكَرَ الْأَصْوَاتِ لَصَوْتُ الْحَمِيرِ","latin":"waiqshid fii masyyika waughdhudh min shawtika inna ankara al-ashwaati lashawtu alhamiiri","translate":{"id":"Dan sederhanalah kamu dalam berjalan dan lunakkanlah suaramu. Sesungguhnya seburuk-buruk suara ialah suara keledai.\n","en":"“Hence, be modest in thy bearing, and lower thy voice: for, behold, the ugliest of all voices is the [loud] voice of asses…”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3488","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3488.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3488.mp3"]}},{"no":20,"arab":"أَلَمْ تَرَوْا أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً ۗ وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ","latin":"alam taraw anna allaaha sakhkhara lakum maa fii alssamaawaati wamaa fii al-ardhi wa-asbagha 'alaykum ni'amahu zhaahiratan wabaathinatan wamina alnnaasi man yujaadilu fii allaahi bighayri 'ilmin walaa hudan walaa kitaabin muniirin","translate":{"id":"Tidakkah kamu perhatikan sesungguhnya Allah telah menundukkan untuk (kepentingan)mu apa yang di langit dan apa yang di bumi dan menyempurnakan untukmu ni'mat-Nya lahir dan batin. Dan di antara manusia ada yang membantah tentang (keesaan) Allah tanpa ilmu pengetahuan atau petunjuk dan tanpa Kitab yang memberi penerangan.\n","en":"ARE YOU NOT aware that God has made subservient to you all that is in the heavens and all that is on earth, and has lavished upon you His blessings, both outward and inward? And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3489","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3489.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3489.mp3"]}},{"no":21,"arab":"وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنْزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ آبَاءَنَا ۚ أَوَلَوْ كَانَ الشَّيْطَانُ يَدْعُوهُمْ إِلَىٰ عَذَابِ السَّعِيرِ","latin":"wa-idzaa qiila lahumu ittabi'uu maa anzala allaahu qaaluu bal nattabi'u maa wajadnaa 'alayhi aabaa-anaa awa law kaana alsysyaythaanu yad'uuhum ilaa 'adzaabi alssa'iiri","translate":{"id":"Dan apabila dikatakan kepada mereka: \"Ikutilah apa yang diturunkan Allah\". Mereka menjawab: \"(Tidak), tapi kami (hanya) mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya\". Dan apakah mereka (akan mengikuti bapak-bapak mereka) walaupun syaitan itu menyeru mereka ke dalam siksa api yang menyala-nyala (neraka)?\n","en":"and when such [people] are told to follow that which God has bestowed from on high, they answer, “Nay, we shall follow that which we found our forefathers believing in and doing!” Why - [would you follow your forefathers] even if Satan had invited them unto the suffering of the blazing flame?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3490","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3490.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3490.mp3"]}},{"no":22,"arab":"وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ ۗ وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ","latin":"waman yuslim wajhahu ilaa allaahi wahuwa muhsinun faqadi istamsaka bial'urwati alwutsqaa wa-ilaa allaahi 'aaqibatu al-umuuri","translate":{"id":"Dan barangsiapa yang menyerahkan dirinya kepada Allah, sedang dia orang yang berbuat kebaikan, maka sesungguhnya ia telah berpegang kepada buhul tali yang kokoh. Dan hanya kepada Allah-lah kesudahan segala urusan.\n","en":"Now whoever surrenders his whole being unto God, and is a doer of good withal, has indeed taken hold of a support most unfailing: for with God rests the final outcome of all events."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3491","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3491.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3491.mp3"]}},{"no":23,"arab":"وَمَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهُ ۚ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُمْ بِمَا عَمِلُوا ۚ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"waman kafara falaa yahzunka kufruhu ilaynaa marji'uhum fanunabbi-uhum bimaa 'amiluu inna allaaha 'aliimun bidzaati alshshuduuri","translate":{"id":"Dan barangsiapa kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada Kami-lah mereka kembali, lalu Kami beritakan kepada mereka apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala isi hati.\n","en":"But as for him who is bent on denying the truth - let not his denial grieve thee: unto Us they must return, and then We shall make them [truly] understand all that they were doing [in life]: for, verily, God has full knowledge of what is in the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3492","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3492.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3492.mp3"]}},{"no":24,"arab":"نُمَتِّعُهُمْ قَلِيلًا ثُمَّ نَضْطَرُّهُمْ إِلَىٰ عَذَابٍ غَلِيظٍ","latin":"numatti'uhum qaliilan tsumma nadtharruhum ilaa 'adzaabin ghaliizhin","translate":{"id":"Kami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam siksa yang keras.\n","en":"We will let them enjoy them­selves for a short while - but in the end We shall drive them into suffering severe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3493","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3493.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3493.mp3"]}},{"no":25,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","latin":"wala-in sa-altahum man khalaqa alssamaawaati waal-ardha layaquulunna allaahu quli alhamdu lillaahi bal aktsaruhum laa ya'lamuuna","translate":{"id":"Dan sesungguhnya jika kamu tanyakan kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\" Tentu mereka akan menjawab: \"Allah\". Katakanlah : \"Segala puji bagi Allah\"; tetapi kebanyakan mereka tidak mengetahui.\n","en":"AND THUS it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “God.” Say: “[Then you ought to know that] all praise is due to God!”- for most of them do not know [what this implies]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3494","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3494.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3494.mp3"]}},{"no":26,"arab":"لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ","latin":"lillaahi maa fii alssamaawaati waal-ardhi inna allaaha huwa alghaniyyu alhamiidu","translate":{"id":"Kepunyaan Allah-lah apa yang di langit dan yang di bumi. Sesungguhnya Allah Dia-lah Yang Maha Kaya lagi Maha Terpuji.\n","en":"Unto God belongs all that is in the heavens and on earth. Verily, God alone is self-sufficient, the One to whom all praise is due!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3495","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3495.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3495.mp3"]}},{"no":27,"arab":"وَلَوْ أَنَّمَا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللَّهِ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","latin":"walaw annamaa fii al-ardhi min syajaratin aqlaamun waalbahru yamudduhu min ba'dihi sab'atu abhurin maa nafidat kalimaatu allaahi inna allaaha 'aziizun hakiimun","translate":{"id":"Dan seandainya pohon-pohon di bumi menjadi pena dan laut (menjadi tinta), ditambahkan kepadanya tujuh laut (lagi) sesudah (kering)nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah . Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"And if all the trees on earth were pens, and the sea [were] ink, with seven [morel seas yet added to it, the words of God would not be exhausted: for, verily, God is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3496","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3496.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3496.mp3"]}},{"no":28,"arab":"مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ ۗ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","latin":"maa khalqukum walaa ba'tsukum illaa kanafsin waahidatin inna allaaha samii'un bashiirun","translate":{"id":"Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja . Sesungguhnya Allah Maha Mendengar lagi Maha Melihat.\n","en":"[For Him,] the creation of you all and the resurrection of you all is but like [the creation and resurrection of] a single soul: for, verily, God is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3497","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3497.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3497.mp3"]}},{"no":29,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي إِلَىٰ أَجَلٍ مُسَمًّى وَأَنَّ اللَّهَ بِمَا تَعْمَلُونَ خَبِيرٌ","latin":"alam tara anna allaaha yuuliju allayla fii alnnahaari wayuuliju alnnahaara fii allayli wasakhkhara alsysyamsa waalqamara kullun yajrii ilaa ajalin musamman wa-anna allaaha bimaa ta'maluuna khabiirun","translate":{"id":"Tidakkah kamu memperhatikan, bahwa sesungguhnya Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan Dia tundukkan matahari dan bulan masing-masing berjalan sampai kepada waktu yang ditentukan, dan sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"Art thou not aware that it is God who makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night, and that He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him] and that God is fully aware of all that you do?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3498","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3498.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3498.mp3"]}},{"no":30,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ","latin":"dzaalika bi-anna allaaha huwa alhaqqu wa-anna maa yad'uuna min duunihi albaathilu wa-anna allaaha huwa al'aliyyu alkabiiru","translate":{"id":"Demikianlah, karena sesungguhnya Allah, Dia-lah yang hak dan sesungguhnya apa saja yang mereka seru selain dari Allah itulah yang batil; dan sesungguhnya Allah Dialah Yang Maha Tinggi lagi Maha Besar.\n","en":"Thus it is, because God alone is the Ultimate Truth, so that all that men invoke instead of Him is sheer falsehood; and because God alone is exalted, truly great!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3499","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3499.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3499.mp3"]}},{"no":31,"arab":"أَلَمْ تَرَ أَنَّ الْفُلْكَ تَجْرِي فِي الْبَحْرِ بِنِعْمَتِ اللَّهِ لِيُرِيَكُمْ مِنْ آيَاتِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ","latin":"alam tara anna alfulka tajrii fii albahri bini'mati allaahi liyuriyakum min aayaatihi inna fii dzaalika laaayaatin likulli shabbaarin syakuurin","translate":{"id":"Tidakkah kamu memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dengan ni'mat Allah, supaya diperlihatkan-Nya kepadamu sebahagian dari tanda-tanda (kekuasaan)-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi semua orang yang sangat sabar lagi banyak bersyukur.\n","en":"Art thou not aware how the ships speed through the sea by God’s favour, so that He might show you some of His wonders? Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grate­ful [to God]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3500","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3500.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3500.mp3"]}},{"no":32,"arab":"وَإِذَا غَشِيَهُمْ مَوْجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ فَمِنْهُمْ مُقْتَصِدٌ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا كُلُّ خَتَّارٍ كَفُورٍ","latin":"wa-idzaa ghasyiyahum mawjun kaalzhzhulali da'awuu allaaha mukhlishiina lahu alddiina falammaa najjaahum ilaa albarri faminhum muqtashidun wamaa yajhadu bi-aayaatinaa illaa kullu khattaarin kafuurin","translate":{"id":"Dan apabila mereka dilamun ombak yang besar seperti gunung, mereka menyeru Allah dengan memurnikan ketaatan kepada-Nya maka tatkala Allah menyelamatkan mereka sampai di daratan, lalu sebagian mereka tetap menempuh jalan yang lurus . Dan tidak ada yang mengingkari ayat-ayat Kami selain orang-orang yang tidak setia lagi ingkar.\n","en":"For [thus it is with most men:] when the waves engulf them like shadows [of death], they call unto God, sincere [at that moment] in their faith in Him alone: but as soon as He has brought them safe ashore, some of them stop half-way [between belief and unbelief] Yet none could knowingly reject Our messages unless he be utterly perfidious, ingrate."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3501","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3501.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3501.mp3"]}},{"no":33,"arab":"يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَا يَجْزِي وَالِدٌ عَنْ وَلَدِهِ وَلَا مَوْلُودٌ هُوَ جَازٍ عَنْ وَالِدِهِ شَيْئًا ۚ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ","latin":"yaa ayyuhaa alnnaasu ittaquu rabbakum waikhsyaw yawman laa yajzii waalidun 'an waladihi walaa mawluudun huwa jaazin 'an waalidihi syay-an inna wa'da allaahi haqqun falaa taghurrannakumu alhayaatu alddunyaa walaa yaghurrannakum biallaahi algharuuru","translate":{"id":"Hai manusia, bertakwalah kepada Tuhanmu dan takutilah suatu hari yang (pada hari itu) seorang bapak tidak dapat menolong anaknya dan seorang anak tidak dapat (pula) menolong bapaknya sedikitpun. Sesungguhnya janji Allah adalah benar, maka janganlah sekali-kali kehidupan dunia memperdayakan kamu, dan jangan (pula) penipu (syaitan) memperdayakan kamu dalam (mentaati) Allah.\n","en":"O MEN! Be conscious of your Sustainer, and stand in awe of the Day on which no parent will be of any avail to his child, nor a child will in the least avail his parent! Verily, God’s promise [of resurrection] is true in­deed: let not, then, the life of this world deludes you, and let not [your own] deceptive thoughts about God delude you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3502","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3502.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3502.mp3"]}},{"no":34,"arab":"إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ ۖ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا ۖ وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ","latin":"inna allaaha 'indahu 'ilmu alssaa'ati wayunazzilu alghaytsa waya'lamu maa fii al-arhaami wamaa tadrii nafsun maatsaa taksibu ghadan wamaa tadrii nafsun bi-ayyi ardhin tamuutu inna allaaha 'aliimun khabiirun","translate":{"id":"Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang Hari Kiamat; dan Dia-lah Yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tiada seorangpun yang dapat mengetahui (dengan pasti) apa yang akan diusahakannya besok . Dan tiada seorangpun yang dapat mengetahui di bumi mana dia akan mati. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.\n","en":"Verily, with God alone rests the knowledge of when the Last Hour will come: and He [it is who] sends down rain; and He [alone] knows what is in the wombs: whereas no one knows what he will reap tomorrow, and no one knows in what land he will die, Verily. God [alone] is all-knowing, all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3503","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3503.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3503.mp3"]}}]}