{"alquran":{"no":33,"name":"Al-Ahzaab","arab":"الأحزاب","start":3533,"count":73,"rukku":9,"type":"medina","description":"Surat Al Ahzab terdiri atas 73 ayat, termasuk golongan surat-surat Madaniyah, diturunkan sesudah surat Ali'Imran. Dinamai <i>Al Ahzab</i> yang berarti <i>golongan-golongan yang bersekutu</i> karena dalam surat ini terdapat beberapa ayat, yaitu ayat 9 sampai dengan ayat 27 yang berhubungan dengan peperangan Al Ahzab, yaitu peperangan yang dilancarkan oleh orang-orang Yahudi, kaum munafik dan orang-orang musyrik terhadap orang-orang mukmin di Medinah. Mereka telah mengepung rapat orang- orang mukmin sehingga sebahagian dari mereka telah berputus asa dan menyangka bahwa mereka akan dihancurkan oleh musuh-musuh mereka itu. Ini adalah suatu ujian yang berat dari Allah untuk menguji sampai dimana teguhnya keimanan mereka. Akhirnya Allah mengirimkan bantuan berupa tentara yang tidak kelihatan dan angin topan, sehingga musuh-musuh itu menjadi kacau balau dan melarikan diri."},"surah":[{"no":1,"arab":" يَا أَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","latin":"yaa ayyuhaa alnnabiyyu ittaqi allaaha walaa tuthi'i alkaafiriina waalmunaafiqiina inna allaaha kaana 'aliiman hakiimaan","translate":{"id":"Hai Nabi, bertakwalah kepada Allah dan janganlah kamu menuruti (keinginan) orang-orang kafir dan orang-orang munafik. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha Bijaksana,\n","en":"PROPHET! Remain conscious of God, and defer not to the deniers of the truth and the hypo­crites: for God is truly all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3534","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3534.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3534.mp3"]}},{"no":2,"arab":"وَاتَّبِعْ مَا يُوحَىٰ إِلَيْكَ مِنْ رَبِّكَ ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","latin":"waittabi' maa yuuhaa ilayka min rabbika inna allaaha kaana bimaa ta'maluuna khabiiraan","translate":{"id":"dan ikutilah apa yang diwahyukan Tuhan kepadamu. Sesungguhnya Allah adalah Maha Mengetahui apa yang kamu kerjakan.\n","en":"And follow [but] that which comes unto thee through revelation from thy Sustainer: for God is truly aware of all that you do, [O men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3535","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3535.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3535.mp3"]}},{"no":3,"arab":"وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","latin":"watawakkal 'alaa allaahi wakafaa biallaahi wakiilaan ","translate":{"id":"dan bertawakkallah kepada Allah. Dan cukuplah Allah sebagai Pemelihara.\n","en":"And place thy trust in God [alone]: for none is as worthy of trust as God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3536","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3536.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3536.mp3"]}},{"no":4,"arab":"مَا جَعَلَ اللَّهُ لِرَجُلٍ مِنْ قَلْبَيْنِ فِي جَوْفِهِ ۚ وَمَا جَعَلَ أَزْوَاجَكُمُ اللَّائِي تُظَاهِرُونَ مِنْهُنَّ أُمَّهَاتِكُمْ ۚ وَمَا جَعَلَ أَدْعِيَاءَكُمْ أَبْنَاءَكُمْ ۚ ذَٰلِكُمْ قَوْلُكُمْ بِأَفْوَاهِكُمْ ۖ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ","latin":"maa ja'ala allaahu lirajulin min qalbayni fii jawfihi wamaa ja'ala azwaajakumu allaa-ii tuzhaahiruuna minhunna ummahaatikum wamaa ja'ala ad'iyaa-akum abnaa-akum dzaalikum qawlukum bi-afwaahikum waallaahu yaquulu alhaqqa wahuwa yahdii alssabiila","translate":{"id":"Allah sekali-kali tidak menjadikan bagi seseorang dua buah hati dalam rongganya; dan Dia tidak menjadikan istri-istrimu yang kamu zhihar itu sebagai ibumu, dan Dia tidak menjadikan anak-anak angkatmu sebagai anak kandungmu (sendiri). Yang demikian itu hanyalah perkataanmu dimulutmu saja. Dan Allah mengatakan yang sebenarnya dan Dia menunjukkan jalan (yang benar).\n","en":"NEVER has God endowed any man with two hearts in one body: and [just as] He has never made your wives whom you may have declared to be “as unlawful to you as your mothers’ bodies” [truly] your mothers, so, too, has He never made your adopted sons [truly] your sons: these are but [figures of] speech uttered by your mouths - whereas God speaks the [absolute] truth: and it is He alone who can show [you] the right path."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3537","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3537.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3537.mp3"]}},{"no":5,"arab":"ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ ۚ فَإِنْ لَمْ تَعْلَمُوا آبَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ ۚ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُمْ بِهِ وَلَٰكِنْ مَا تَعَمَّدَتْ قُلُوبُكُمْ ۚ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"ud'uuhum li-aabaa-ihim huwa aqsathu 'inda allaahi fa-in lam ta'lamuu aabaa-ahum fa-ikhwaanukum fii alddiini wamawaaliikum walaysa 'alaykum junaahun fiimaa akhtha/tum bihi walaakin maa ta'ammadat quluubukum wakaana allaahu ghafuuran rahiimaan","translate":{"id":"Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang lebih adil pada sisi Allah, dan jika kamu tidak mengetahui bapak-bapak mereka, maka (panggilah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu . Dan tidak ada dosa atasmu terhadap apa yang kamu khilaf padanya, tetapi (yang ada dosanya) apa yang disengaja oleh hatimu. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"[As for your adopted children,] call them by their [real] fathers’ names: this is more equitable in the sight of God; and if you know not who their fathers were, [call them] your brethren in faith and your friends. However, you will incur no sin if you err in this respect: [what really matters is] but what your hearts intend - for God is indeed much-forgiv­ing, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3538","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3538.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3538.mp3"]}},{"no":6,"arab":"النَّبِيُّ أَوْلَىٰ بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ ۖ وَأَزْوَاجُهُ أُمَّهَاتُهُمْ ۗ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ مِنَ الْمُؤْمِنِينَ وَالْمُهَاجِرِينَ إِلَّا أَنْ تَفْعَلُوا إِلَىٰ أَوْلِيَائِكُمْ مَعْرُوفًا ۚ كَانَ ذَٰلِكَ فِي الْكِتَابِ مَسْطُورًا","latin":"alnnabiyyu awlaa bialmu/miniina min anfusihim wa-azwaajuhu ummahaatuhum wauluu al-arhaami ba'dhuhum awlaa biba'dhin fii kitaabi allaahi mina almu/miniina waalmuhaajiriina illaa an taf'aluu ilaa awliyaa-ikum ma'ruufan kaana dzaalika fii alkitaabi masthuuraan","translate":{"id":"Nabi itu (hendaknya) lebih utama bagi orang-orang mukmin dari diri mereka sendiri dan isteri-isterinya adalah ibu-ibu mereka. Dan orang-orang yang mempunyai hubungan darah satu sama lain lebih berhak (waris-mewarisi) di dalam Kitab Allah daripada orang-orang mukmim dan orang-orang Muhajirin, kecuali kalau kamu berbuat baik kepada saudara-saudaramu (seagama). Adalah yang demikian itu telah tertulis di dalam Kitab (Allah).\n","en":"The Prophet has a higher claim on the believers than [they have on] their own selves, [seeing that he is as a father to them] and his wives are their mothers: and they who are [thus] closely related have, in accordance with God’s decree, a higher claim upon one another than [was even the case between] the believers [of Yathrib] and those who had migrated [there for the sake of God]. None the less, you are to act with utmost goodness towards your [other] close friends as well: this [too] is written down in God’s decree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3539","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3539.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3539.mp3"]}},{"no":7,"arab":"وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنْكَ وَمِنْ نُوحٍ وَإِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَى ابْنِ مَرْيَمَ ۖ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا","latin":"wa-idz akhadznaa mina alnnabiyyiina miitsaaqahum waminka wamin nuuhin wa-ibraahiima wamuusaa wa'iisaa ibni maryama wa-akhadznaa minhum miitsaaqan ghaliizhaan","translate":{"id":"Dan (ingatlah) ketika Kami mengambil perjanjian dari nabi-nabi dan dari kamu (sendiri) dari Nuh, Ibrahim, Musa dan Isa putra Maryam, dan Kami telah mengambil dari mereka perjanjian yang teguh .\n","en":"AND LO! We did accept a solemn pledge from all the prophets from thee, [O Muhammad,] as well as from Noah, and Abraham, and Moses, and Jesus the son of Mary -: for We accepted a most weighty, solemn pledge from [all of] them,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3540","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3540.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3540.mp3"]}},{"no":8,"arab":"لِيَسْأَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ ۚ وَأَعَدَّ لِلْكَافِرِينَ عَذَابًا أَلِيمًا","latin":"liyas-ala alshshaadiqiina 'an shidqihim wa-a'adda lilkaafiriina 'adzaaban aliimaan","translate":{"id":"agar Dia menanyakan kepada orang-orang yang benar tentang kebenaran mereka dan Dia menyediakan bagi orang-orang kafir siksa yang pedih.\n","en":"so that [at the end of time] He might ask those men of truth as to [what response] their truthfulness [had received on earth]. And grievous suffering has He readied for all who deny the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3541","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3541.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3541.mp3"]}},{"no":9,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَمْ تَرَوْهَا ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا","latin":"yaa ayyuhaa alladziina aamanuu udzkuruu ni'mata allaahi 'alaykum idz jaa-atkum junuudun fa-arsalnaa 'alayhim riihan wajunuudan lam tarawhaa wakaana allaahu bimaa ta'maluuna bashiiraan","translate":{"id":"Hai orang-orang yang beriman, ingatlah akan ni'mat Allah (yang telah dikurniakan) kepadamu ketika datang kepadamu tentara-tentara, lalu Kami kirimkan kepada mereka angin topan dan tentara yang tidak dapat kamu melihatnya . Dan adalah Allah Maha Melihat akan apa yang kamu kerjakan.\n","en":"O YOU who have attained to faith! Call to mind the blessings which God bestowed on you (at the time) when [enemy] hosts came down upon you, where­upon We let loose against them a storm wind and [heavenly] hosts that you could not see: yet God saw all that you did."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3542","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3542.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3542.mp3"]}},{"no":10,"arab":"إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الْأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا","latin":"idz jaauukum min fawqikum wamin asfala minkum wa-idz zaaghati al-abshaaru wabalaghati alquluubu alhanaajira watazhunnuuna biallaahi alzhzhunuunaa","translate":{"id":"(Yaitu) ketika mereka datang kepadamu dari atas dan dari bawahmu, dan ketika tidak tetap lagi penglihatan(mu) dan hatimu naik menyesak sampai ke tenggorokan dan kamu menyangka terhadap Allah dengan bermacam-macam purbasangka.\n","en":"[Remember what you felt] when they came upon you from above you and from below you, and when [your] eyes became dim and [your] hearts came up to [your] throats, and [when] most conflicting thoughts about God passed through your minds:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3543","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3543.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3543.mp3"]}},{"no":11,"arab":"هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالًا شَدِيدًا","latin":"hunaalika ibtuliya almu-minuuna wazulziluu zilzaalan syadiidaan","translate":{"id":"Disitulah diuji orang-orang mukmin dan digoncangkan (hatinya) dengan goncangan yang sangat.\n","en":"[for] there and then were the believers tried, and shaken with a shock severe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3544","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3544.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3544.mp3"]}},{"no":12,"arab":"وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُورًا","latin":"wa-idz yaquulu almunaafiquuna waalladziina fii quluubihim maradhun maa wa'adanaa allaahu warasuuluhu illaa ghuruuraan","translate":{"id":"Dan (ingatlah) ketika orang-orang munafik dan orang-orang yang berpenyakit dalam hatinya berkata :\"Allah dan Rasul-Nya tidak menjanjikan kepada kami melainkan tipu daya\".\n","en":"And [remember how it was] when the hypo­crites and those with hearts diseased said [to one another], “God and His Apostle have promised us nothing but delusions!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3545","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3545.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3545.mp3"]}},{"no":13,"arab":"وَإِذْ قَالَتْ طَائِفَةٌ مِنْهُمْ يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا ۚ وَيَسْتَأْذِنُ فَرِيقٌ مِنْهُمُ النَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِيَ بِعَوْرَةٍ ۖ إِنْ يُرِيدُونَ إِلَّا فِرَارًا","latin":"wa-idz qaalat thaa-ifatun minhum yaa ahla yatsriba laa muqaama lakum fairji'uu wayasta/dzinu fariiqun minhumu alnnabiyya yaquuluuna inna buyuutanaa 'awratun wamaa hiya bi'awratin in yuriiduuna illaa firaaraan","translate":{"id":"Dan (ingatlah) ketika segolongan di antara mreka berkata: \"Hai penduduk Yatsrib (Madinah), tidak ada tempat bagimu, maka kembalilah kamu\". Dan sebahagian dari mereka minta izin kepada Nabi (untuk kembali pulang) dengan berkata : \"Sesungguhnya rumah-rumah kami terbuka (tidak ada penjaga)\". Dan rumah-rumah itu sekali-kali tidak terbuka, mereka tidak lain hanya hendak lari.\n","en":"and when some of them said, “O you people of Yathrib! You cannot withstand [the enemy] here: hence, go back [to your homes]!” — Whereupon a party from among them asked leave of the Prophet, saying, “Behold, our houses are exposed [to attack]!” — The while they were not [really] exposed: they wanted nothing but to flee."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3546","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3546.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3546.mp3"]}},{"no":14,"arab":"وَلَوْ دُخِلَتْ عَلَيْهِمْ مِنْ أَقْطَارِهَا ثُمَّ سُئِلُوا الْفِتْنَةَ لَآتَوْهَا وَمَا تَلَبَّثُوا بِهَا إِلَّا يَسِيرًا","latin":"walaw dukhilat 'alayhim min aqthaarihaa tsumma su-iluu alfitnata laaatawhaa wamaa talabbatsuu bihaa illaa yasiiraan","translate":{"id":"Kalau (Yatsrib) diserang dari segala penjuru, kemudian diminta kepada mereka supaya murtad , niscaya mereka mengerjakannya; dan mereka tiada akan bertangguh untuk murtad itu melainkan dalam waktu yang singkat.\n","en":"Now if their town had been stormed, and they had been asked [by the enemy] to commit apos­tasy, [the hypocrites] would have done so without much delay"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3547","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3547.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3547.mp3"]}},{"no":15,"arab":"وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِنْ قَبْلُ لَا يُوَلُّونَ الْأَدْبَارَ ۚ وَكَانَ عَهْدُ اللَّهِ مَسْئُولًا","latin":"walaqad kaanuu 'aahaduu allaaha min qablu laa yuwalluuna al-adbaara wakaana 'ahdu allaahi mas-uulaan","translate":{"id":"Dan sesungguhnya mereka sebelum itu telah berjanji kepada Allah: \"Mereka tidak akan berbalik ke belakang (mundur)\". Dan adalah perjanjian dengan Allah akan diminta pertanggungan jawabnya.\n","en":"although ere that they had vowed before God that they would never turn their backs [on His message]: and a vow made to God must surely be answered for!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3548","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3548.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3548.mp3"]}},{"no":16,"arab":"قُلْ لَنْ يَنْفَعَكُمُ الْفِرَارُ إِنْ فَرَرْتُمْ مِنَ الْمَوْتِ أَوِ الْقَتْلِ وَإِذًا لَا تُمَتَّعُونَ إِلَّا قَلِيلًا","latin":"qul lan yanfa'akumu alfiraaru in farartum mina almawti awi alqatli wa-idzan laa tumatta'uuna illaa qaliilaan","translate":{"id":"Katakanlah: \"Lari itu sekali-kali tidaklah berguna bagimu, jika kamu melarikan diri dari kematian atau pembunuhan, dan jika (kamu terhindar dari kematian) kamu tidak juga akan mengecap kesenangan kecuali sebentar saja\".\n","en":"Say: “Whether you flee from [natural] death or from being slain [in battle], flight will not profit you - for, however you fare, you are not [allowed] to enjoy life for more than a little while!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3549","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3549.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3549.mp3"]}},{"no":17,"arab":"قُلْ مَنْ ذَا الَّذِي يَعْصِمُكُمْ مِنَ اللَّهِ إِنْ أَرَادَ بِكُمْ سُوءًا أَوْ أَرَادَ بِكُمْ رَحْمَةً ۚ وَلَا يَجِدُونَ لَهُمْ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","latin":"qul man dzaa alladzii ya'shimukum mina allaahi in araada bikum suu-an aw araada bikum rahmatan walaa yajiduuna lahum min duuni allaahi waliyyan walaa nashiiraan","translate":{"id":"Katakanlah: \"Siapakah yang dapat melindungi kamu dari (takdir) Allah jika Dia menghendaki bencana atasmu atau menghendaki rahmat untuk dirimu?\" Dan orang-orang munafik itu tidak memperoleh bagi mereka pelindung dan penolong selain Allah.\n","en":"Say: “Who is there that could keep you away from God if it be His will to harm you, or if it be His will to show you mercy?” For, [do they not know that] besides God they can find none to protect them, and none to bring them succour?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3550","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3550.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3550.mp3"]}},{"no":18,"arab":"قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ مِنْكُمْ وَالْقَائِلِينَ لِإِخْوَانِهِمْ هَلُمَّ إِلَيْنَا ۖ وَلَا يَأْتُونَ الْبَأْسَ إِلَّا قَلِيلًا","latin":"qad ya'lamu allaahu almu'awwiqiina minkum waalqaa-iliina li-ikhwaanihim halumma ilaynaa walaa ya/tuuna alba/sa illaa qaliilaan","translate":{"id":"Sesungguhnya Allah mengetahui orang-orang yang menghalang-halangi di antara kamu dan orang-orang yang berkata kepada saudara-saudaranya: \"Marilah kepada kami\". Dan mereka tidak mendatangi peperangan melainkan sebentar.\n","en":"God is indeed aware of those of you who would divert others [from fighting in His cause], as well as of those who say to their brethren, “Come hither to us [and face the enemy]!” — The while they [themselves] join battle but seldom,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3551","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3551.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3551.mp3"]}},{"no":19,"arab":"أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَاءَ الْخَوْفُ رَأَيْتَهُمْ يَنْظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَالَّذِي يُغْشَىٰ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَإِذَا ذَهَبَ الْخَوْفُ سَلَقُوكُمْ بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى الْخَيْرِ ۚ أُولَٰئِكَ لَمْ يُؤْمِنُوا فَأَحْبَطَ اللَّهُ أَعْمَالَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","latin":"asyihhatan 'alaykum fa-idzaa jaa-a alkhawfu ra-aytahum yanzhuruuna ilayka taduuru a'yunuhum kaalladzii yughsyaa 'alayhi mina almawti fa-idzaa dzahaba alkhawfu salaquukum bi-alsinatin hidaadin asyihhatan 'alaa alkhayri ulaa-ika lam yu/minuu fa-ahbatha allaahu a'maalahum wakaana dzaalika 'alaa allaahi yasiiraan","translate":{"id":"Mereka bakhil terhadapmu, apabila datang ketakutan (bahaya), kamu lihat mereka itu memandang kepadamu dengan mata yang terbalik-balik seperti orang yang pingsan karena akan mati, dan apabila ketakutan telah hilang, mereka mencaci kamu dengan lidah yang tajam, sedang mereka bakhil untuk berbuat kebaikan. Mereka itu tidak beriman, maka Allah menghapuskan (pahala) amalnya. Dan yang demikian itu adalah mudah bagi Allah.\n","en":"begrudging you all help. But then, when danger threatens, thou canst see them looking to thee [for help, O Prophet], their eyes rolling [in terror] like [the eyes of] one who is overshadowed by death: yet as soon as the danger has passed, they will assail you [believers] with sharp tongues, begrudging you all that is good! [People like] these have never known faith - and therefore God will cause all their works to come to nought: for this is indeed easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3552","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3552.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3552.mp3"]}},{"no":20,"arab":"يَحْسَبُونَ الْأَحْزَابَ لَمْ يَذْهَبُوا ۖ وَإِنْ يَأْتِ الْأَحْزَابُ يَوَدُّوا لَوْ أَنَّهُمْ بَادُونَ فِي الْأَعْرَابِ يَسْأَلُونَ عَنْ أَنْبَائِكُمْ ۖ وَلَوْ كَانُوا فِيكُمْ مَا قَاتَلُوا إِلَّا قَلِيلًا","latin":"yahsabuuna al-ahzaaba lam yadzhabuu wa-in ya/ti al-ahzaabu yawadduu law annahum baaduuna fii al-a'raabi yas-aluuna 'an anbaa-ikum walaw kaanuu fiikum maa qaataluu illaa qaliilaan","translate":{"id":"Mereka mengira (bahwa) golongan-golongan yang bersekutu itu belum pergi; dan jika golongan-golongan yang bersekutu itu datang kembali, niscaya mereka ingin berada di dusun-dusun bersama-sama orang Arab Badwi, sambil menanya-nanyakan tentang berita-beritamu. Dan sekiranya mereka berada bersama kamu, mereka tidak akan berperang, melainkan sebentar saja.\n","en":"They think that the Confederates have not [really] withdrawn; and should the Confederates return, these [hypocrites] would prefer to be in the desert, among the bedouin, asking for news about you, [O believers, from far away;] and even were they to find themselves in your midst, they would but make a pretence at fighting [by your side]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3553","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3553.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3553.mp3"]}},{"no":21,"arab":"لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِمَنْ كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا","latin":"laqad kaana lakum fii rasuuli allaahi uswatun hasanatun liman kaana yarjuu allaaha waalyawma al-aakhira wadzakara allaaha katsiiraan","translate":{"id":"Sesungguhnya telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu (yaitu) bagi orang yang mengharap (rahmat) Allah dan (kedatangan) hari kiamat dan dia banyak menyebut Allah.\n","en":"VERILY, in the Apostle of God you have a good example for everyone who looks forward [with hope and awe] to God and the Last Day, and remembers God unceasingly."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3554","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3554.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3554.mp3"]}},{"no":22,"arab":"وَلَمَّا رَأَى الْمُؤْمِنُونَ الْأَحْزَابَ قَالُوا هَٰذَا مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ وَصَدَقَ اللَّهُ وَرَسُولُهُ ۚ وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا","latin":"walammaa raaa almu/minuuna al-ahzaaba qaaluu haadzaa maa wa'adanaa allaahu warasuuluhu washadaqa allaahu warasuuluhu wamaa zaadahum illaa iimaanan watasliimaan","translate":{"id":"Dan tatkala orang-orang mu'min melihat golongan-golongan yang bersekutu itu, mereka berkata : \"Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita\". Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu tidaklah menambah kepada mereka kecuali iman dan ketundukan.\n","en":"And [so,] when the believers saw the Con­federates [advancing against them], they said, “This is what God and His Apostle have promised us!”- and, “Truly spoke God and His Apostle!” and all this but increased their faith and their readiness to surrender themselves unto God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3555","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3555.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3555.mp3"]}},{"no":23,"arab":"مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ ۖ فَمِنْهُمْ مَنْ قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ ۖ وَمَا بَدَّلُوا تَبْدِيلًا","latin":"mina almu/miniina rijaalun shadaquu maa 'aahaduu allaaha 'alayhi faminhum man qadaa nahbahu waminhum man yantazhiru wamaa baddaluu tabdiilaan","translate":{"id":"Di antara orang-orang mu'min itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; maka di antara mereka ada yang gugur. Dan di antara mereka ada (pula) yang menunggu-nunggu dan mereka tidak merobah (janjinya),\n","en":"Among the believers are men who have [always] been true to what they have vowed before God; and among them are such as have [already] redeemed their pledge by death, and such as yet await [its fulfillment] without having changed [their resolve] in the least."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3556","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3556.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3556.mp3"]}},{"no":24,"arab":"لِيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ الْمُنَافِقِينَ إِنْ شَاءَ أَوْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا","latin":"liyajziya allaahu alshshaadiqiina bishidqihim wayu'adzdziba almunaafiqiina in syaa-a aw yatuuba 'alayhim inna allaaha kaana ghafuuran rahiimaan","translate":{"id":"supaya Allah memberikan balasan kepada orang-orang yang benar itu karena kebenarannya, dan menyiksa orang munafik jika dikehendaki-Nya, atau menerima taubat mereka. Sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang.\n","en":"[Such trials are imposed upon man] so that God may reward the truthful for having been true to their word, and cause the hypocrites to suffer - if that be His will - or [if they repent,] accept their repen­tance: for, verily, God is indeed much-forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3557","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3557.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3557.mp3"]}},{"no":25,"arab":"وَرَدَّ اللَّهُ الَّذِينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنَالُوا خَيْرًا ۚ وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ ۚ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا","latin":"waradda allaahu alladziina kafaruu bighayzhihim lam yanaaluu khayran wakafaa allaahu almu/miniina alqitaala wakaana allaahu qawiyyan 'aziizaan","translate":{"id":"Dan Allah menghalau orang-orang yang kafir itu yang keadaan mereka penuh kejengkelan, (lagi) mereka tidak memperoleh keuntungan apapun. Dan Allah menghindarkan orang-orang mu'min dari peperangan . Dan adalah Allah Maha Kuat lagi Maha Perkasa.\n","en":"Thus, for all their fury, God repulsed those who were bent on denying the truth; no advantage did they gain, since God was enough to [protect] the believers in battle - seeing that God is most powerful, almighty;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3558","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3558.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3558.mp3"]}},{"no":26,"arab":"وَأَنْزَلَ الَّذِينَ ظَاهَرُوهُمْ مِنْ أَهْلِ الْكِتَابِ مِنْ صَيَاصِيهِمْ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا","latin":"wa-anzala alladziina zhaaharuuhum min ahli alkitaabi min shayaasiihim waqadzafa fii quluubihimu alrru'ba fariiqan taqtuluuna wata/siruuna fariiqaan","translate":{"id":"Dan Dia menurunkan orang-orang Ahli Kitab (Bani Quraizhah) yang membantu golongan-golongan yang bersekutu dari benteng-benteng mereka, dan Dia memesukkan rasa takut ke dalam hati mereka. Sebahagian mereka kamu bunuh dan sebahagian yang lain kamu tawan .\n","en":"and He brought down from their strongholds those of the followers of earlier reve­lation who had aided the aggressors, and cast terror into their hearts: some you slew, and some you made captive;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3559","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3559.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3559.mp3"]}},{"no":27,"arab":"وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَمْ تَطَئُوهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا","latin":"wa-awratsakum ardhahum wadiyaarahum wa-amwaalahum wa-ardhan lam tathauuhaa wakaana allaahu 'alaa kulli syay-in qadiiraan","translate":{"id":"Dan Dia mewariskan kepada kamu tanah-tanah, rumah-rumah dan harta benda mereka, dan (begitu pula) tanah yang belum kamu injak . Dan adalah Allah Maha Kuasa terhadap segala sesuatu.\n","en":"and He made you heirs to their lands, and their houses, and their goods - and [promised you] lands on which you had never yet set foot: for God has indeed the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3560","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3560.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3560.mp3"]}},{"no":28,"arab":"يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا","latin":"yaa ayyuhaa alnnabiyyu qul li-azwaajika in kuntunna turidna alhayaata alddunyaa waziinatahaa fata'aalayna umatti'kunna wausarrihkunna saraahan jamiilaan","translate":{"id":"Hai Nabi, katakanlah kepada isteri-isterimu: \"Jika kamu sekalian mengingini kehidupan dunia dan perhiasannya, maka marilah supaya kuberikan kepadamu mut'ah dan aku ceraikan kamu dengan cara yang baik.\n","en":"O PROPHET! Say unto thy wives: “If you desire [but] the life of this world and its charms - well, then, I shall provide for you and release you in a becoming manner;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3561","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3561.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3561.mp3"]}},{"no":29,"arab":"وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا","latin":"wa-in kuntunna turidna allaaha warasuulahu waalddaara al-aakhirata fa-inna allaaha a'adda lilmuhsinaati minkunna ajran 'azhiimaan","translate":{"id":"Dan jika kamu sekalian menghendaki (keredhaan) Allah dan Rasulnya-Nya serta (kesenangan) di negeri akhirat, maka sesungguhnya Allah menyediakan bagi siapa yang berbuat baik diantaramu pahala yang besar.\n","en":"but if you desire God and His Apostle, and [thus the good of] the life in the hereafter, then [know that], verily, for the doers of good among you God has readied a mighty reward!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3562","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3562.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3562.mp3"]}},{"no":30,"arab":"يَا نِسَاءَ النَّبِيِّ مَنْ يَأْتِ مِنْكُنَّ بِفَاحِشَةٍ مُبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","latin":"yaa nisaa-a alnnabiyyi man ya/ti minkunna bifaahisyatin mubayyinatin yudaa'af lahaa al'adzaabu dhi'fayni wakaana dzaalika 'alaa allaahi yasiiraan","translate":{"id":"Hai isteri-isteri Nabi, siapa-siapa di antaramu yang mengerjakan perbuatan keji yang nyata, niscaya akan di lipat gandakan siksaan kepada mereka dua kali lipat. Dan adalah yang demikian itu mudah bagi Allah.\n","en":"O wives of the Prophet! If any of you were to become guilty of manifestly immoral conduct, double [that of other sinners] would be her suffering [in the hereafter]: for that is indeed easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3563","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3563.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3563.mp3"]}},{"no":31,"arab":"وَمَنْ يَقْنُتْ مِنْكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا","latin":"waman yaqnut minkunna lillaahi warasuulihi wata'mal shaalihan nu/tihaa ajrahaa marratayni wa-a'tadnaa lahaa rizqan kariimaan","translate":{"id":"Dan barang siapa diantara kamu sekalian (isteri-isteri nabi) tetap taat kepada Allah dan Rasul-Nya dan mengerjakan amal yang saleh, niscata Kami memberikan kepadanya pahala dua kali lipat dan Kami sediakan baginya rezki yang mulia.\n","en":"But if any of you devoutly obeys God and His Apostle and does good deeds, on her shall We bestow her reward twice-over: for We shall have readied for her a most excellent sustenance [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3564","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3564.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3564.mp3"]}},{"no":32,"arab":"يَا نِسَاءَ النَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِنَ النِّسَاءِ ۚ إِنِ اتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَعْرُوفًا","latin":"yaa nisaa-a alnnabiyyi lastunna ka-ahadin mina alnnisaa-i ini ittaqaytunna falaa takhdha'na bialqawli fayathma'a alladzii fii qalbihi maradhun waqulna qawlan ma'ruufaan","translate":{"id":"Hai isteri-isteri Nabi, kamu sekalian tidaklah seperti wanita yang lain, jika kamu bertakwa. Maka janganlah kamu tunduk dalam berbicara sehingga berkeinginanlah orang yang ada penyakit dalam hatinya dan ucapkanlah perkataan yang baik,\n","en":"O wives of the Prophet! You are not like any of the [other] women, provided that you remain [truly] conscious of God. Hence, be not over-soft in your speech, lest any whose heart is diseased should be moved to desire [you]: but, withal, speak in a kindly way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3565","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3565.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3565.mp3"]}},{"no":33,"arab":"وَقَرْنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَىٰ ۖ وَأَقِمْنَ الصَّلَاةَ وَآتِينَ الزَّكَاةَ وَأَطِعْنَ اللَّهَ وَرَسُولَهُ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا","latin":"waqarna fii buyuutikunna walaa tabarrajna tabarruja aljaahiliyyati al-uulaa wa-aqimna alshshalaata waaatiina alzzakaata wa-athi'na allaaha warasuulahu innamaa yuriidu allaahu liyudzhiba 'ankumu alrrijsa ahla albayti wayuthahhirakum tathhiiraan","translate":{"id":"dan hendaklah kamu tetap di rumahmu dan janganlah kamu berhias dan bertingkah laku seperti orang-orang Jahiliyah yang dahulu dan dirikanlah shalat, tunaikanlah zakat dan ta'atilah Allah dan Rasul-Nya. Sesungguhnya Allah bermaksud hendak menghilangkan dosa dari kamu, hai ahlul bait dan membersihkan kamu sebersih-bersihnya.\n","en":"And abide quietly in your homes, and do not flaunt your charms as they used to flaunt them in the old days of pagan ignorance; and be constant in prayer, and render the purifying dues, and pay heed unto God and His Apostle: for God only wants to remove from you all that might be loathsome, O you members of the [Prophet’s] household, and to purify you to utmost purity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3566","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3566.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3566.mp3"]}},{"no":34,"arab":"وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ ۚ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا","latin":"waudzkurna maa yutlaa fii buyuutikunna min aayaati allaahi waalhikmati inna allaaha kaana lathiifan khabiiraan","translate":{"id":"Dan ingatlah apa yang dibacakan di rumahmu dari ayat-ayat Allah dan hikmah (sunnah nabimu). Sesungguhnya Allah adalah Maha Lembut lagi Maha Mengetahui.\n","en":"And bear in mind all that is recited in your homes of God’s messages and [His] wisdom: for God is unfathomable [in His wisdom], all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3567","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3567.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3567.mp3"]}},{"no":35,"arab":"إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا","latin":"inna almuslimiina waalmuslimaati waalmu/miniina waalmu/minaati waalqaanitiina waalqaanitaati waalshshaadiqiina waalshshaadiqaati waalshshaabiriina waalshshaabiraati waalkhaasyi'iina waalkhaasyi'aati waalmutashaddiqiina waalmutashaddiqaati waalshshaa-imiina waalshshaa-imaati waalhaafizhiina furuujahum waalhaafizhaati waaldzdzaakiriina allaaha katsiiran waaldzdzaakiraati a'adda allaahu lahum maghfiratan wa-ajran 'azhiimaan","translate":{"id":"Sesungguhnya laki-laki dan perempuan yang muslim, laki-laki dan perempuan yang mu'min , laki-laki dan perempuan yang tetap dalam keta'atannya, laki-laki dan perempuan yang benar, laki-laki dan perempuan yang sabar, laki-laki dan perempuan yang khusyu', laki-laki dan perempuan yang bersedekah, laki-laki dan perempuan yang berpuasa, laki-laki dan perempuan yang memelihara kehormatannya, laki-laki dan perempuan yang banyak menyebut (nama) Allah, Allah telah menyediakan untuk mereka ampunan dan pahala yang besar.\n","en":"VERILY, for all men and women who have sur­rendered themselves unto God, and all believing men and believing women, and all truly devout men and truly devout women, and all men and women who are true to their word, and all men and women who are patient in adversity, and all men and women who humble themselves [before God], and all men and women who give in charity, and all self-denying men and self-denying women, and all men and women who are mindful of their chastity, and all men and women who remember God unceasingly: for [all of] them has God readied forgiveness of sins and a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3568","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3568.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3568.mp3"]}},{"no":36,"arab":"وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُبِينًا","latin":"wamaa kaana limu/minin walaa mu/minatin idzaa qadaa allaahu warasuuluhu amran an yakuuna lahumu alkhiyaratu min amrihim waman ya'shi allaaha warasuulahu faqad dhalla dhalaalan mubiinaan","translate":{"id":"Dan tidaklah patut bagi laki-laki yang mu'min dan tidak (pula) bagi perempuan yang mu'min, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada bagi mereka pilihan (yang lain) tentang urusan mereka. Dan barangsiapa mendurhakai Allah dan Rasul-Nya maka sungguhlah dia telah sesat, sesat yang nyata.\n","en":"Now whenever God and His Apostle have decided a matter, it is not for a believing man or a believing woman to claim freedom of choice insofar as they themselves are concerned: for he who [thus] rebels against God and His Apostle has already, most obviously, gone astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3569","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3569.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3569.mp3"]}},{"no":37,"arab":"وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا","latin":"wa-idz taquulu lilladzii an'ama allaahu 'alayhi wa-an'amta 'alayhi amsik 'alayka zawjaka waittaqi allaaha watukhfii fii nafsika maa allaahu mubdiihi watakhsyaa alnnaasa waallaahu ahaqqu an takhsyaahu falammaa qadaa zaydun minhaa watharan zawwajnaakahaa likay laa yakuuna 'alaa almu/miniina harajun fii azwaaji ad'iyaa-ihim idzaa qadhaw minhunna watharan wakaana amru allaahi maf'uulaan","translate":{"id":"Dan (ingatlah), ketika kamu berkata kepada orang yang Allah telah melimpahkan ni'mat kepadanya dan kamu (juga) telah memberi ni'mat kepadanya: \"Tahanlah terus isterimu dan bertakwalah kepada Allah\", sedang kamu menyembunyikan di dalam hatimu apa yang Allah akan menyatakannya, dan kamu takut kepada manusia, sedang Allah-lah yang lebih berhak untuk kamu takuti. Maka tatkala Zaid telah mengakhiri keperluan terhadap istrinya (menceraikannya), Kami kawinkan kamu dengan dia supaya tidak ada keberatan bagi orang mu'min untuk (mengawini) isteri-isteri anak-anak angkat mereka, apabila anak-anak angkat itu telah menyelesaikan keperluannya daripada isterinya . Dan adalah ketetapan Allah itu pasti terjadi.\n","en":"AND LO, [O Muhammad,] thou didst say unto the one to whom God had shown favour and to whom thou hadst shown favour, “Hold on to thy wife, and remain conscious of God!” And [thus] wouldst thou hide within thyself something that God was about to bring to light for thou didst stand in awe of [what] people [might think], whereas it was God alone of whom thou shouldst have stood in awe! [But] then, when Zayd had come to the end of his union with her, We gave her to thee in marriage, so that [in future] no blame should attach to the be­lievers for [marrying] the spouses of their adopted children when the latter have come to the end of their union with them. And [thus] God’s will was done."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3570","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3570.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3570.mp3"]}},{"no":38,"arab":"مَا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ ۖ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ ۚ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا","latin":"maa kaana 'alaa alnnabiyyi min harajin fiimaa faradha allaahu lahu sunnata allaahi fii alladziina khalaw min qablu wakaana amru allaahi qadaran maqduuraan","translate":{"id":"Tidak ada suatu keberatanpun atas Nabi tentang apa yang telah ditetapkan Allah baginya. (Allah telah menetapkan yang demikian) sebagai sunnah-Nya pada nabi-nabi yang telah berlalu dahulu . Dan adalah ketetapan Allah itu suatu ketetapan yang pasti berlaku,\n","en":"[Hence,] no blame whatever attaches to the Prophet for [having done] what God has ordained for him. [Indeed, such was] God’s way with those that have passed away aforetime and [remember that] God’s will is always destiny absolute-;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3571","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3571.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3571.mp3"]}},{"no":39,"arab":"الَّذِينَ يُبَلِّغُونَ رِسَالَاتِ اللَّهِ وَيَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ ۗ وَكَفَىٰ بِاللَّهِ حَسِيبًا","latin":"alladziina yuballighuuna risaalaati allaahi wayakhsyawnahu walaa yakhsyawna ahadan illaa allaaha wakafaa biallaahi hasiibaan","translate":{"id":"(yaitu) orang-orang yang menyapaikan risalah-risalah Allah , mereka takut kepada-Nya dan mereka tiada merasa takut kepada seorang(pun) selain kepada Allah. Dan cukuplah Allah sebagai Pembuat Perhitungan.\n","en":"[and such will always be His way with] those who convey God’s messages [to the world], and stand in awe of Him, and hold none but God in awe: for none can take count [of man’s doings] as God does!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3572","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3572.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3572.mp3"]}},{"no":40,"arab":"مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَٰكِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا","latin":"maa kaana muhammadun abaa ahadin min rijaalikum walaakin rasuula allaahi wakhaatama alnnabiyyiina wakaana allaahu bikulli syay-in 'aliimaan","translate":{"id":"Muhammad itu sekali-kali bukanlah bapak dari seorang laki-laki di antara kamu , tetapi dia adalah Rasulullah dan penutup nabi-nabi. Dan adalah Allah Maha Mengetahui segala sesuatu.\n","en":"[And know, O believers, that] Muhammad is not the father of any one of your men, but is God’s Apostle and the Seal of all Prophets. And God has indeed full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3573","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3573.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3573.mp3"]}},{"no":41,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا","latin":"yaa ayyuhaa alladziina aamanuu udzkuruu allaaha dzikran katsiiraan","translate":{"id":"Hai orang-orang yang beriman, berzdikirlah (dengan menyebut nama) Allah, zikir yang sebanyak-banyaknya.\n","en":"O YOU who have attained to faith! Remember God with unceasing remembrance,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3574","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3574.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3574.mp3"]}},{"no":42,"arab":"وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا","latin":"wasabbihuuhu bukratan wa-ashiilaan","translate":{"id":"Dan bertasbihlah kepada-Nya diwaktu pagi dan petang.\n","en":"and extol His limitless glory from morn to evening."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3575","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3575.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3575.mp3"]}},{"no":43,"arab":"هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا","latin":"huwa alladzii yushallii 'alaykum wamalaa-ikatuhu liyukhrijakum mina alzhzhulumaati ilaa alnnuuri wakaana bialmu/miniina rahiimaan","translate":{"id":"Dialah yang memberi rahmat kepadamu dan malaikat-Nya (memohonkan ampunan untukmu), supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya (yang terang). Dan adalah Dia Maha Penyayang kepada orang-orang yang beriman.\n","en":"He it is who bestows His blessings upon you, with His angels [echoing Him], so that He might take you out of the depths of darkness into the light. And, indeed, a dispenser of grace is He unto the believers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3576","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3576.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3576.mp3"]}},{"no":44,"arab":"تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌ ۚ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا","latin":"tahiyyatuhum yawma yalqawnahu salaamun wa-a'adda lahum ajran kariimaan","translate":{"id":"Salam penghormatan kepada mereka (orang-orang mu'min itu) pada hari mereka menemui-Nya ialah: Salam ; dan Dia menyediakan pahala yang mulia bagi mereka.\n","en":"On the Day when they meet Him, they will be welcomed with the greeting, “Peace”; and He will have readied for them a most excellent reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3577","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3577.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3577.mp3"]}},{"no":45,"arab":"يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا","latin":"yaa ayyuhaa alnnabiyyu innaa arsalnaaka syaahidan wamubasysyiran wanadziiraan","translate":{"id":"Hai Nabi, sesungguhnya Kami mengutusmu untuk jadi saksi, dan pembawa kabar gemgira dan pemberi peringatan,\n","en":"[And as for thee,] O Prophet - behold, We have sent thee as a witness [to the truth], and as a herald of glad tidings and a warner,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3578","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3578.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3578.mp3"]}},{"no":46,"arab":"وَدَاعِيًا إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجًا مُنِيرًا","latin":"wadaa'iyan ilaa allaahi bi-idznihi wasiraajan muniiraan","translate":{"id":"dan untuk jadi penyeru kepada Agama Allah dengan izin-Nya dan untuk jadi cahaya yang menerangi.\n","en":"and as one who summons [all men] to God by His leave, and as a light-giving beacon."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3579","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3579.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3579.mp3"]}},{"no":47,"arab":"وَبَشِّرِ الْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِنَ اللَّهِ فَضْلًا كَبِيرًا","latin":"wabasysyiri almu/miniina bi-anna lahum mina allaahi fadhlan kabiiraan","translate":{"id":"Dan sampaikanlah berita gembira kepada orang-orang mu'min bahwa sesungguhnya bagi mereka karunia yang besar dari Allah.\n","en":"And [so,] convey to the believers the glad tiding that a great bounty from God awaits them;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3580","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3580.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3580.mp3"]}},{"no":48,"arab":"وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ وَدَعْ أَذَاهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","latin":"walaa tuthi'i alkaafiriina waalmunaafiqiina wada' adzaahum watawakkal 'alaa allaahi wakafaa biallaahi wakiilaan","translate":{"id":"Dan janganlah kamu menuruti orang-orang yang kafir dan orang-orang munafik itu, janganlah kamu hiraukan gangguan mereka dan bertawakkallah kepada Allah. Dan cukuplah Allah sebagai Pelindung.\n","en":"and defer not to [the likes and dislikes of] the deniers of the truth and the hypocrites, and disregard their hurtful talk, and place thy trust in God: for none is as worthy of trust as God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3581","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3581.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3581.mp3"]}},{"no":49,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا","latin":"yaa ayyuhaa alladziina aamanuu idzaa nakahtumu almu/minaati tsumma thallaqtumuuhunna min qabli an tamassuuhunna famaa lakum 'alayhinna min 'iddatin ta'tadduunahaa famatti'uuhunna wasarrihuuhunna saraahan jamiilaan","translate":{"id":"Hai orang-orang yang beriman, apabila kamu menikahi perempuan-perempuan yang beriman, kemudian kamu ceraikan mereka sebelum kamu mencampurinya maka sekali-sekali tidak wajib atas mereka 'iddah bagimu yang kamu minta menyempurnakannya. Maka berilah mereka mut'ah dan lepaskanlah mereka itu dengan cara yang sebaik-baiknya.\n","en":"O YOU who have attained to faith! If you marry believing women and then divorce them ere you have touched them, you have no reason to expect, and to calculate, any waiting period on their part: hence, make [at once] provision for them, and release them in a becoming manner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3582","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3582.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3582.mp3"]}},{"no":50,"arab":"يَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَنْ يَسْتَنْكِحَهَا خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ ۗ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"yaa ayyuhaa alnnabiyyu innaa ahlalnaa laka azwaajaka allaatii aatayta ujuurahunna wamaa malakat yamiinuka mimmaa afaa-a allaahu 'alayka wabanaati 'ammika wabanaati 'ammaatika wabanaati khaalika wabanaati khaalaatika allaatii haajarna ma'aka waimra-atan mu/minatan in wahabat nafsahaa lilnnabiyyi in araada alnnabiyyu an yastankihahaa khaalishatan laka min duuni almu/miniina qad 'alimnaa maa faradhnaa 'alayhim fii azwaajihim wamaa malakat aymaanuhum likaylaa yakuuna 'alayka harajun wakaana allaahu ghafuuran rahiimaan","translate":{"id":"Hai Nabi, sesungguhnya Kami telah menghalalkan bagimu isteri-isterimu yang telah kamu berikan mas kawinnya dan hamba sahaya yang kamu miliki yang termasuk apa yang kamu peroleh dalam peperangan yang dikaruniakan Allah untukmu, dan (demikian pula) anak-anak perempuan dari saudara laki-laki bapakmu, anak-anak perempuan dari saudara perempuan bapakmu, anak-anak perempuan dari saudara laki-laki ibumu dan anak-anak perempuan dari saudara perempuan ibumu yang turut hijrah bersama kamu dan perempuan mu'min yang menyerahkan dirinya kepada Nabi kalau Nabi mau mengawininya, sebagai pengkhususan bagimu, bukan untuk semua orang mu'min. Sesungguhnya Kami telah mengetahui apa yang Kami wajibkan kepada mereka tentang isteri-isteri mereka dan hamba sahaya yang mereka miliki supaya tidak menjadi kesempitan bagimu. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"O PROPHET! Behold, We have made lawful to thee thy wives unto whom thou hast paid their dowers, as well as those whom thy right hand has come to possess from among the captives of war whom God has bestowed upon thee. And [We have made lawful to thee] the daughters of thy paternal uncles and aunts, and the daughters of thy maternal uncles and aunts, who have migrated with thee [to Yathrib]; and any believing woman who offers herself freely to the Prophet and whom the Prophet might be willing to wed: [this latter being but] a privilege for thee, and not for other believers - [seeing that] We have already made known what We have enjoined upon them with regard to their wives and those whom their right hands may possess. [And] in order that thou be not burdened with [undue] anxiety - for God is indeed much-forgiving, a dispenser of grace –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3583","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3583.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3583.mp3"]}},{"no":51,"arab":"تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ ۖ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ ۚ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ ۚ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا","latin":"turjii man tasyaau minhunna watu/wii ilayka man tasyaau wamani ibtaghayta mimman 'azalta falaa junaaha 'alayka dzaalika adnaa an taqarra a'yunuhunna walaa yahzanna wayardhayna bimaa aataytahunna kulluhunna waallaahu ya'lamu maa fii quluubikum wakaana allaahu 'aliiman haliimaan","translate":{"id":"Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki diantara mereka (isteri-isterimu) dan (boleh pula) menggauli siapa yang kamu kehendaki. Dan siapa-siapa yang kamu ingini untuk menggaulinya kembali dari perempuan yang telah kamu cerai, maka tidak ada dosa bagimu. Yang demikian itu adalah lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih, dan semuanya rela dengan apa yang telah kamu berikan kepada mereka. Dan Allah mengetahui apa yang (tersimpan) dalam hatimu. Dan adalah Allah Maha Mengetahui lagi Maha Penyantun .\n","en":"[know that] thou mayest put off for a time whichever of them thou pleasest, and mayest take unto thee whichever thou pleasest; and [that,] if thou seek out any from whom thou hast kept away [for a time], thou wilt incur no sin [thereby]: this will make it more likely that their eyes are gladdened [whenever they see thee], and that they do not grieve [whenever they are overlooked], and that all of them may find contentment in whatever thou hast to give them: for God [alone] knows what is in your hearts - and God is indeed all-knowing, for­bearing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3584","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3584.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3584.mp3"]}},{"no":52,"arab":"لَا يَحِلُّ لَكَ النِّسَاءُ مِنْ بَعْدُ وَلَا أَنْ تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ رَقِيبًا","latin":"turjii man tasyaau minhunna watu/wii ilayka man tasyaau wamani ibtaghayta mimman 'azalta falaa junaaha 'alayka dzaalika adnaa an taqarra a'yunuhunna walaa yahzanna wayardhayna bimaa aataytahunna kulluhunna waallaahu ya'lamu maa fii quluubikum wakaana allaahu 'aliiman haliimaan","translate":{"id":"Tidak halal bagimu mengawini perempuan-perempuan sesudah itu dan tidak boleh (pula) mengganti mereka dengan isteri-isteri (yang lain), meskipun kecantikannya menarik hatimu kecuali perempuan-perempuan (hamba sahaya) yang kamu miliki. Dan adalah Allah Maha Mengawasi segala sesuatu .\n","en":"No [other] women shall henceforth be lawful to thee nor art thou [allowed] to supplant [any of] them by other wives, even though their beauty should please thee greatly -: [none shall be lawful to thee] beyond those whom thou [already] hast come to possess. And God keeps watch over everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3585","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3585.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3585.mp3"]}},{"no":53,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ ۖ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا","latin":"yaa ayyuhaa alladziina aamanuu laa tadkhuluu buyuuta alnnabiyyi illaa an yu/dzana lakum ilaa tha'aamin ghayra naatsiriina inaahu walaakin idzaa du'iitum faudkhuluu fa-idzaa tha'imtum faintasyiruu walaa musta/nisiina lihadiitsin inna dzaalikum kaana yu/dzii alnnabiyya fayastahyii minkum waallaahu laa yastahyii mina alhaqqi wa-idzaa sa-altumuuhunna mataa'an fais-aluuhunna min waraa-i hijaabin dzaalikum athharu liquluubikum waquluubihinna wamaa kaana lakum an tu/dzuu rasuula allaahi walaa an tankihuu azwaajahu min ba'dihi abadan inna dzaalikum kaana 'inda allaahi 'azhiimaan","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu memasuki rumah-rumah Nabi kecuali bila kamu diizinkan untuk makan dengan tidak menunggu-nunggu waktu masak (makanannya) , tetapi jika kamu diundang maka masuklah dan bila kamu selesai makan, keluarlah kamu tanpa asyik memperpanjang percakapan. Sesungguhnya yang demikian itu akan mengganggu Nabi lalu Nabi malu kepadamu (untuk menyuruh kamu keluar), dan Allah tidak malu (menerangkan) yang benar. Apabila kamu meminta sesuatu (keperluan) kepada mereka (isteri-isteri Nabi), maka mintalah dari belakang tabir. Cara yang demikian itu lebih suci bagi hatimu dan hati mereka. Dan tidak boleh kamu menyakiti (hati) Rasulullah dan tidak (pula) mengawini isteri-isterinya selama-lamanya sesudah ia wafat. Sesungguhnya perbuatan itu adalah amat besar (dosanya) di sisi Allah.\n","en":"O YOU who have attained to faith! Do not enter the Prophet’s dwellings unless you are given leave; [and when invited] to a meal, do not come [so early as] to wait for it to be readied: but whenever you are invited, enter [at the proper time]; and when you have partaken of the meal, disperse without lingering for the sake of mere talk: that, behold, might give offence to the Prophet, and yet he might feel shy of [asking] you [to leave]: but God is not shy of [teaching you] what is right. And [as for the Prophet’s wives,] whenever you ask them for anything that you need, ask them from behind a screen: this will but deepen the purity of your hearts and theirs. Moreover, it does not behove you to give offence to God’s Apostle - just as it would not behove you ever to marry his widows after he has passed away: that, verily, would be an enormity in the sight of God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3586","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3586.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3586.mp3"]}},{"no":54,"arab":"إِنْ تُبْدُوا شَيْئًا أَوْ تُخْفُوهُ فَإِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا","latin":"in tubduu syay-an aw tukhfuuhu fa-inna allaaha kaana bikulli syay-in 'aliimaan","translate":{"id":"Jika kamu melahirkan sesuatu atau menyembunyikannya, maka sesungguhnya Allah adalah Maha Mengetahui segala sesuatu.\n","en":"Whether you do anything openly or in secret, [remember that,] verily, God has full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3587","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3587.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3587.mp3"]}},{"no":55,"arab":"لَا جُنَاحَ عَلَيْهِنَّ فِي آبَائِهِنَّ وَلَا أَبْنَائِهِنَّ وَلَا إِخْوَانِهِنَّ وَلَا أَبْنَاءِ إِخْوَانِهِنَّ وَلَا أَبْنَاءِ أَخَوَاتِهِنَّ وَلَا نِسَائِهِنَّ وَلَا مَا مَلَكَتْ أَيْمَانُهُنَّ ۗ وَاتَّقِينَ اللَّهَ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا","latin":"laa junaaha 'alayhinna fii aabaa-ihinna walaa abnaa-ihinna walaa ikhwaanihinna walaa abnaa-i ikhwaanihinna walaa abnaa-i akhawaatihinna walaa nisaa-ihinna walaa maa malakat aymaanuhunna waittaqiina allaaha inna allaaha kaana 'alaa kulli syay-in syahiidaan","translate":{"id":"Tidak ada dosa atas isteri-isteri Nabi (untuk berjumpa tanpa tabir) dengan bapak-bapak mereka, anak-anak laki-laki mereka, saudara laki-laki mereka, anak laki-laki dari saudara laki-laki mereka, anak laki-laki dari saudara mereka yang perempuan yang beriman dan hamba sahaya yang mereka miliki, dan bertakwalah kamu (hai isteri-isteri Nabi) kepada Allah. Sesungguhnya Allah Maha Menyaksikan segala sesuatu.\n","en":"[However,] it is no sin for them [to appear freely] before their fathers, or their sons, or their brothers, or their brothers’ sons, or their sisters’ sons, or their womenfolk, or such [male slaves] as their right hands may possess. But [always, O wives of the Prophet,] remain con­scious of God - for, behold, God is witness unto everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3588","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3588.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3588.mp3"]}},{"no":56,"arab":"إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا","latin":"inna allaaha wamalaa-ikatahu yushalluuna 'alaa alnnabiyyi yaa ayyuhaa alladziina aamanuu shalluu 'alayhi wasallimuu tasliimaan","translate":{"id":"Sesungguhnya Allah dan malaikat-malaikat-Nya bershalawat untuk Nabi . Hai orang-orang yang beriman, bershalawatlah kamu untuk Nabi dan ucapkanlah salam penghormatan kepadanya .\n","en":"Verily, God and His angels bless the Prophet: [hence,] O you who have attained to faith, bless him and give yourselves up [to his guidance] in utter self-surrender!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3589","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3589.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3589.mp3"]}},{"no":57,"arab":"إِنَّ الَّذِينَ يُؤْذُونَ اللَّهَ وَرَسُولَهُ لَعَنَهُمُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُهِينًا","latin":"inna alladziina yu/dzuuna allaaha warasuulahu la'anahumu allaahu fii alddunyaa waal-aakhirati wa-a'adda lahum 'adzaaban muhiinaan","translate":{"id":"Sesungguhnya orang-orang yang menyakiti Allah dan Rasul-Nya . Allah akan mela'natinya di dunia dan di akhirat, dan menyediakan baginya siksa yang menghinakan.\n","en":"Verily, as for those who [knowingly] affront God and His Apostle - God will reject them in this world and in the life to come; and shameful suffering will He ready for them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3590","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3590.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3590.mp3"]}},{"no":58,"arab":"وَالَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ بِغَيْرِ مَا اكْتَسَبُوا فَقَدِ احْتَمَلُوا بُهْتَانًا وَإِثْمًا مُبِينًا","latin":"waalladziina yu/dzuuna almu/miniina waalmu/minaati bighayri maa iktasabuu faqadi ihtamaluu buhtaanan wa-itsman mubiinaan","translate":{"id":"Dan orang-orang yang menyakiti orang-orang yang mu'min dan mu'minat tanpa kesalahan yang mereka perbuat, maka sesungguhnya mereka telah memikul kebohongan dan dosa yang nyata.\n","en":"And as for those who malign believing men and believing women without their having done any wrong - they surely burden themselves with the guilt of calumny, and [thus] with a flagrant sin!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3591","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3591.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3591.mp3"]}},{"no":59,"arab":"يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ يُعْرَفْنَ فَلَا يُؤْذَيْنَ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"yaa ayyuhaa alnnabiyyu qul li-azwaajika wabanaatika wanisaa-i almu/miniina yudniina 'alayhinna min jalaabiibihinna dzaalika adnaa an yu'rafna falaa yu/dzayna wakaana allaahu ghafuuran rahiimaan","translate":{"id":"Hai Nabi, katakanlah kepada isteri-isterimu, anak-anak perempuanmu dan isteri-isteri orang mu'min: \"Hendaklah mereka mengulurkan jilbabnya ke seluruh tubuh mereka\". Yang demikian itu supaya mereka lebih mudah untuk dikenal, karena itu mereka tidak di ganggu. Dan Allah adalah Maha Pengampun lagi Maha Penyayang.\n","en":"O Prophet! Tell thy wives and thy daughters, as well as all [other] believing women, that they should draw over themselves some of their outer garments [when in public]: this will be more con­ducive to their being recognized [as decent women] and not annoyed. But [withal,] God is indeed much- forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3592","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3592.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3592.mp3"]}},{"no":60,"arab":"لَئِنْ لَمْ يَنْتَهِ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْمُرْجِفُونَ فِي الْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَا إِلَّا قَلِيلًا","latin":"la-in lam yantahi almunaafiquuna waalladziina fii quluubihim maradhun waalmurjifuuna fii almadiinati lanughriyannaka bihim tsumma laa yujaawiruunaka fiihaa illaa qaliilaan","translate":{"id":"Sesungguhnya jika tidak berhenti orang-orang munafik, orang-orang yang berpenyakit dalam hatinya dan orang-orang yang menyebarkan kabar bohong di Madinah (dari menyakitimu), niscaya Kami perintahkan kamu (untuk memerangi) mereka, kemudian mereka tidak menjadi tetanggamu (di Madinah) melainkan dalam waktu yang sebentar,\n","en":"THUS IT IS: if the hypocrites, and they in whose hearts is disease, and they who, by spreading false rumours, would cause disturbances in the City [of the Prophet] desist not [from their hostile doings]. We shall indeed give thee mastery over them, [O Muhammad] - and then they will not remain thy neighbours in this [city] for more than a little while:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3593","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3593.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3593.mp3"]}},{"no":61,"arab":"مَلْعُونِينَ ۖ أَيْنَمَا ثُقِفُوا أُخِذُوا وَقُتِّلُوا تَقْتِيلًا","latin":"mal'uuniina ayna maa tsuqifuu ukhidzuu waquttiluu taqtiilaan","translate":{"id":"dalam keadaan terla'nat. Di mana saja mereka dijumpai, mereka ditangkap dan dibunuh dengan sehebat-hebatnya.\n","en":"bereft of God’s grace, they shall be seized wherever they may be found, and slain one and all."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3594","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3594.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3594.mp3"]}},{"no":62,"arab":"سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ ۖ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا","latin":"sunnata allaahi fii alladziina khalaw min qablu walan tajida lisunnati allaahi tabdiilaan","translate":{"id":"Sebagai sunnah Allah yang berlaku atas orang-orang yang telah terdahulu sebelum (mu), dan kamu sekali-kali tiada akan mendapati perubahan pada sunnah Allah.\n","en":"Such has been God’s way with those who [sinned in like manner and] passed away aforetime - and never wilt thou find any change in God’s way!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3595","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3595.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3595.mp3"]}},{"no":63,"arab":"يَسْأَلُكَ النَّاسُ عَنِ السَّاعَةِ ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ ۚ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ تَكُونُ قَرِيبًا","latin":"yas-aluka alnnaasu 'ani alssaa'ati qul innamaa 'ilmuhaa 'inda allaahi wamaa yudriika la'alla alssaa'ata takuunu qariibaan","translate":{"id":"Manusia bertanya kepadamu tentang hari berbangkit. Katakanlah: \"Sesungguhnya pengetahuan tentang hari berbangkit itu hanya di sisi Allah\". Dan tahukah kamu (hai Muhammad), boleh jadi hari berbangkit itu sudah dekat waktunya.\n","en":"PEOPLE will ask thee about the Last Hour. Say: “Knowledge thereof rests with God alone; yet for all thou knowest, the Last Hour may well be near!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3596","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3596.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3596.mp3"]}},{"no":64,"arab":"إِنَّ اللَّهَ لَعَنَ الْكَافِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا","latin":"inna allaaha la'ana alkaafiriina wa-a'adda lahum sa'iiraan","translate":{"id":"Sesungguhnya Allah mela'nati orang-orang kafir dan menyediakan bagi mereka api yang menyala-nyala (neraka),\n","en":"Verily, God has rejected the deniers of the truth, and has readied for them a blazing fire,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3597","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3597.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3597.mp3"]}},{"no":65,"arab":"خَالِدِينَ فِيهَا أَبَدًا ۖ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا","latin":"khaalidiina fiihaa abadan laa yajiduuna waliyyan walaa nashiiraan","translate":{"id":"mereka kekal di dalamnya selama-lamanya; mereka tidak memperoleh seorang pelindungpun dan tidak (pula) seorang penolong.\n","en":"therein to abide beyond the count of time: no protec­tor will they find, and none to bring them succour."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3598","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3598.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3598.mp3"]}},{"no":66,"arab":"يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِي النَّارِ يَقُولُونَ يَا لَيْتَنَا أَطَعْنَا اللَّهَ وَأَطَعْنَا الرَّسُولَا","latin":"yawma tuqallabu wujuuhuhum fii alnnaari yaquuluuna yaa laytanaa atha'naa allaaha wa-atha'naa alrrasuulaa","translate":{"id":"Pada hari ketika muka mereka dibolak-balikan dalam neraka, mereka berkata: \"Alangkah baiknya, andaikata kami ta'at kepada Allah dan ta'at (pula) kepada Rasul\".\n","en":"On the Day when their faces shall be tossed about in the fire, they will exclaim, “Oh, would that we had paid heed unto God, and paid heed unto the Apostle!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3599","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3599.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3599.mp3"]}},{"no":67,"arab":"وَقَالُوا رَبَّنَا إِنَّا أَطَعْنَا سَادَتَنَا وَكُبَرَاءَنَا فَأَضَلُّونَا السَّبِيلَا","latin":"waqaaluu rabbanaa innaa atha'naa saadatanaa wakubaraa-anaa fa-adhalluunaa alssabiilaa","translate":{"id":"Dan mereka berkata;:\"Ya Tuhan kami, sesungguhnya kami telah menta'ati pemimpin-pemimpin dan pembesar-pembesar kami, lalu mereka menyesatkan kami dari jalan (yang benar).\n","en":"And they will say: “O our Sustainer! Behold, we paid heed unto our leaders and our great men, and it is they who have led us astray from the right path!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3600","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3600.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3600.mp3"]}},{"no":68,"arab":"رَبَّنَا آتِهِمْ ضِعْفَيْنِ مِنَ الْعَذَابِ وَالْعَنْهُمْ لَعْنًا كَبِيرًا","latin":"rabbanaa aatihim dhi'fayni mina al'adzaabi wail'anhum la'nan kabiiraan","translate":{"id":"Ya Tuhan kami, timpakanlah kepada mereka azab dua kali lipat dan kutuklah mereka dengan kutukan yang besar\".\n","en":"O our Sustainer! Give them double suffering, and banish them utterly from Thy grace!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3601","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3601.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3601.mp3"]}},{"no":69,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ آذَوْا مُوسَىٰ فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا ۚ وَكَانَ عِنْدَ اللَّهِ وَجِيهًا","latin":"yaa ayyuhaa alladziina aamanuu laa takuunuu kaalladziina aadzaw muusaa fabarra-ahu allaahu mimmaa qaaluu wakaana 'inda allaahi wajiihaan","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu menjadi seperti orang-orang yang menyakiti Musa; maka Allah membersihkannya dari tuduhan-tuduhan yang mereka katakan. Dan adalah dia seorang yang mempunyai kedudukan terhormat di sisi Allah.\n","en":"O YOU who have attained to faith! Be not like those [children of Israel] who gave offence to Moses, and [remember that] God showed him to be innocent of whatever they alleged [against him or demanded of him]: for of great honour was he in the sight of God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3602","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3602.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3602.mp3"]}},{"no":70,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا","latin":"yaa ayyuhaa alladziina aamanuu ittaquu allaaha waquuluu qawlan sadiidaan","translate":{"id":"Hai orang-orang yang beriman, bertakwalah kamu kepada Allah dan katakanlah perkataan yang benar,\n","en":"O you who have attained to faith! Remain conscious of God, and [always] speak with a will to bring out [only] what is just and true -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3603","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3603.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3603.mp3"]}},{"no":71,"arab":"يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا","latin":"yushlih lakum a'maalakum wayaghfir lakum dzunuubakum waman yuthi'i allaaha warasuulahu faqad faaza fawzan 'azhiimaan","translate":{"id":"niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa menta'ati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar.\n","en":"[whereupon] He will cause your deeds to be virtuous, and will forgive you your sins. And [know that] whoever pays heed unto God and His Apostle has already attained to a mighty triumph."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3604","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3604.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3604.mp3"]}},{"no":72,"arab":"إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا الْإِنْسَانُ ۖ إِنَّهُ كَانَ ظَلُومًا جَهُولًا","latin":"innaa 'aradhnaa al-amaanata 'alaa alssamaawaati waal-ardhi waaljibaali fa-abayna an yahmilnahaa wa-asyfaqna minhaa wahamalahaa al-insaanu innahu kaana zhaluuman jahuulaan","translate":{"id":"Sesungguhnya Kami telah mengemukakan amanat kepada langit, bumi dan gunung-gunung, maka semuanya enggan untuk memikul amanat itu dan mereka khawatir akan mengkhianatinya, dan dipikullah amanat itu oleh manusia. Sesungguhnya manusia itu amat zalim dan amat bodoh,\n","en":"Verily, We did offer the trust [of reason and volition] to the heavens, and the earth, and the mountains: but they refused to bear it because they were afraid of it. Yet man took it up - for, verily, he has always been prone to be most wicked, most foolish."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3605","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3605.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3605.mp3"]}},{"no":73,"arab":"لِيُعَذِّبَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ وَيَتُوبَ اللَّهُ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"liyu'adzdziba allaahu almunaafiqiina waalmunaafiqaati waalmusyrikiina waalmusyrikaati wayatuuba allaahu 'alaa almu/miniina waalmu/minaati wakaana allaahu ghafuuran rahiimaan","translate":{"id":"sehingga Allah mengazab orang-orang munafik laki-laki dan perempuan dan orang-orang musyrikin laki-laki dan perempuan; dan sehingga Allah menerima taubat orang-orang mu'min laki-laki dan perempuan. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"[And so it is] that God imposes suffering on the hypocrites, both men and women, as well as on the men and women who ascribe divinity to aught beside Him. And [so, too, it is] that God turns in His mercy unto the believing men and believing women: for God is indeed much-forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3606","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3606.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3606.mp3"]}}]}