{"alquran":{"no":35,"name":"Faatir","arab":"فاطر","start":3660,"count":45,"rukku":5,"type":"mecca","description":"Surat Faathir terdiri atas 45 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Al Furqaan dan merupakan surat akhir dari urutan surat-surat dalam Al Quran yang dimulai dengan <i>Alhamdulillah</i>. Dinamakan <i>Faathir</i> (pencipta) ada hubungannya dengan perkataan <i>Faathir</i> yang terdapat pada ayat pertama pada surat ini. Pada ayat tersebut diterangkan bahwa Allah adalah Pencipta langit dan bumi, Pencipta malaikat-malaikat, Pencipta semesta alam yang semuanya itu adalah sebagai bukti atas kekuasaan dan kebesaran-Nya. Surat ini dinamai juga dengan <i>surat Malaikat</i> karena pada ayat pertama disebutkan bahwa Allah telah menjadikan malaikat-malaikat sebagai utusan-Nya  yang mempunyai beberapa sayap."},"surah":[{"no":1,"arab":" الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۚ يَزِيدُ فِي الْخَلْقِ مَا يَشَاءُ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"alhamdu lillaahi faathiri alssamaawaati waal-ardhi jaa'ili almalaa-ikati rusulan ulii ajnihatin matsnaa watsulaatsa warubaa'a yaziidu fii alkhalqi maa yasyaau inna allaaha 'alaa kulli syay-in qadiirun","translate":{"id":"Segala puji bagi Allah Pencipta langit dan bumi, Yang menjadikan malaikat sebagai utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang dikehendaki-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.\n","en":"ALL PRAISE is due to God, Originator of the heavens and the earth, who causes the angels to be (His) message-bearers, endowed with wings, two, or three, or four. [Unceasingly] He adds to His creation whatever He wills: for, verily, God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3661","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3661.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3661.mp3"]}},{"no":2,"arab":"مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِهِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"maa yaftahi allaahu lilnnaasi min rahmatin falaa mumsika lahaa wamaa yumsik falaa mursila lahu min ba'dihi wahuwa al'aziizu alhakiimu","translate":{"id":"Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorangpun yang sanggup melepaskannya sesudah itu. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"Whatever grace God opens up to man, none can withhold it; and whatever He withholds, none can henceforth release: for He alone is almighty, truly wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3662","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3662.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3662.mp3"]}},{"no":3,"arab":"يَا أَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ ۚ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ ۚ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُؤْفَكُونَ","latin":"yaa ayyuhaa alnnaasu udzkuruu ni'mata allaahi 'alaykum hal min khaaliqin ghayru allaahi yarzuqukum mina alssamaa-i waal-ardhi laa ilaaha illaa huwa fa-annaa tu/fakuuna","translate":{"id":"Hai manusia, ingatlah akan ni'mat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezki kepada kamu dari langit dan bumi ? Tidak ada Tuhan selain Dia; maka mengapakah kamu berpaling (dari ketauhidan) ?\n","en":"O men! Call to mind the blessings which God has bestowed upon you! Is there any creator, other than God, that could provide for you sustenance out of heaven and earth? There is no deity save Him: and yet, how perverted are your minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3663","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3663.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3663.mp3"]}},{"no":4,"arab":"وَإِنْ يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","latin":"wa-in yukadzdzibuuka faqad kuthtsibat rusulun min qablika wa-ilaa allaahi turja'u al-umuuru","translate":{"id":"Dan jika mereka mendustakan kamu (sesudah kamu beri peringatan) maka sungguh telah didustakan pula rasul-rasul sebelum kamu. Dan hanya kepada Allahlah dikembalikan segala urusan.\n","en":"But if they [whose minds are perverted] give thee the lie, [O Prophet, remember that] even so, before thy time, have [other] apostles been given the lie: for [the unbelievers always refuse to admit that] all things go back to God [as their source]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3664","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3664.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3664.mp3"]}},{"no":5,"arab":"يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا ۖ وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ","latin":"yaa ayyuhaa alnnaasu inna wa'da allaahi haqqun falaa taghurrannakumu alhayaatu alddunyaa walaa yaghurrannakum biallaahi algharuuru","translate":{"id":"Hai manusia, sesungguhnya janji Allah adalah benar, maka sekali-kali janganlah kehidupan dunia memperdayakan kamu dan sekali-kali janganlah syaitan yang pandai menipu, memperdayakan kamu tentang Allah.\n","en":"O men! Verily, God’s promise [of resurrection] is true indeed: let not, then, the life of this world delude you, and let not [your own] deceptive thoughts about God delude you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3665","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3665.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3665.mp3"]}},{"no":6,"arab":"إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا ۚ إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ","latin":"inna alsysyaythaana lakum 'aduwwun faittakhidzuuhu 'aduwwan innamaa yad'uu hizbahu liyakuunuu min ash-haabi alssa'iiri","translate":{"id":"Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu), karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala\n","en":"Behold, Satan is a foe unto you: so treat him as a foe. He but calls on his followers to the end that they might find themselves among such as are des­tined for the blazing flame –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3666","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3666.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3666.mp3"]}},{"no":7,"arab":"الَّذِينَ كَفَرُوا لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ","latin":"alladziina kafaruu lahum 'adzaabun syadiidun waalladziina aamanuu wa'amiluu alshshaalihaati lahum maghfiratun wa-ajrun kabiirun","translate":{"id":"Orang-orang yang kafir bagi mereka azab yang keras. Dan orang-orang yang beriman dan mengerjakan amal saleh bagi mereka ampunan dan pahala yang besar.\n","en":"[seeing that] for those who are bent on denying the truth there is suffering severe in store, just as for those who have attained to faith and do righteous deeds there is forgiveness of sins, and a great reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3667","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3667.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3667.mp3"]}},{"no":8,"arab":"أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۖ فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ ۚ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ","latin":"afaman zuyyina lahu suu-u 'amalihi faraaahu hasanan fa-inna allaaha yudhillu man yasyaau wayahdii man yasyaau falaa tadzhab nafsuka 'alayhim hasaraatin inna allaaha 'aliimun bimaa yashna'uuna","translate":{"id":"Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik, (sama dengan orang yang tidak ditipu oleh syaitan) ? Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya dan menunjuki siapa yang dikehendaki-Nya; maka janganlah dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.\n","en":"Is, then, he to whom the evil of his own doings is [so] alluring that [in the end] he regards it as good [anything but a follower of Satan]? For, verily, God lets go astray him that wills [to go astray], just as He guides him that wills [to be guided]. Hence, [O believer,] do not waste thyself in sorrowing over them: verily, God has full knowledge of all that they do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3668","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3668.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3668.mp3"]}},{"no":9,"arab":"وَاللَّهُ الَّذِي أَرْسَلَ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَسُقْنَاهُ إِلَىٰ بَلَدٍ مَيِّتٍ فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ كَذَٰلِكَ النُّشُورُ","latin":"waallaahu alladzii arsala alrriyaaha fatutsiiru sahaaban fasuqnaahu ilaa baladin mayyitin fa-ahyaynaa bihi al-ardha ba'da mawtihaa kadzaalika alnnusyuuru","translate":{"id":"Dan Allah, Dialah Yang mengirimkan angin; lalu angin itu menggerakkan awan, maka Kami halau awan itu kesuatu negeri yang mati lalu Kami hidupkan bumi setelah matinya dengan hujan itu. Demikianlah kebangkitan itu.\n","en":"AND [remember:] it is God who sends forth the winds, so that they raise a cloud, whereupon We drive it towards dead land and thereby give life to the earth after it had been lifeless: even thus shall resur­rection be!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3669","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3669.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3669.mp3"]}},{"no":10,"arab":"مَنْ كَانَ يُرِيدُ الْعِزَّةَ فَلِلَّهِ الْعِزَّةُ جَمِيعًا ۚ إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ ۚ وَالَّذِينَ يَمْكُرُونَ السَّيِّئَاتِ لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَمَكْرُ أُولَٰئِكَ هُوَ يَبُورُ","latin":"man kaana yuriidu al'izzata falillaahi al'izzatu jamii'an ilayhi yash'adu alkalimu alththhayyibu waal'amalu alshshaalihu yarfa'uhu waalladziina yamkuruuna alssayyi-aati lahum 'adzaabun syadiidun wamakru ulaa-ika huwa yabuuru","translate":{"id":"Barangsiapa yang menghendaki kemuliaan, maka bagi Allah-lah kemuliaan itu semuanya. Kepada-Nyalah naik perkataan-perkataan yang baik dan amal yang saleh dinaikkan-Nya . Dan orang-orang yang merencanakan kejahatan bagi mereka azab yang keras. Dan rencana jahat mereka akan hancur.\n","en":"He who desires might and glory [ought to know that] all might and glory belong to God [alone]. Unto Him ascend all good words, and the righteous deed does He exalt. But as for those who cunningly devise evil deeds - suffering severe awaits them; and all their devising is bound to come to nought."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3670","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3670.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3670.mp3"]}},{"no":11,"arab":"وَاللَّهُ خَلَقَكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَاجًا ۚ وَمَا تَحْمِلُ مِنْ أُنْثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَمَا يُعَمَّرُ مِنْ مُعَمَّرٍ وَلَا يُنْقَصُ مِنْ عُمُرِهِ إِلَّا فِي كِتَابٍ ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","latin":"waallaahu khalaqakum min turaabin tsumma min nuthfatin tsumma ja'alakum azwaajan wamaa tahmilu min untsaa walaa tadha'u illaa bi'ilmihi wamaa yu'ammaru min mu'ammarin walaa yunqashu min 'umurihi illaa fii kitaabin inna dzaalika 'alaa allaahi yasiirun","translate":{"id":"Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan). Dan tidak ada seorang perempuanpun mengandung dan tidak (pula) melahirkan melainkan dengan sepengetahuan-Nya. Dan sekali-kali tidak dipanjangkan umur seorang yang berumur panjang dan tidak pula dikurangi umurnya, melainkan (sudah ditetapkan) dalam Kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu bagi Allah adalah mudah.\n","en":"And [remember:] God creates [every one of] you out of dust, then out of a drop of sperm; and then He fashions you into either of the two sexes. And no female conceives or gives birth unless it be with His knowledge; and none that is long-lived has his days lengthened - and neither is aught lessened of his days - unless it be thus laid down in [God’s] decree: for, behold, all this is easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3671","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3671.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3671.mp3"]}},{"no":12,"arab":"وَمَا يَسْتَوِي الْبَحْرَانِ هَٰذَا عَذْبٌ فُرَاتٌ سَائِغٌ شَرَابُهُ وَهَٰذَا مِلْحٌ أُجَاجٌ ۖ وَمِنْ كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُونَ حِلْيَةً تَلْبَسُونَهَا ۖ وَتَرَى الْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","latin":"wamaa yastawii albahraani haadzaa 'adzbun furaatun saa-ighun syaraabuhu wahaadzaa milhun ujaajun wamin kullin ta/kuluuna lahman thariyyan watastakhrijuuna hilyatan talbasuunahaa wataraa alfulka fiihi mawaakhira litabtaghuu min fadhlihi wala'allakum tasykuruuna","translate":{"id":"Dan tiada sama (antara) dua laut; yang ini tawar, segar, sedap diminum dan yang lain asin lagi pahit. Dan dari masing-masing laut itu kamu dapat memakan daging yang segar dan kamu dapat mengeluarkan perhiasan yang dapat kamu memakainya, dan pada masing-masingnya kamu lihat kapal-kapal berlayar membelah laut supaya kamu dapat mencari karunia-Nya dan supaya kamu bersyukur.\n","en":"[Easy is it for Him to create likeness and variety:] thus, the two great bodies of water [on earth] are not alike the one sweet, thirst-allaying, pleasant to drink, and the other salty and bitter: and yet, from either of them do you eat fresh meat, and [from either] you take gems which you may wear; and on either thou canst see ships ploughing through the waves, so that you might [be able to] go forth in quest of some of His bounty, and thus have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3672","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3672.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3672.mp3"]}},{"no":13,"arab":"يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۚ وَالَّذِينَ تَدْعُونَ مِنْ دُونِهِ مَا يَمْلِكُونَ مِنْ قِطْمِيرٍ","latin":"yuuliju allayla fii alnnahaari wayuuliju alnnahaara fii allayli wasakhkhara alsysyamsa waalqamara kullun yajrii li-ajalin musamman dzaalikumu allaahu rabbukum lahu almulku waalladziina tad'uuna min duunihi maa yamlikuuna min qithmiirin","translate":{"id":"Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Yang (berbuat) demikian itulah Allah Tuhanmu, kepunyaan-Nyalah kerajaan. Dan orang-orang yang kamu seru (sembah) selain Allah tiada mempunyai apa-apa walaupun setipis kulit ari.\n","en":"He makes the night grow longer by shortening the day, and He makes the day grow longer by shortening the night; and He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. Thus is God, your Sustainer: unto Him belongs all dominion - whereas those whom you invoke instead of Him do not own so much as the husk of a date-stone!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3673","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3673.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3673.mp3"]}},{"no":14,"arab":"إِنْ تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ ۖ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ ۚ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ","latin":"in tad'uuhum laa yasma'uu du'aa-akum walaw sami'uu maa istajaabuu lakum wayawma alqiyaamati yakfuruuna bisyirkikum walaa yunabbi-uka mitslu khabiirin","translate":{"id":"Jika kamu menyeru mereka, mereka tiada mendengar seruanmu; dan kalau mereka mendengar, mereka tidak dapat memperkenankan permintaanmu. Dan dihari kiamat mereka akan mengingkari kemusyirikanmu dan tidak ada yang dapat memberi keterangan kepadamu sebagai yang diberikan oleh Yang Maha Mengetahui .\n","en":"If you invoke them, they do not hear your call; and even if they could hear, they would not [be able to] respond to you. And [withal,] on the Day of Resurrection they will utterly disown your having associated them with God. And none can make thee understand [the truth] like the One who is all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3674","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3674.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3674.mp3"]}},{"no":15,"arab":"يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ ۖ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ","latin":"yaa ayyuhaa alnnaasu antumu alfuqaraau ilaa allaahi waallaahu huwa alghaniyyu alhamiidu","translate":{"id":"Hai manusia, kamulah yang berkehendak kepada Allah; dan Allah Dialah Yang Maha Kaya (tidak memerlukan sesuatu) lagi Maha Terpuji.\n","en":"O men! It is you, who stand in need of God, whereas He alone is self-sufficient, the One to whom all praise is due."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3675","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3675.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3675.mp3"]}},{"no":16,"arab":"إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ","latin":"in yasya/ yudzhibkum waya/ti bikhalqin jadiidin","translate":{"id":"Jika Dia menghendaki, niscaya Dia memusnahkan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu).\n","en":"If He so wills, He can do away with you and bring forth a new mankind [in your stead]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3676","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3676.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3676.mp3"]}},{"no":17,"arab":"وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ","latin":"wamaa dzaalika 'alaa allaahi bi'aziizin","translate":{"id":"Dan yang demikian itu sekali-kali tidak sulit bagi Allah.\n","en":"nor is this difficult for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3677","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3677.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3677.mp3"]}},{"no":18,"arab":"وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ وَإِنْ تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰ ۗ إِنَّمَا تُنْذِرُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَأَقَامُوا الصَّلَاةَ ۚ وَمَنْ تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِ ۚ وَإِلَى اللَّهِ الْمَصِيرُ","latin":"walaa taziru waaziratun wizra ukhraa wa-in tad'u mutsqalatun ilaa himlihaa laa yuhmal minhu syay-un walaw kaana dzaa qurbaa innamaa tundziru alladziina yakhsyawna rabbahum bialghaybi wa-aqaamuu alshshalaata waman tazakkaa fa-innamaa yatazakkaa linafsihi wa-ilaa allaahi almashiiru","translate":{"id":"Dan orang yang berdosa tidak akan memikul dosa orang lain . Dan jika seseorang yang berat dosanya memanggil (orang lain) untuk memikul dosanya itu tiadalah akan dipikulkan untuknya sedikitpun meskipun (yang dipanggilnya itu) kaum kerabatnya. Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada azab Tuhannya (sekalipun) mereka tidak melihatNya dan mereka mendirikan sembahyang. Dan barangsiapa yang mensucikan dirinya, sesungguhnya ia mensucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allahlah kembali(mu).\n","en":"AND NO BEARER of burdens shall be made to bear another’s burden; and if one weighed down by his load calls upon [another] to help him carry it, nothing thereof may be carried [by that other], even if it be one’s near of kin. Hence, thou canst [truly] warn only those who stand in awe of their Sustainer although He is beyond the reach of their perception, and are constant in prayer, and [know that] whoever grows in purity, attains to purity but for the good of his own self, and [that] with God is all journeys’ end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3678","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3678.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3678.mp3"]}},{"no":19,"arab":"وَمَا يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ","latin":"wamaa yastawii al-a'maa waalbashiiru","translate":{"id":"Dan tidaklah sama orang yang buta dengan orang yang melihat.\n","en":"For [thus it is:] the blind and the seeing are not equal;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3679","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3679.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3679.mp3"]}},{"no":20,"arab":"وَلَا الظُّلُمَاتُ وَلَا النُّورُ","latin":"walaa alzhzhulumaatu walaa alnnuuru","translate":{"id":"dan tidak (pula) sama gelap gulita dengan cahaya,\n","en":"nor are the depths of darkness and the light;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3680","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3680.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3680.mp3"]}},{"no":21,"arab":"وَلَا الظِّلُّ وَلَا الْحَرُورُ","latin":"walaa alzhzhillu walaa alharuuru","translate":{"id":"dan tidak (pula) sama yang teduh dengan yang panas,\n","en":"nor the [cooling] shade and the scorching heat:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3681","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3681.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3681.mp3"]}},{"no":22,"arab":"وَمَا يَسْتَوِي الْأَحْيَاءُ وَلَا الْأَمْوَاتُ ۚ إِنَّ اللَّهَ يُسْمِعُ مَنْ يَشَاءُ ۖ وَمَا أَنْتَ بِمُسْمِعٍ مَنْ فِي الْقُبُورِ","latin":"wamaa yastawii al-ahyaau walaa al-amwaatu inna allaaha yusmi'u man yasyaau wamaa anta bimusmi'in man fii alqubuuri","translate":{"id":"dan tidak (pula) sama orang-orang yang hidup dan orang-orang yang mati. Sesungguhnya Allah memberi pendengaran kepada siapa yang dikehendaki-Nya dan kamu sekali-kali tiada sanggup menjadikan orang yang didalam kubur dapat mendengar .\n","en":"and neither are equal the living and the dead [of heart]. Behold, [O Muhammad,] God can make hear whomever He wills, whereas thou canst not make hear such as are [dead of heart like the dead] in their graves:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3682","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3682.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3682.mp3"]}},{"no":23,"arab":"إِنْ أَنْتَ إِلَّا نَذِيرٌ","latin":"in anta illaa nadziirun","translate":{"id":"Kamu tidak lain hanyalah seorang pemberi peringatan.\n","en":"thou art nothing but a warner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3683","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3683.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3683.mp3"]}},{"no":24,"arab":"إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۚ وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ","latin":"innaa arsalnaaka bialhaqqi basyiiran wanadziiran wa-in min ummatin illaa khalaa fiihaa nadziirun","translate":{"id":"Sesungguhnya Kami mengutus kamu dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Dan tidak ada suatu umatpun melainkan telah ada padanya seorang pemberi peringatan.\n","en":"Verily, We have sent thee with the truth, as a bearer of glad tidings and a warner: for there never was any community but a warner has [lived and] passed away in its midst."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3684","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3684.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3684.mp3"]}},{"no":25,"arab":"وَإِنْ يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ وَبِالزُّبُرِ وَبِالْكِتَابِ الْمُنِيرِ","latin":"wa-in yukadzdzibuuka faqad kadzdzaba alladziina min qablihim jaa-at-hum rusuluhum bialbayyinaati wabialzzuburi wabialkitaabi almuniiri","translate":{"id":"Dan jika mereka mendustakan kamu, maka sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasulnya); kepada mereka telah datang rasul-rasulnya dengan membawa mu'jizat yang nyata, zubur , dan kitab yang memberi penjelasan yang sempurna .\n","en":"And if they give thee the lie - even so gave the lie to the truth [many of] those who lived before their time, [when] there came unto them their apostles with all evidence of the truth, and with books of divine wisdom, and with light-giving revelation;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3685","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3685.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3685.mp3"]}},{"no":26,"arab":"ثُمَّ أَخَذْتُ الَّذِينَ كَفَرُوا ۖ فَكَيْفَ كَانَ نَكِيرِ","latin":"tsumma akhadztu alladziina kafaruu fakayfa kaana nakiiri","translate":{"id":"Kemudian Aku azab orang-orang yang kafir; maka (lihatlah) bagaimana (hebatnya) akibat kemurkaan-Ku.\n","en":"[but] in the end I took to task all those who were bent on denying the truth: and how awesome was My rejection!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3686","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3686.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3686.mp3"]}},{"no":27,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُخْتَلِفًا أَلْوَانُهَا ۚ وَمِنَ الْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ","latin":"alam tara anna allaaha anzala mina alssamaa-i maa-an fa-akhrajnaa bihi tsamaraatin mukhtalifan alwaanuhaa wamina aljibaali judadun biidhun wahumrun mukhtalifun alwaanuhaa wagharaabiibu suudun","translate":{"id":"Tidakkah kamu melihat bahwasanya Allah menurunkan hujan dari langit lalu Kami hasilkan dengan hujan itu buah-buahan yang beraneka macam jenisnya. Dan di antara gunung-gunung itu ada garis-garis putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat.\n","en":"ART THOU NOT aware that God sends down water from the skies, whereby We bring forth fruits of many hues - just as in the mountains there are streaks of white and red of various shades, as well as (others) raven-black,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3687","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3687.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3687.mp3"]}},{"no":28,"arab":"وَمِنَ النَّاسِ وَالدَّوَابِّ وَالْأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَٰلِكَ ۗ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ ۗ إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ","latin":"wamina alnnaasi waalddawaabbi waal-an'aami mukhtalifun alwaanuhu kadzaalika innamaa yakhsyaa allaaha min 'ibaadihi al'ulamaau inna allaaha 'aziizun ghafuurun","translate":{"id":"Dan demikian (pula) di antara manusia, binatang-binatang melata dan binatang-binatang ternak ada yang bermacam-macam warnanya (dan jenisnya). Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama . Sesungguhnya Allah Maha Perkasa lagi Maha Pengampun.\n","en":"and (as) there are in men, and in crawling beasts, and in cattle, too, many hues? Of all His servants, only such as are endowed with [innate] knowledge stand [truly] in awe of God: [for they alone comprehend that,] verily, God is almighty, much-forgiving."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3688","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3688.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3688.mp3"]}},{"no":29,"arab":"إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَنْ تَبُورَ","latin":"inna alladziina yatluuna kitaaba allaahi wa-aqaamuu alshshalaata wa-anfaquu mimmaa razaqnaahum sirran wa'alaaniyatan yarjuuna tijaaratan lan tabuura","translate":{"id":"Sesungguhnya orang-orang yang selalu membaca kitab Allah dan mendirikan shalat dan menafkahkan sebahagian dari rezki yang Kami anugerahkan kepada mereka dengan diam-diam dan terang-terangan, mereka itu mengharapkan perniagaan yang tidak akan merugi,\n","en":"(It is) they who [truly] follow God’s revelation, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance - it is they who may look forward to a bargain that can never fail,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3689","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3689.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3689.mp3"]}},{"no":30,"arab":"لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُمْ مِنْ فَضْلِهِ ۚ إِنَّهُ غَفُورٌ شَكُورٌ","latin":"liyuwaffiyahum ujuurahum wayaziidahum min fadhlihi innahu ghafuurun syakuurun","translate":{"id":"agar Allah menyempurnakan kepada mereka pahala mereka dan menambah kepada mereka dari karunia-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri .\n","en":"since He will grant them their just rewards, and give them yet more out of His bounty: for, verily, He is much-forgiving, ever-responsive to gratitude."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3690","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3690.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3690.mp3"]}},{"no":31,"arab":"وَالَّذِي أَوْحَيْنَا إِلَيْكَ مِنَ الْكِتَابِ هُوَ الْحَقُّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ ۗ إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ","latin":"waalladzii awhaynaa ilayka mina alkitaabi huwa alhaqqu mushaddiqan limaa bayna yadayhi inna allaaha bi'ibaadihi lakhabiirun bashiirun","translate":{"id":"Dan apa yang telah Kami wahyukan kepadamu yaitu Al Kitab (Al Qur'an) itulah yang benar, dengan membenarkan kitab-kitab yang sebelumnya. Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat (keadaan) hamba-hamba-Nya.\n","en":"And [know that] all of the divine writ with which We have inspired thee is the very truth, confirming the truth of whatever there still remains of earlier revelations for, behold, of [the needs of] His servants God is fully aware, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3691","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3691.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3691.mp3"]}},{"no":32,"arab":"ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا ۖ فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ وَمِنْهُمْ مُقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ","latin":"tsumma awratsnaa alkitaaba alladziina isthafaynaa min 'ibaadinaa faminhum zhaalimun linafsihi waminhum muqtashidun waminhum saabiqun bialkhayraati bi-idzni allaahi dzaalika huwa alfadhlu alkabiiru","translate":{"id":"Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami, lalu di antara mereka ada yang menganiaya diri mereka sendiri dan di antara mereka ada yang pertengahan dan diantara mereka ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah. Yang demikian itu adalah karunia yang amat besar.\n","en":"And so, We have bestowed this divine writ as a heritage unto such of Our servants as We chose: and among them are some who sin against themselves; and some who keep half-way [between right and wrong]; and some who, by God’s leave, are fore­most in deeds of goodness: [and] this, indeed, is a merit most high!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3692","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3692.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3692.mp3"]}},{"no":33,"arab":"جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ","latin":"jannaatu 'adnin yadkhuluunahaa yuhallawna fiihaa min asaawira min dzahabin walu/lu-an walibaasuhum fiihaa hariirun","translate":{"id":"(Bagi mereka) syurga 'Adn mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas, dan dengan mutiara, dan pakaian mereka didalamnya adalah sutera.\n","en":"[Hence,] gardens of perpetual bliss will they enter, therein to be adorned with bracelets of gold and pearls, and therein to be clad in raiments of silk;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3693","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3693.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3693.mp3"]}},{"no":34,"arab":"وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ","latin":"waqaaluu alhamdu lillaahi alladzii adzhaba 'annaa alhazana inna rabbanaa laghafuurun syakuurun","translate":{"id":"Dan mereka berkata: \"Segala puji bagi Allah yang telah menghilangkan duka cita dari kami. Sesungguhnya Tuhan kami benar-benar Maha Pengampum lagi Maha Mensyukuri.\n","en":"and they will say: “All praise is due to God, who has caused all sorrow to leave us: for, verily, our Sustainer is indeed much-forgiving, ever-responsive to gratitude –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3694","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3694.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3694.mp3"]}},{"no":35,"arab":"الَّذِي أَحَلَّنَا دَارَ الْمُقَامَةِ مِنْ فَضْلِهِ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ","latin":"alladzii ahallanaa daara almuqaamati min fadhlihi laa yamassunaa fiihaa nashabun walaa yamassunaa fiihaa lughuubun","translate":{"id":"Yang menempatkan kami dalam tempat yang kekal (surga) dari karunia-Nya; didalamnya kami tiada merasa lelah dan tiada pula merasa lesu\".\n","en":"He who, out of His bounty, has made us alight in this abode of life enduring, wherein no struggle can assail us, and wherein no weariness can touch us!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3695","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3695.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3695.mp3"]}},{"no":36,"arab":"وَالَّذِينَ كَفَرُوا لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَىٰ عَلَيْهِمْ فَيَمُوتُوا وَلَا يُخَفَّفُ عَنْهُمْ مِنْ عَذَابِهَا ۚ كَذَٰلِكَ نَجْزِي كُلَّ كَفُورٍ","latin":"waalladziina kafaruu lahum naaru jahannama laa yuqdaa 'alayhim fayamuutuu walaa yukhaffafu 'anhum min 'adzaabihaa kadzaalika najzii kulla kafuurin","translate":{"id":"Dan orang-orang kafir bagi mereka neraka Jahannam. Mereka tidak dibinasakan sehingga mereka mati dan tidak (pula) diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir.\n","en":"But as for those who are bent on denying the truth - the fire of hell awaits them: no end shall be put to their lives so that they could die, nor shall aught of the suffering caused by that [fire] be lightened for them: thus shall We requite all who are bereft of gratitude."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3696","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3696.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3696.mp3"]}},{"no":37,"arab":"وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَا أَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِي كُنَّا نَعْمَلُ ۚ أَوَلَمْ نُعَمِّرْكُمْ مَا يَتَذَكَّرُ فِيهِ مَنْ تَذَكَّرَ وَجَاءَكُمُ النَّذِيرُ ۖ فَذُوقُوا فَمَا لِلظَّالِمِينَ مِنْ نَصِيرٍ","latin":"wahum yastharikhuuna fiihaa rabbanaa akhrijnaa na'mal shaalihan ghayra alladzii kunnaa na'malu awa lam nu'ammirkum maa yatadzakkaru fiihi man tadzakkara wajaa-akumu alnnadziiru fadzuuquu famaa lilzhzhaalimiina min nashiirin","translate":{"id":"Dan mereka berteriak di dalam neraka itu : \"Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh berlainan dengan yang telah kami kerjakan\". Dan apakah Kami tidak memanjangkan umurmu dalam masa yang cukup untuk berfikir bagi orang yang mau berfikir, dan (apakah tidak) datang kepada kamu pemberi peringatan ? maka rasakanlah (azab Kami) dan tidak ada bagi orang-orang yang zalim seorang penolongpun.\n","en":"And in that [hell] they will cry aloud: “O our Sustainer! Cause us to come out [of this suffering]! We shall [henceforth] do good deeds, not such as we were wont to do [aforetime]!” [But We shall answer:] “Did We not grant you a life long enough so that whoever was willing to take thought could bethink himself? And [withal,] a war­ner had come unto you! Taste, then, [the fruit of your evil deeds]: for evildoers shall have none to succour them!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3697","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3697.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3697.mp3"]}},{"no":38,"arab":"إِنَّ اللَّهَ عَالِمُ غَيْبِ السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"inna allaaha 'aalimu ghaybi alssamaawaati waal-ardhi innahu 'aliimun bidzaati alshshuduuri","translate":{"id":"Sesungguhnya Allah mengetahui yang tersembunyi di langit dan di bumi. Sesungguhnya Dia Maha Mengetahui segala isi hati.\n","en":"Verily, God knows the hidden reality of the heavens and the earth: [and,] behold, He has full knowledge of what is in the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3698","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3698.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3698.mp3"]}},{"no":39,"arab":"هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ ۚ فَمَنْ كَفَرَ فَعَلَيْهِ كُفْرُهُ ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ عِنْدَ رَبِّهِمْ إِلَّا مَقْتًا ۖ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا","latin":"huwa alladzii ja'alakum khalaa-ifa fii al-ardhi faman kafara fa'alayhi kufruhu walaa yaziidu alkaafiriina kufruhum 'inda rabbihim illaa maqtan walaa yaziidu alkaafiriina kufruhum illaa khasaaraan","translate":{"id":"Dia-lah yang menjadikan kamu khalifah-khalifah di muka bumi. Barangsiapa yang kafir, maka (akibat) kekafirannya menimpa dirinya sendiri. Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kemurkaan pada sisi Tuhannya dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka.\n","en":"He it is who has made you inherit the earth. Hence, he who is bent on denying the truth [of God’s oneness and uniqueness ought to know that] this denial of his will fall back upon him: for their [per­sistent] denial of this truth does but add to the deniers’ loathsomeness in their Sustainer’s sight and, thus, their denial of this truth does but add to the deniers’ loss."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3699","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3699.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3699.mp3"]}},{"no":40,"arab":"قُلْ أَرَأَيْتُمْ شُرَكَاءَكُمُ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ أَمْ آتَيْنَاهُمْ كِتَابًا فَهُمْ عَلَىٰ بَيِّنَتٍ مِنْهُ ۚ بَلْ إِنْ يَعِدُ الظَّالِمُونَ بَعْضُهُمْ بَعْضًا إِلَّا غُرُورًا","latin":"qul ara-aytum syurakaa-akumu alladziina tad'uuna min duuni allaahi aruunii maatsaa khalaquu mina al-ardhi am lahum syirkun fii alssamaawaati am aataynaahum kitaaban fahum 'alaa bayyinatin minhu bal in ya'idu alzhzhaalimuuna ba'dhuhum ba'dhan illaa ghuruuraan","translate":{"id":"Katakanlah: \"Terangkanlah kepada-Ku tentang sekutu-sekutumu yang kamu seru selain Allah. Perlihatkanlah kepada-Ku (bahagian) manakah dari bumi ini yang telah mereka ciptakan ataukah mereka mempunyai saham dalam (penciptaan) langit atau adakah Kami memberi kepada mereka sebuah Kitab sehingga mereka mendapat keterangan-keterangan yang jelas daripadanya? Sebenarnya orang-orang yang zalim itu sebahagian dari mereka tidak menjanjikan kepada sebahagian yang lain, melainkan tipuan belaka\".\n","en":"Say: “Have you ever [really] considered those beings and forces to whom you ascribe a share in God’s divinity, [and] whom you invoke beside God? Show me what it is that they have created on earth - or do [you claim that] they have a share in [govern­ing] the heavens?” Have We ever vouchsafed them a divine writ on which they could rely as evidence [in support of their views]? Nay, [the hope which] the evildoers hold out to one another [is] nothing but a delusion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3700","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3700.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3700.mp3"]}},{"no":41,"arab":"إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالْأَرْضَ أَنْ تَزُولَا ۚ وَلَئِنْ زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِنْ بَعْدِهِ ۚ إِنَّهُ كَانَ حَلِيمًا غَفُورًا","latin":"inna allaaha yumsiku alssamaawaati waal-ardha an tazuulaa wala-in zaalataa in amsakahumaa min ahadin min ba'dihi innahu kaana haliiman ghafuuraan","translate":{"id":"Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorangpun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.\n","en":"Verily, it is God [alone] who upholds the celestial bodies and the earth, lest they deviate [from their orbits] - for if they should ever deviate, there is none that could uphold them after He will have ceased to do so. [But,] verily, He is ever-forbearing, much-for­giving!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3701","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3701.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3701.mp3"]}},{"no":42,"arab":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ جَاءَهُمْ نَذِيرٌ لَيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى الْأُمَمِ ۖ فَلَمَّا جَاءَهُمْ نَذِيرٌ مَا زَادَهُمْ إِلَّا نُفُورًا","latin":"wa-aqsamuu biallaahi jahda aymaanihim la-in jaa-ahum nadziirun layakuununna ahdaa min ihdaa al-umami falammaa jaa-ahum nadziirun maa zaadahum illaa nufuuraan","translate":{"id":"Dan mereka bersumpah dengan nama Allah dengan sekuat-kuat sumpah; sesungguhnya jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat (yang lain). Tatkala datang kepada mereka pemberi peringatan, maka kedatangannya itu tidak menambah kepada mereka, kecuali jauhnya mereka dari (kebenaran),\n","en":"As it is, they [who are averse to the truth often] swear by God with their most solemn oaths that if a warner should ever come to them, they would follow his guidance better than any of the communities [of old had followed the warner sent to them]: but now that a warner has come unto them, [his call] but increases their aversion,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3702","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3702.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3702.mp3"]}},{"no":43,"arab":"اسْتِكْبَارًا فِي الْأَرْضِ وَمَكْرَ السَّيِّئِ ۚ وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ ۚ فَهَلْ يَنْظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ ۚ فَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا ۖ وَلَنْ تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا","latin":"istikbaaran fii al-ardhi wamakra alssayyi-i walaa yahiiqu almakru alssayyi-u illaa bi-ahlihi fahal yanzhuruuna illaa sunnata al-awwaliina falan tajida lisunnati allaahi tabdiilan walan tajida lisunnati allaahi tahwiilaan","translate":{"id":"karena kesombongan (mereka) di muka bumi dan karena rencana (mereka) yang jahat. Rencana yang jahat itu tidak akan menimpa selain orang yang merencanakannya sendiri. Tiadalah yang mereka nanti-nantikan melainkan (berlakunya) sunnah (Allah yang telah berlaku) kepada orang-orang yang terdahulu ka sekali-kali kamu tidak akan mendapat penggantian bagi sunnah Allah, dan sekali-kali tidak (pula) akan menemui penyimpangan bagi sunnah Allah itu.\n","en":"their arro­gant behaviour on earth, and their devising of evil [arguments against God’s messages]. Yet [in the end,] such evil scheming will engulf none but its authors: and can they expect anything but [to be made to go] the way of those [sinners] of olden times? Thus [it is]: no change wilt thou ever find in God’s way; yea, no deviation wilt thou ever find in God’s way!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3703","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3703.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3703.mp3"]}},{"no":44,"arab":"أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ وَكَانُوا أَشَدَّ مِنْهُمْ قُوَّةً ۚ وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِنْ شَيْءٍ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ إِنَّهُ كَانَ عَلِيمًا قَدِيرًا","latin":"awa lam yasiiruu fii al-ardhi fayanzhuruu kayfa kaana 'aaqibatu alladziina min qablihim wakaanuu asyadda minhum quwwatan wamaa kaana allaahu liyu'jizahu min syay-in fii alssamaawaati walaa fii al-ardhi innahu kaana 'aliiman qadiiraan","translate":{"id":"Dan apakah mereka tidak berjalan di muka bumi, lalu melihat bagaimana kesudahan orang-orang yang sebelum mereka, sedangkan orang-orang itu adalah lebih besar kekuatannya dari mereka? Dan tiada sesuatupun yang dapat melemahkan Allah baik di langit maupun di bumi. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa.\n","en":"Have they never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time and were [so much] greater than they in power? And [do they not see that the will of] God can never be foiled by anything whatever in the heavens or on earth, since, verily, He is all-knowing, infinite in His power?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3704","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3704.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3704.mp3"]}},{"no":45,"arab":"وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِنْ دَابَّةٍ وَلَٰكِنْ يُؤَخِّرُهُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۖ فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا","latin":"walaw yu-aakhidzu allaahu alnnaasa bimaa kasabuu maa taraka 'alaa zhahrihaa min daabbatin walaakin yu-akhkhiruhum ilaa ajalin musamman fa-idzaa jaa-a ajaluhum fa-inna allaaha kaana bi'ibaadihi bashiiraan","translate":{"id":"Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya, niscaya Dia tidak akan meninggalkan di atas permukaan bumi suatu mahluk yang melatapun akan tetapi Allah menangguhkan (penyiksaan) mereka, sampai waktu yang tertentu; maka apabila datang ajal mereka, maka sesungguhnya Allah adalah Maha Melihat (keadaan) hamba-hamba-Nya.\n","en":"Now if God were to take men [at once] to task for whatever [wrong] they commit [on earth], He would not leave a single living creature upon its surface. However, He grants them respite for a term set [by Him]: but when their term comes to an end - then, verily, [they come to know that] God sees all that is in [the hearts of] His servants."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3705","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/3705.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/3705.mp3"]}}]}