{"alquran":{"no":39,"name":"Az-Zumar","arab":"الزمر","start":4058,"count":75,"rukku":8,"type":"mecca","description":"Surat Az Zumar terdiri ataz 75 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Saba'. Dinamakan <i>Az Zumar</i> (Rombongan-rombongan) karena perkataan <i>Az Zumar</i> yang terdapat pada ayat 71 dan 73 ini. Dalam ayat-ayat tersebut diterangkan keadaan manusia di hari kiamat setelah mereka dihisab, di waktu itu mereka terbagi atas dua rombongan; satu rombongan dibawa ke neraka dan satu rombongan lagi dibawa ke syurga. Masing- masing rombongan memperoleh balasan dari apa yang mereka kerjakan di dunia dahulu. Surat ini dinamakan juga <i>Al Ghuraf</i> (kamar-kamar) berhubung perkataan <i>ghuraf</i> yang terdapat pada ayat 20, dimana diterangkan keadaan kamar-kamar dalam syurga yang diperoleh orang-orang yang bertakwa."},"surah":[{"no":1,"arab":" تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ","latin":"tanziilu alkitaabi mina allaahi al'aziizi alhakiimi","translate":{"id":"Kitab (Al Quraan ini) diturunkan oleh Allah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4059","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4059.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4059.mp3"]}},{"no":2,"arab":"إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَهُ الدِّينَ","latin":"innaa anzalnaa ilayka alkitaaba bialhaqqi fau'budi allaaha mukhlishan lahu alddiina","translate":{"id":"Sesunguhnya Kami menurunkan kepadamu Kitab (Al Quraan) dengan (membawa) kebenaran. Maka sembahlah Allah dengan memurnikan keta'atan kepada-Nya.\n","en":"for, behold, it is We who have bestowed this revela­tion upon thee from on high, setting forth the truth: so worship Him, sincere in thy faith in Him alone!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4060","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4060.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4060.mp3"]}},{"no":3,"arab":"أَلَا لِلَّهِ الدِّينُ الْخَالِصُ ۚ وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ","latin":"alaa lillaahi alddiinu alkhaalishu waalladziina ittakhadzuu min duunihi awliyaa-a maa na'buduhum illaa liyuqarribuunaa ilaa allaahi zulfaa inna allaaha yahkumu baynahum fii maa hum fiihi yakhtalifuuna inna allaaha laa yahdii man huwa kaadzibun kaffaarun","translate":{"id":"Ingatlah, hanya kepunyaan Allah-lah agama yang bersih (dari syirik). Dan orang-orang yang mengambil pelindung selain Allah (berkata): \"Kami tidak menyembah mereka melainkan supaya mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya\". Sesungguhnya Allah akan memutuskan di antara mereka tentang apa yang mereka berselisih padanya. Sesungguhnya Allah tidak menunjuki orang-orang yang pendusta dan sangat ingkar.\n","en":"Is it not to God alone that all sincere faith is due? And yet, they who take for their protectors aught beside Him [are wont to say], “We worship them for no other reason than that they bring us nearer to God.” Behold, God will judge between them [on Resur­rection Day] with regard to all wherein they differ [from the truth]: for, verily, God does not grace with His guidance anyone who is bent on lying [to himself and is] stubbornly ingrate!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4061","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4061.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4061.mp3"]}},{"no":4,"arab":"لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ","latin":"law araada allaahu an yattakhidza waladan laisthafaa mimmaa yakhluqu maa yasyaau subhaanahu huwa allaahu alwaahidu alqahhaaru","translate":{"id":"Kalau sekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang dikehendaki-Nya di antara ciptaan-ciptaan yang telah diciptakan-Nya. Maha Suci Allah. Dialah Allah Yang Maha Esa lagi Maha Mengalahkan.\n","en":"Had God willed to take Unto Himself a son, He could have chosen anyone that He wanted out of whatever He has created - [but] limitless is He in His glory! He is the One God, the One who holds absolute sway over all that exists!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4062","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4062.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4062.mp3"]}},{"no":5,"arab":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۗ أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ","latin":"khalaqa alssamaawaati waal-ardha bialhaqqi yukawwiru allayla 'alaa alnnahaari wayukawwiru alnnahaara 'alaa allayli wasakhkhara alsysyamsa waalqamara kullun yajrii li-ajalin musamman alaa huwa al'aziizu alghaffaaru","translate":{"id":"Dia menciptakan langit dan bumi dengan (tujuan) yang benar; Dia menutupkan malam atas siang dan menutupkan siang atas malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Ingatlah Dialah Yang Maha Perkasa lagi Maha Pengampun.\n","en":"He it is who has created the heavens and the earth in accordance with [an inner] truth. He causes the night to flow into the day, and causes the day to flow into the night; and He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. Is not He the Almighty, the All-Forgiving?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4063","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4063.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4063.mp3"]}},{"no":6,"arab":"خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنْزَلَ لَكُمْ مِنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ ۚ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِنْ بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ","latin":"khalaqakum min nafsin waahidatin tsumma ja'ala minhaa zawjahaa wa-anzala lakum mina al-an'aami tsamaaniyata azwaajin yakhluqukum fii buthuuni ummahaatikum khalqan min ba'di khalqin fii zhulumaatin tsalaatsin dzaalikumu allaahu rabbukum lahu almulku laa ilaaha illaa huwa fa-annaa tushrafuuna","translate":{"id":"Dia menciptakan kamu dari seorang diri kemudian Dia jadikan daripadanya isterinya dan Dia menurunkan untuk kamu delapan ekor yang berpasangan dari binatang ternak. Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan . Yang (berbuat) demikian itu adalah Allah, Tuhan kamu, Tuhan Yang mempunyai kerajaan. Tidak ada Tuhan selain Dia; maka bagaimana kamu dapat dipalingkan?\n","en":"He has created you [all] out of one living entity, and out of it fashioned its mate; and he has be­stowed upon you four kinds of cattle of either sex; [and] He creates you in your mothers’ wombs, one act of creation after another, in threefold depths of darkness. Thus is God, your Sustainer: unto Him belongs all dominion: there is no deity save Him: how, then, can you lose sight of the truth?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4064","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4064.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4064.mp3"]}},{"no":7,"arab":"إِنْ تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنْكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"in takfuruu fa-inna allaaha ghaniyyun 'ankum walaa yardaa li'ibaadihi alkufra wa-in tasykuruu yardhahu lakum walaa taziru waaziratun wizra ukhraa tsumma ilaa rabbikum marji'ukum fayunabbi-ukum bimaa kuntum ta'maluuna innahu 'aliimun bidzaati alshshuduuri","translate":{"id":"Jika kamu kafir maka sesungguhnya Allah tidak memerlukan (iman)mu dan Dia tidak meridhai kekafiran bagi hamba-Nya; dan jika kamu bersyukur, niscaya Dia meridhai bagimu kesyukuranmu itu; dan seorang yang berdosa tidak akan memikul dosa orang lain . Kemudian kepada Tuhanmulah kembalimu lalu Dia memberitakan kepadamu apa yang telah kamu kerjakan. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan dalam (dada)mu.\n","en":"If you are ingrate behold, God has no need of you; none the less, He does not approve of in­gratitude in His servants: whereas, if you show grati­tude, He approves it in you. And no bearer of burdens shall be made to bear another’s burden. In time, unto your Sustainer you all must return, and then He will make you [truly] understand all that you were doing [in life]: for, verily, He has full knowledge of what is in the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4065","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4065.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4065.mp3"]}},{"no":8,"arab":"وَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلَّهِ أَنْدَادًا لِيُضِلَّ عَنْ سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ","latin":"wa-idzaa massa al-insaana dhurrun da'aa rabbahu muniiban ilayhi tsumma idzaa khawwalahu ni'matan minhu nasiya maa kaana yad'uu ilayhi min qablu waja'ala lillaahi andaadan liyudhilla 'an sabiilihi qul tamatta' bikufrika qaliilan innaka min ash-haabi alnnaari","translate":{"id":"Dan apabila manusia itu ditimpa kemudharatan, dia memohon (pertolongan) kepada Tuhannya dengan kembali kepada-Nya; kemudian apabila Tuhan memberikan ni'mat-Nya kepadanya lupalah dia akan kemudharatan yang pernah dia berdo'a (kepada Allah) untuk (menghilangkannya) sebelum itu, dan dia mengada-adakan sekutu-sekutu bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah: \"Bersenang-senanglah dengan kekafiranmu itu sementara waktu; sesungguhnya kamu termasuk penghuni neraka\".\n","en":"NOW [thus it is:] when affliction befalls man, he is likely to cry out to his Sustainer, turning unto Him [for help]; but as soon as He has bestowed upon him a boon by His grace, he forgets Him whom he in­voked before, and claims that there are other powers that could rival God - and thus leads [others] astray from His path. Say [unto him who sins in this way]: “Enjoy thyself for a while in this thy denial of the truth; [yet,] verily, thou art of those who are destined for the fire!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4066","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4066.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4066.mp3"]}},{"no":9,"arab":"أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ ۗ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ","latin":"amman huwa qaanitun aanaa-a allayli saajidan waqaa-iman yahtsaru al-aakhirata wayarjuu rahmata rabbihi qul hal yastawii alladziina ya'lamuuna waalladziina laa ya'lamuuna innamaa yatadzakkaru uluu al-albaabi","translate":{"id":"(Apakah kamu hai orang musyrik yang lebih beruntung) ataukah orang yang beribadat di waktu-waktu malam dengan sujud dan berdiri, sedang ia takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya? Katakanlah: \"Adakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?\" Sesungguhnya orang yang berakallah yang dapat menerima pelajaran.\n","en":"Or [dost thou deem thyself equal to] one who devoutly worships [God] throughout the night, prostrating himself or standing [in prayer], ever- mindful of the life to come, and hoping for his Sustainer’s grace?” Say: “Can they who know and they who do not know be deemed equal?” [But] only they who are endowed with insight keep this in mind!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4067","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4067.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4067.mp3"]}},{"no":10,"arab":"قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ","latin":"qul yaa 'ibaadi alladziina aamanuu ittaquu rabbakum lilladziina ahsanuu fii haadzihi alddunyaa hasanatun wa-ardhu allaahi waasi'atun innamaa yuwaffaa alshshaabiruuna ajrahum bighayri hisaabin","translate":{"id":"Katakanlah: \"Hai hamba-hamba-Ku yang beriman. Bertakwalah kepada Tuhanmu\". Orang-orang yang berbuat baik di dunia ini memperoleh kebaikan. Dan bumi Allah itu adalah luas. Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas.\n","en":"Say: “[Thus speaks God:] ‘O you servants of Mine who have attained to faith! Be conscious of your Sustainer! Ultimate good awaits those who per­severe in doing good in this world. And [remember:] wide is God’s earth, [and,] verily, they who are patient in adversity will be given their reward in full, beyond all reckoning!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4068","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4068.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4068.mp3"]}},{"no":11,"arab":"قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ","latin":"qul innii umirtu an a'buda allaaha mukhlishan lahu alddiina","translate":{"id":"Katakanlah: \"Sesungguhnya aku diperintahkan supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama.\n","en":"Say [O Muhammad]: “Behold, I am bidden to worship God, sincere in my faith in Him alone;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4069","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4069.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4069.mp3"]}},{"no":12,"arab":"وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ","latin":"waumirtu li-an akuuna awwala almuslimiina","translate":{"id":"Dan aku diperintahkan supaya menjadi orang yang pertama-tama berserah diri\".\n","en":"and I am bidden to be foremost among those who surrender themselves unto God.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4070","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4070.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4070.mp3"]}},{"no":13,"arab":"قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ","latin":"qul innii akhaafu in 'ashaytu rabbii 'adzaaba yawmin 'azhiimin","translate":{"id":"Katakanlah: \"Sesungguhnya aku takut akan siksaan hari yang besar jika aku durhaka kepada Tuhanku\".\n","en":"Say: “Behold, I would dread, were I to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment].”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4071","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4071.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4071.mp3"]}},{"no":14,"arab":"قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي","latin":"quli allaaha a'budu mukhlishan lahu diinii","translate":{"id":"Katakanlah: \"Hanya Allah saja Yang aku sembah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agamaku\".\n","en":"Say: “God alone do I worship, sincere in my faith in Him alone -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4072","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4072.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4072.mp3"]}},{"no":15,"arab":"فَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ ۗ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ","latin":"fau'buduu maa syi/tum min duunihi qul inna alkhaasiriina alladziina khasiruu anfusahum wa-ahliihim yawma alqiyaamati alaa dzaalika huwa alkhusraanu almubiinu","translate":{"id":"Maka sembahlah olehmu (hai orang-orang musyrik) apa yang kamu kehendaki selain Dia . Katakanlah: \"Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat\". Ingatlah yang demikian itu adalah kerugian yang nyata.\n","en":"and [it is up to you, O sinners, to] worship whatever you please instead of Him!” Say: “Behold, the [true] losers will be they who shall have lost their own selves and their kith and kin on Resurrection Day: for is not this, this, the [most] obvious loss?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4073","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4073.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4073.mp3"]}},{"no":16,"arab":"لَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ ۚ يَا عِبَادِ فَاتَّقُونِ","latin":"lahum min fawqihim zhulalun mina alnnaari wamin tahtihim zhulalun dzaalika yukhawwifu allaahu bihi 'ibaadahu yaa 'ibaadi faittaquuni","translate":{"id":"Bagi mereka lapisan-lapisan dari api di atas mereka dan di bawah merekapun lapisan-lapisan (dari api). Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu. Maka bertakwalah kepada-Ku hai hamba-hamba-Ku.\n","en":"Clouds of fire will they have above them, and [similar] clouds beneath them…” In this way does God imbue His servants with fear. O you servants of Mine! Be, then, conscious of Me -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4074","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4074.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4074.mp3"]}},{"no":17,"arab":"وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَنْ يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ","latin":"waalladziina ijtanabuu alththaaghuuta an ya'buduuhaa wa-anaabuu ilaa allaahi lahumu albusyraa fabasysyir 'ibaadi","translate":{"id":"Dan orang-orang yang menjauhi thaghut (yaitu) tidak menyembahnya dan kembali kepada Allah, bagi mereka berita gembira; sebab itu sampaikanlah berita itu kepada hamba-hamba-Ku,\n","en":"seeing that for those who shun the powers of evil lest they [be tempted to] worship them, and turn unto God instead, there is the glad tiding [of happiness in the life to come]. Give, then, this glad tiding to [those of] My ser­vants"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4075","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4075.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4075.mp3"]}},{"no":18,"arab":"الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ ۚ أُولَٰئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ ۖ وَأُولَٰئِكَ هُمْ أُولُو الْأَلْبَابِ","latin":"alladziina yastami'uuna alqawla fayattabi'uuna ahsanahu ulaa-ika alladziina hadaahumu allaahu waulaa-ika hum uluu al-albaabi","translate":{"id":"yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya . Mereka itulah orang-orang yang telah diberi Allah petunjuk dan mereka itulah orang-orang yang mempunyai akal.\n","en":"who listen [closely] to all that is said, and follow the best of it: [for] it is they whom God has graced with His guidance, and it is they who are [truly] endowed with insight!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4076","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4076.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4076.mp3"]}},{"no":19,"arab":"أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ","latin":"afaman haqqa 'alayhi kalimatu al'adzaabi afa-anta tunqidzu man fii alnnaari","translate":{"id":"Apakah (kamu hendak merobah nasib) orang-orang yang telah pasti ketentuan azab atasnya? Apakah kamu akan menyelamatkan orang yang berada dalam api neraka?\n","en":"On the other hand, could one on whom [God’s] sentence of suffering has been passed [be rescued by man]? Couldst thou, perchance, save one who is [already, as it were,] in the fire?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4077","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4077.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4077.mp3"]}},{"no":20,"arab":"لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِنْ فَوْقِهَا غُرَفٌ مَبْنِيَّةٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ","latin":"laakini alladziina ittaqaw rabbahum lahum ghurafun min fawqihaa ghurafun mabniyyatun tajrii min tahtihaa al-anhaaru wa'da allaahi laa yukhlifu allaahu almii'aada","translate":{"id":"Tetapi orang-orang yang bertakwa kepada Tuhannya mereka mendapat tempat-tempat yang tinggi, di atasnya dibangun pula tempat-tempat yang tinggi yang di bawahnya mengalir sungai-sungai. Allah telah berjanji dengan sebenar-benarnya. Allah tidak akan memungkiri janji-Nya.\n","en":"As against this they who of their Sustainer are conscious shall [in the life to come] have man­sions raised upon mansions high, beneath which run­ning waters flow: [this is] God’s promise - [and] never does God fail to fulfill His promise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4078","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4078.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4078.mp3"]}},{"no":21,"arab":"أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا ۚ إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِأُولِي الْأَلْبَابِ","latin":"alam tara anna allaaha anzala mina alssamaa-i maa-an fasalakahu yanaabii'a fii al-ardhi tsumma yukhriju bihi zar'an mukhtalifan alwaanuhu tsumma yahiiju fataraahu mushfarran tsumma yaj'aluhu huthaaman inna fii dzaalika ladzikraa li-ulii al-albaabi","translate":{"id":"Apakah kamu tidak memperhatikan, bahwa sesungguhnya Allah menurunkan air dari langit, maka diaturnya menjadi sumber-sumber air di bumi kemudian ditumbuhkan-Nya dengan air itu tanam-tanaman yang bermacam-macam warnanya, lalu menjadi kering lalu kamu melihatnya kekuning-kuningan, kemudian dijadikan-Nya hancur berderai-derai. Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran bagi orang-orang yang mempunyai akal.\n","en":"ART THOU NOT aware that it is God who sends down water from the skies, and then causes it to travel through the earth in the shape of springs? And then He brings forth thereby herbage of various hues; and then it withers, and thou canst see it turn yellow; and in the end He causes it to crumble to dust. Verily, in [all] this there is indeed a reminder to those who are endowed with insight!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4079","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4079.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4079.mp3"]}},{"no":22,"arab":"أَفَمَنْ شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِنْ رَبِّهِ ۚ فَوَيْلٌ لِلْقَاسِيَةِ قُلُوبُهُمْ مِنْ ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ","latin":"afaman syaraha allaahu shadrahu lil-islaami fahuwa 'alaa nuurin min rabbihi fawaylun lilqaasiyati quluubuhum min dzikri allaahi ulaa-ika fii dhalaalin mubiinin","translate":{"id":"Maka apakah orang-orang yang dibukakan Allah hatinya untuk (menerima) agama Islam lalu ia mendapat cahaya dari Tuhannya (sama dengan orang yang membatu hatinya)? Maka kecelakaan yang besarlah bagi mereka yang telah membatu hatinya untuk mengingat Allah. Mereka itu dalam kesesatan yang nyata.\n","en":"Could, then, one whose bosom God has opened wide with willingness towards self-surrender unto Him, so that he is illumined by a light [that flows] from his Sustainer, [be likened to the blind and deaf of heart]? Woe, then, unto those whose hearts are hardened against all remembrance of God! They are most obviously lost in error!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4080","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4080.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4080.mp3"]}},{"no":23,"arab":"اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُتَشَابِهًا مَثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","latin":"allaahu nazzala ahsana alhadiitsi kitaaban mutasyaabihan matsaaniya taqsya'irru minhu juluudu alladziina yakhsyawna rabbahum tsumma taliinu juluuduhum waquluubuhum ilaa dzikri allaahi dzaalika hudaa allaahi yahdii bihi man yasyaau waman yudhlili allaahu famaa lahu min haadin","translate":{"id":"Allah telah menurunkan perkataan yang paling baik (yaitu) Al Qur'an yang serupa (mutu ayat-ayatnya) lagi berulang-ulang , gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka di waktu mengingat Allah. Itulah petunjuk Allah, dengan kitab itu Dia menunjuki siapa yang dikehendaki-Nya. Dan barangsiapa yang disesatkan Allah, niscaya tak ada baginya seorang pemimpinpun.\n","en":"God bestows from on high the best of all teachings in the shape of a divine writ fully consistent within itself, repeating each statement [of the truth] in manifold forms [a divine writ] whereat shiver the skins of all who of their Sustainer stand in awe: [but] in the end their skins and their hearts do soften at the remembrance of [the grace of] God. Such is God’s guidance: He guides therewith him that wills [to be guided] whereas he whom God lets go astray can never find any guide"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4081","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4081.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4081.mp3"]}},{"no":24,"arab":"أَفَمَنْ يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنْتُمْ تَكْسِبُونَ","latin":"afaman yattaqii biwajhihi suu-a al'adzaabi yawma alqiyaamati waqiila lilzhzhaalimiina dzuuquu maa kuntum taksibuuna","translate":{"id":"Maka apakah orang-orang yang menoleh dengan mukanya menghindari azab yang buruk pada hari kiamat (sama dengan orang mu'min yang tidak kena azab)? Dan dikatakan kepada orang-orang yang zalim: \"Rasakanlah olehmu balasan apa yang telah kamu kerjakan\".\n","en":"Could, then, one who shall have nothing but is [bare] face to protect him from the awful suffering [that will befall him] on Resurrection Day [be likened to the God-conscious]? [On that Day,] the evildoers will be told: “Taste [now] what you have earned [in life]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4082","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4082.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4082.mp3"]}},{"no":25,"arab":"كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","latin":"kadzdzaba alladziina min qablihim fa-ataahumu al'adzaabu min haytsu laa yasy'uruuna","translate":{"id":"Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul), maka datanglah kepada mereka azab dari arah yang tidak mereka sangka.\n","en":"Those who lived before them did [too] give the lie to the truth - whereupon suffering befell them without their having perceived whence it came:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4083","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4083.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4083.mp3"]}},{"no":26,"arab":"فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ","latin":"fa-adzaaqahumu allaahu alkhizya fii alhayaati alddunyaa wala'adzaabu al-aakhirati akbaru law kaanuu ya'lamuuna","translate":{"id":"Maka Allah merasakan kepada mereka kehinaan pada kehidupan dunia. Dan sesungguhnya azab pada hari akhirat lebih besar kalau mereka mengetahui.\n","en":"and thus God let them taste ignominy [even] in the life of this world. Yet [how] much greater will be the [sinners’] suffering in the life to come - if they [who now deny the truth] but knew it!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4084","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4084.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4084.mp3"]}},{"no":27,"arab":"وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ لَعَلَّهُمْ يَتَذَكَّرُونَ","latin":"walaqad dharabnaa lilnnaasi fii haadzaa alqur-aani min kulli matsalin la'allahum yatadzakkaruuna","translate":{"id":"Sesungguhnya telah Kami buatkan bagi manusia dalam Al Quraan ini setiap macam perumpamaan supaya mereka dapat pelajaran.\n","en":"THUS, INDEED, have We propounded unto men all kinds of parables in this Qur’an, so that they might bethink themselves; [and We have revealed it]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4085","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4085.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4085.mp3"]}},{"no":28,"arab":"قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَعَلَّهُمْ يَتَّقُونَ","latin":"qur-aanan 'arabiyyan ghayra dzii 'iwajin la'allahum yattaquuna","translate":{"id":"(Ialah) Al Quraan dalam bahasa Arab yang tidak ada kebengkokan (di dalamnya) supaya mereka bertakwa.\n","en":"as a discourse in the Arabic tongue, free of all devious­ness, so that they might become conscious of God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4086","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4086.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4086.mp3"]}},{"no":29,"arab":"ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","latin":"dharaba allaahu matsalan rajulan fiihi syurakaau mutasyaakisuuna warajulan salaman lirajulin hal yastawiyaani matsalan alhamdu lillaahi bal aktsaruhum laa ya'lamuuna","translate":{"id":"Allah membuat perumpamaan (yaitu) seorang laki-laki (budak) yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan dan seorang budak yang menjadi milik penuh dari seorang laki-laki (saja); Adakah kedua budak itu sama halnya? Segala puji bagi Allah tetapi kebanyakan mereka tidak mengetahui.\n","en":"[To this end,] God sets forth a parable: A man who has for his masters several partners, [all of them] at variance with one another, and a man depending wholly on one person: can these two be deemed equal as regards their condition? [Nay,] all praise is due to God [alone]: but most of them do not understand this."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4087","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4087.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4087.mp3"]}},{"no":30,"arab":"إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ","latin":"innaka mayyitun wa-innahum mayyituuna","translate":{"id":"Sesungguhnya kamu akan mati dan sesungguhnya mereka akan mati (pula).\n","en":"Yet, verily, thou art bound to die, [O Muhammad,] and, verily, they, too, are bound to die:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4088","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4088.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4088.mp3"]}},{"no":31,"arab":"ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُونَ","latin":"tsumma innakum yawma alqiyaamati 'inda rabbikum takhtashimuuna","translate":{"id":"Kemudian sesungguhnya kamu pada hari kiamat akan berbantah-bantah di hadapan Tuhanmu.\n","en":"and then, behold, on the Day of Resurrection you all shall place your dispute before your Sustainer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4089","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4089.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4089.mp3"]}},{"no":32,"arab":"فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ","latin":"faman azhlamu mimman kadzaba 'alaa allaahi wakadzdzaba bialshshidqi idz jaa-ahu alaysa fii jahannama matswan lilkaafiriina","translate":{"id":"Maka siapakah yang lebih zalim daripada orang yang membuat-buat dusta terhadap Allah dan mendustakan kebenaran ketika datang kepadanya? Bukankah di neraka Jahannam tersedia tempat tinggal bagi orang-orang yang kafir?\n","en":"And who could be more wicked than he who invents lies about God? and gives the lie to the truth as soon as it has been placed before him? Is not hell the [proper] abode for all who deny the truth?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4090","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4090.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4090.mp3"]}},{"no":33,"arab":"وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ ۙ أُولَٰئِكَ هُمُ الْمُتَّقُونَ","latin":"waalladzii jaa-a bialshshidqi washaddaqa bihi ulaa-ika humu almuttaquuna","translate":{"id":"Dan orang yang membawa kebenaran (Muhammad) dan membenarkannya, mereka itulah orang-orang yang bertakwa.\n","en":"But he who brings the truth, and he who wholeheartedly accepts it as true - it is they, they, who are [truly] conscious of Him!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4091","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4091.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4091.mp3"]}},{"no":34,"arab":"لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ","latin":"lahum maa yasyaauuna 'inda rabbihim dzaalika jazaau almuhsiniina","translate":{"id":"Mereka memperoleh apa yang mereka kehendaki pada sisi Tuhan mereka. Demikianlah balasan orang-orang yang berbuat baik,\n","en":"All that they have ever yearned for awaits them with their Sustainer: such will be the reward of the doers of good."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4092","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4092.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4092.mp3"]}},{"no":35,"arab":"لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُمْ بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ","latin":"liyukaffira allaahu 'anhum aswa-a alladzii 'amiluu wayajziyahum ajrahum bi-ahsani alladzii kaanuu ya'maluuna","translate":{"id":"agar Allah akan menutupi (mengampuni) bagi mereka perbuatan yang paling buruk yang mereka kerjakan dan membalas mereka dengan upah yang lebih baik dari apa yang telah mereka kerjakan.\n","en":"And to this end, God will efface from their record the worst that they ever did, and give them their reward in accordance with the best that they were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4093","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4093.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4093.mp3"]}},{"no":36,"arab":"أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِنْ دُونِهِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","latin":"alaysa allaahu bikaafin 'abdahu wayukhawwifuunaka bialladziina min duunihi waman yudhlili allaahu famaa lahu min haadin","translate":{"id":"Bukankah Allah cukup untuk melindungi hamba-hamba-Nya. Dan mereka mempertakuti kamu dengan (sembahan-sembahan) yang selain Allah? Dan siapa yang disesatkan Allah maka tidak seorangpun pemberi petunjuk baginya.\n","en":"IS NOT God enough for His servant? And yet, they would frighten thee with those [imaginary divine powers which they worship] beside Him! But he whom God lets go astray can never find any guide,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4094","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4094.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4094.mp3"]}},{"no":37,"arab":"وَمَنْ يَهْدِ اللَّهُ فَمَا لَهُ مِنْ مُضِلٍّ ۗ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انْتِقَامٍ","latin":"waman yahdi allaahu famaa lahu min mudhillin alaysa allaahu bi'aziizin dzii intiqaamin","translate":{"id":"Dan barangsiapa yang diberi petunjuk oleh Allah, maka tidak seorangpun yang dapat menyesatkannya. Bukankah Allah Maha Perkasa lagi mempunyai (kekuasaan untuk) mengazab?\n","en":"whereas he whom God guides aright can never be led astray. Is not God almighty, an avenger of evil?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4095","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4095.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4095.mp3"]}},{"no":38,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ","latin":"wala-in sa-altahum man khalaqa alssamaawaati waal-ardha layaquulunna allaahu qul afara-aytum maa tad'uuna min duuni allaahi in araadaniya allaahu bidhurrin hal hunna kaasyifaatu dhurrihi aw araadanii birahmatin hal hunna mumsikaatu rahmatihi qul hasbiya allaahu 'alayhi yatawakkalu almutawakkiluuna","translate":{"id":"Dan sungguh jika kamu bertanya kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\", niscaya mereka menjawab: \"Allah\". Katakanlah: \"Maka terangkanlah kepadaku tentang apa yang kamu seru selain Allah, jika Allah hendak mendatangkan kemudharatan kepadaku, apakah berhala-berhalamu itu dapat menghilangkan kemudharatan itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat menahan rahmatNya?. Katakanlah: \"Cukuplah Allah bagiku\". Kepada-Nyalah bertawakkal orang-orang yang berserah diri.\n","en":"And thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “God.” Say: “Have you, then, ever considered what it is that you invoke instead of God? If God wills that harm should befall me, could those [imaginary powers] remove the harm inflicted by Him? Or, if He wills that grace should alight on me, could they withhold His grace [from me]?” Say: “God is enough for me! In Him [alone] place their trust all who have trust [in His existence].”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4096","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4096.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4096.mp3"]}},{"no":39,"arab":"قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ","latin":"qul yaa qawmi i'maluu 'alaa makaanatikum innii 'aamilun fasawfa ta'lamuuna","translate":{"id":"Katakanlah: \"Hai kaumku, bekerjalah sesuai dengan keadaanmu, sesungguhnya aku akan bekerja (pula), maka kelak kamu akan mengetahui,\n","en":"Say: “O my [truth-denying] people! Do yet all that may be within your power, [whereas] I, behold, shall labour [in God’s way]: in time you will come to know"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4097","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4097.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4097.mp3"]}},{"no":40,"arab":"مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ","latin":"man ya/tiihi 'adzaabun yukhziihi wayahillu 'alayhi 'adzaabun muqiimun","translate":{"id":"siapa yang akan mendapat siksa yang menghinakannya dan lagi ditimpa oleh azab yang kekal\".\n","en":"who it is that shall be visited [in this world] by suffering which will cover him with ignominy, and upon whom long-lasting suffering shall alight [in the life to come]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4098","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4098.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4098.mp3"]}},{"no":41,"arab":"إِنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ ۖ فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ","latin":"innaa anzalnaa 'alayka alkitaaba lilnnaasi bialhaqqi famani ihtadaa falinafsihi waman dhalla fa-innamaa yadhillu 'alayhaa wamaa anta 'alayhim biwakiilin","translate":{"id":"Sesungguhnya Kami menurunkan kepadamu Al Kitab (Al Qur'an) untuk manusia dengan membawa kebenaran; siapa yang mendapat petunjuk maka (petunjuk itu) untuk dirinya sendiri, dan siapa yang sesat maka sesungguhnya dia semata-mata sesat buat (kerugian) dirinya sendiri, dan kamu sekali-kali bukanlah orang yang bertanggung jawab terhadap mereka.\n","en":"BEHOLD, from on high have We bestowed upon thee this divine writ, setting forth the truth for [the benefit of all] mankind. And whoever chooses to be guided [thereby], does so for his own good, and whoever chooses to go astray, goes but astray to his own hurt; and thou hast not the power to determine their fate."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4099","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4099.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4099.mp3"]}},{"no":42,"arab":"اللَّهُ يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ","latin":"allaahu yatawaffaa al-anfusa hiina mawtihaa waallatii lam tamut fii manaamihaa fayumsiku allatii qadaa 'alayhaa almawta wayursilu al-ukhraa ilaa ajalin musamman inna fii dzaalika laaayaatin liqawmin yatafakkaruuna","translate":{"id":"Allah memegang jiwa (orang) ketika matinya dan (memegang) jiwa (orang) yang belum mati di waktu tidurnya; maka Dia tahanlah jiwa (orang) yang telah Dia tetapkan kematiannya dan Dia melepaskan jiwa yang lain sampai waktu yang ditetapkan . Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi kaum yang berfikir.\n","en":"It is God [alone that has this power - He] who causes all human beings to die at the time of their [bodily] death, and [causes to be as dead], during their sleep, those that have not yet died: thus, He withholds [from life] those upon whom He has decreed death, and lets the others go free for a term set [by Him]. In [all] this, behold, there are messages indeed for people who think!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4100","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4100.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4100.mp3"]}},{"no":43,"arab":"أَمِ اتَّخَذُوا مِنْ دُونِ اللَّهِ شُفَعَاءَ ۚ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ","latin":"ami ittakhadzuu min duuni allaahi syufa'aa-a qul awa law kaanuu laa yamlikuuna syay-an walaa ya'qiluuna","translate":{"id":"Bahkan mereka mengambil pemberi syafa'at selain Allah. Katakanlah: \"Dan apakah (kamu mengambilnya juga) meskipun mereka tidak memiliki sesuatupun dan tidak berakal?\"\n","en":"And yet, they choose [to worship], side by side with God, [imaginary] intercessors!” Say: “Why - even though they have no power over anything, and no understanding?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4101","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4101.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4101.mp3"]}},{"no":44,"arab":"قُلْ لِلَّهِ الشَّفَاعَةُ جَمِيعًا ۖ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ","latin":"qul lillaahi alsysyafaa'atu jamii'an lahu mulku alssamaawaati waal-ardhi tsumma ilayhi turja'uuna","translate":{"id":"Katakanlah: \"Hanya kepunyaan Allah syafaat itu semuanya. Kepunyaan-Nya kerajaan langit dan bumi. Kemudian kepada-Nyalah kamu dikembalikan\"\n","en":"Say: “God’s alone is [the power to bestow the right of] intercession: His [alone] is the dominion over the heavens and the earth; and, in the end, Unto Him you will all be brought back.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4102","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4102.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4102.mp3"]}},{"no":45,"arab":"وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ ۖ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ","latin":"wa-idzaa dzukira allaahu wahdahu isyma-azzat quluubu alladziina laa yu/minuuna bial-aakhirati wa-idzaa dzukira alladziina min duunihi idzaa hum yastabsyiruuna","translate":{"id":"Dan apabila hanya nama Allah saja disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat; dan apabila nama sembahan-sembahan selain Allah yang disebut, tiba-tiba mereka bergirang hati.\n","en":"And yet, whenever God alone is mentioned, the hearts of those who will not believe in the life to come contract with bitter aversion - whereas, when those [imaginary powers] are mentioned side by side with Him, lo, they rejoice!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4103","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4103.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4103.mp3"]}},{"no":46,"arab":"قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ","latin":"quli allaahumma faathira alssamaawaati waal-ardhi 'aalima alghaybi waalsysyahaadati anta tahkumu bayna 'ibaadika fii maa kaanuu fiihi yakhtalifuuna","translate":{"id":"Katakanlah: \"Wahai Allah, Pencipta langit dan bumi, Yang mengetahui barang ghaib dan yang nyata, Engkaulah Yang memutuskan antara hamba-hamba-Mu tentang apa yang selalu mereka memperselisihkannya.\"\n","en":"Say: “O God! Originator of the heavens and the earth! Knower of all that is beyond the reach of a created being’s perception, as well as of all that can be witnessed by a creature’s senses or mind! It is Thou who wilt judge between Thy servants [on Resurrection Day] with regard to all on which they were wont to differ!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4104","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4104.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4104.mp3"]}},{"no":47,"arab":"وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِنْ سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَبَدَا لَهُمْ مِنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ","latin":"walaw anna lilladziina zhalamuu maa fii al-ardhi jamii'an wamitslahu ma'ahu laiftadaw bihi min suu-i al'adzaabi yawma alqiyaamati wabadaa lahum mina allaahi maa lam yakuunuu yahtasibuuna","translate":{"id":"Dan sekiranya orang-orang yang zalim mempunyai apa yang ada di bumi semuanya dan (ada pula) sebanyak itu besertanya, niscaya mereka akan menebus dirinya dengan itu dari siksa yang buruk pada hari kiamat. Dan jelaslah bagi mereka azab dari Allah yang belum pernah mereka perkirakan.\n","en":"But if those who are bent on evildoing posses­sed all that is on earth, and twice as much, they would surely offer it as ransom from the awful suffering [that will befall them] on the Day of Resur­rection: for, something with which they had not reckoned before will [by then] have been made obvious to them by God;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4105","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4105.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4105.mp3"]}},{"no":48,"arab":"وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"wabadaa lahum sayyi-aatu maa kasabuu wahaaqa bihim maa kaanuu bihi yastahzi-uuna","translate":{"id":"Dan (jelaslah) bagi mereka akibat buruk dari apa yang telah mereka perbuat dan mereka diliputi oleh pembalasan yang mereka dahulu selalu memperolok-olokkannya.\n","en":"and obvious to them will have become the evil that they had wrought [in life]: and thus shall they be overwhelmed by the very truth which they were wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4106","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4106.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4106.mp3"]}},{"no":49,"arab":"فَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ ۚ بَلْ هِيَ فِتْنَةٌ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","latin":"fa-idzaa massa al-insaana dhurrun da'aanaa tsumma idzaa khawwalnaahu ni'matan minnaa qaala innamaa uutiituhu 'alaa 'ilmin bal hiya fitnatun walaakinna aktsarahum laa ya'lamuuna","translate":{"id":"Maka apabila manusia ditimpa bahaya ia menyeru Kami, kemudian apabila Kami berikan kepadanya ni'mat dari Kami ia berkata: \"Sesungguhnya aku diberi ni'mat itu hanyalah karena kepintaranku\". Sebenarnya itu adalah ujian, tetapi kebanyakan mereka itu tidak mengetahui.\n","en":"NOW [thus it is:] when affliction befalls man, he cries out unto Us for help; but when We bestow upon him a boon by Our grace, he says [to himself], “I have been given [all] this by virtue of [my own] wisdom!” Nay, this [bestowal of grace] is a trial: but most of them understand it not!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4107","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4107.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4107.mp3"]}},{"no":50,"arab":"قَدْ قَالَهَا الَّذِينَ مِنْ قَبْلِهِمْ فَمَا أَغْنَىٰ عَنْهُمْ مَا كَانُوا يَكْسِبُونَ","latin":"qad qaalahaa alladziina min qablihim famaa aghnaa 'anhum maa kaanuu yaksibuuna","translate":{"id":"Sungguh orang-orang yang sebelum mereka (juga) telah mengatakan itu pula, maka tiadalah berguna bagi mereka apa yang dahulu mereka usahakan.\n","en":"The same did say [to themselves many of] those who lived before their time; but of no avail to them was all that they had ever achieved:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4108","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4108.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4108.mp3"]}},{"no":51,"arab":"فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا ۚ وَالَّذِينَ ظَلَمُوا مِنْ هَٰؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُمْ بِمُعْجِزِينَ","latin":"fa-ashaabahum sayyi-aatu maa kasabuu waalladziina zhalamuu min haaulaa-i sayushiibuhum sayyi-aatu maa kasabuu wamaa hum bimu'jiziina","translate":{"id":"Maka mereka ditimpa oleh akibat buruk dari apa yang mereka usahakan. Dan orang-orang yang zalim di antara mereka akan ditimpa akibat buruk dari usahanya dan mereka tidak dapat melepaskan diri.\n","en":"for all the evil deeds that they had wrought fell [back] upon them. And [the same will happen to] people of the present time who are bent on wrongdoing: all the evil deeds that they have ever wrought will fall [back] upon them, and never will they be able to elude [God]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4109","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4109.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4109.mp3"]}},{"no":52,"arab":"أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ","latin":"awa lam ya'lamuu anna allaaha yabsuthu alrrizqa liman yasyaau wayaqdiru inna fii dzaalika laaayaatin liqawmin yu/minuuna","translate":{"id":"Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezki dan menyempitkannya bagi siapa yang dikehendaki-Nya? Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi kaum yang beriman.\n","en":"Are they, then, not aware that it is God who grants abundant sustenance, or gives it in scant measure, unto whomever He wills? In this, behold, there are messages indeed for peo­ple who will believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4110","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4110.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4110.mp3"]}},{"no":53,"arab":"قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ","latin":"qul yaa 'ibaadiya alladziina asrafuu 'alaa anfusihim laa taqnathuu min rahmati allaahi inna allaaha yaghfiru aldzdzunuuba jamii'an innahu huwa alghafuuru alrrahiimu","translate":{"id":"Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dia-lah Yang Maha Pengampun lagi Maha Penyayang.\n","en":"SAY: “[Thus speaks God:] ‘O you servants of Mine who have transgressed against your own selves! Despair not of God’s mercy: behold, God forgives all sins - for, verily, He alone is much-forgiving, a dis­penser of grace!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4111","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4111.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4111.mp3"]}},{"no":54,"arab":"وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُونَ","latin":"wa-aniibuu ilaa rabbikum wa-aslimuu lahu min qabli an ya/tiyakumu al'adzaabu tsumma laa tunsharuuna","translate":{"id":"Dan kembalilah kamu kepada Tuhanmu, dan berserah dirilah kepada-Nya sebelum datang azab kepadamu kemudian kamu tidak dapat ditolong (lagi).\n","en":"Hence, turn towards your Sustainer [alone] and surrender yourselves unto Him ere the suffering [of death and resurrection] comes upon you, for then you will not be succoured."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4112","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4112.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4112.mp3"]}},{"no":55,"arab":"وَاتَّبِعُوا أَحْسَنَ مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنْتُمْ لَا تَشْعُرُونَ","latin":"waittabi'uu ahsana maa unzila ilaykum min rabbikum min qabli an ya/tiyakumu al'adzaabu baghtatan wa-antum laa tasy'uruuna","translate":{"id":"Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu dari Tuhanmu sebelum datang azab kepadamu dengan tiba-tiba, sedang kamu tidak menyadarinya,\n","en":"And ere that suffering comes upon you of a sudden, without your being aware [of its approach], follow the most goodly [teaching] that has been revealed unto you by your Sustainer,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4113","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4113.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4113.mp3"]}},{"no":56,"arab":"أَنْ تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ وَإِنْ كُنْتُ لَمِنَ السَّاخِرِينَ","latin":"an taquula nafsun yaa hasrataa 'alaa maa farrathtu fii janbi allaahi wa-in kuntu lamina alssaakhiriina","translate":{"id":"supaya jangan ada orang yang mengatakan: \"Amat besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah, sedang aku sesungguhnya termasuk orang-orang yang memperolok-olokkan (agama Allah ),\n","en":"lest any human being should say [on Judgment Day], “Alas for me for having been remiss in what is due to God, and for having been indeed one of those who scoffed [at the truth]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4114","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4114.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4114.mp3"]}},{"no":57,"arab":"أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنْتُ مِنَ الْمُتَّقِينَ","latin":"aw taquula law anna allaaha hadaanii lakuntu mina almuttaqiina","translate":{"id":"atau supaya jangan ada yang berkata: 'Kalau sekiranya Allah memberi petunjuk kepadaku tentulah aku termasuk orang-orang yang bertakwa'.\n","en":"or lest he should say, “If God had but guided me, I would surely have been among those who are conscious of Him!”-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4115","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4115.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4115.mp3"]}},{"no":58,"arab":"أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ","latin":"aw taquula hiina taraa al'adzaaba law anna lii karratan fa-akuuna mina almuhsiniina","translate":{"id":"Atau supaya jangan ada yang berkata ketika ia melihat azab 'Kalau sekiranya aku dapat kembali (ke dunia), niscaya aku akan termasuk orang-orang berbuat baik'.\n","en":"or lest he should say, when he becomes aware of the suffering [that awaits him], “Would that I had a second chance [in life], so that I could be among the doers of good!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4116","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4116.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4116.mp3"]}},{"no":59,"arab":"بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكَافِرِينَ","latin":"balaa qad jaa-atka aayaatii fakadzdzabta bihaa waistakbarta wakunta mina alkaafiriina","translate":{"id":"(Bukan demikian) sebenarya telah datang keterangan-keterangan-Ku kepadamu lalu kamu mendustakannya dan kamu menyombongkan diri dan adalah kamu termasuk orang-orang yang kafir\".\n","en":"[But God will reply:] “Yea, indeed! My mes­sages did come unto thee; but thou gavest them the lie, and wert filled with false pride, and wert among those who deny the truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4117","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4117.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4117.mp3"]}},{"no":60,"arab":"وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُمْ مُسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْمُتَكَبِّرِينَ","latin":"wayawma alqiyaamati taraa alladziina kadzabuu 'alaa allaahi wujuuhuhum muswaddatun alaysa fii jahannama matswan lilmutakabbiriina","translate":{"id":"Dan pada hari kiamat kamu akan melihat orang-orang yang berbuat dusta terhadap Allah, mukanya menjadi hitam. Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang menyombongkan diri?\n","en":"And [so,] on the Day of Resurrection thou wilt see all who invented lies about God [with] their faces darkened [by grief and ignominy]. Is not hell the [proper] abode for all who are given to false pride?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4118","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4118.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4118.mp3"]}},{"no":61,"arab":"وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ","latin":"wayunajjii allaahu alladziina ittaqaw bimafaazatihim laa yamassuhumu alssuu-u walaa hum yahzanuuna","translate":{"id":"Dan Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka, mereka tiada disentuh oleh azab (neraka dan tidak pula) mereka berduka cita.\n","en":"But God will safeguard all who were conscious of Him, [and will grant them happiness] by virtue of their [inner] triumphs; no evil shall ever touch them, and neither shall they grieve."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4119","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4119.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4119.mp3"]}},{"no":62,"arab":"اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ","latin":"allaahu khaaliqu kulli syay-in wahuwa 'alaa kulli syay-in wakiilun","translate":{"id":"Allah menciptakan segala sesuatu dan Dia memelihara segala sesuatu.\n","en":"GOD is the Creator of all things, and He alone has the power to determine the fate of all things."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4120","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4120.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4120.mp3"]}},{"no":63,"arab":"لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","latin":"lahu maqaaliidu alssamaawaati waal-ardhi waalladziina kafaruu bi-aayaati allaahi ulaa-ika humu alkhaasiruuna","translate":{"id":"Kepunyaan-Nyalah kunci-kunci (perbendaharaan) langit dan bumi. Dan orang-orang yang kafir terhadap ayat-ayat Allah, mereka itulah orang-orang yang merugi.\n","en":"His are the keys [to the mysteries] of the heavens and the earth: and they who are bent on denying the truth of God’s messages - it is they, they, who are the losers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4121","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4121.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4121.mp3"]}},{"no":64,"arab":"قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ","latin":"qul afaghayra allaahi ta/muruunnii a'budu ayyuhaa aljaahiluuna","translate":{"id":"Katakanlah: \"Maka apakah kamu menyuruh aku menyembah selain Allah, hai orang-orang yang tidak berpengetahuan?\"\n","en":"Say: “Is it, then, something other than God that you bid me to worship, O you who are unaware [of right and wrong]?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4122","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4122.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4122.mp3"]}},{"no":65,"arab":"وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ","latin":"walaqad uuhiya ilayka wa-ilaa alladziina min qablika la-in asyrakta layahbathanna 'amaluka walatakuunanna mina alkhaasiriina","translate":{"id":"Dan sesungguhnya telah diwahyukan kepadamu dan kepada (nabi-nabi) yang sebelummu. \"Jika kamu mempersekutukan (Tuhan), niscaya akan hapuslah amalmu dan tentulah kamu termasuk orang-orang yang merugi.\n","en":"And yet, it has already been revealed to thee [O man,] as well as to those who lived before thee, that if thou ever ascribe divine powers to aught but God, all thy works shall most certainly have been in vain: for [in the life to come] thou shalt most certainly be among the lost."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4123","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4123.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4123.mp3"]}},{"no":66,"arab":"بَلِ اللَّهَ فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ","latin":"bali allaaha fau'bud wakun mina alsysyaakiriina","translate":{"id":"Karena itu, maka hendaklah Allah saja kamu sembah dan hendaklah kamu termasuk orang-orang yang bersyukur\".\n","en":"Nay, but thou shalt worship God [alone], and be among those who are grateful [to Him]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4124","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4124.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4124.mp3"]}},{"no":67,"arab":"وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","latin":"wamaa qadaruu allaaha haqqa qadrihi waal-ardhu jamii'an qabdhatuhu yawma alqiyaamati waalssamaawaatu mathwiyyaatun biyamiinihi subhaanahu wata'aalaa 'ammaa yusyrikuuna","translate":{"id":"Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggaman-Nya pada hari kiamat dan langit digulung dengan tangan kanan-Nya . Maha Suci Tuhan dan Maha Tinggi Dia dari apa yang mereka persekutukan.\n","en":"And no true understanding of God have they [who worship aught beside Him], inasmuch as the whole of the earth will be as a [mere] handful to Him on Resurrection Day, and the heavens will be rolled up in His right hand: limitless is He in His glory, and sublimely exalted above anything to which they may ascribe a share in His divinity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4125","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4125.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4125.mp3"]}},{"no":68,"arab":"وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ","latin":"wanufikha fii alshshuuri fasha'iqa man fii alssamaawaati waman fii al-ardhi illaa man syaa-a allaahu tsumma nufikha fiihi ukhraa fa-idzaa hum qiyaamun yanzhuruuna","translate":{"id":"Dan ditiuplah sangkakala, maka matilah siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah. Kemudian ditiup sangkakala itu sekali lagi maka tiba-tiba mereka berdiri menunggu (putusannya masing-masing).\n","en":"And [on that Day,] the trumpet [of judgment] will be sounded, and all [creatures] that are in the heavens and all that are on earth will fall down senseless, unless they be such as God wills [to exempt]. And then it will sound again - and lo! standing [before the Seat of Judgment], they will begin to see [the truth]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4126","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4126.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4126.mp3"]}},{"no":69,"arab":"وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ","latin":"wa-asyraqati al-ardhu binuuri rabbihaa wawudhi'a alkitaabu wajii-a bialnnabiyyiina waalsysyuhadaa-i waqudhiya baynahum bialhaqqi wahum laa yuzhlamuuna","translate":{"id":"Dan terang benderanglah bumi (padang mahsyar) dengan cahaya (keadilan) Tuhannya; dan diberikanlah buku (perhitungan perbuatan masing-masing) dan didatangkanlah para nabi dan saksi-saksi dan diberi keputusan di antara mereka dengan adil, sedang mereka tidak dirugikan.\n","en":"And the earth will shine bright with her Sus­tainer’s light. And the record [of everyone’s deeds] will be laid bare, and all the prophets will be brought forward, and all [other] witnesses; and judgment will be passed on them all in justice. And they will not be wronged,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4127","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4127.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4127.mp3"]}},{"no":70,"arab":"وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ","latin":"wawuffiyat kullu nafsin maa 'amilat wahuwa a'lamu bimaa yaf'aluuna","translate":{"id":"Dan disempurnakan bagi tiap-tiap jiwa (balasan) apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan.\n","en":"for every human being will be repaid in full for whatever [good or evil] he has done: and He is fully aware of all that they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4128","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4128.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4128.mp3"]}},{"no":71,"arab":"وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ","latin":"wasiiqa alladziina kafaruu ilaa jahannama zumaran hattaa idzaa jaauuhaa futihat abwaabuhaa waqaala lahum khazanatuhaa alam ya/tikum rusulun minkum yatluuna 'alaykum aayaati rabbikum wayundziruunakum liqaa-a yawmikum haadzaa qaaluu balaa walaakin haqqat kalimatu al'adzaabi 'alaa alkaafiriina","translate":{"id":"Orang-orang kafir dibawa ke neraka Jahannam berombong-rombongan. Sehingga apabila mereka sampai ke neraka itu dibukakanlah pintu-pintunya dan berkatalah kepada mereka penjaga-penjaganya: \"Apakah belum pernah datang kepadamu rasul-rasul di antaramu yang membacakan kepadamu ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan dengan hari ini?\" Mereka menjawab: \"Benar (telah datang)\". Tetapi telah pasti berlaku ketetapan azab terhadap orang-orang yang kafir.\n","en":"And those who were bent on denying the truth will be urged on in throngs towards hell till, when they reach it, its gates will be opened, and its keepers will ask them, “Have there not come to you apostles from among yourselves, who conveyed to you your Sustainer’s messages and warned you of the coming of this your Day [of Judgment]?” They will answer: “Yea, indeed!” But the sentence of suffering will [already] have fallen due upon the deniers of the truth;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4129","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4129.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4129.mp3"]}},{"no":72,"arab":"قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ","latin":"qiila udkhuluu abwaaba jahannama khaalidiina fiihaa fabi/sa matswaa almutakabbiriina","translate":{"id":"Dikatakan (kepada mereka): \"Masukilah pintu-pintu neraka Jahannam itu, sedang kamu kekal di dalamnya\" Maka neraka Jahannam itulah seburuk-buruk tempat bagi orang-orang yang menyombongkan diri.\n","en":"[and] they will be told, “Enter the gates of hell, therein to abide!” And how vile an abode for those who were given to false pride!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4130","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4130.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4130.mp3"]}},{"no":73,"arab":"وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ","latin":"wasiiqa alladziina ittaqaw rabbahum ilaa aljannati zumaran hattaa idzaa jaauuhaa wafutihat abwaabuhaa waqaala lahum khazanatuhaa salaamun 'alaykum thibtum faudkhuluuhaa khaalidiina","translate":{"id":"Dan orang-orang yang bertakwa kepada Tuhan dibawa ke dalam syurga berombong-rombongan (pula). Sehingga apabila mereka sampai ke syurga itu sedang pintu-pintunya telah terbuka dan berkatalah kepada mereka penjaga-penjaganya: \"Kesejahteraan (dilimpahkan) atasmu. Berbahagialah kamu! maka masukilah syurga ini, sedang kamu kekal di dalamnya\".\n","en":"But those who were conscious of their Sus­tainer will be urged on in throngs towards paradise till, when they reach it, they shall find its gates wide- open; and its keepers will say unto them, “Peace be upon you! Well have you done: enter, then, this [paradise], herein to abide!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4131","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4131.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4131.mp3"]}},{"no":74,"arab":"وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ","latin":"waqaaluu alhamdu lillaahi alladzii shadaqanaa wa'dahu wa-awratsanaa al-ardha natabawwau mina aljannati haytsu nasyaau fani'ma ajru al'aamiliina","translate":{"id":"Dan mereka mengucapkan: \"Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami dan telah (memberi) kepada kami tempat ini sedang kami (diperkenankan) menempati tempat dalam syurga di mana saja yang kami kehendaki; maka syurga itulah sebaik-baik balasan bagi orang-orang yang beramal\".\n","en":"And they will exclaim: “All praise is due to God, who has made His promise to us come true, and has bestowed upon us this expanse [of bliss] as our portion, so that we may dwell in paradise as we please!” And how excellent a reward will it be for those who laboured [in God’s way]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4132","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4132.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4132.mp3"]}},{"no":75,"arab":"وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"wataraa almalaa-ikata haaffiina min hawli al'arsyi yusabbihuuna bihamdi rabbihim waqudhiya baynahum bialhaqqi waqiila alhamdu lillaahi rabbi al'aalamiina","translate":{"id":"Dan kamu (Muhammad) akan melihat malaikat-mmlaikat berlingkar di sekeliling 'Arsy bertasbih sambil memuji Tuhannya; dan diberi putusan di antara hamba-hamba Allah dengan adil dan diucapkan: \"Segala puji bagi Allah, Tuhan semesta alam\".\n","en":"And thou wilt see the angels surrounding the throne of [God’s] almightiness, extolling their Sus­tainer’s glory and praise. And judgment will have been passed in justice on all [who had lived and died], and the word will be spoken: “All praise is due to God, the Sustainer of all the worlds!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4133","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4133.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4133.mp3"]}}]}