{"alquran":{"no":4,"name":"An-Nisaa","arab":"النساء","start":493,"count":176,"rukku":24,"type":"medina","description":"Surat An Nisaa' yang terdiri dari 176 ayat itu, adalah surat Madaniyyah yang terpanjang sesudah surat Al Baqarah. Dinamakan <i>An Nisaa'</i> karena dalam surat ini banyak dibicarakan hal-hal yang berhubungan dengan wanita serta merupakan surat yang paling membicarakan hal itu dibanding dengan surat-surat yang lain. Surat yang lain banyak juga yang membicarakan tentang hal wanita ialah surat Ath Thalaq. Dalam hubungan ini biasa disebut surat An Nisaa' dengan sebutan: <i>Surat An Nisaa' Al Kubraa</i> (surat An Nisaa' yang besar), sedang  surat Ath Thalaq disebut dengan sebutan: <i>Surat An Nisaa' Ash Shughraa</i> (surat An Nisaa' yang kecil)."},"surah":[{"no":1,"arab":" يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا","latin":"yaa ayyuhaa alnnaasu ittaquu rabbakumu alladzii khalaqakum min nafsin waahidatin wakhalaqa minhaa zawjahaa wabatstsa minhumaa rijaalan katsiiran wanisaa-an waittaquu allaaha alladzii tasaa-aluuna bihi waal-arhaama inna allaaha kaana 'alaykum raqiiban","translate":{"id":"Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya Allah menciptakan isterinya; dan dari pada keduanya Allah memperkembang biakkan laki-laki dan perempuan yang banyak. Dan bertakwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain , dan (peliharalah) hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu.\n","en":"O MANKIND! Be conscious of your Sustainer, who has created you out of one living entity, and out of it created its mate, and out of the two spread abroad a multitude of men and women. And remain conscious of God, in whose name you demand [your rights] from one another, and of these ties of kinship. Verily, God is ever watchful over you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/494","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/494.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/494.mp3"]}},{"no":2,"arab":"وَآتُوا الْيَتَامَىٰ أَمْوَالَهُمْ ۖ وَلَا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ ۖ وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ ۚ إِنَّهُ كَانَ حُوبًا كَبِيرًا","latin":"waaatuu alyataamaa amwaalahum walaa tatabaddaluu alkhabiitsa bialththhayyibi walaa ta/kuluu amwaalahum ilaa amwaalikum innahu kaana huuban kabiiraan","translate":{"id":"Dan berikanlah kepada anak-anak yatim (yang sudah balig) harta mereka, jangan kamu menukar yang baik dengan yang buruk dan jangan kamu makan harta mereka bersama hartamu. Sesungguhnya tindakan-tindakan (menukar dan memakan) itu, adalah dosa yang besar.\n","en":"Hence, render unto the orphans their posses­sions, and do not substitute bad things [of your own] for the good things [that belong to them], and do not consume their possessions together with your own: this, verily, is a great crime."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/495","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/495.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/495.mp3"]}},{"no":3,"arab":"وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ۚ ذَٰلِكَ أَدْنَىٰ أَلَّا تَعُولُوا","latin":"wa-in khiftum allaa tuqsithuu fii alyataamaa fainkihuu maa thaaba lakum mina alnnisaa-i matsnaa watsulaatsa warubaa'a fa-in khiftum allaa ta'diluu fawaahidatan aw maa malakat aymaanukum dzaalika adnaa allaa ta'uuluu","translate":{"id":"Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), maka kawinilah wanita-wanita (lain) yang kamu senangi : dua, tiga atau empat. Kemudian jika kamu takut tidak akan dapat berlaku adil , maka (kawinilah) seorang saja , atau budak-budak yang kamu miliki. Yang demikian itu adalah lebih dekat kepada tidak berbuat aniaya.\n","en":"And if you have reason to fear that you might not act equitably towards orphans, then marry from among [other] women such as are lawful to you - [even] two, or three, or four: but if you have reason to fear that you might not be able to treat them with equal fairness, then [only] one - or [from among] those whom you rightfully possess. This will make it more likely that you will not deviate from the right course."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/496","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/496.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/496.mp3"]}},{"no":4,"arab":"وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً ۚ فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْءٍ مِنْهُ نَفْسًا فَكُلُوهُ هَنِيئًا مَرِيئًا","latin":"waaatuu alnnisaa-a shaduqaatihinna nihlatan fa-in thibna lakum 'an syay-in minhu nafsan fakuluuhu hanii-an marii-aan","translate":{"id":"Berikanlah maskawin (mahar) kepada wanita (yang kamu nikahi) sebagai pemberian dengan penuh kerelaan . Kemudian jika mereka menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati, maka makanlah (ambillah) pemberian itu (sebagai makanan) yang sedap lagi baik akibatnya.\n","en":"And give unto women their marriage portions in the spirit of a gift; but if they, of their own accord, give up unto you aught thereof, then enjoy it with pleasure and good cheer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/497","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/497.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/497.mp3"]}},{"no":5,"arab":"وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ الَّتِي جَعَلَ اللَّهُ لَكُمْ قِيَامًا وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ وَقُولُوا لَهُمْ قَوْلًا مَعْرُوفًا","latin":"walaa tu/tuu alssufahaa-a amwaalakumu allatii ja'ala allaahu lakum qiyaaman waurzuquuhum fiihaa wauksuuhum waquuluu lahum qawlan ma'ruufaan","translate":{"id":"Dan janganlah kamu serahkan kepada orang-orang yang belum sempurna akalnya , harta (mereka yang ada dalam kekuasaanmu) yang dijadikan Allah sebagai pokok kehidupan. Berilah mereka belanja dan pakaian (dari hasil harta itu) dan ucapkanlah kepada mereka kata-kata yang baik.\n","en":"And do not entrust to those who are weak of judgment the possessions which God has placed in your charge for [their] support; but let them have their sustenance therefrom, and clothe them, and speak unto them in a kindly way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/498","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/498.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/498.mp3"]}},{"no":6,"arab":"وَابْتَلُوا الْيَتَامَىٰ حَتَّىٰ إِذَا بَلَغُوا النِّكَاحَ فَإِنْ آنَسْتُمْ مِنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ ۖ وَلَا تَأْكُلُوهَا إِسْرَافًا وَبِدَارًا أَنْ يَكْبَرُوا ۚ وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَالَهُمْ فَأَشْهِدُوا عَلَيْهِمْ ۚ وَكَفَىٰ بِاللَّهِ حَسِيبًا","latin":"waibtaluu alyataamaa hattaa idzaa balaghuu alnnikaaha fa-in aanastum minhum rusydan faidfa'uu ilayhim amwaalahum walaa ta/kuluuhaa israafan wabidaaran an yakbaruu waman kaana ghaniyyan falyasta'fif waman kaana faqiiran falya/kul bialma'ruufi fa-idzaa dafa'tum ilayhim amwaalahum fa-asyhiduu 'alayhim wakafaa biallaahi hasiibaan","translate":{"id":"Dan ujilah anak yatim itu sampai mereka cukup umur untuk kawin. Kemudian jika menurut pendapatmu mereka telah cerdas (pandai memelihara harta), maka serahkanlah kepada mereka harta-hartanya. Dan janganlah kamu makan harta anak yatim lebih dari batas kepatutan dan (janganlah kamu) tergesa-gesa (membelanjakannya) sebelum mereka dewasa. Barang siapa (di antara pemelihara itu) mampu, maka hendaklah ia menahan diri (dari memakan harta anak yatim itu) dan barangsiapa yang miskin, maka bolehlah ia makan harta itu menurut yang patut. Kemudian apabila kamu menyerahkan harta kepada mereka, maka hendaklah kamu adakan saksi-saksi (tentang penyerahan itu) bagi mereka. Dan cukuplah Allah sebagai Pengawas (atas persaksian itu).\n","en":"And test the orphans [in your charge] until they reach a marriage­able age; then, if you find them to be mature of mind, hand over to them their possessions; and do not consume them by wasteful spending, and in haste, ere they grow up. And let him who is rich abstain entirely [from his ward's property]; and let him who is poor partake thereof in a fair manner. And when you hand over to them their possessions, let there be witnesses on their behalf - although none can take count as God does."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/499","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/499.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/499.mp3"]}},{"no":7,"arab":"لِلرِّجَالِ نَصِيبٌ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ ۚ نَصِيبًا مَفْرُوضًا","latin":"lilrrijaali nashiibun mimmaa taraka alwaalidaani waal-aqrabuuna walilnnisaa-i nashiibun mimmaa taraka alwaalidaani waal-aqrabuuna mimmaa qalla minhu aw katsura nashiiban mafruudaan","translate":{"id":"Bagi orang laki-laki ada hak bagian dari harta peninggalan ibu-bapa dan kerabatnya, dan bagi orang wanita ada hak bagian (pula) dari harta peninggalan ibu-bapa dan kerabatnya, baik sedikit atau banyak menurut bahagian yang telah ditetapkan.\n","en":"MEN SHALL have a share in what parents and kinsfolk leave behind, and women shall have a share in what parents and kinsfolk leave behind, whether it be little or much - a share ordained [by God]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/500","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/500.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/500.mp3"]}},{"no":8,"arab":"وَإِذَا حَضَرَ الْقِسْمَةَ أُولُو الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينُ فَارْزُقُوهُمْ مِنْهُ وَقُولُوا لَهُمْ قَوْلًا مَعْرُوفًا","latin":"wa-idzaa hadhara alqismata uluu alqurbaa waalyataamaa waalmasaakiinu faurzuquuhum minhu waquuluu lahum qawlan ma'ruufaan","translate":{"id":"Dan apabila sewaktu pembagian itu hadir kerabat , anak yatim dan orang miskin, maka berilah mereka dari harta itu (sekedarnya) dan ucapkanlah kepada mereka perkataan yang baik.\n","en":"And when [other] near of kin and orphans and needy persons are present at the distribution [of inheritance], give them something thereof for their sustenance, and speak unto them in a kindly way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/501","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/501.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/501.mp3"]}},{"no":9,"arab":"وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعَافًا خَافُوا عَلَيْهِمْ فَلْيَتَّقُوا اللَّهَ وَلْيَقُولُوا قَوْلًا سَدِيدًا","latin":"walyakhsya alladziina law tarakuu min khalfihim dzurriyyatan dhi'aafan khaafuu 'alayhim falyattaquu allaaha walyaquuluu qawlan sadiidaan","translate":{"id":"Dan hendaklah takut kepada Allah orang-orang yang seandainya meninggalkan dibelakang mereka anak-anak yang lemah, yang mereka khawatir terhadap (kesejahteraan) mereka. Oleh sebab itu hendaklah mereka bertakwa kepada Allah dan hendaklah mereka mengucapkan perkataan yang benar.\n","en":"And let them stand in awe [of God], those [legal heirs] - who, if they [themselves] had to leave behind weak offspring, would feel fear on their account - and let them remain conscious of God, and let them speak [to the poor] in a just manner."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/502","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/502.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/502.mp3"]}},{"no":10,"arab":"إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَىٰ ظُلْمًا إِنَّمَا يَأْكُلُونَ فِي بُطُونِهِمْ نَارًا ۖ وَسَيَصْلَوْنَ سَعِيرًا","latin":"inna alladziina ya/kuluuna amwaala alyataamaa zhulman innamaa ya/kuluuna fii buthuunihim naaran wasayashlawna sa'iiraan","translate":{"id":"Sesungguhnya orang-orang yang memakan harta anak yatim secara zalim, sebenarnya mereka itu menelan api sepenuh perutnya dan mereka akan masuk ke dalam api yang menyala-nyala (neraka).\n","en":"Behold, those who sinfully devour the posses­sions of orphans but fill their bellies with fire: for [in the life to come] they will have to endure a blazing flame!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/503","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/503.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/503.mp3"]}},{"no":11,"arab":"يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ ۚ فَإِنْ كُنَّ نِسَاءً فَوْقَ اثْنَتَيْنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَ ۖ وَإِنْ كَانَتْ وَاحِدَةً فَلَهَا النِّصْفُ ۚ وَلِأَبَوَيْهِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِنْ كَانَ لَهُ وَلَدٌ ۚ فَإِنْ لَمْ يَكُنْ لَهُ وَلَدٌ وَوَرِثَهُ أَبَوَاهُ فَلِأُمِّهِ الثُّلُثُ ۚ فَإِنْ كَانَ لَهُ إِخْوَةٌ فَلِأُمِّهِ السُّدُسُ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِي بِهَا أَوْ دَيْنٍ ۗ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا ۚ فَرِيضَةً مِنَ اللَّهِ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","latin":"yuushiikumu allaahu fii awlaadikum lildzdzakari mitslu hazhzhi aluntsayayni fa-in kunna nisaa-an fawqa itsnatayni falahunna tsulutsaa maa taraka wa-in kaanat waahidatan falahaa alnnishfu wali-abawayhi likulli waahidin minhumaa alssudusu mimmaa taraka in kaana lahu waladun fa-in lam yakun lahu waladun wawaritsahu abawaahu fali-ummihi altstsulutsu fa-in kaana lahu ikhwatun fali-ummihi alssudusu min ba'di washiyyatin yuushii bihaa aw daynin aabaaukum wa-abnaaukum laa tadruuna ayyuhum aqrabu lakum naf'an fariidhatan mina allaahi inna allaaha kaana 'aliiman hakiimaan","translate":{"id":"Allah mensyari'atkan bagimu tentang (pembagian pusaka untuk) anak-anakmu. Yaitu : bahagian seorang anak lelaki sama dengan bagahian dua orang anak perempuan ; dan jika anak itu semuanya perempuan lebih dari dua , maka bagi mereka dua pertiga dari harta yang ditinggalkan; jika anak perempuan itu seorang saja, maka ia memperoleh separo harta. Dan untuk dua orang ibu-bapa, bagi masing-masingnya seperenam dari harta yang ditinggalkan, jika yang meninggal itu mempunyai anak; jika orang yang meninggal tidak mempunyai anak dan ia diwarisi oleh ibu-bapanya (saja), maka ibunya mendapat sepertiga; jika yang meninggal itu mempunyai beberapa saudara, maka ibunya mendapat seperenam. (Pembagian-pembagian tersebut di atas) sesudah dipenuhi wasiat yang ia buat atau (dan) sesudah dibayar hutangnya. (Tentang) orang tuamu dan anak-anakmu, kamu tidak mengetahui siapa di antara mereka yang lebih dekat (banyak) manfa'atnya bagimu. Ini adalah ketetapan dari Allah. Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"CONCERNING [the inheritance of] your children, God enjoins [this] upon you: The male shall have the equal of two females’ share; but if there are more than two females, they shall have two-thirds of what [their parents] leave behind; and if there is only one daughter, she shall have one-half thereof. And as for the parents [of the deceased], each of them shall have one-sixth of what he leaves behind, in the event of his having [left] a child; but if he has left no child and his parents are his [only] heirs, then his mother shall have one-third; and if he has brothers and sisters, then his mother shall have one-sixth after [the deduction of] any bequest he may have made, or any debt [he may have incurred]. As for your parents and your children - you know not which of them is more deserving of benefit from you: [therefore this] ordinance from God. Verily, God is all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/504","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/504.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/504.mp3"]}},{"no":12,"arab":"وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ ۚ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ۚ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ ۚ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ ۚ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ۗ وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ ۚ فَإِنْ كَانُوا أَكْثَرَ مِنْ ذَٰلِكَ فَهُمْ شُرَكَاءُ فِي الثُّلُثِ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ ۚ وَصِيَّةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَلِيمٌ","latin":"walakum nishfu maa taraka azwaajukum in lam yakun lahunna waladun fa-in kaana lahunna waladun falakumu alrrubu'u mimmaa tarakna min ba'di washiyyatin yuushiina bihaa aw daynin walahunna alrrubu'u mimmaa taraktum in lam yakun lakum waladun fa-in kaana lakum waladun falahunna altstsumunu mimmaa taraktum min ba'di washiyyatin tuushuuna bihaa aw daynin wa-in kaana rajulun yuuratsu kalaalatan awi imra-atun walahu akhun aw ukhtun falikulli waahidin minhumaa alssudusu fa-in kaanuu aktsara min dzaalika fahum syurakaau fii altstsulutsi min ba'di washiyyatin yuushaa bihaa aw daynin ghayra mudaarrin washiyyatan mina allaahi waallaahu 'aliimun haliimun","translate":{"id":"Dan bagimu (suami-suami) seperdua dari harta yang ditinggalkan oleh isteri-isterimu, jika mereka tidak mempunyai anak. Jika isteri-isterimu itu mempunyai anak, maka kamu mendapat seperempat dari harta yang ditinggalkannya sesudah dipenuhi wasiat yang mereka buat atau (dan) seduah dibayar hutangnya. Para isteri memperoleh seperempat harta yang kamu tinggalkan jika kamu tidak mempunyai anak. Jika kamu mempunyai anak, maka para isteri memperoleh seperdelapan dari harta yang kamu tinggalkan sesudah dipenuhi wasiat yang kamu buat atau (dan) sesudah dibayar hutang-hutangmu. Jika seseorang mati, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang saudara laki-laki (seibu saja) atau seorang saudara perempuan (seibu saja), maka bagi masing-masing dari kedua jenis saudara itu seperenam harta. Tetapi jika saudara-saudara seibu itu lebih dari seorang, maka mereka bersekutu dalam yang sepertiga itu, sesudah dipenuhi wasiat yang dibuat olehnya atau sesudah dibayar hutangnya dengan tidak memberi mudharat (kepada ahli waris) . (Allah menetapkan yang demikian itu sebagai) syari'at yang benar-benar dari Allah, dan Allah Maha Mengetahui lagi Maha Penyantun.\n","en":"And you shall inherit one-half of what your wives leave behind, provided they have left no child; but if they have left a child, then you shall have one-quarter of what they leave behind, after [the deduction of] any bequest they may have made, or any debt [they may have incurred]. And your widows shall have one-quarter of what you leave behind, provided you have left no child; but if you have left a child, then they shall have one-eighth of what you leave behind, after [the deduction of] any bequest you may have made, or any debt [you may have incurred]. And if a man or a woman has no heir in the direct line, but has a brother or a sister, then each of these two shall inherit one-sixth; but if there are more than two, then they shall share in one-third [of the inheritance], after [the deduction of] any bequest that may have been made, or any debt [that may have been incurred], neither of which having been intended to harm [the heirs]. [This is] an injunction from God: and God is all-knowing, forbearing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/505","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/505.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/505.mp3"]}},{"no":13,"arab":"تِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ الْفَوْزُ الْعَظِيمُ","latin":"tilka huduudu allaahi waman yuthi'i allaaha warasuulahu yudkhilhu jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa wadzaalika alfawzu al'azhiimu","translate":{"id":"(Hukum-hukum tersebut) itu adalah ketentuan-ketentuan dari Allah. Barangsiapa taat kepada Allah dan Rasul-Nya, niscaya Allah memasukkannya kedalam syurga yang mengalir didalamnya sungai-sungai, sedang mereka kekal di dalamnya; dan itulah kemenangan yang besar.\n","en":"These are the bounds set by God. And whoever pays heed unto God and His Apostle, him will He bring into gardens through which running waters flow, therein to abide: and this is a triumph supreme."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/506","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/506.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/506.mp3"]}},{"no":14,"arab":"وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُهِينٌ","latin":"waman ya'shi allaaha warasuulahu wayata'adda huduudahu yudkhilhu naaran khaalidan fiihaa walahu 'adzaabun muhiinun","translate":{"id":"Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya dan melanggar ketentuan-ketentuan-Nya, niscaya Allah memasukkannya ke dalam api neraka sedang ia kekal di dalamnya; dan baginya siksa yang menghinakan.\n","en":"And whoever rebels against God and His Apostle and transgresses His bounds, him will He commit unto fire, therein to abide; and shameful suffering awaits him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/507","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/507.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/507.mp3"]}},{"no":15,"arab":"وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِنْ نِسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِنْكُمْ ۖ فَإِنْ شَهِدُوا فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ حَتَّىٰ يَتَوَفَّاهُنَّ الْمَوْتُ أَوْ يَجْعَلَ اللَّهُ لَهُنَّ سَبِيلًا","latin":"waallaatii ya/tiina alfaahisyata min nisaa-ikum faistasyhiduu 'alayhinna arba'atan minkum fa-in syahiduu fa-amsikuuhunna fii albuyuuti hattaa yatawaffaahunna almawtu aw yaj'ala allaahu lahunna sabiilaanwaalladzaani ya/tiyaanihaa minkum faaadzuuhumaa fa-in taabaa wa-ashlahaa fa-a'ridhuu 'anhumaa inna allaaha kaana tawwaaban rahiimaan","translate":{"id":"Dan (terhadap) para wanita yang mengerjakan perbuatan keji , hendaklah ada empat orang saksi diantara kamu (yang menyaksikannya). Kemudian apabila mereka telah memberi persaksian, maka kurunglah mereka (wanita-wanita itu) dalam rumah sampai mereka menemui ajalnya, atau sampai Allah memberi jalan lain kepadanya .\n","en":"AND AS FOR those of your women who become guilty of immoral conduct, call upon four from among you who have witnessed their guilt; and if these bear witness thereto, confine the guilty women to their houses until death takes them away or God opens for them a way [through repentance]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/508","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/508.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/508.mp3"]}},{"no":16,"arab":"وَاللَّذَانِ يَأْتِيَانِهَا مِنْكُمْ فَآذُوهُمَا ۖ فَإِنْ تَابَا وَأَصْلَحَا فَأَعْرِضُوا عَنْهُمَا ۗ إِنَّ اللَّهَ كَانَ تَوَّابًا رَحِيمًا","latin":"waalladzaani ya/tiyaanihaa minkum faaadzuuhumaa fa-in taabaa wa-ashlahaa fa-a'ridhuu 'anhumaa inna allaaha kaana tawwaaban rahiimaan","translate":{"id":"Dan terhadap dua orang yang melakukan perbuatan keji di antara kamu, maka berilah hukuman kepada keduanya, kemudian jika keduanya bertaubat dan memperbaiki diri, maka biarkanlah mereka. Sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang.\n","en":"And punish [thus] both of the guilty parties; but if they both repent and mend their ways, leave them alone: for, behold, God is an acceptor of repentance, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/509","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/509.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/509.mp3"]}},{"no":17,"arab":"إِنَّمَا التَّوْبَةُ عَلَى اللَّهِ لِلَّذِينَ يَعْمَلُونَ السُّوءَ بِجَهَالَةٍ ثُمَّ يَتُوبُونَ مِنْ قَرِيبٍ فَأُولَٰئِكَ يَتُوبُ اللَّهُ عَلَيْهِمْ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","latin":"innamaa alttawbatu 'alaa allaahi lilladziina ya'maluuna alssuu-a bijahaalatin tsumma yatuubuuna min qariibin faulaa-ika yatuubu allaahu 'alayhim wakaana allaahu 'aliiman hakiimaan","translate":{"id":"Sesungguhnya taubat di sisi Allah hanyalah taubat bagi orang-orang yang mengerjakan kejahatan lantaran kejahilan , yang kemudian mereka bertaubat dengan segera, maka mereka itulah yang diterima Allah taubatnya; dan Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"Verily, God's acceptance of repentance relates only to those who do evil out of ignorance and then repent before their time runs out: and it is they unto whom God will turn again in His mercy - for God is all-knowing, wise;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/510","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/510.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/510.mp3"]}},{"no":18,"arab":"وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّىٰ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ وَلَا الَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ أُولَٰئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا","latin":"walaysati alttawbatu lilladziina ya'maluuna alssayyi-aati hattaa idzaa hadhara ahadahumu almawtu qaala innii tubtu al-aana walaa alladziina yamuutuuna wahum kuffaarun ulaa-ika a'tadnaa lahum 'adzaaban aliimaan","translate":{"id":"Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan : \"Sesungguhnya saya bertaubat sekarang\". Dan tidak (pula diterima taubat) orang-orang yang mati sedang mereka di dalam kekafiran. Bagi orang-orang itu telah Kami sediakan siksa yang pedih.\n","en":"whereas repentance shall not be accepted from those who do evil deeds until their dying hour and then say, \"Behold, I now repent\"; nor from those who die as deniers of the truth: it is these for whom We have readied grievous suffering."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/511","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/511.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/511.mp3"]}},{"no":19,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ ۚ فَإِنْ كَرِهْتُمُوهُنَّ فَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَيَجْعَلَ اللَّهُ فِيهِ خَيْرًا كَثِيرًا","latin":"yaa ayyuhaa alladziina aamanuu laa yahillu lakum an taritsuu alnnisaa-a karhan walaa ta'dhuluuhunna litadzhabuu biba'dhi maa aataytumuuhunna illaa an ya/tiina bifaahisyatin mubayyinatin wa'aasyiruuhunna bialma'ruufi fa-in karihtumuuhunna fa'asaa an takrahuu syay-an wayaj'ala allaahu fiihi khayran katsiiraan","translate":{"id":"Hai orang-orang yang beriman, tidak halal bagi kamu mempusakai wanita dengan jalan paksa dan janganlah kamu menyusahkan mereka karena hendak mengambil kembali sebagian dari apa yang telah kamu berikan kepadanya, terkecuali bila mereka melakukan pekerjaan keji yang nyata . Dan bergaullah dengan mereka secara patut. Kemudian bila kamu tidak menyukai mereka, (maka bersabarlah) karena mungkin kamu tidak menyukai sesuatu, padahal Allah menjadikan padanya kebaikan yang banyak.\n","en":"O YOU who have attained to faith! It is not lawful for you to [try to] become heirs to your wives [by holding onto them] against their will; and neither shall you keep them under constraint with a view to taking away anything of what you may have given them, unless it be that they have become guilty, in an obvious man­ner, of immoral conduct. And consort with your wives in a goodly manner; for if you dislike them, it may well be that you dislike something which God might yet make a source of abundant good."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/512","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/512.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/512.mp3"]}},{"no":20,"arab":"وَإِنْ أَرَدْتُمُ اسْتِبْدَالَ زَوْجٍ مَكَانَ زَوْجٍ وَآتَيْتُمْ إِحْدَاهُنَّ قِنْطَارًا فَلَا تَأْخُذُوا مِنْهُ شَيْئًا ۚ أَتَأْخُذُونَهُ بُهْتَانًا وَإِثْمًا مُبِينًا","latin":"wa-in aradtumu istibdaala zawjin makaana zawjin waaataytum ihdaahunna qinthaaran falaa ta/khudzuu minhu syay-an ata/khudzuunahu buhtaanan wa-itsman mubiinaan","translate":{"id":"Dan jika kamu ingin mengganti isterimu dengan isteri yang lain , sedang kamu telah memberikan kepada seseorang di antara mereka harta yang banyak, maka janganlah kamu mengambil kembali dari padanya barang sedikitpun. Apakah kamu akan mengambilnya kembali dengan jalan tuduhan yang dusta dan dengan (menanggung) dosa yang nyata ?\n","en":"But if you desire to give up a wife and to take another in her stead, do not take away anything of what you have given the first one, however much it may have been. Would you, perchance, take it away by slandering her and thus committing a manifest sin?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/513","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/513.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/513.mp3"]}},{"no":21,"arab":"وَكَيْفَ تَأْخُذُونَهُ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنْكُمْ مِيثَاقًا غَلِيظًا","latin":"wakayfa ta/khudzuunahu waqad afdaa ba'dhukum ilaa ba'dhin wa-akhadzna minkum miitsaaqan ghaliizhaan","translate":{"id":"Bagaimana kamu akan mengambilnya kembali, padahal sebagian kamu telah bergaul (bercampur) dengan yang lain sebagai suami-isteri. Dan mereka (isteri-isterimu) telah mengambil dari kamu perjanjian yang kuat.\n","en":"And how could you take it away after you have given yourselves to one another, and she has received a most solemn pledge from you?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/514","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/514.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/514.mp3"]}},{"no":22,"arab":"وَلَا تَنْكِحُوا مَا نَكَحَ آبَاؤُكُمْ مِنَ النِّسَاءِ إِلَّا مَا قَدْ سَلَفَ ۚ إِنَّهُ كَانَ فَاحِشَةً وَمَقْتًا وَسَاءَ سَبِيلًا","latin":"walaa tankihuu maa nakaha aabaaukum mina alnnisaa-i illaa maa qad salafa innahu kaana faahisyatan wamaqtan wasaa-a sabiilaan","translate":{"id":"Dan janganlah kamu kawini wanita-wanita yang telah dikawini oleh ayahmu, terkecuali pada masa yang telah lampau. Sesungguhnya perbuatan itu amat keji dan dibenci Allah dan seburuk-buruk jalan (yang ditempuh).\n","en":"AND DO NOT marry women whom your fathers have previously married - although what is past is past: this, verily, is a shameful deed, and a hateful thing, and an evil way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/515","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/515.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/515.mp3"]}},{"no":23,"arab":"حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالَاتُكُمْ وَبَنَاتُ الْأَخِ وَبَنَاتُ الْأُخْتِ وَأُمَّهَاتُكُمُ اللَّاتِي أَرْضَعْنَكُمْ وَأَخَوَاتُكُمْ مِنَ الرَّضَاعَةِ وَأُمَّهَاتُ نِسَائِكُمْ وَرَبَائِبُكُمُ اللَّاتِي فِي حُجُورِكُمْ مِنْ نِسَائِكُمُ اللَّاتِي دَخَلْتُمْ بِهِنَّ فَإِنْ لَمْ تَكُونُوا دَخَلْتُمْ بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ وَحَلَائِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلَابِكُمْ وَأَنْ تَجْمَعُوا بَيْنَ الْأُخْتَيْنِ إِلَّا مَا قَدْ سَلَفَ ۗ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا","latin":"hurrimat 'alaykum ummahaatukum wabanaatukum wa-akhawaatukum wa'ammaatukum wakhaalaatukum wabanaatu al-akhi wabanaatu al-ukhti waummahaatukumu allaatii ardha'nakum wa-akhawaatukum mina alrradaa'ati waummahaatu nisaa-ikum warabaa-ibukumu allaatii fii hujuurikum min nisaa-ikumu allaatii dakhaltum bihinna fa-in lam takuunuu dakhaltum bihinna falaa junaaha 'alaykum wahalaa-ilu abnaa-ikumu alladziina min ashlaabikum wa-an tajma'uu bayna al-ukhtayni illaa maa qad salafa inna allaaha kaana ghafuuran rahiimaan","translate":{"id":"Diharamkan atas kamu (mengawini) ibu-ibumu; anak-anakmu yang perempuan ; saudara-saudaramu yang perempuan, saudara-saudara bapakmu yang perempuan; saudara-saudara ibumu yang perempuan; anak-anak perempuan dari saudara-saudaramu yang laki-laki; anak-anak perempuan dari saudara-saudaramu yang perempuan; ibu-ibumu yang menyusui kamu; saudara perempuan sepersusuan; ibu-ibu isterimu (mertua); anak-anak isterimu yang dalam pemeliharaanmu dari isteri yang telah kamu campuri, tetapi jika kamu belum campur dengan isterimu itu (dan sudah kamu ceraikan), maka tidak berdosa kamu mengawininya; (dan diharamkan bagimu) isteri-isteri anak kandungmu (menantu); dan menghimpunkan (dalam perkawinan) dua perempuan yang bersaudara, kecuali yang telah terjadi pada masa lampau; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"Forbidden to you are your mothers, and your daughters, and your sisters, and your aunts paternal and maternal, and a brother's daughters, and a sister's daughters; and your milk-mothers, and your milk-sisters; and the mothers of your wives; and your step-daughters - who are your foster children - born of your wives with whom you have consummated your marriage; but if you have not consummated your marriage, you will incur no sin [by marrying their daughters]; and [forbidden to you are] the spouses of the sons who have sprung from your loins; and [you are forbidden] to have two sisters [as your wives] at one and the same time - but what is past is past: for, behold, God is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/516","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/516.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/516.mp3"]}},{"no":24,"arab":"وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُمْ مَا وَرَاءَ ذَٰلِكُمْ أَنْ تَبْتَغُوا بِأَمْوَالِكُمْ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ ۚ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُمْ بِهِ مِنْ بَعْدِ الْفَرِيضَةِ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","latin":"waalmuhsanaatu mina alnnisaa-i illaa maa malakat aymaanukum kitaaba allaahi 'alaykum wauhilla lakum maa waraa-a dzaalikum an tabtaghuu bi-amwaalikum muhsiniina ghayra musaafihiina famaa istamta'tum bihi minhunna faaatuuhunna ujuurahunna fariidhatan walaa junaaha 'alaykum fiimaa taraadaytum bihi min ba'di alfariidhati inna allaaha kaana 'aliiman hakiimaan","translate":{"id":"dan (diharamkan juga kamu mengawini) wanita yang bersuami, kecuali budak-budak yang kamu miliki (Allah telah menetapkan hukum itu) sebagai ketetapan-Nya atas kamu. Dan dihalalkan bagi kamu selain yang demikian (yaitu) mencari isteri-isteri dengan hartamu untuk dikawini bukan untuk berzina. Maka isteri-isteri yang telah kamu ni'mati (campuri) di antara mereka, berikanlah kepada mereka maharnya (dengan sempurna), sebagai suatu kewajiban; dan tiadalah mengapa bagi kamu terhadap sesuatu yang kamu telah saling merelakannya, sesudah menentukan mahar itu . Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"And [forbidden to you are] all married women other than those whom you rightfully possess [through wedlock]: this is God's ordinance, binding upon you. But lawful to you are all [women] beyond these, for you to seek out, offering them of your possessions, taking them in honest wedlock, and not in fornication. And unto those with whom you desire to enjoy marriage, you shall give the dowers due to them; but you will incur no sin if, after [having agreed upon] this lawful due, you freely agree with one another upon anything [else]: behold, God is indeed all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/517","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/517.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/517.mp3"]}},{"no":25,"arab":"وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا أَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِنْ مَا مَلَكَتْ أَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُؤْمِنَاتِ ۚ وَاللَّهُ أَعْلَمُ بِإِيمَانِكُمْ ۚ بَعْضُكُمْ مِنْ بَعْضٍ ۚ فَانْكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ ۚ فَإِذَا أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَاحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنَاتِ مِنَ الْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ ۚ وَأَنْ تَصْبِرُوا خَيْرٌ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ","latin":"waman lam yastathi' minkum thawlan an yankiha almuhsanaati almu/minaati famin maa malakat aymaanukum min fatayaatikumu almu/minaati waallaahu a'lamu bi-iimaanikum ba'dhukum min ba'dhin fainkihuuhunna bi-idzni ahlihinna waaatuuhunna ujuurahunna bialma'ruufi muhsanaatin ghayra masaafihaatin walaa muttakhidzaati akhdaanin fa-idzaa uhsinna fa-in atayna bifaahisyatin fa'alayhinna nishfu maa 'alaa almuhsanaati mina al'adzaabi dzaalika liman khasyiya al'anata minkum wa-an tashbiruu khayrun lakum waallaahu ghafuurun rahiimun","translate":{"id":"Dan barangsiapa diantara kamu (orang merdeka) yang tidak cukup perbelanjaannya untuk mengawini wanita merdeka lagi beriman, ia boleh mengawini wanita yang beriman, dari budak-budak yang kamu miliki. Allah mengetahui keimananmu; sebahagian kamu adalah dari sebahagian yang lain , karena itu kawinilah mereka dengan seizin tuan mereka, dan berilah maskawin mereka menurut yang patut, sedang merekapun wanita-wanita yang memelihara diri, bukan pezina dan bukan (pula) wanita yang mengambil laki-laki lain sebagai piaraannya; dan apabila mereka telah menjaga diri dengan kawin, kemudian mereka melakukan perbuatan yang keji (zina), maka atas mereka separo hukuman dari hukuman wanita-wanita merdeka yang bersuami. (Kebolehan mengawini budak) itu, adalah bagi orang-orang yang takut kepada kemasyakatan menjaga diri (dari perbuatan zina) di antara kamu, dan kesabaran itu lebih baik bagimu. Dan Allah Maha Pengampun lagi Maha Penyayang.\n","en":"And as for those of you who, owing to cir­cumstances, are not in a position to marry free believing women, [let them marry] believing maidens from among those whom you rightfully possess. And God knows all about your faith; each one of you is an issue of the other. Marry them, then, with their people's leave, and give them their dowers in an equitable manner - they being women who give themselves in honest wedlock, not in fornication, nor as secret love-companions. And when they are married, and thereafter become guilty of immoral conduct, they shall be liable to half the penalty to which free married women are liable. This [permission to marry slave-girls applies] to those of you who fear lest they stumble into evil. But it is for your own good to persevere in patience [and to abstain from such marriages]: and God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/518","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/518.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/518.mp3"]}},{"no":26,"arab":"يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِنْ قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","latin":"yuriidu allaahu liyubayyina lakum wayahdiyakum sunana alladziina min qablikum wayatuuba 'alaykum waallaahu 'aliimun hakiimun","translate":{"id":"Allah hendak menerangkan (hukum syari'at-Nya) kepadamu, dan menunjukimu kepada jalan-jalan orang yang sebelum kamu (para nabi dan shalihin) dan (hendak) menerima taubatmu. Dan Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"God wants to make [all this] clear unto you, and to guide you onto the [righteous] ways of life of those who preceded you, and to turn unto you in His mercy: for God is all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/519","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/519.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/519.mp3"]}},{"no":27,"arab":"وَاللَّهُ يُرِيدُ أَنْ يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَنْ تَمِيلُوا مَيْلًا عَظِيمًا","latin":"waallaahu yuriidu an yatuuba 'alaykum wayuriidu alladziina yattabi'uuna alsysyahawaati an tamiiluu maylan 'azhiimanv","translate":{"id":"Dan Allah hendak menerima taubatmu, sedang orang-orang yang mengikuti hawa nafsunya bermaksud supaya kamu berpaling sejauh-jauhnya (dari kebenaran).\n","en":"And God wants to turn unto you in His mercy, whereas those who follow [only] their own lusts want you to drift far away from the right path."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/520","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/520.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/520.mp3"]}},{"no":28,"arab":"يُرِيدُ اللَّهُ أَنْ يُخَفِّفَ عَنْكُمْ ۚ وَخُلِقَ الْإِنْسَانُ ضَعِيفًا","latin":"yuriidu allaahu an yukhaffifa 'ankum wakhuliqa al-insaanu dha'iifaan","translate":{"id":"Allah hendak memberikan keringanan kepadamu , dan manusia dijadikan bersifat lemah.\n","en":"God wants to lighten your burdens: for man has been created weak."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/521","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/521.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/521.mp3"]}},{"no":29,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلَّا أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ ۚ وَلَا تَقْتُلُوا أَنْفُسَكُمْ ۚ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا","latin":"yaa ayyuhaa alladziina aamanuu laa ta/kuluu amwaalakum baynakum bialbaathili illaa an takuuna tijaaratan 'an taraadin minkum walaa taqtuluu anfusakum inna allaaha kaana bikum rahiimaan","translate":{"id":"Hai orang-orang yang beriman, janganlah kami saling memakan harta sesamamu dengan jalan yang batil, kecuali dengan jalan perniagaan yang berlaku dengan suka sama-suka di antara kamu. Dan janganlah kamu membunuh dirimu ; sesungguhnya Allah adalah Maha Penyayang kepadamu.\n","en":"O YOU who have attained to faith! Do not devour one another's possessions wrongfully - not even by way of trade based on mutual agreement - and do not destroy one another: for, behold, God is indeed a dispenser of grace unto you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/522","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/522.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/522.mp3"]}},{"no":30,"arab":"وَمَنْ يَفْعَلْ ذَٰلِكَ عُدْوَانًا وَظُلْمًا فَسَوْفَ نُصْلِيهِ نَارًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","latin":"waman yaf'al dzaalika 'udwaanan wazhulman fasawfa nushliihi naaran wakaana dzaalika 'alaa allaahi yasiiraan","translate":{"id":"Dan barangsiapa berbuat demikian dengan melanggar hak dan aniaya, maka Kami kelak akan memasukkannya ke dalam neraka. Yang demikian itu adalah mudah bagi Allah.\n","en":"And as for him who does this with malicious intent and a will to do wrong - him shall We, in time, cause to endure [suffering through] fire: for this is indeed easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/523","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/523.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/523.mp3"]}},{"no":31,"arab":"إِنْ تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ وَنُدْخِلْكُمْ مُدْخَلًا كَرِيمًا","latin":"in tajtanibuu kabaa-ira maa tunhawna 'anhu nukaffir 'ankum sayyi-aatikum wanudkhilkum mudkhalan kariimaan","translate":{"id":"Jika kamu menjauhi dosa-dosa besar di antara dosa-dosa yang dilarang kamu mengerjakannya, niscaya Kami hapus kesalahan-kesalahanmu (dosa-dosamu yang kecil) dan Kami masukkan kamu ke tempat yang mulia (surga).\n","en":"If you avoid the great sins, which you have been enjoined to shun, We shall efface your [minor] bad deeds, and shall cause you to enter an abode of glory."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/524","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/524.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/524.mp3"]}},{"no":32,"arab":"وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا ۖ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا","latin":"walaa tatamannaw maa fadhdhala allaahu bihi ba'dhakum 'alaa ba'dhin lilrrijaali nashiibun mimmaa iktasabuu walilnnisaa-i nashiibun mimmaa iktasabna wais-aluu allaaha min fadhlihi inna allaaha kaana bikulli syay-in 'aliimaan","translate":{"id":"Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebahagian kamu lebih banyak dari sebahagian yang lain. (Karena) bagi orang laki-laki ada bahagian dari pada apa yang mereka usahakan, dan bagi para wanita (pun) ada bahagian dari apa yang mereka usahakan, dan mohonlah kepada Allah sebagian dari karunia-Nya. Sesungguhnya Allah Maha Mengetahui segala sesuatu.\n","en":"Hence, do not covet the bounties which God has bestowed more abundantly on some of you than on others. Men shall have a benefit from what they earn, and women shall have a benefit from what they earn. Ask, therefore, God [to give you] out of His bounty: behold, God has indeed full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/525","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/525.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/525.mp3"]}},{"no":33,"arab":"وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ ۚ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا","latin":"walikullin ja'alnaa mawaaliya mimmaa taraka alwaalidaani waal-aqrabuuna waalladziina 'aqadat aymaanukum faaatuuhum nashiibahum inna allaaha kaana 'alaa kulli syay-in syahiidaan","translate":{"id":"Bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya . Dan (jika ada) orang-orang yang kamu telah bersumpah setia dengan mereka, maka berilah kepada mereka bahagiannya. Sesungguhnya Allah menyaksikan segala sesuatu.\n","en":"And unto everyone have We appointed heirs to what he may leave behind: parents, and near kinsfolk, and those to whom you have pledged your troth give them, therefore, their share. Behold, God is indeed a witness unto everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/526","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/526.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/526.mp3"]}},{"no":34,"arab":"الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنْفَقُوا مِنْ أَمْوَالِهِمْ ۚ فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا","latin":"alrrijaalu qawwaamuuna 'alaa alnnisaa-i bimaa fadhdhala allaahu ba'dhahum 'alaa ba'dhin wabimaa anfaquu min amwaalihim faalshshaalihaatu qaanitaatun haafizhaatun lilghaybi bimaa hafizha allaahu waallaatii takhaafuuna nusyuuzahunna fa'izhuuhunna wauhjuruuhunna fii almadaaji'i waidhribuuhunna fa-in atha'nakum falaa tabghuu 'alayhinna sabiilan inna allaaha kaana 'aliyyan kabiiraanv","translate":{"id":"Kaum laki-laki itu adalah pemimpin bagi kaum wanita, oleh karena Allah telah melebihkan sebahagian mereka (laki-laki) atas sebahagian yang lain (wanita), dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka. Sebab itu maka wanita yang saleh, ialah yang ta'at kepada Allah lagi memelihara diri ketika suaminya tidak ada, oleh karena Allah telah memelihara (mereka) . Wanita-wanita yang kamu khawatirkan nusyuznya , maka nasehatilah mereka dan pisahkanlah mereka di tempat tidur mereka, dan pukullah mereka. Kemudian jika mereka mentaatimu, maka janganlah kamu mencari-cari jalan untuk menyusahkannya . Sesungguhnya Allah Maha Tinggi lagi Maha Besar.\n","en":"MEN SHALL take full care of women with the bounties which God has bestowed more abundantly on the former than on the latter, and with what they may spend out of their possessions. And the right­eous women are the truly devout ones, who guard the intimacy which God has [ordained to be] guar­ded. And as for those women whose ill-will you have reason to fear, admonish them [first]; then leave them alone in bed; then beat them; and if thereupon they pay you heed, do not seek to harm them. Behold, God is indeed most high, great!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/527","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/527.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/527.mp3"]}},{"no":35,"arab":"وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا","latin":"wa-in khiftum syiqaaqa baynihimaa faib'atsuu hakaman min ahlihi wahakaman min ahlihaa in yuriidaa ishlaahan yuwaffiqi allaahu baynahumaa inna allaaha kaana 'aliiman khabiiraanv","translate":{"id":"Dan jika kamu khawatirkan ada persengketaan antara keduanya, maka kirimlah seorang hakam dari keluarga laki-laki dan seorang hakam dari keluarga perempuan. Jika kedua orang hakam itu bermaksud mengadakan perbaikan, niscaya Allah memberi taufik kepada suami-isteri itu. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.\n","en":"And if you have reason to fear that a breach might occur between a [married] couple, appoint an arbiter from among his people and an arbiter from among her people; if they both want to set things aright, God may bring about their reconciliation. Be­hold, God is indeed all-knowing, aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/528","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/528.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/528.mp3"]}},{"no":36,"arab":"وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا","latin":"wau'buduu allaaha walaa tusyrikuu bihi syay-an wabialwaalidayni ihsaanan wabidzii alqurbaa waalyataamaa waalmasaakiini waaljaari dzii alqurbaa waaljaari aljunubi waalssahibi bialjanbi waibni alssabiili wamaa malakat aymaanukum inna allaaha laa yuhibbu man kaana mukhtaalan fakhuuraanalladziina yabkhaluuna waya/muruuna alnnaasa bialbukhli wayaktumuuna maa aataahumu allaahu min fadhlihi wa-a'tadnaa lilkaafiriina 'adzaaban muhiinaan","translate":{"id":"Sembahlah Allah dan janganlah kamu mempersekutukan-Nya dengan sesuatupun. Dan berbuat baiklah kepada dua orang ibu-bapa, karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga yang dekat dan tetangga yang jauh , dan teman sejawat, ibnu sabil dan hamba sahayamu. Sesungguhnya Allah tidak menyukai orang-orang yang sombong dan membangga-banggakan diri,\n","en":"AND WORSHIP God [alone], and do not ascribe divinity, in any way, to aught beside Him. And do good unto your parents, and near of kin, and unto orphans, and the needy, and the neighbour from among your own people, and the neighbour who is a stranger, and the friend by your side, and the wayfarer, and those whom you rightfully possess. Verily, God does not love any of those who, full of self-conceit, act in a boastful manner;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/529","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/529.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/529.mp3"]}},{"no":37,"arab":"الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۗ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا","latin":"alladziina yabkhaluuna waya/muruuna alnnaasa bialbukhli wayaktumuuna maa aataahumu allaahu min fadhlihi wa-a'tadnaa lilkaafiriina 'adzaaban muhiinaan","translate":{"id":"(yaitu) orang-orang yang kikir, dan menyuruh orang lain berbuat kikir, dan menyembunyikan karunia Allah yang telah diberikan-Nya kepada mereka. Dan Kami telah menyediakan untuk orang-orang kafir siksa yang menghinakan.\n","en":"[nor] those who are niggardly, and bid others to be niggardly, and conceal whatever God has bestowed upon them out of His bounty; and so We have readied shameful suffering for all who thus deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/530","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/530.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/530.mp3"]}},{"no":38,"arab":"وَالَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ رِئَاءَ النَّاسِ وَلَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ ۗ وَمَنْ يَكُنِ الشَّيْطَانُ لَهُ قَرِينًا فَسَاءَ قَرِينًا","latin":"waalladziina yunfiquuna amwaalahum ri-aa-a alnnaasi walaa yu/minuuna biallaahi walaa bialyawmi al-aakhiri waman yakuni alsysyaythaanu lahu qariinan fasaa-a qariinaan","translate":{"id":"Dan (juga) orang-orang yang menafkahkan harta-harta mereka karena riya kepada manusia, dan orang-orang yang tidak beriman kepada Allah dan kepada hari kemudian. Barangsiapa yang mengambil syaitan itu menjadi temannya, maka syaitan itu adalah teman yang seburuk-buruknya.\n","en":"And [God does not love] those who spend their possessions on others [only] to be seen and praised by men, the while they believe neither in God nor in the Last Day; and he who has Satan for a soul-mate, how evil a soul-mate has he!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/531","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/531.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/531.mp3"]}},{"no":39,"arab":"وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَنْفَقُوا مِمَّا رَزَقَهُمُ اللَّهُ ۚ وَكَانَ اللَّهُ بِهِمْ عَلِيمًا","latin":"wamaatsaa 'alayhim law aamanuu biallaahi waalyawmi al-aakhiri wa-anfaquu mimmaa razaqahumu allaahu wakaana allaahu bihim 'aliimaaninna allaaha laa yazhlimu mitsqaala dzarratin wa-in taku hasanatan yudaa'ifhaa wayu/ti min ladunhu ajran 'azhiimaan","translate":{"id":"Apakah kemudharatannya bagi mereka, kalau mereka beriman kepada Allah dan hari kemudian dan menafkahkan sebahagian rezki yang telah diberikan Allah kepada mereka ? Dan adalah Allah Maha Mengetahui keadaan mereka.\n","en":"And what would they have to fear if they would but believe in God and the Last Day, and spend [in His way] out of what God has granted them as sustenance - since God has indeed full knowledge of them?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/532","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/532.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/532.mp3"]}},{"no":40,"arab":"إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْرًا عَظِيمًا","latin":"inna allaaha laa yazhlimu mitsqaala dzarratin wa-in taku hasanatan yudaa'ifhaa wayu/ti min ladunhu ajran 'azhiimaan","translate":{"id":"Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar .\n","en":"Verily, God does not wrong [anyone] by as much as an atom's weight; and if there be a good deed, He will multiply it, and will bestow out of His grace a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/533","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/533.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/533.mp3"]}},{"no":41,"arab":"فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَٰؤُلَاءِ شَهِيدًا","latin":"fakayfa idzaa ji/naa min kulli ummatin bisyahiidin waji/naa bika 'alaa haaulaa-i syahiidaan","translate":{"id":"Maka bagaimanakah (halnya orang kafir nanti), apabila Kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu ).\n","en":"How, then, [will the sinners fare on Judgment Day,] when We shall bring forward witnesses from within every community, and bring thee [O Prophet] as witness against them?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/534","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/534.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/534.mp3"]}},{"no":42,"arab":"يَوْمَئِذٍ يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّىٰ بِهِمُ الْأَرْضُ وَلَا يَكْتُمُونَ اللَّهَ حَدِيثًا","latin":"yawma-idzin yawaddu alladziina kafaruu wa'ashawuu alrrasuula law tusawwaa bihimu al-ardhu walaa yaktumuuna allaaha hadiitsaan","translate":{"id":"Di hari itu orang-orang kafir dan orang-orang yang mendurhakai rasul, ingin supaya mereka disamaratakan dengan tanah , dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadianpun.\n","en":"Those who were bent on denying the truth and paid no heed to the Apostle will on that Day wish that the earth would swallow them: but they shall not [be able to] conceal from God anything that has happened."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/535","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/535.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/535.mp3"]}},{"no":43,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْرَبُوا الصَّلَاةَ وَأَنْتُمْ سُكَارَىٰ حَتَّىٰ تَعْلَمُوا مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا ۚ وَإِنْ كُنْتُمْ مَرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ إِنَّ اللَّهَ كَانَ عَفُوًّا غَفُورًا","latin":"yaa ayyuhaa alladziina aamanuu laa taqrabuu alshshalaata wa-antum sukaaraa hattaa ta'lamuu maa taquuluuna walaa junuban illaa 'aabirii sabiilin hattaa taghtasiluu wa-in kuntum mardaa aw 'alaa safarin aw jaa-a ahadun minkum mina alghaa-ithi aw laamastumu alnnisaa-a falam tajiduu maa-an fatayammamuu sha'iidan thayyiban faimsahuu biwujuuhikum wa-aydiikum inna allaaha kaana 'afuwwan ghafuuraan","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu shalat, sedang kamu dalam keadaan mabuk, sehingga kamu mengerti apa yang kamu ucapkan, (jangan pula hampiri mesjid) sedang kamu dalam keadaan junub , terkecuali sekedar berlalu saja, hingga kamu mandi. Dan jika kamu sakit atau sedang dalam musafir atau datang dari tempat buang air atau kamu telah menyentuh perempuan, kemudian kamu tidak mendapat air, maka bertayamumlah kamu dengan tanah yang baik (suci); sapulah mukamu dan tanganmu. Sesungguhnya Allah Maha Pema'af lagi Maha Pengampun.\n","en":"O YOU who have attained to faith! Do not attempt to pray while you are in a state of drunkenness, [but wait] until you know what you are saying; nor yet [while you are] in a state requiring total ablution, until you have bathed - except if you are travelling [and are unable to do so]. But if you are ill, or are travelling, or have just satisfied a want of nature, or have cohabited with a woman, and can find no water - then take resort to pure dust, passing [there­with] lightly over your face and your hands. Behold, God is indeed an absolver of sins, much-forgiving."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/536","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/536.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/536.mp3"]}},{"no":44,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يَشْتَرُونَ الضَّلَالَةَ وَيُرِيدُونَ أَنْ تَضِلُّوا السَّبِيلَ","latin":"alam tara ilaa alladziina uutuu nashiiban mina alkitaabi yasytaruuna aldhdhalaalata wayuriiduuna an tadhilluu alssabiila","translate":{"id":"Apakah kamu tidak melihat orang-orang yang telah diberi bahagian dari Al Kitab (Taurat) ? Mereka membeli (memilih) kesesatan (dengan petunjuk) dan mereka bermaksud supaya kamu tersesat (menyimpang) dari jalan (yang benar).\n","en":"ART THOU NOT aware of those who, having been granted their share of the divine writ, now barter it away for error, and want you [too] to lose your way?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/537","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/537.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/537.mp3"]}},{"no":45,"arab":"وَاللَّهُ أَعْلَمُ بِأَعْدَائِكُمْ ۚ وَكَفَىٰ بِاللَّهِ وَلِيًّا وَكَفَىٰ بِاللَّهِ نَصِيرًا","latin":"waallaahu a'lamu bi-a'daa-ikum wakafaa biallaahi waliyyan wakafaa biallaahi nashiiraan","translate":{"id":"Dan Allah lebih mengetahui (dari pada kamu) tentang musuh-musuhmu. Dan cukuplah Allah menjadi Pelindung (bagimu). Dan cukuplah Allah menjadi Penolong (bagimu).\n","en":"But God knows best who are your enemies: and none can befriend as God does, and none can give succour as God does."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/538","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/538.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/538.mp3"]}},{"no":46,"arab":"مِنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ وَيَقُولُونَ سَمِعْنَا وَعَصَيْنَا وَاسْمَعْ غَيْرَ مُسْمَعٍ وَرَاعِنَا لَيًّا بِأَلْسِنَتِهِمْ وَطَعْنًا فِي الدِّينِ ۚ وَلَوْ أَنَّهُمْ قَالُوا سَمِعْنَا وَأَطَعْنَا وَاسْمَعْ وَانْظُرْنَا لَكَانَ خَيْرًا لَهُمْ وَأَقْوَمَ وَلَٰكِنْ لَعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا","latin":"mina alladziina haaduu yuharrifuuna alkalima 'an mawaadi'ihi wayaquuluuna sami'naa wa'ashaynaa waisma' ghayra musma'in waraa'inaa layyan bi-alsinatihim watha'nan fii alddiini walaw annahum qaaluu sami'naa wa-atha'naa waisma' waunzhurnaa lakaana khayran lahum wa-aqwama walaakin la'anahumu allaahu bikufrihim falaa yu/minuuna illaa qaliilaan","translate":{"id":"Yaitu orang-orang Yahudi, mereka mengubah perkataan dari tempat-tempatnya . Mereka berkata : \"Kami mendengar\", tetapi kami tidak mau menurutinya . Dan (mereka mengatakan pula) : \"Dengarlah\" sedang kamu sebenarnya tidak mendengar apa-apa . Dan (mereka mengatakan) : \"Raa'ina\" , dengan memutar-mutar lidahnya dan mencela agama. Sekiranya mereka mengatakan : \"Kami mendengar dan menurut, dan dengarlah, dan perhatikanlah kami\", tentulah itu lebih baik bagi mereka dan lebih tepat, akan tetapi Allah mengutuk mereka, karena kekafiran mereka. Mereka tidak beriman kecuali iman yang sangat tipis.\n","en":"Among those of the Jewish faith there are some who distort the meaning of the [revealed] words, taking them out of their context and saying, [as it were,] \"We have heard, but we disobey,\" and, \"Hear without hearkening,” and, “Hearken thou unto us, (O Muhammad)” - thus making a play with their tongues, and implying that the [true] Faith is false. And had they but said, \"We have heard, and we pay heed,\" and \"Hear [us], and have patience with us,\" it would indeed have been for their own good, and more upright: but God has rejected them because of their refusal to acknowledge the truth - for it is in but few things that they believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/539","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/539.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/539.mp3"]}},{"no":47,"arab":"يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقًا لِمَا مَعَكُمْ مِنْ قَبْلِ أَنْ نَطْمِسَ وُجُوهًا فَنَرُدَّهَا عَلَىٰ أَدْبَارِهَا أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا","latin":"yaa ayyuhaa alladziina uutuu alkitaaba aaminuu bimaa nazzalnaa mushaddiqan limaa ma'akum min qabli an nathmisa wujuuhan fanaruddahaa 'alaa adbaarihaa aw nal'anahum kamaa la'annaa ash-haaba alssabti wakaana amru allaahi maf'uulaan","translate":{"id":"Hai orang-orang yang telah diberi Al Kitab, berimanlah kamu kepada apa yang telah Kami turunkan (Al Qur'an) yang membenarkan Kitab yang ada pada kamu sebelum Kami mengubah muka (mu), lalu Kami putarkan ke belakang atau Kami kutuki mereka sebagaimana Kami telah mengutuki orang-orang (yang berbuat ma'siat) pada hari Sabtu . Dan ketetapan Allah pasti berlaku.\n","en":"O you who have been granted revelation [aforetime]! Believe in what We have [now] bestowed from on high in confirmation of whatever [of the truth] you already possess, lest We efface your hopes and bring them to an end - just as We rejected those people who broke the Sabbath: for God's will is always done."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/540","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/540.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/540.mp3"]}},{"no":48,"arab":"إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا","latin":"inna allaaha laa yaghfiru an yusyraka bihi wayaghfiru maa duuna dzaalika liman yasyaau waman yusyrik biallaahi faqadi iftaraa itsman 'azhiimaan","translate":{"id":"Sesungguhnya Allah tidak akan mengampuni dosa syirik, dan Dia mengampuni segala dosa yang selain dari (syirik) itu, bagi siapa yang dikehendaki-Nya. Barangsiapa yang mempersekutukan Allah, maka sungguh ia telah berbuat dosa yang besar.\n","en":"VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for he who ascribes divinity to aught beside God has indeed contrived an awesome sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/541","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/541.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/541.mp3"]}},{"no":49,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنْفُسَهُمْ ۚ بَلِ اللَّهُ يُزَكِّي مَنْ يَشَاءُ وَلَا يُظْلَمُونَ فَتِيلًا","latin":"alam tara ilaa alladziina yuzakkuuna anfusahum bali allaahu yuzakkii man yasyaau walaa yuzhlamuuna fatiilaan","translate":{"id":"Apakah kamu tidak memperhatikan orang yang menganggap dirinya bersih ? . Sebenarnya Allah membersihkan siapa yang dikehendaki-Nya dan mereka tidak aniaya sedikitpun.\n","en":"Art thou not aware of those who consider themselves pure? Nay, but it is God who causes whomever He wills to grow in purity; and none shall be wronged by as much as a hair's breadth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/542","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/542.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/542.mp3"]}},{"no":50,"arab":"انْظُرْ كَيْفَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ ۖ وَكَفَىٰ بِهِ إِثْمًا مُبِينًا","latin":"unzhur kayfa yaftaruuna 'alaa allaahi alkadziba wakafaa bihi itsman mubiinaan","translate":{"id":"Perhatikanlah, betapakah mereka mengada-adakan dusta terhadap Allah ? Dan cukuplah perbuatan itu menjadi dosa yang nyata (bagi mereka).\n","en":"Behold how they attribute their own lying inventions to God - than which there is no sin more obvious."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/543","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/543.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/543.mp3"]}},{"no":51,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ وَيَقُولُونَ لِلَّذِينَ كَفَرُوا هَٰؤُلَاءِ أَهْدَىٰ مِنَ الَّذِينَ آمَنُوا سَبِيلًا","latin":"alam tara ilaa alladziina uutuu nashiiban mina alkitaabi yu/minuuna bialjibti waalththaaghuuti wayaquuluuna lilladziina kafaruu haaulaa-i ahdaa mina alladziina aamanuu sabiilaan","translate":{"id":"Apakah kamu tidak memperhatikan orang-orang yang diberi bahagian dari Al kitab ? Mereka percaya kepada jibt dan thaghut , dan mengatakan kepada orang-orang Kafir (musyrik Mekah), bahwa mereka itu lebih benar jalannya dari orang-orang yang beriman.\n","en":"Art thou not aware of those who, having been granted their share of the divine writ, [now] believe in baseless mysteries and in the powers of evil, and maintain that those who are bent on denying the truth are more surely guided than those who have attained to faith?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/544","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/544.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/544.mp3"]}},{"no":52,"arab":"أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ ۖ وَمَنْ يَلْعَنِ اللَّهُ فَلَنْ تَجِدَ لَهُ نَصِيرًا","latin":"ulaa-ika alladziina la'anahumu allaahu waman yal'ani allaahu falan tajida lahu nashiiraan","translate":{"id":"Mereka itulah orang yang dikutuki Allah. Barangsiapa yang dikutuki Allah, niscaya kamu sekali-kali tidak akan memperoleh penolong baginya.\n","en":"It is they whom God has rejected: and he whom God rejects shall find none to succour him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/545","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/545.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/545.mp3"]}},{"no":53,"arab":"أَمْ لَهُمْ نَصِيبٌ مِنَ الْمُلْكِ فَإِذًا لَا يُؤْتُونَ النَّاسَ نَقِيرًا","latin":"am lahum nashiibun mina almulki fa-idzan laa yu/tuuna alnnaasa naqiiraan","translate":{"id":"Ataukah ada bagi mereka bahagian dari kerajaan (kekuasaan) ? Kendatipun ada, mereka tidak akan memberikan sedikitpun (kebajikan) kepada manusia .\n","en":"Have they, perchance, a share in [God's] dominion? But [if they had], lo, they would not give to other people as much as [would fill] the groove of a date-stone!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/546","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/546.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/546.mp3"]}},{"no":54,"arab":"أَمْ يَحْسُدُونَ النَّاسَ عَلَىٰ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۖ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَالْحِكْمَةَ وَآتَيْنَاهُمْ مُلْكًا عَظِيمًا","latin":"am yahsuduuna alnnaasa 'alaa maa aataahumu allaahu min fadhlihi faqad aataynaa aala ibraahiima alkitaaba waalhikmata waaataynaahum mulkan 'azhiimaan","translate":{"id":"ataukah mereka dengki kepada manusia (Muhammad) lantaran karunia yang Allah telah berikan kepadanya ? Sesungguhnya Kami telah memberikan Kitab dan Hikmah kepada keluarga Ibrahim, dan Kami telah memberikan kepadanya kerajaan yang besar.\n","en":"Do they, perchance, envy other people for what God has granted them out of His bounty? But then, We did grant revelation and wisdom unto the House of Abraham, and We did bestow on them a mighty dominion:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/547","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/547.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/547.mp3"]}},{"no":55,"arab":"فَمِنْهُمْ مَنْ آمَنَ بِهِ وَمِنْهُمْ مَنْ صَدَّ عَنْهُ ۚ وَكَفَىٰ بِجَهَنَّمَ سَعِيرًا","latin":"faminhum man aamana bihi waminhum man shadda 'anhu wakafaa bijahannama sa'iiraan","translate":{"id":"Maka di antara mereka (orang-orang yang dengki itu), ada orang-orang yang beriman kepadanya, dan di antara mereka ada orang-orang yang menghalangi (manusia) dari beriman kepadanya. Dan cukuplah (bagi mereka) Jahannam yang menyala-nyala apinya.\n","en":"and among them are such as [truly] believe in him, and among them are such as have turned away from him. And nothing could be as burning as [the fire of] hell:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/548","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/548.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/548.mp3"]}},{"no":56,"arab":"إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ ۗ إِنَّ اللَّهَ كَانَ عَزِيزًا حَكِيمًا","latin":"inna alladziina kafaruu bi-aayaatinaa sawfa nushliihim naaran kullamaa nadhijat juluuduhum baddalnaahum juluudan ghayrahaa liyadzuuquu al'adzaaba inna allaaha kaana 'aziizan hakiimaan","translate":{"id":"Sesungguhnya orang-orang yang kafir kepada ayat-ayat Kami, kelak akan Kami masukkan mereka ke dalam neraka. Setiap kali kulit mereka hangus, Kami ganti kulit mereka dengan kulit yang lain, supaya mereka merasakan azab. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"for, verily, those who are bent on denying the truth of Our messages We shall, in time, cause to endure fire: [and] every time their skins are burnt off, We shall replace them with new skins, so that they may taste suffering [in full] Verily, God is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/549","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/549.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/549.mp3"]}},{"no":57,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ لَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ ۖ وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati sanudkhiluhum jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa abadan lahum fiihaa azwaajun muthahharatun wanudkhiluhum zhillan zhaliilaan","translate":{"id":"Dan orang-orang yang beriman dan mengerjakan amalan-amalan yang shaleh, kelak akan Kami masukkan mereka ke dalam surga yang di dalamnya mengalir sungai-sungai; kekal mereka di dalamnya; mereka di dalamnya mempunyai isteri-isteri yang suci, dan Kami masukkan mereka ke tempat yang teduh lagi nyaman.\n","en":"But those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time; there shall they have spouses pure: and [thus] We shall bring them unto happiness abounding."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/550","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/550.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/550.mp3"]}},{"no":58,"arab":"إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ ۚ إِنَّ اللَّهَ نِعِمَّا يَعِظُكُمْ بِهِ ۗ إِنَّ اللَّهَ كَانَ سَمِيعًا بَصِيرًا","latin":"inna allaaha ya/murukum an tu-adduu al-amaanaati ilaa ahlihaa wa-idzaa hakamtum bayna alnnaasi an tahkumuu bial'adli inna allaaha ni'immaa ya'izhukum bihi inna allaaha kaana samii'an bashiiraan","translate":{"id":"Sesungguhnya Allah menyuruh kamu menyampaikan amanat kepada yang berhak menerimanya, dan (menyuruh kamu) apabila menetapkan hukum di antara manusia supaya kamu menetapkan dengan adil. Sesungguhnya Allah memberi pengajaran yang sebaik-baiknya kepadamu. Sesungguhnya Allah adalah Maha Mendengar lagi Maha Melihat.\n","en":"BEHOLD, God bids you to deliver all that you have been entrusted with unto those who are entitled thereto, and whenever you judge between people, to judge with justice. Verily, most excellent is what God exhorts you to do: verily, God is all-hearing, all-seeing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/551","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/551.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/551.mp3"]}},{"no":59,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ ۖ فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا","latin":"yaa ayyuhaa alladziina aamanuu athii'uu allaaha wa-athii'uu alrrasuula waulii al-amri minkum fa-in tanaaza'tum fii syay-in farudduuhu ilaa allaahi waalrrasuuli in kuntum tu/minuuna biallaahi waalyawmi al-aakhiri dzaalika khayrun wa-ahsanu ta/wiilaan","translate":{"id":"Hai orang-orang yang beriman, ta'atilah Allah dan ta'atilah Rasul (Nya), dan ulil amri di antara kamu. Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Qur'an) dan Rasul (sunnahnya), jika kamu benar-benar beriman kepada Allah dan hari kemudian. Yang demikian itu lebih utama (bagimu) dan lebih baik akibatnya.\n","en":"O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle and unto those from among you who have been entrusted with authority; and if you are at variance over any matter, refer it unto God and the Apostle, if you [truly] believe in God and the Last Day. This is the best [for you], and best in the end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/552","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/552.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/552.mp3"]}},{"no":60,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ يَزْعُمُونَ أَنَّهُمْ آمَنُوا بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ يُرِيدُونَ أَنْ يَتَحَاكَمُوا إِلَى الطَّاغُوتِ وَقَدْ أُمِرُوا أَنْ يَكْفُرُوا بِهِ وَيُرِيدُ الشَّيْطَانُ أَنْ يُضِلَّهُمْ ضَلَالًا بَعِيدًا","latin":"alam tara ilaa alladziina yaz'umuuna annahum aamanuu bimaa unzila ilayka wamaa unzila min qablika yuriiduuna an yatahaakamuu ilaa alththaaghuuti waqad umiruu an yakfuruu bihi wayuriidu alsysyaythaanu an yudhillahum dhalaalan ba'iidaan","translate":{"id":"Apakah kamu tidak memperhatikan orang-orang yang mengaku dirinya telah beriman kepada apa yang diturunkan kepadamu dan kepada apa yang diturunkan sebelum kamu ? Mereka hendak berhakim kepada thaghut , padahal mereka telah diperintah mengingkari thaghut itu. Dan syaitan bermaksud menyesatkan mereka (dengan) penyesatan yang sejauh-jauhnya.\n","en":"ART THOU NOT aware of those who claim that they believe in what has been bestowed from on high upon thee, [O Prophet,] as well as in what was bestowed from on high before thee, [and yet] are willing to defer to the rule of the powers of evil - although they were bidden to deny it, seeing that Satan but wants to lead them far astray?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/553","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/553.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/553.mp3"]}},{"no":61,"arab":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنْزَلَ اللَّهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنَافِقِينَ يَصُدُّونَ عَنْكَ صُدُودًا","latin":"wa-idzaa qiila lahum ta'aalaw ilaa maa anzala allaahu wa-ilaa alrrasuuli ra-ayta almunaafiqiina yashudduuna 'anka shuduudaan","translate":{"id":"Apabila dikatakan kepada mereka : \"Marilah kamu (tunduk) kepada hukum yang Allah telah turunkan dan kepada hukum Rasul\", niscaya kamu lihat orang-orang munafik menghalangi (manusia) dengan sekuat-kuatnya dari (mendekati) kamu.\n","en":"And so, whenever they are told, \"Come unto that which God has be­stowed from on high, and unto the Apostle,\" thou canst see these hypocrites turn away from thee with aversion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/554","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/554.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/554.mp3"]}},{"no":62,"arab":"فَكَيْفَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ ثُمَّ جَاءُوكَ يَحْلِفُونَ بِاللَّهِ إِنْ أَرَدْنَا إِلَّا إِحْسَانًا وَتَوْفِيقًا","latin":"fakayfa idzaa ashaabat-hum mushiibatun bimaa qaddamat aydiihim tsumma jaauuka yahlifuuna biallaahi in aradnaa illaa ihsaanan watawfiiqaan","translate":{"id":"Maka bagaimanakah halnya apabila mereka (orang-orang munafik) ditimpa sesuatu musibah disebabkan perbuatan tangan mereka sendiri, kemudian mereka datang kepadamu sambil bersumpah : \"Demi Allah, kami sekali-kali tidak menghendaki selain penyelesaian yang baik dan perdamaian yang sempurna\".\n","en":"But how [will they fare] when calamity befalls them [on the Day of Judgment] because of what they have wrought in this world - whereupon they will come to thee, swearing by God, \"Our aim was but to do good, and to bring about harmony\"?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/555","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/555.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/555.mp3"]}},{"no":63,"arab":"أُولَٰئِكَ الَّذِينَ يَعْلَمُ اللَّهُ مَا فِي قُلُوبِهِمْ فَأَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُلْ لَهُمْ فِي أَنْفُسِهِمْ قَوْلًا بَلِيغًا","latin":"ulaa-ika alladziina ya'lamu allaahu maa fii quluubihim fa-a'ridh 'anhum wa'izhhum waqul lahum fii anfusihim qawlan baliighaan","translate":{"id":"Mereka itu adalah orang-orang yang Allah mengetahui apa yang di dalam hati mereka. Karena itu berpalinglah kamu dari mereka, dan berilah mereka pelajaran, dan katakanlah kepada mereka perkataan yang berbekas pada jiwa mereka.\n","en":"As for them - God knows all that is in their hearts; so leave them alone, and admonish them, and speak unto them about themselves in a gravely search­ing manner:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/556","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/556.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/556.mp3"]}},{"no":64,"arab":"وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا لِيُطَاعَ بِإِذْنِ اللَّهِ ۚ وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَاءُوكَ فَاسْتَغْفَرُوا اللَّهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ لَوَجَدُوا اللَّهَ تَوَّابًا رَحِيمًا","latin":"wamaa arsalnaa min rasuulin illaa liyuthaa'a bi-idzni allaahi walaw annahum idz zhalamuu anfusahum jaauuka faistaghfaruu allaaha waistaghfara lahumu alrrasuulu lawajaduu allaaha tawwaaban rahiimaan","translate":{"id":"Dan Kami tidak mengutus seseorang rasul melainkan untuk dita'ati dengan seizin Allah. Sesungguhnya jikalau mereka ketika menganiaya dirinya datang kepadamu, lalu memohon ampun kepada Allah, dan Rasulpun memohonkan ampun untuk mereka, tentulah mereka mendapati Allah Maha Penerima Taubat lagi Maha Penyayang.\n","en":"for We have never sent any apostle save that he should be heeded by God's leave. If, then, after having sinned against themselves, they would but come round to thee and ask God to forgive them - with the Apostle, too, praying that they be forgiven - they would assuredly find that God is an acceptor of repentance, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/557","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/557.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/557.mp3"]}},{"no":65,"arab":"فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا","latin":"falaa warabbika laa yu/minuuna hattaa yuhakkimuuka fiimaa syajara baynahum tsumma laa yajiduu fii anfusihim harajan mimmaa qadhayta wayusallimuu tasliimaan","translate":{"id":"Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan, kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya.\n","en":"But nay, by thy Sustainer! They do not [really] believe unless they make thee [O Prophet] a judge of all on which they disagree among themselves, and then find in their hearts no bar to an acceptance of thy decision and give themselves up [to it] in utter self-surrender."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/558","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/558.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/558.mp3"]}},{"no":66,"arab":"وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ أَوِ اخْرُجُوا مِنْ دِيَارِكُمْ مَا فَعَلُوهُ إِلَّا قَلِيلٌ مِنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا","latin":"walaw annaa katabnaa 'alayhim ani uqtuluu anfusakum awi ukhrujuu min diyaarikum maa fa'aluuhu illaa qaliilun minhum walaw annahum fa'aluu maa yuu'azhuuna bihi lakaana khayran lahum wa-asyadda tatsbiitaan","translate":{"id":"Dan sesungguhnya kalau Kami perintahkan kepada mereka : \"Bunuhlah dirimu atau keluarlah kamu dari kampungmu\", niscaya mereka tidak akan melakukannya kecuali sebagian kecil dari mereka. Dan sesungguhnya kalau mereka melaksanakan pelajaran yang diberikan kepada mereka, tentulah hal yang demikian itu lebih baik bagi mereka dan lebih menguatkan (iman mereka),\n","en":"Yet if We were to ordain for them, \"Lay down your lives,\" or, \"Forsake your homelands,\" only a very few of them would do it - although, if they did what they are admonished to do, it would indeed be for their own good and apt to strengthen them greatly [in faith],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/559","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/559.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/559.mp3"]}},{"no":67,"arab":"وَإِذًا لَآتَيْنَاهُمْ مِنْ لَدُنَّا أَجْرًا عَظِيمًا","latin":"wa-idzan laaataynaahum min ladunnaa ajran 'azhiimaan","translate":{"id":"dan kalau demikian, pasti Kami berikan kepada mereka pahala yang besar dari sisi Kami,\n","en":"whereupon We should indeed grant them, out of Our grace, a mighty reward,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/560","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/560.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/560.mp3"]}},{"no":68,"arab":"وَلَهَدَيْنَاهُمْ صِرَاطًا مُسْتَقِيمًا","latin":"walahadaynaahum shiraathan mustaqiimaan","translate":{"id":"dan pasti Kami tunjuki mereka kepada jalan yang lurus.\n","en":"and indeed guide them onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/561","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/561.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/561.mp3"]}},{"no":69,"arab":"وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ۚ وَحَسُنَ أُولَٰئِكَ رَفِيقًا","latin":"waman yuthi'i allaaha waalrrasuula faulaa-ika ma'a alladziina an'ama allaahu 'alayhim mina alnnabiyyiina waalshshiddiiqiina waalsysyuhadaa-i waalshshaalihiina wahasuna ulaa-ika rafiiqaan","translate":{"id":"Dan barangsiapa yang menta'ati Allah dan Rasul(Nya), mereka itu akan bersama-sama dengan orang-orang yang dianugerahi ni'mat oleh Allah, yaitu : Nabi-nabi, para shiddiiqiin , orang-orang yang mati syahid, dan orang-orang saleh. Dan mereka itulah teman yang sebaik-baiknya.\n","en":"For, all who pay heed unto God and the Apostle shall be among those upon whom God has bestowed His blessings: the prophets, and those who never deviated from the truth, and those who [with their lives] bore witness to the truth, and the right­eous ones: and how goodly a company are these!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/562","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/562.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/562.mp3"]}},{"no":70,"arab":"ذَٰلِكَ الْفَضْلُ مِنَ اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ عَلِيمًا","latin":"dzaalika alfadhlu mina allaahi wakafaa biallaahi 'aliimaan","translate":{"id":"Yang demikian itu adalah karunia dari Allah, dan Allah cukup mengetahui.\n","en":"Such is the bounty of God - and none has the knowledge which God has."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/563","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/563.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/563.mp3"]}},{"no":71,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا خُذُوا حِذْرَكُمْ فَانْفِرُوا ثُبَاتٍ أَوِ انْفِرُوا جَمِيعًا","latin":"yaa ayyuhaa alladziina aamanuu khudzuu hidzrakum fainfiruu tsubaatin awi infiruu jamii'aan","translate":{"id":"Hai orang-orang yang beriman, bersiap siagalah kamu, dan majulah (ke medan pertempuran) berkelompok-kelompok, atau majulah bersama-sama !\n","en":"O YOU who have attained to faith! Be fully prepared against danger, whether you go to war in small groups or all together."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/564","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/564.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/564.mp3"]}},{"no":72,"arab":"وَإِنَّ مِنْكُمْ لَمَنْ لَيُبَطِّئَنَّ فَإِنْ أَصَابَتْكُمْ مُصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُنْ مَعَهُمْ شَهِيدًا","latin":"wa-inna minkum laman layubaththhi-anna fa-in ashaabatkum mushiibatun qaala qad an'ama allaahu 'alayya idz lam akun ma'ahum syahiidaanwala-in ashaabakum fadhlun mina allaahi layaquulanna ka-an lam takun baynakum wabaynahu mawaddatun yaa laytanii kuntu ma'ahum fa-afuuza fawzan 'azhiimaan","translate":{"id":"Dan sesungguhnya di antara kamu ada orang yang sangat berlambat-lambat (ke medan pertempuran) . Maka jika kamu ditimpa musibah ia berkata : \"Sesungguhnya Tuhan telah menganugerahkan ni'mat kepada saya karena saya tidak ikut berperang bersama mereka.\n","en":"And, behold, there are indeed among you such as would lag behind, and then, if calamity befalls you, say, \"God has bestowed His favour upon me in that I did not accompany them.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/565","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/565.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/565.mp3"]}},{"no":73,"arab":"وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِنَ اللَّهِ لَيَقُولَنَّ كَأَنْ لَمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنْتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا","latin":"wala-in ashaabakum fadhlun mina allaahi layaquulanna ka-an lam takun baynakum wabaynahu mawaddatun yaa laytanii kuntu ma'ahum fa-afuuza fawzan 'azhiimaan","translate":{"id":"Dan sungguh jika kamu beroleh karunia (kemenangan) dari Allah, tentulah dia mengatakan seolah-oleh belum pernah ada hubungan kasih sayang antara kamu dengan dia : \"Wahai kiranya saya ada bersama-sama mereka, tentu saya mendapat kemenangan yang besar (pula)\".\n","en":"But if good fortune comes to you from God, such a person is sure to say - just as if there had never been any question of love between you and him -: \"Oh, would that I had been with them, and thus had a [share in their] mighty triumph!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/566","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/566.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/566.mp3"]}},{"no":74,"arab":"فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۚ وَمَنْ يُقَاتِلْ فِي سَبِيلِ اللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","latin":"falyuqaatil fii sabiili allaahi alladziina yasyruuna alhayaata alddunyaa bial-aakhirati waman yuqaatil fii sabiili allaahi fayuqtal aw yaghlib fasawfa nu/tiihi ajran 'azhiimaan","translate":{"id":"Karena itu hendaklah orang-orang yang menukar kehidupan dunia dengan kehidupan akhirat berperang di jalan Allah. Barangsiapa yang berperang di jalan Allah, lalu gugur atau memperoleh kemenangan maka kelak akan Kami berikan kepadanya pahala yang besar.\n","en":"Hence, let them fight in God's cause - all who are willing to barter the life of this world for the life to come: for unto him who fights in God's cause, whether he be slain or be victorious, We shall in time grant a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/567","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/567.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/567.mp3"]}},{"no":75,"arab":"وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ الَّذِينَ يَقُولُونَ رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيًّا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيرًا","latin":"wamaa lakum laa tuqaatiluuna fii sabiili allaahi waalmustadh'afiina mina alrrijaali waalnnisaa-i waalwildaani alladziina yaquuluuna rabbanaa akhrijnaa min haadzihi alqaryati alzhzhaalimi ahluhaa waij'al lanaa min ladunka waliyyan waij'al lanaa min ladunka nashiiraan","translate":{"id":"Mengapa kamu tidak mau berperang di jalan Allah dan (membela) orang-orang yang lemah baik laki-laki, wanita-wanita maupun anak-anak yang semuanya berdo'a : \"Ya Tuhan kami, keluarkanlah kami dari negeri ini (Mekah) yang zalim penduduknya dan berilah kami pelindung dari sisi Engkau, dan berilah kami penolong dari sisi Engkau !\".\n","en":"And how could you refuse to fight in the cause of God and of the utterly helpless men and women and children who are crying, \"O our Sustainer! Lead us forth [to freedom] out of this land whose people are oppressors, and raise for us, out of Thy grace, a protector, and raise for us, out of Thy grace, one who will bring us succour!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/568","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/568.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/568.mp3"]}},{"no":76,"arab":"الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ ۖ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا","latin":"alladziina aamanuu yuqaatiluuna fii sabiili allaahi waalladziina kafaruu yuqaatiluuna fii sabiili alththaaghuuti faqaatiluu awliyaa-a alsysyaythaani inna kayda alsysyaythaani kaana dha'iifaan","translate":{"id":"Orang-orang yang beriman berperang di jalan Allah, dan orang-orang yang kafir berperang di jalan thaghut, sebab itu perangilah kawan-kawan syaitan itu, karena sesungguhnya tipu daya syaitan itu adalah lemah.\n","en":"Those who have attained to faith fight in the cause of God, whereas those who are bent on denying the truth fight in the cause of the powers of evil. Fight, then, against those friends of Satan: verily, Satan's guile is weak indeed!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/569","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/569.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/569.mp3"]}},{"no":77,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ إِذَا فَرِيقٌ مِنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلَا أَخَّرْتَنَا إِلَىٰ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالْآخِرَةُ خَيْرٌ لِمَنِ اتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا","latin":"alam tara ilaa alladziina qiila lahum kuffuu aydiyakum wa-aqiimuu alshshalaata waaatuu alzzakaata falammaa kutiba 'alayhimu alqitaalu idzaa fariiqun minhum yakhsyawna alnnaasa kakhasyyati allaahi aw asyadda khasyyatan waqaaluu rabbanaa lima katabta 'alaynaa alqitaala lawlaa akhkhartanaa ilaa ajalin qariibin qul mataa'u alddunyaa qaliilun waal-aakhiratu khayrun limani ittaqaa walaa tuzhlamuuna fatiilaan","translate":{"id":"Tidakkah kamu perhatikan orang-orang yang dikatakan kepada mereka : \"Tahanlah tanganmu (dari berperang), dirikanlah sembahyang dan tunaikanlah zakat !\" Setelah diwajibkan kepada mereka berperang, tiba-tiba sebahagian dari mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih sangat dari itu takutnya. Mereka berkata : \"Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami ? Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami sampai kepada beberapa waktu lagi ?\" Katakanlah : \"Kesenangan di dunia ini hanya sebentar dan akhirat itu lebih baik untuk orang-orang yang bertakwa, dan kamu tidak akan dianiaya sedikitpun .\n","en":"ART THOU NOT aware of those who have been told, \"Curb your hands, and be constant in prayer, and render the purifying dues\"? But as soon as fighting [in God's cause] is ordained for them, lo, some of them stand in awe of men as one should stand in awe of God - or in even greater awe - and say, \"O our Sustainer! Why hast Thou ordained fighting for us? If only Thou hadst granted us a delay for a little while!\" Say: \"Brief is the enjoyment of this world, whereas the life to come is the best for all who are conscious of God - since none of you shall be wronged by as much as a hair's breadth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/570","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/570.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/570.mp3"]}},{"no":78,"arab":"أَيْنَمَا تَكُونُوا يُدْرِكْكُمُ الْمَوْتُ وَلَوْ كُنْتُمْ فِي بُرُوجٍ مُشَيَّدَةٍ ۗ وَإِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِ اللَّهِ ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِكَ ۚ قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ ۖ فَمَالِ هَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا","latin":"aynamaa takuunuu yudrikkumu almawtu walaw kuntum fii buruujin musyayyadatin wa-in tushibhum hasanatun yaquuluu haadzihi min 'indi allaahi wa-in tushibhum sayyi-atun yaquuluu haadzihi min 'indika qul kullun min 'indi allaahi famaali haaulaa-i alqawmi laa yakaaduuna yafqahuuna hadiitsaan","translate":{"id":"Di mana saja kamu berada, kematian akan mendapatkan kamu, kendatipun kamu di dalam benteng yang tinggi lagi kokoh, dan jika mereka memperoleh kebaikan , mereka mengatakan : \"Ini adalah dari sisi Allah\", dan kalau mereka ditimpa sesuatu bencana mereka mengatakan : \"Ini (datangnya) dari sisi kamu (Muhammad)\". Katakanlah : \"Semuanya (datang) dari sisi Allah\". Maka mengapa orang-orang itu (orang munafik) hampir-hampir tidak memahami pembicaraan sedikitpun ?\n","en":"Wherever you may be, death will overtake you - even though you be in towers raised high. \"Yet, when a good thing happens to them, some [people] say, \"This is from God,\" whereas when evil befalls them, they say, \"This is from thee [O fellow­man]!” Say: \"All is from God.\" What, then, is amiss with these people that they are in no wise near to grasping the truth of what they are told?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/571","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/571.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/571.mp3"]}},{"no":79,"arab":"مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ ۚ وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا","latin":"maa ashaabaka min hasanatin famina allaahi wamaa ashaabaka min sayyi-atin famin nafsika wa-arsalnaaka lilnnaasi rasuulan wakafaa biallaahi syahiidan","translate":{"id":"Apa saja ni'mat yang kamu peroleh adalah dari Allah, dan apa saja bencana yang menimpamu, maka dari (kesalahan) dirimu sendiri. Kami mengutusmu menjadi Rasul kepada segenap manusia. Dan cukuplah Allah menjadi saksi.\n","en":"Whatever good happens to thee is from God; and whatever evil befalls thee is from thyself. AND WE have sent thee [O Muhammad] as an apostle unto all mankind: and none can bear witness [thereto] as God does."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/572","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/572.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/572.mp3"]}},{"no":80,"arab":"مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ ۖ وَمَنْ تَوَلَّىٰ فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا","latin":"man yuthi'i alrrasuula faqad athaa'a allaaha waman tawallaa famaa arsalnaaka 'alayhim hafiizhaan","translate":{"id":"Barangsiapa yang menta'ati Rasul itu, sesungguhnya ia telah menta'ati Allah. Dan barangsiapa yang berpaling (dari keta'atan itu), maka Kami tidak mengutusmu untuk menjadi pemelihara bagi mereka .\n","en":"Whoever pays heed unto the Apostle pays heed unto God thereby; and as for those who turn away - We have not sent thee to be their keeper."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/573","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/573.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/573.mp3"]}},{"no":81,"arab":"وَيَقُولُونَ طَاعَةٌ فَإِذَا بَرَزُوا مِنْ عِنْدِكَ بَيَّتَ طَائِفَةٌ مِنْهُمْ غَيْرَ الَّذِي تَقُولُ ۖ وَاللَّهُ يَكْتُبُ مَا يُبَيِّتُونَ ۖ فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","latin":"wayaquuluuna thaa'atun fa-idzaa barazuu min 'indika bayyata thaa-ifatun minhum ghayra alladzii taquulu waallaahu yaktubu maa yubayyituuna fa-a'ridh 'anhum watawakkal 'alaa allaahi wakafaa biallaahi wakiilaan","translate":{"id":"Dan mereka (orang-orang munafik) mengatakan : \"(Kewajiban kami hanyalah) ta'at\". Tetapi apabila mereka telah pergi dari sisimu, sebahagian dari mereka mengatur siasat di malam hari (mengambil keputusan) lain dari yang telah mereka katakan tadi. Allah menulis siasat yang mereka atur di malam hari itu, maka berpalinglah kamu dari mereka dan tawakallah kepada Allah. Cukuplah Allah menjadi Pelindung.\n","en":"And they say, \"We do pay heed unto thee'' - but when they leave thy presence, some of them devise, in the dark of night, [beliefs] other than thou art voicing; and all the while God records what they thus devise in the dark of night. Leave them, then, alone, and place thy trust in God: for none is as worthy of trust as God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/574","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/574.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/574.mp3"]}},{"no":82,"arab":"أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ ۚ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا","latin":"afalaa yatadabbaruuna alqur-aana walaw kaana min 'indi ghayri allaahi lawajaduu fiihi ikhtilaafan katsiiraan","translate":{"id":"Maka apakah mereka tidak memperhatikan Al Qur'an ? Kalau kiranya Al Qur'an itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.\n","en":"Will they not, then, try to understand this Qur’an? Had it issued from any but God, they would surely have found in it many an inner contradiction!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/575","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/575.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/575.mp3"]}},{"no":83,"arab":"وَإِذَا جَاءَهُمْ أَمْرٌ مِنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ ۖ وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ وَإِلَىٰ أُولِي الْأَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَاتَّبَعْتُمُ الشَّيْطَانَ إِلَّا قَلِيلًا","latin":"wa-idzaa jaa-ahum amrun mina al-amni awi alkhawfi adzaa'uu bihi walaw radduuhu ilaa alrrasuuli wa-ilaa ulii al-amri minhum la'alimahu alladziina yastanbithuunahu minhum walawlaa fadhlu allaahi 'alaykum warahmatuhu laittaba'tumu alsysyaythaana illaa qaliilaan","translate":{"id":"Dan apabila datang kepada mereka suatu berita tentang keamanan ataupun ketakutan, mereka lalu menyiarkannya. Dan kalau mereka menyerahkannya kepada Rasul dan Ulil Amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya dari mereka (Rasul dan Ulil Amri) . Kalau tidaklah karena karunia dan rahmat Allah kepada kamu, tentulah kamu mengikut syaitan, kecuali sebahagian kecil saja (di antaramu).\n","en":"AND IF any [secret] matter pertaining to peace or war comes within their ken, they spread it abroad - whereas, if they would but refer it unto the Apostle and unto those from among the believers who have been entrusted with authority, such of them as are engaged in obtaining intelligence would indeed know [what to do with] it And but for God's bounty towards you, and His grace, all but a few of you would certainly have followed Satan."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/576","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/576.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/576.mp3"]}},{"no":84,"arab":"فَقَاتِلْ فِي سَبِيلِ اللَّهِ لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ وَحَرِّضِ الْمُؤْمِنِينَ ۖ عَسَى اللَّهُ أَنْ يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا ۚ وَاللَّهُ أَشَدُّ بَأْسًا وَأَشَدُّ تَنْكِيلًا","latin":"faqaatil fii sabiili allaahi laa tukallafu illaa nafsaka waharridhi almu/miniina 'asaa allaahu an yakuffa ba/sa alladziina kafaruu waallaahu asyaddu ba/san wa-asyaddu tankiilaan","translate":{"id":"Maka berperanglah kamu pada jalan Allah, tidaklah kamu dibebani melainkan dengan kewajiban kamu sendiri . Kobarkanlah semangat para mu'min (untuk berperang). Mudah-mudahan Allah menolak serangan orang-orang yang kafir itu. Allah amat besar kekuatan dan amat keras siksaan(Nya).\n","en":"Fight thou, then, in God's cause - since thou art but responsible for thine own self - and inspire the believers to overcome all fear of death. God may well curb the might of those who are bent on denying the truth: for God is stronger in might, and stronger in ability to deter."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/577","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/577.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/577.mp3"]}},{"no":85,"arab":"مَنْ يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُنْ لَهُ نَصِيبٌ مِنْهَا ۖ وَمَنْ يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُنْ لَهُ كِفْلٌ مِنْهَا ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ مُقِيتًا","latin":"man yasyfa' syafaa'atan hasanatan yakun lahu nashiibun minhaa waman yasyfa' syafaa'atan sayyi-atan yakun lahu kiflun minhaa wakaana allaahu 'alaa kulli syay-in muqiitaan","translate":{"id":"Barangsiapa yang memberikan syafa'at yang baik , niscaya ia akan memperoleh bahagian (pahala) dari padanya. Dan barangsiapa memberi syafa'at yang buruk , niscaya ia akan memikul bahagian (dosa) dari padanya. Allah Maha Kuasa atas segala sesuatu.\n","en":"Whoever rallies to a good cause shall have a share in its blessings; and whoever rallies to an evil cause shall be answerable for his part in it: for, indeed, God watches over everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/578","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/578.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/578.mp3"]}},{"no":86,"arab":"وَإِذَا حُيِّيتُمْ بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا ۗ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ حَسِيبًا","latin":"wa-idzaa huyyiitum bitahiyyatin fahayyuu bi-ahsana minhaa aw rudduuhaa inna allaaha kaana 'alaa kulli syay-in hasiibaan","translate":{"id":"Apabila kamu diberi penghormatan dengan sesuatu penghormatan, maka balaslah penghormatan itu dengan yang lebih baik dari padanya, atau balaslah penghormatan itu (dengan yang serupa) . Sesungguhnya Allah memperhitungankan segala sesuatu.\n","en":"But when you are greeted with a greeting [of peace], answer with an even better greeting, or [at least] with the like thereof. Verily, God keeps count indeed of all things."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/579","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/579.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/579.mp3"]}},{"no":87,"arab":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ ۗ وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا","latin":"allaahu laa ilaaha illaa huwa layajma'annakum ilaa yawmi alqiyaamati laa rayba fiihi waman ashdaqu mina allaahi hadiitsaan","translate":{"id":"Allah, tidak ada Tuhan (yang berhak disembah) selain Dia. Sesungguhnya Dia akan mengumpulkan kamu di hari kiamat, yang tidak ada keraguan terjadinya. Dan siapakah orang yang lebih benar perkataan(nya) dari pada Allah ?\n","en":"God - save whom there is no deity - will surely gather you all together on the Day of Resurrection, [the coming of] which is beyond all doubt: and whose word could be truer than God's?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/580","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/580.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/580.mp3"]}},{"no":88,"arab":"فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَنْ تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا","latin":"famaa lakum fii almunaafiqiina fi-atayni waallaahu arkasahum bimaa kasabuu aturiiduuna an tahduu man adhalla allaahu waman yudhlili allaahu falan tajida lahu sabiilaan","translate":{"id":"Maka mengapa kamu (terpecah) menjadi dua golongan dalam (menghadapi) orang-orang munafik, padahal Allah telah membalikkan mereka kepada kekafiran, disebabkan usaha mereka sendiri ? Apakah kamu bermaksud memberi petunjuk kepada orang-orang yang telah disesatkan Allah ? Barangsiapa yang disesatkan Allah, sekali-kali kamu tidak mendapatkan jalan (untuk memberi petunjuk) kepadanya.\n","en":"How, then, could you be of two minds about the hypocrites, seeing that God [Himself] has disowned them because of their guilt? Do you, perchance, seek to guide those whom God has let go astray - when for him whom God lets go astray thou canst never find any way?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/581","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/581.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/581.mp3"]}},{"no":89,"arab":"وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً ۖ فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ حَتَّىٰ يُهَاجِرُوا فِي سَبِيلِ اللَّهِ ۚ فَإِنْ تَوَلَّوْا فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ ۖ وَلَا تَتَّخِذُوا مِنْهُمْ وَلِيًّا وَلَا نَصِيرًا","latin":"wadduu law takfuruuna kamaa kafaruu fatakuunuuna sawaa-an falaa tattakhidzuu minhum awliyaa-a hattaa yuhaajiruu fii sabiili allaahi fa-in tawallaw fakhudzuuhum wauqtuluuhum haytsu wajadtumuuhum walaa tattakhidzuu minhum waliyyan walaa nashiiraan","translate":{"id":"Mereka ingin supaya kamu menjadi kafir sebagaimana mereka telah menjadi kafir, lalu kamu menjadi sama (dengan mereka). Maka janganlah kamu jadikan di antara mereka penolong-penolong(mu), hingga mereka berhijrah pada jalan Allah. Maka jika mereka berpaling , tawan dan bunuhlah mereka di mana saja kamu menemuinya, dan janganlah kamu ambil seorangpun di antara mereka menjadi pelindung, dan jangan (pula) menjadi penolong,\n","en":"They would love to see you deny the truth even as they have denied it, so that you should be like them. Do not, therefore, take them for your allies until they forsake the domain of evil for the sake of God; and if they revert to [open] enmity, seize them and slay them wherever you may find them. And do not take any of them for your ally or giver of succour,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/582","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/582.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/582.mp3"]}},{"no":90,"arab":"إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ ۚ وَلَوْ شَاءَ اللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ ۚ فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا","latin":"illaa alladziina yashiluuna ilaa qawmin baynakum wabaynahum miitsaaqun aw jaauukum hashirat shuduuruhum an yuqaatiluukum aw yuqaatiluu qawmahum walaw syaa-a allaahu lasallathahum 'alaykum falaqaataluukum fa-ini i'tazaluukum falam yuqaatiluukum wa-alqaw ilaykumu alssalama famaa ja'ala allaahu lakum 'alayhim sabiilaan","translate":{"id":"kecuali orang-orang yang meminta perlindungan kepada sesuatu kaum, yang antara kamu dan kaum itu telah ada perjanjian (damai) atau orang-orang yang datang kepada kamu sedang hati mereka merasa keberatan untuk memerangi kamu dan memerangi kaumnya . Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka terhadap kamu, lalu pastilah mereka memerangimu. tetapi jika mereka membiarkan kamu, dan tidak memerangi kamu serta mengemukakan perdamaian kepadamu maka Allah tidak memberi jalan bagimu (untuk menawan dan membunuh) mereka.\n","en":"unless it be such [of them] as have ties with people to whom you yourselves are bound by a covenant, or such as come unto you because their hearts shrink from [the thought of] making war either on you or on their own folk - although, if God had willed to make them stronger than you, they would certainly have made war on you. Thus, if they let you be, and do not make war on you, and offer you peace, God does not allow you to harm them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/583","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/583.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/583.mp3"]}},{"no":91,"arab":"سَتَجِدُونَ آخَرِينَ يُرِيدُونَ أَنْ يَأْمَنُوكُمْ وَيَأْمَنُوا قَوْمَهُمْ كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا ۚ فَإِنْ لَمْ يَعْتَزِلُوكُمْ وَيُلْقُوا إِلَيْكُمُ السَّلَمَ وَيَكُفُّوا أَيْدِيَهُمْ فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُولَٰئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَانًا مُبِينًا","latin":"satajiduuna aakhariina yuriiduuna an ya/manuukum waya/manuu qawmahum kulla maa rudduu ilaa alfitnati urkisuu fiihaa fa-in lam ya'taziluukum wayulquu ilaykumu alssalama wayakuffuu aydiyahum fakhudzuuhum wauqtuluuhum haytsu tsaqiftumuuhum waulaa-ikum ja'alnaa lakum 'alayhim sulthaanan mubiinaan","translate":{"id":"Kelak kamu akan dapati (golongan-golongan) yang lain, yang bermaksud supaya mereka aman dari pada kamu dan aman (pula) dari kaumnya. Setiap mereka diajak kembali kepada fitnah (syirik), merekapun terjun kedalamnya. Karena itu jika mereka tidak membiarkan kamu dan (tidak) mau mengemukakan perdamaian kepadamu, serta (tidak) menahan tangan mereka (dari memerangimu), maka tawanlah mereka dan bunuhlah mereka dan merekalah orang-orang yang Kami berikan kepadamu alasan yang nyata (untuk menawan dan membunuh) mereka.\n","en":"You will find [that there are] others who would like to be safe from you as well as safe from their own folk, [but who,] whenever they are faced anew with temptation to evil, plunge into it headlong. Hence, if they do not let you be, and do not offer you peace, and do not stay their hands, seize them and slay them whenever you come upon them: for it is against these that We have clearly empowered you [to make war]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/584","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/584.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/584.mp3"]}},{"no":92,"arab":"وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً ۚ وَمَنْ قَتَلَ مُؤْمِنًا خَطَأً فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ وَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ إِلَّا أَنْ يَصَّدَّقُوا ۚ فَإِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ وَإِنْ كَانَ مِنْ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ فَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ وَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ فَمَنْ لَمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ تَوْبَةً مِنَ اللَّهِ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","latin":"wamaa kaana limu/minin an yaqtula mu/minan illaa khatha-an waman qatala mu/minan khatha-an fatahriiru raqabatin mu/minatin wadiyatun musallamatun ilaa ahlihi illaa an yashshaddaquu fa-in kaana min qawmin 'aduwwin lakum wahuwa mu/minun fatahriiru raqabatin mu/minatin wa-in kaana min qawmin baynakum wabaynahum miitsaaqun fadiyatun musallamatun ilaa ahlihi watahriiru raqabatin mu/minatin faman lam yajid fashiyaamu syahrayni mutataabi'ayni tawbatan mina allaahi wakaana allaahu 'aliiman hakiimaan","translate":{"id":"Dan tidak layak bagi seorang mu'min membunuh seorang mu'min (yang lain), kecuali karena tersalah (tidak sengaja) , dan barangsiapa membunuh seorang mu'min karena tersalah (hendaklah) ia memerdekakan seorang hamba sahaya yang beriman serta membayar diat yang diserahkan kepada keluarganya (si terbunuh itu), kecuali jika mereka (keluarga terbunuh) bersedekah . Jika ia (si terbunuh) dari kaum (kafir) yang ada perjanjian (damai) antara mereka dengan kamu, maka (hendaklah si pembunuh) membayar diat yang diserahkan kepada keluarganya (si terbunuh) serta memerdekakan hamba sahaya yang beriman. Barangsiapa yang tidak memperolehnya , maka hendaklah ia (si pembunuh) berpuasa dua bulan berturut-turut untuk penerimaan taubat dari pada Allah. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"AND IT IS not conceivable that a believer should slay another believer, unless it be by mistake. And upon him who has slain a believer by mistake there is the duty of freeing a believing soul from bondage and paying an indemnity to the victim's relations, unless they forgo it by way of charity. Now if the slain, while himself a believer, belonged to a people who are at war with you, [the penance shall be confined to] the freeing of a believing soul from bondage; whereas, if he belonged to a people to whom you are bound by a covenant, [it shall consist of] an indemnity to be paid to his relations in ad­dition to the freeing of a believing soul from bon­dage. And he who does not have the wherewithal shall fast [instead] for two consecutive months. (This is) the atonement ordained by God: and God is indeed all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/585","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/585.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/585.mp3"]}},{"no":93,"arab":"وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ وَلَعَنَهُ وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا","latin":"waman yaqtul mu/minan muta'ammidan fajazaauhu jahannamu khaalidan fiihaa waghadhiba allaahu 'alayhi wala'anahu wa-a'adda lahu 'adzaaban 'azhiimaan ","translate":{"id":"Dan barangsiapa yang membunuh seorang mu'min dengan sengaja maka balasannya ialah Jahannam, kekal ia di dalamnya dan Allah murka kepadanya, dan mengutukinya serta menyediakan azab yang besar baginya.\n","en":"But whoever deliberately slays another be­liever, his requital shall be hell, therein to abide; and God will condemn him, and will reject him, and will prepare for him awesome suffering."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/586","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/586.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/586.mp3"]}},{"no":94,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَىٰ إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِنْدَ اللَّهِ مَغَانِمُ كَثِيرَةٌ ۚ كَذَٰلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ فَتَبَيَّنُوا ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","latin":"yaa ayyuhaa alladziina aamanuu idzaa dharabtum fii sabiili allaahi fatabayyanuu walaa taquuluu liman alqaa ilaykumu alssalaama lasta mu/minan tabtaghuuna 'aradha alhayaati alddunyaa fa'inda allaahi maghaanimu katsiiratun kadzaalika kuntum min qablu famanna allaahu 'alaykum fatabayyanuu inna allaaha kaana bimaa ta'maluuna khabiiraan","translate":{"id":"Hai orang-orang yang beriman, apabila kamu pergi (berperang) di jalan Allah, maka telitilah dan janganlah kamu mengatakan kepada orang yang mengucapkan \"salam\" kepadamu : \"Kamu bukan seorang mu'min\" (lalu kamu membunuhnya), dengan maksud mencari harta benda kehidupan di dunia, karena di sisi Allah ada harta yang banyak. Begitu jugalah keadaan kamu dahulu , lalu Allah menganugerahkan ni'mat-Nya atas kamu, maka telitilah. Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"[Hence,] O you who have attained to faith, when you go forth [to war] in God's cause, use your discernment, and do not - out of a desire for the fleeting gains of this worldly life - say unto anyone who offers you the greeting of peace, \"Thou art not a believer\" for with God there are gains abundant. You, too, were once in the same condition - but God has been gracious unto you. Use, therefore, your discernment: verily, God is always aware of what you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/587","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/587.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/587.mp3"]}},{"no":95,"arab":"لَا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ غَيْرُ أُولِي الضَّرَرِ وَالْمُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ ۚ فَضَّلَ اللَّهُ الْمُجَاهِدِينَ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ عَلَى الْقَاعِدِينَ دَرَجَةً ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَفَضَّلَ اللَّهُ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ أَجْرًا عَظِيمًا","latin":"laa yastawii alqaa'iduuna mina almu/miniina ghayru ulii aldhdharari waalmujaahiduuna fii sabiili allaahi bi-amwaalihim wa-anfusihim fadhdhala allaahu almujaahidiina bi-amwaalihim wa-anfusihim 'alaa alqaa'idiina darajatan wakullan wa'ada allaahu alhusnaa wafadhdhala allaahu almujaahidiina 'alaa alqaa'idiina ajran 'azhiimaan","translate":{"id":"Tidaklah sama antara mu'min yang duduk (yang tidak ikut berperang) yang tidak mempunyai 'uzur dengan orang-orang yang berjihad di jalan Allah dengan harta mereka dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orang-orang yang duduk satu derajat. Kepada masing-masing mereka Allah menjanjikan pahala yang baik (surga) dan Allah melebihkan orang-orang yang berjihad atas orang yang duduk dengan pahala yang besar,\n","en":"SUCH of the believers as remain passive - other than the disabled - cannot be deemed equal to those who strive hard in God's cause with their possessions and their lives: God has exalted those who strive hard with their possessions and their lives far above those who remain passive. Although God has promised the ultimate good unto all [believers], yet has God exalted those who strive hard above those who remain passive by [promising them] a mighty reward -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/588","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/588.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/588.mp3"]}},{"no":96,"arab":"دَرَجَاتٍ مِنْهُ وَمَغْفِرَةً وَرَحْمَةً ۚ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"darajaatin minhu wamaghfiratan warahmatan wakaana allaahu ghafuuran rahiimaa","translate":{"id":"(yaitu) beberapa derajat dari pada-Nya, ampunan serta rahmat. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"[many] degrees thereof - and for­giveness of sins, and His grace; for God is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/589","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/589.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/589.mp3"]}},{"no":97,"arab":"إِنَّ الَّذِينَ تَوَفَّاهُمُ الْمَلَائِكَةُ ظَالِمِي أَنْفُسِهِمْ قَالُوا فِيمَ كُنْتُمْ ۖ قَالُوا كُنَّا مُسْتَضْعَفِينَ فِي الْأَرْضِ ۚ قَالُوا أَلَمْ تَكُنْ أَرْضُ اللَّهِ وَاسِعَةً فَتُهَاجِرُوا فِيهَا ۚ فَأُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ ۖ وَسَاءَتْ مَصِيرًا","latin":"inna alladziina tawaffaahumu almalaa-ikatu zhaalimii anfusihim qaaluu fiima kuntum qaaluu kunnaa mustadh'afiina fii al-ardhi qaaluu alam takun ardhu allaahi waasi'atan fatuhaajiruu fiihaa faulaa-ika ma/waahum jahannamu wasaa-at mashiiraan","translate":{"id":"Sesungguhnya orang-orang yang diwafatkan malaikat dalam keadaan menganiaya diri sendiri , (kepada mereka) malaikat bertanya : \"Dalam keadaan bagaimana kamu ini ?\". Mereka menjawab : \"Adalah kami orang-orang yang tertindas di negeri (Mekah)\". Para malaikat berkata : \"Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu ?\". Orang-orang itu tempatnya neraka Jahannam, dan Jahannam itu seburuk-buruk tempat kembali,\n","en":"Behold, those whom the angels gather in death while they are still sinning against themselves, [the angels] will ask, \"What was wrong with you?'' They will answer: \"We were too weak on earth.\" [The angels] will say: \"Was, then, God's earth not wide enough for you to forsake the domain of evil?\" For such, then, the goal is hell - and how evil a journey's end!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/590","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/590.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/590.mp3"]}},{"no":98,"arab":"إِلَّا الْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ لَا يَسْتَطِيعُونَ حِيلَةً وَلَا يَهْتَدُونَ سَبِيلًا","latin":"illaa almustadh'afiina mina alrrijaali waalnnisaa-i waalwildaani laa yastathii'uuna hiilatan walaa yahtaduuna sabiilaan","translate":{"id":"kecuali mereka yang tertindas baik laki-laki atau wanita ataupun anak-anak yang tidak mampu berdaya upaya dan tidak mengetahui jalan (untuk hijrah),\n","en":"But excepted shall be the truly helpless - be they men or women or children - who cannot bring forth any strength and have not been shown the right way:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/591","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/591.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/591.mp3"]}},{"no":99,"arab":"فَأُولَٰئِكَ عَسَى اللَّهُ أَنْ يَعْفُوَ عَنْهُمْ ۚ وَكَانَ اللَّهُ عَفُوًّا غَفُورًا","latin":"faulaa-ika 'asaa allaahu an ya'fuwa 'anhum wakaana allaahu 'afuwwan ghafuuraan","translate":{"id":"mereka itu, mudah-mudahan Allah mema'afkannya. Dan adalah Allah Maha Pema'af lagi Maha Pengampun.\n","en":"as for them, God may well efface their sin - for God is indeed an absolver of sins, much-forgiving."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/592","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/592.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/592.mp3"]}},{"no":100,"arab":"وَمَنْ يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الْأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً ۚ وَمَنْ يَخْرُجْ مِنْ بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى اللَّهِ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"waman yuhaajir fii sabiili allaahi yajid fii al-ardhi muraaghaman katsiiran wasa'atan waman yakhruj min baytihi muhaajiran ilaa allaahi warasuulihi tsumma yudrik-hu almawtu faqad waqa'a ajruhu 'alaa allaahi wakaana allaahu ghafuuran rahiimaan","translate":{"id":"Barangsiapa berhijrah di jalan Allah, niscaya mereka mendapati di muka bumi ini tempat hijrah yang luas dan rezki yang banyak. Barangsiapa keluar dari rumahnya dengan maksud berhijrah kepada Allah dan Rasul-Nya, kemudian kematian menimpanya (sebelum sampai ke tempat yang dituju), maka sungguh telah tetap pahalanya di sisi Allah. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"And he who forsakes the domain of evil for the sake of God shall find on earth many a lonely road, as well as life abundant. And if anyone leaves his home, fleeing from evil unto God and His Apostle, and then death overtakes him - his reward is ready with God: for God iss indeed much-forgiving, a dis­penser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/593","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/593.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/593.mp3"]}},{"no":101,"arab":"وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنَ الصَّلَاةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا ۚ إِنَّ الْكَافِرِينَ كَانُوا لَكُمْ عَدُوًّا مُبِينًا","latin":"wa-idzaa dharabtum fii al-ardhi falaysa 'alaykum junaahun an taqshuruu mina alshshalaati in khiftum an yaftinakumu alladziina kafaruu inna alkaafiriina kaanuu lakum 'aduwwan mubiinaan","translate":{"id":"Dan apabila kamu bepergian di muka bumi, maka tidaklah mengapa kamu men-qashar sembahyang(mu), jika kamu takut diserang orang-orang kafir. Sesungguhnya orang-orang kafir itu adalah musuh yang nyata bagimu.\n","en":"AND WHEN you go forth [to war] on earth, you will incur no sin by shortening your prayers if you have reason to fear that those who are bent on denying the truth might suddenly fall upon you: for, verily, those who deny the truth are your open foes."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/594","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/594.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/594.mp3"]}},{"no":102,"arab":"وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَىٰ أَنْ تَضَعُوا أَسْلِحَتَكُمْ ۖ وَخُذُوا حِذْرَكُمْ ۗ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا","latin":"wa-idzaa kunta fiihim fa-aqamta lahumu alshshalaata faltaqum thaa-ifatun minhum ma'aka walya/khudzuu aslihatahum fa-idzaa sajaduu falyakuunuu min waraa-ikum walta/ti thaa-ifatun ukhraa lam yushalluu falyushalluu ma'aka walya/khudzuu hidzrahum wa-aslihatahum wadda alladziina kafaruu law taghfuluuna 'an aslihatikum wa-amti'atikum fayamiiluuna 'alaykum maylatan waahidatan walaa junaaha 'alaykum in kaana bikum adzan min matharin aw kuntum mardaa an tadha'uu aslihatakum wakhudzuu hidzrakum inna allaaha a'adda lilkaafiriina 'adzaaban muhiinaan","translate":{"id":"Dan apabila kamu berada di tengah-tengah mereka (sahabatmu) lalu kamu hendak mendirikan shalat bersama-sama mereka, maka hendaklah segolongan dari mereka berdiri (shalat) besertamu dan menyandang senjata, kemudian apabila mereka (yang shalat besertamu) sujud (telah menyempurnakan seraka'at) , maka hendaklah mereka pindah dari belakangmu (untuk menghadapi musuh) dan hendaklah datang golongan yang kedua yang belum bersembahyang, lalu bersembahyanglah mereka denganmu , dan hendaklah mereka bersiap siaga dan menyandang senjata. Orang-orang kafir ingin supaya kamu lengah terhadap senjatamu dan harta bendamu, lalu mereka menyerbu kamu dengan sekaligus. Dan tidak ada dosa atasmu meletakkan senjata-senjatamu, jika kamu mendapat sesuatu kesusahan karena hujan atau karena kamu memang sakit; dan siap siagalah kamu. Sesungguhnya Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir itu .\n","en":"Thus, when thou art among the believers and about to lead them in prayer, let [only] part of them stand up with thee, retaining their arms. Then, after they have finished their prayer, let them provide you cover while another group, who have not yet prayed, shall come forward and pray with thee, being fully prepared against danger and retaining their arms: (for) those who are bent on denying the truth would love to see you oblivious of your arms and your equipment, so that they might fall upon you in a surprise attack. But it shall not be wrong for you to lay down your arms [while you pray] if you are troubled by rain or if you are ill; but [always] be fully prepared against danger. Verily, God has readied shameful suffering for all who deny the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/595","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/595.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/595.mp3"]}},{"no":103,"arab":"فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا اطْمَأْنَنْتُمْ فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا","latin":"fa-idzaa qadhaytumu alshshalaata faudzkuruu allaaha qiyaaman waqu'uudan wa'alaa junuubikum fa-idzaa ithma/nantum fa-aqiimuu alshshalaata inna alshshalaata kaanat 'alaa almu/miniina kitaaban mawquutaan","translate":{"id":"Maka apabila kamu telah menyelesaikan shalat(mu), ingatlah Allah di waktu berdiri, di waktu duduk dan di waktu berbaring. Kemudian apabila kamu telah merasa aman, maka dirikanlah shalat itu (sebagaimana biasa). Sesungguhnya shalat itu adalah fardhu yang ditentukan waktunya atas orang-orang yang beriman.\n","en":"And when you have finished your prayer, remember God - standing and sitting and lying down; and when you are once again secure, observe your prayers [fully]. Verily, for all believers prayer is indeed a sacred duty linked to particular times [of day]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/596","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/596.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/596.mp3"]}},{"no":104,"arab":"وَلَا تَهِنُوا فِي ابْتِغَاءِ الْقَوْمِ ۖ إِنْ تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","latin":"walaa tahinuu fii ibtighaa-i alqawmi in takuunuu ta/lamuuna fa-innahum ya/lamuuna kamaa ta/lamuuna watarjuuna mina allaahi maa laa yarjuuna wakaana allaahu 'aliiman hakiimaan","translate":{"id":"Janganlah kamu berhati lemah dalam mengejar mereka (musuhmu). Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"And be not faint of heart when you seek out the [enemy] host. If you happen to suffer pain, behold, they suffer pain even as you suffer it: but you are hoping [to receive] from God what they cannot hope for. And God is indeed all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/597","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/597.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/597.mp3"]}},{"no":105,"arab":"إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ ۚ وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا","latin":"innaa anzalnaa ilayka alkitaaba bialhaqqi litahkuma bayna alnnaasi bimaa araaka allaahu walaa takun lilkhaa-iniina khashiimaan","translate":{"id":"Sesungguhnya Kami telah menurunkan kitab kepadamu dengan membawa kebenaran, supaya kamu mengadili antara manusia dengan apa yang telah Allah wahyukan kepadamu, dan janganlah kamu menjadi penantang (orang yang tidak bersalah), karena (membela) orang-orang yang khianat ,\n","en":"BEHOLD, We have bestowed upon thee from on high this divine writ, setting forth the truth, so that thou may judge between people in accordance with what God has taught thee. Hence, do not contend with those who are false to their trust,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/598","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/598.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/598.mp3"]}},{"no":106,"arab":"وَاسْتَغْفِرِ اللَّهَ ۖ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا","latin":"waistaghfiri allaaha inna allaaha kaana ghafuuran rahiimaan","translate":{"id":"dan mohonlah ampun kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"but pray God to forgive [them]: behold, God is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/599","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/599.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/599.mp3"]}},{"no":107,"arab":"وَلَا تُجَادِلْ عَنِ الَّذِينَ يَخْتَانُونَ أَنْفُسَهُمْ ۚ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ خَوَّانًا أَثِيمًا","latin":"walaa tujaadil 'ani alladziina yakhtaanuuna anfusahum inna allaaha laa yuhibbu man kaana khawwaanan atsiimaan","translate":{"id":"Dan janganlah kamu berdebat (untuk membela) orang-orang yang mengkhianati dirinya. Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat lagi bergelimang dosa,\n","en":"Yet do not argue in behalf of those who are false to their own selves: verily, God does not love those who betray their trust and persist in sinful ways."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/600","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/600.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/600.mp3"]}},{"no":108,"arab":"يَسْتَخْفُونَ مِنَ النَّاسِ وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ ۚ وَكَانَ اللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا","latin":"yastakhfuuna mina alnnaasi walaa yastakhfuuna mina allaahi wahuwa ma'ahum idz yubayyituuna maa laa yardaa mina alqawli wakaana allaahu bimaa ya'maluuna muhiithaan","translate":{"id":"mereka bersembunyi dari manusia, tetapi mereka tidak bersembunyi dari Allah, padahal Allah beserta mereka, ketika pada suatu malam mereka menetapkan keputusan rahasia yang Allah tidak redlai. Dan adalah Allah Maha Meliputi (ilmu-Nya) terhadap apa yang mereka kerjakan.\n","en":"They would conceal their doings from men; but from God they cannot conceal them - for He is with them whenever they devise, in the dark of night, all manner of beliefs which He does not approve. And God indeed encompasses [with His knowledge] whatever they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/601","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/601.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/601.mp3"]}},{"no":109,"arab":"هَا أَنْتُمْ هَٰؤُلَاءِ جَادَلْتُمْ عَنْهُمْ فِي الْحَيَاةِ الدُّنْيَا فَمَنْ يُجَادِلُ اللَّهَ عَنْهُمْ يَوْمَ الْقِيَامَةِ أَمْ مَنْ يَكُونُ عَلَيْهِمْ وَكِيلًا","latin":"haa-antum haaulaa-i jaadaltum 'anhum fii alhayaati alddunyaa faman yujaadilu allaaha 'anhum yawma alqiyaamati am man yakuunu 'alayhim wakiilaan","translate":{"id":"Beginilah kamu, kamu sekalian adalah orang-orang yang berdebat untuk (membela) mereka dalam kehidupan dunia ini. Maka siapakah yang akan mendebat Allah untuk (membela) mereka pada hari kiamat ? Atau siapakah yang menjadi pelindung mereka (terhadap siksa Allah) ?\n","en":"Oh, you might well argue in their behalf in the life of this world: but who will argue in their behalf with God on the Day of Resurrection, or who will be their defender?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/602","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/602.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/602.mp3"]}},{"no":110,"arab":"وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَحِيمًا","latin":"waman ya'mal suu-an aw yazhlim nafsahu tsumma yastaghfiri allaaha yajidi allaaha ghafuuran rahiimaanwaman ya'mal suu-an aw yazhlim nafsahu tsumma yastaghfiri allaaha yajidi allaaha ghafuuran rahiimaanv","translate":{"id":"Dan barangsiapa yang mengerjakan kejahatan dan menganiaya dirinya, kemudian ia mohon ampun kepada Allah, niscaya ia mendapati Allah Maha Pengampun lagi Maha Penyayang.\n","en":"Yet he who does evil or [otherwise] sins against himself, and thereafter prays God to forgive him, shall find God much-forgiving, a dispenser of grace:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/603","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/603.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/603.mp3"]}},{"no":111,"arab":"وَمَنْ يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُ عَلَىٰ نَفْسِهِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","latin":"waman yaksib itsman fa-innamaa yaksibuhu 'alaa nafsihi wakaana allaahu 'aliiman hakiimaan","translate":{"id":"Barangsiapa yang mengerjakan dosa, maka sesungguhnya ia mengerjakannya untuk (kemudharatan) dirinya sendiri. Dan Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"for he who commits a sin, commits it only to his own hurt; and God is indeed all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/604","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/604.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/604.mp3"]}},{"no":112,"arab":"وَمَنْ يَكْسِبْ خَطِيئَةً أَوْ إِثْمًا ثُمَّ يَرْمِ بِهِ بَرِيئًا فَقَدِ احْتَمَلَ بُهْتَانًا وَإِثْمًا مُبِينًا","latin":"waman yaksib khathii-atan aw itsman tsumma yarmi bihi barii-an faqadi ihtamala buhtaanan wa-itsman mubiinaan","translate":{"id":"Dan barangsiapa yang mengerjakan kesalahan atau dosa, kemudian dituduhkannya kepada orang yang tidak bersalah, maka sesungguhnya ia telah berbuat suatu kebohongan dan dosa yang nyata.\n","en":"But he who commits a fault or a sin and then throws the blame therefore on an innocent person, burdens himself with the guilt of calumny and [yet another] flagrant sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/605","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/605.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/605.mp3"]}},{"no":113,"arab":"وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكَ وَرَحْمَتُهُ لَهَمَّتْ طَائِفَةٌ مِنْهُمْ أَنْ يُضِلُّوكَ وَمَا يُضِلُّونَ إِلَّا أَنْفُسَهُمْ ۖ وَمَا يَضُرُّونَكَ مِنْ شَيْءٍ ۚ وَأَنْزَلَ اللَّهُ عَلَيْكَ الْكِتَابَ وَالْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ ۚ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا","latin":"walawlaa fadhlu allaahi 'alayka warahmatuhu lahammat thaa-ifatun minhum an yudhilluuka wamaa yudhilluuna illaa anfusahum wamaa yadhurruunaka min syay-in wa-anzala allaahu 'alayka alkitaaba waalhikmata wa'allamaka maa lam takun ta'lamu wakaana fadhlu allaahi 'alayka 'azhiimaan","translate":{"id":"Sekiranya bukan karena karunia Allah dan rahmat-Nya kepadamu, tentulah segolongan dari mereka berkeinginan keras untuk menyesatkanmu. Tetapi mereka tidak menyesatkan melainkan dirinya sendiri, dan mereka tidak dapat membahayakanmu sedikitpun kepadamu. Dan (juga karena) Allah telah menurunkan Kitab dan hikmah kepadamu, dan telah mengajarkan kepadamu apa yang belum kamu ketahui. Dan adalah karunia Allah sangat besar atasmu.\n","en":"And but for God's favour upon thee and His grace, some of those [who are false to themselves] would indeed endeavour to lead thee astray; yet none but themselves do they lead astray. Nor can they harm thee in any way, since God has bestowed upon thee from on high this divine writ and [given thee] wisdom, and has imparted unto thee the knowledge of what thou didst not know. And God's favour upon thee is tremendous indeed."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/606","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/606.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/606.mp3"]}},{"no":114,"arab":"لَا خَيْرَ فِي كَثِيرٍ مِنْ نَجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ ابْتِغَاءَ مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","latin":"laa khayra fii katsiirin min najwaahum illaa man amara bishadaqatin aw ma'ruufin aw ishlaahin bayna alnnaasi waman yaf'al dzaalika ibtighaa-a mardaati allaahi fasawfa nu/tiihi ajran 'azhiimaan","translate":{"id":"Tidak ada kebaikan pada kebanyakan bisikan-bisikan mereka, kecuali bisikan-bisikan dari orang yang menyuruh (manusia) memberi sedekah, atau berbuat ma'ruf, atau mengadakan perdamaian di antara manusia. Dan barangsiapa yang berbuat demikian karena mencari keredhaan Allah, maka kelak Kami memberi kepadanya pahala yang besar.\n","en":"NO GOOD comes, as a rule, out of secret confabulations - saving such as are devoted to en­joining charity, or equitable dealings, or setting things to rights between people: and unto him who does this out of a longing for God's goodly acceptance We shall in time grant a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/607","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/607.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/607.mp3"]}},{"no":115,"arab":"وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّىٰ وَنُصْلِهِ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا","latin":"waman yusyaaqiqi alrrasuula min ba'di maa tabayyana lahu alhudaa wayattabi' ghayra sabiili almu/miniina nuwallihi maa tawallaa wanushlihi jahannama wasaa-at mashiiraan","translate":{"id":"Dan barangsiapa yang menentang Rasul sesudah jelas kebenaran baginya, dan mengikuti jalan yang bukan jalan orang-orang mu'min, Kami biarkan ia leluasa terhadap kesesatan yang telah dikuasainya itu dan Kami masukkan ia ke dalam Jahannam, dan Jahannam itu seburuk-buruk tempat kembali.\n","en":"But as for him who, after guidance has been vouchsafed to him, cuts himself off from the Apostle and follows a path other than that of the believers - him shall We leave unto that which he himself has chosen, and shall cause him to endure hell: and how evil a journey’s end!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/608","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/608.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/608.mp3"]}},{"no":116,"arab":"إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا","latin":"inna allaaha laa yaghfiru an yusyraka bihi wayaghfiru maa duuna dzaalika liman yasyaau waman yusyrik biallaahi faqad dhalla dhalaalan ba'iidaan","translate":{"id":"Sesungguhnya Allah tidak mengampuni dosa mempersekutukan (sesuatu) dengan Dia, dan dia mengampuni dosa yang selain syirik bagi siapa yang dikehendaki-Nya. Barangsiapa yang mempersekutukan (sesuatu) dengan Allah, maka sesungguhnya ia telah tersesat sejauh-jauhnya.\n","en":"VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for those who ascribe divinity to aught beside God have indeed gone far astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/609","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/609.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/609.mp3"]}},{"no":117,"arab":"إِنْ يَدْعُونَ مِنْ دُونِهِ إِلَّا إِنَاثًا وَإِنْ يَدْعُونَ إِلَّا شَيْطَانًا مَرِيدًا","latin":"in yad'uuna min duunihi illaa inaatsan wa-in yad'uuna illaa syaythaanan mariidaan","translate":{"id":"Yang mereka sembah selain Allah itu, tidak lain hanyalah berhala , dan (dengan menyembah berhala itu) mereka tidak lain hanyalah menyembah syaitan yang durhaka,\n","en":"In His stead, they invoke only life­less symbols - thus invoking none but a rebellious Satan"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/610","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/610.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/610.mp3"]}},{"no":118,"arab":"لَعَنَهُ اللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا","latin":"la'anahu allaahu waqaala la-attakhidzanna min 'ibaadika nashiiban mafruudaan","translate":{"id":"yang dila'nati Allah dan syaitan itu mengatakan : \"Saya benar-benar akan mengambil dari hamba-hamba Engkau bahagian yang sudah ditentukan (untuk saya) ,\n","en":"whom God has rejected for having said, \"Verily, of Thy servants I shall most certainly take my due share,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/611","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/611.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/611.mp3"]}},{"no":119,"arab":"وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الْأَنْعَامِ وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ۚ وَمَنْ يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِنْ دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُبِينًا","latin":"walaudhillannahum walaumanniyannahum walaaamurannahum falayubattikunna aatsaana al-an'aami walaaamurannahum falayughayyirunna khalqa allaahi waman yattakhidzi alsysyaythaana waliyyan min duuni allaahi faqad khasira khusraanan mubiinaan","translate":{"id":"dan aku benar-benar akan menyesatkan mereka, dan akan membangkitkan angan-angan kosong pada mereka dan menyuruh mereka (memotong telinga-telinga binatang ternak), lalu mereka benar-benar memotongnya , dan akan aku suruh mereka (mengubah ciptaan Allah), lalu benar-benar mereka merubahnya \". Barangsiapa yang menjadikan syaitan menjadi pelindung selain Allah, maka sesungguhnya ia menderita kerugian yang nyata.\n","en":"and shall lead them astray, and fill them with vain desires; and I shall command them - and they will cut off the ears of cattle [in idolatrous sacrifice]; and I shall command them - and they will corrupt God's creation!\" But all who take Satan rather than God for their master do indeed, most clearly, lose all:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/612","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/612.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/612.mp3"]}},{"no":120,"arab":"يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا","latin":"ya'iduhum wayumanniihim wamaa ya'iduhumu alsysyaythaanu illaa ghuruuraan","translate":{"id":"Syaitan itu memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong pada mereka, padahal syaitan itu tidak menjanjikan kepada mereka selain dari tipuan belaka.\n","en":"he holds out promises to them, and fills them with vain desires: yet whatever Satan promises them is but meant to delude the mind."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/613","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/613.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/613.mp3"]}},{"no":121,"arab":"أُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا","latin":"ulaa-ika ma/waahum jahannamu walaa yajiduuna 'anhaa mahiishaan","translate":{"id":"Mereka itu tempatnya Jahannam dan mereka tidak memperoleh tempat lari dari padanya.\n","en":"Such as these have hell for their goal: and they shall find no way to escape therefrom."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/614","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/614.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/614.mp3"]}},{"no":122,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلًا","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati sanudkhiluhum jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa abadan wa'da allaahi haqqan waman ashdaqu mina allaahi qiilaan","translate":{"id":"Orang-orang yang beriman dan mengerjakan amalan saleh, kelak akan Kami masukkan ke dalam surga yang mengalir sungai-sungai di dalamnya, mereka kekal di dalamnya selama-lamanya. Allah telah membuat suatu janji yang benar. Dan siapakah yang lebih benar perkataannya dari pada Allah ?\n","en":"Yet those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time: this is, in truth, God's promise - and whose word could be truer than God's?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/615","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/615.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/615.mp3"]}},{"no":123,"arab":"لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ ۗ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ وَلَا يَجِدْ لَهُ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","latin":"laysa bi-amaaniyyikum walaa amaaniyyi ahli alkitaabi man ya'mal suu-an yujza bihi walaa yajid lahu min duuni allaahi waliyyan walaa nashiiraan","translate":{"id":"(Pahala dari Allah) itu bukanlah menurut angan-anganmu yang kosong dan tidak (pula) menurut angan-angan Ahli Kitab. Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu dan ia tidak mendapat pelindung dan tidak (pula) penolong baginya selain dari Allah.\n","en":"It may not accord with your wishful thinking - nor with the wishful thinking of the fol­lowers of earlier revelation - [that] he who does evil shall be requited for it, and shall find none to protect him from God, and none to bring him succour,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/616","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/616.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/616.mp3"]}},{"no":124,"arab":"وَمَنْ يَعْمَلْ مِنَ الصَّالِحَاتِ مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًا","latin":"waman ya'mal mina alshshaalihaati min dzakarin aw untsaa wahuwa mu/minun faulaa-ika yadkhuluuna aljannata walaa yuzhlamuuna naqiiraan","translate":{"id":"Barangsiapa yang mengerjakan amal-amal saleh, baik laki-laki maupun wanita sedang ia orang yang beriman, maka mereka itu masuk ke dalam surga dan mereka tidak dianiaya walau sedikitpun.\n","en":"whereas anyone - be it man or woman - who does [whatever he can] of good deeds and is a believer withal, shall enter paradise, and shall not be wronged by as much as [would fill] the groove of a date-stone."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/617","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/617.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/617.mp3"]}},{"no":125,"arab":"وَمَنْ أَحْسَنُ دِينًا مِمَّنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۗ وَاتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلًا","latin":"waman ahsanu diinan mimman aslama wajhahu lillaahi wahuwa muhsinun waittaba'a millata ibraahiima haniifan waittakhadza allaahu ibraahiima khaliilaan","translate":{"id":"Dan siapakah yang lebih baik agamanya dari pada orang yang ikhlas menyerahkan dirinya kepada Allah, sedang diapun mengerjakan kebaikan, dan ia mengikuti agama Ibrahim yang lurus ? Dan Allah mengambil Ibrahim menjadi kesayanganNya.\n","en":"And who could be of better faith than he who surrenders his whole being unto God and is a doer of good withal, and follows the creed of Abraham, who turned away from all that is false - seeing that God exalted Abraham with His love?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/618","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/618.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/618.mp3"]}},{"no":126,"arab":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ مُحِيطًا","latin":"walillaahi maa fii alssamaawaati wamaa fii al-ardhi wakaana allaahu bikulli syay-in muhiithaan","translate":{"id":"Kepunyaan Allah-lah apa yang di langit dan apa yang di bumi, dan adalah (pengetahuan) Allah Maha Meliputi segala sesuatu.\n","en":"For, unto God belongs all that is in the heavens and all that is on earth; and, indeed, God encompasses everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/619","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/619.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/619.mp3"]}},{"no":127,"arab":"وَيَسْتَفْتُونَكَ فِي النِّسَاءِ ۖ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَىٰ عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ وَالْمُسْتَضْعَفِينَ مِنَ الْوِلْدَانِ وَأَنْ تَقُومُوا لِلْيَتَامَىٰ بِالْقِسْطِ ۚ وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ كَانَ بِهِ عَلِيمًا","latin":"wayastaftuunaka fii alnnisaa-i quli allaahu yuftiikum fiihinna wamaa yutlaa 'alaykum fii alkitaabi fii yataamaa alnnisaa-i allaatii laa tu/tuunahunna maa kutiba lahunna watarghabuuna an tankihuuhunna waalmustadh'afiina mina alwildaani wa-an taquumuu lilyataamaa bialqisthi wamaa taf'aluu min khayrin fa-inna allaaha kaana bihi 'aliimaan","translate":{"id":"Dan mereka minta fatwa kepadamu tentang para wanita. Katakanlah : \"Allah memberi fatwa kepadamu tentang mereka, dan apa yang dibacakan kepadamu dalam Al Qur'an (juga memfatwakan) tentang para wanita yatim yang kamu tidak memberikan kepada mereka apa yang ditetapkan untuk mereka, sedang kamu ingin mengawini mereka dan tentang anak-anak yang masih dipandang lemah. Dan (Allah menyuruh kamu) supaya kamu mengurus anak-anak yatim secara adil. Dan kebajikan apa saja yang kamu kerjakan, maka sesungguhnya Allah adalah Maha Mengetahuinya.\n","en":"AND THEY will ask thee to enlighten them about the laws concerning women. Say: \"God [Himself] en­lightens you about the laws concerning them\"- for [His will is shown] in what is being conveyed unto you through this divine writ about orphan women [in your charge], to whom - because you yourselves may be desirous of marrying them - you do not give that which has been ordained for them; and about help­less children; and about your duty to treat orphans with equity. And whatever good you may do - be­hold, God has indeed full knowledge thereof."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/620","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/620.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/620.mp3"]}},{"no":128,"arab":"وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ وَالصُّلْحُ خَيْرٌ ۗ وَأُحْضِرَتِ الْأَنْفُسُ الشُّحَّ ۚ وَإِنْ تُحْسِنُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","latin":"wa-ini imra-atun khaafat min ba'lihaa nusyuuzan aw i'raadan falaa junaaha 'alayhimaa an yushlihaa baynahumaa shulhan waalshshulhu khayrun wauhdirati al-anfusu alsysyuhha wa-in tuhsinuu watattaquu fa-inna allaaha kaana bimaa ta'maluuna khabiiraan","translate":{"id":"Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya, maka tidak mengapa bagi keduanya mengadakan perdamaian yang sebenar-benarnya , dan perdamaian itu lebih baik (bagi mereka) walaupun manusia itu menurut tabiatnya kikir . Dan jika kamu bergaul dengan isterimu secara baik dan memelihara dirimu (dari nusyuz dan sikap tak acuh), maka sesungguhnya Allah adalah Maha Mengetahui apa yang kamu kerjakan.\n","en":"And if a woman has reason to fear ill-treat­ment from her husband, or that he might turn away from her, it shall not be wrong for the two to set things peacefully to rights between themselves: for peace is best, and selfishness is ever-present in human souls. But if you do good and are conscious of Him - behold, God is indeed aware of all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/621","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/621.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/621.mp3"]}},{"no":129,"arab":"وَلَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ۚ وَإِنْ تُصْلِحُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا","latin":"walan tastathii'uu an ta'diluu bayna alnnisaa-i walaw harashtum falaa tamiiluu kulla almayli fatadzaruuhaa kaalmu'allaqati wa-in tushlihuu watattaquu fa-inna allaaha kaana ghafuuran rahiimaan","translate":{"id":"Dan kamu sekali-kali tidak akan dapat berlaku adil di antara isteri-isteri(mu), walaupun kamu sangat ingin berbuat demikian, karena itu janganlah kamu terlalu cenderung (kepada yang kamu cintai), sehingga kamu biarkan yang lain terkatung-katung. Dan jika kamu mengadakan perbaikan dan memelihara diri (dari kecurangan), maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"And it will not be within your power to treat your wives with equal fairness, however much you may desire it; and so, do not allow yourselves to incline towards one to the exclusion of the other, leaving her in a state, as it were, of having and not having a husband. But if you put things to rights and are conscious of Him - behold, God is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/622","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/622.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/622.mp3"]}},{"no":130,"arab":"وَإِنْ يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِنْ سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا","latin":"wa-in yatafarraqaa yughni allaahu kullan min sa'atihi wakaana allaahu waasi'an hakiimaan","translate":{"id":"Jika keduanya bercerai, maka Allah akan memberi kecukupan kepada masing-masingnya dari limpahan karunia-Nya. Dan adalah Allah Maha Luas (karunia-Nya) lagi Maha Bijaksana.\n","en":"And if husband and wife do separate, God shall provide for each of them out of His abundance: for God is indeed infinite, wise,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/623","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/623.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/623.mp3"]}},{"no":131,"arab":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَإِيَّاكُمْ أَنِ اتَّقُوا اللَّهَ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ غَنِيًّا حَمِيدًا","latin":"walillaahi maa fii alssamaawaati wamaa fii al-ardhi walaqad washshaynaa alladziina uutuu alkitaaba min qablikum wa-iyyaakum ani ittaquu allaaha wa-in takfuruu fa-inna lillaahi maa fii alssamaawaati wamaa fii al-ardhi wakaana allaahu ghaniyyan hamiidaan","translate":{"id":"Dan kepunyaan Allah-lah apa yang di langit dan yang di bumi, dan sungguh Kami telah memerintahkan kepada orang-orang yang diberi kitab sebelum kamu dan (juga) kepada kamu; bertakwalah kepada Allah. Tetapi jika kamu kafir maka (ketahuilah), sesungguhnya apa yang di langit dan apa yang di bumi hanyalah kepunyaan Allah dan Allah Maha Kaya dan Maha Terpuji.\n","en":"and unto God belongs all that is in the heavens and all that is on earth. AND, INDEED, We have enjoined upon those who were granted revelation before your time, as well as upon yourselves, to remain conscious of God. And if you deny Him - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed self-sufficient, ever to be praised."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/624","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/624.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/624.mp3"]}},{"no":132,"arab":"وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا","latin":"walillaahi maa fii alssamaawaati wamaa fii al-ardhi wakafaa biallaahi wakiilaan","translate":{"id":"Dan kepunyaan Allah-lah apa yang di langit dan apa yang di bumi. Cukuplah Allah sebagai Pemelihara.\n","en":"And unto God belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/625","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/625.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/625.mp3"]}},{"no":133,"arab":"إِنْ يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ۚ وَكَانَ اللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًا","latin":"in yasya/ yudzhibkum ayyuhaa alnnaasu waya/ti bi-aakhariina wakaana allaahu 'alaa dzaalika qadiiraan","translate":{"id":"Jika Allah menghendaki, niscaya Dia musnahkan kamu wahai manusia, dan Dia datangkan umat yang lain (sebagai penggantimu). Dan adalah Allah Maha Kuasa berbuat demikian.\n","en":"If He so wills, He can cause you, O mankind, to disappear, and bring forth other beings [in your stead]: for God has indeed the power to do this."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/626","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/626.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/626.mp3"]}},{"no":134,"arab":"مَنْ كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا فَعِنْدَ اللَّهِ ثَوَابُ الدُّنْيَا وَالْآخِرَةِ ۚ وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا","latin":"man kaana yuriidu tsawaaba alddunyaa fa'inda allaahi tsawaabu alddunyaa waal-aakhirati wakaana allaahu samii'an bashiiraan","translate":{"id":"Barangsiapa yang menghendaki pahala di dunia saja (maka ia merugi), karena di sisi Allah ada pahala dunia dan akhirat. Dan Allah Maha Mendengar lagi Maha Melihat.\n","en":"If one desires the rewards of this world, [let him remember that] with God are the rewards of [both] this world and the life to come: and God is indeed all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/627","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/627.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/627.mp3"]}},{"no":135,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَنْ تَعْدِلُوا ۚ وَإِنْ تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","latin":"yaa ayyuhaa alladziina aamanuu kuunuu qawwaamiina bialqisthi syuhadaa-a lillaahi walaw 'alaa anfusikum awi alwaalidayni waal-aqrabiina in yakun ghaniyyan aw faqiiran faallaahu awlaa bihimaa falaa tattabi'uu alhawaa an ta'diluu wa-in talwuu aw tu'ridhuu fa-inna allaaha kaana bimaa ta'maluuna khabiiraan","translate":{"id":"Wahai orang-orang yang beriman, jadilah kamu orang yang benar-benar penegak keadilan, menjadi saksi karena Allah biarpun terhadap dirimu sendiri atau ibu bapa dan kaum kerabatmu. Jika ia kaya ataupun miskin, maka Allah lebih tahu kemaslahatannya. Maka janganlah kamu mengikuti hawa nafsu karena ingin menyimpang dari kebenaran. Dan jika kamu memutar balikkan (kata-kata) atau enggan menjadi saksi, maka sesungguhnya Allah adalah Maha Mengetahui segala apa yang kamu kerjakan.\n","en":"O YOU who have attained to faith! Be ever steadfast in upholding equity, bearing witness to the truth for the sake of God, even though it be against your own selves or your parents and kinsfolk. Whether the person concerned be rich or poor, God's claim takes precedence over [the claims of] either of them. Do not, then, follow your own desires, lest you swerve from justice: for if you distort [the truth], behold, God is indeed aware of all that you do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/628","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/628.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/628.mp3"]}},{"no":136,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ ۚ وَمَنْ يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا","latin":"yaa ayyuhaa alladziina aamanuu aaminuu biallaahi warasuulihi waalkitaabi alladzii nazzala 'alaa rasuulihi waalkitaabi alladzii anzala min qablu waman yakfur biallaahi wamalaa-ikatihi wakutubihi warusulihi waalyawmi al-aakhiri faqad dhalla dhalaalan ba'iidaan","translate":{"id":"Wahai orang-orang yang beriman, tetaplah beriman kepada Allah dan Rasul-Nya dan kepada kitab yang Allah turunkan kepada Rasul-Nya, serta kitab yang Allah turunkan sebelumnya. Barangsiapa yang kafir kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sesungguhnya orang itu telah sesat sejauh-jauhnya.\n","en":"O you who have attained to faith! Hold fast unto your belief in God and His Apostle, and in the divine writ which He has bestowed from on high upon His Apostle, step by step, as well as in the revelation which He sent down aforetime: for he who denies God, and His angels, and His revelations, and His apostles, and the Last Day, has indeed gone far astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/629","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/629.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/629.mp3"]}},{"no":137,"arab":"إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًا","latin":"inna alladziina aamanuu tsumma kafaruu tsumma aamanuu tsumma kafaruu tsumma izdaaduu kufran lam yakuni allaahu liyaghfira lahum walaa liyahdiyahum sabiilaan","translate":{"id":"Sesungguhnya orang-orang yang beriman kemudian kafir, kemudian beriman (pula), kamudian kafir lagi, kemudian bertambah kekafirannya , maka sekali-kali Allah tidak akan memberi ampunan kepada mereka, dan tidak (pula) menunjuki mereka kepada jalan yang lurus.\n","en":"Behold, as for those who come to believe, and then deny the truth, and again come to believe, and again deny the truth, and thereafter grow stubborn in their denial of the truth - God will not forgive them, nor will He guide them in any way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/630","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/630.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/630.mp3"]}},{"no":138,"arab":"بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا","latin":"basysyiri almunaafiqiina bi-anna lahum 'adzaaban aliimaan","translate":{"id":"Kabarkanlah kepada orang-orang munafik bahwa mereka akan mendapat siksaan yang pedih,\n","en":"Announce thou to such hypocrites that grievous suffering awaits them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/631","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/631.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/631.mp3"]}},{"no":139,"arab":"الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِنْدَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا","latin":"alladziina yattakhidzuuna alkaafiriina awliyaa-a min duuni almu/miniina ayabtaghuuna 'indahumu al'izzata fa-inna al'izzata lillaahi jamii'aan","translate":{"id":"(yaitu) orang-orang yang mengambil orang-orang kafir menjadi teman-teman penolong dengan meninggalkan orang-orang mu'min. Apakah mereka mencari kekuatan di sisi orang kafir itu ? Maka sesungguhnya semua kekuatan kepunyaan Allah.\n","en":"As for those who take the deniers of the truth for their allies in preference to the believers - do they hope to be honoured by them when, behold, all honour belongs to God [alone]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/632","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/632.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/632.mp3"]}},{"no":140,"arab":"وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا مَعَهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ إِنَّكُمْ إِذًا مِثْلُهُمْ ۗ إِنَّ اللَّهَ جَامِعُ الْمُنَافِقِينَ وَالْكَافِرِينَ فِي جَهَنَّمَ جَمِيعًا","latin":"waqad nazzala 'alaykum fii alkitaabi an idzaa sami'tum aayaati allaahi yukfaru bihaa wayustahzau bihaa falaa taq'uduu ma'ahum hattaa yakhuudhuu fii hadiitsin ghayrihi innakum idzan mitsluhum inna allaaha jaami'u almunaafiqiina waalkaafiriina fii jahannama jamii'aan","translate":{"id":"Dan sungguh Allah telah menurunkan kekuatan kepada kamu di dalam Al Qur'an bahwa apabila kamu mendengar ayat-ayat Allah diingkari dan diperolok-olokkan (oleh orang-orang kafir), maka janganlah kamu duduk beserta mereka, sehingga mereka memasuki pembicaraan yang lain. Karena sesungguhnya (kalau kamu berbuat demikian), tentulah kamu serupa dengan mereka. Sesungguhnya Allah akan mengumpulkan semua orang-orang munafik dan orang-orang kafir di dalam Jahannam,\n","en":"And, indeed, He has enjoined upon you in this divine writ that whenever you hear people deny the truth of God's messages and mock at them, you shall avoid their company until they begin to talk of other things - or else, verily, you will become like them. Behold, together with those who deny the truth God will gather in hell the hypocrites,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/633","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/633.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/633.mp3"]}},{"no":141,"arab":"الَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِنْ كَانَ لَكُمْ فَتْحٌ مِنَ اللَّهِ قَالُوا أَلَمْ نَكُنْ مَعَكُمْ وَإِنْ كَانَ لِلْكَافِرِينَ نَصِيبٌ قَالُوا أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُمْ مِنَ الْمُؤْمِنِينَ ۚ فَاللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ ۗ وَلَنْ يَجْعَلَ اللَّهُ لِلْكَافِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا","latin":"alladziina yatarabbashuuna bikum fa-in kaana lakum fathun mina allaahi qaaluu alam nakun ma'akum wa-in kaana lilkaafiriina nashiibun qaaluu alam nastahwidz 'alaykum wanamna'kum mina almu/miniina faallaahu yahkumu baynakum yawma alqiyaamati walan yaj'ala allaahu lilkaafiriina 'alaa almu/miniina sabiilaan","translate":{"id":"(yaitu) orang-orang yang menunggu-nunggu (peristiwa) yang akan terjadi pada dirimu (hai orang-orang mu'min). Maka jika terjadi bagimu kemenangan dari Allah mereka berkata : \"Bukankah kami (turut berperang) beserta kamu ?\" Dan jika orang-orang kafir mendapat keberuntungan (kemenangan) mereka berkata : \"Bukankah kami turut memenangkanmu , dan membela kamu dari orang-orang mu'min ?\" Maka Allah akan memberi keputusan di antara kamu di hari kiamat dan Allah sekali-kali tidak akan memberi jalan kepada orang-orang kafir untuk memusnahkan orang-orang yang beriman.\n","en":"who but wait to see what betides you: thus, if triumph comes to you from God, they say, \"Were we not on your side?\"- whereas if those who deny the truth are in luck, they say [to them], \"Have we not earned your affection by defending you against those be­lievers?'' But God will judge between you all on the Day of Resurrection; and never will God allow those who deny the truth to harm the believers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/634","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/634.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/634.mp3"]}},{"no":142,"arab":"إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا","latin":"inna almunaafiqiina yukhaadi'uuna allaaha wahuwa khaadi'uhum wa-idzaa qaamuu ilaa alshshalaati qaamuu kusaalaa yuraauuna alnnaasa walaa yadzkuruuna allaaha illaa qaliilaan","translate":{"id":"Sesungguhnya orang-orang munafik itu menipu Allah, dan Allah akan membalas tipuan mereka . Dan apabila mereka berdiri untuk shalat mereka berdiri dengan malas. Mereka bermaksud riya (dengan shalat) di hadapan manusia. Dan tidaklah mereka menyebut Allah kecuali sedikit sekali .\n","en":"Behold, the hypocrites seek to deceive God - the while it is He who causes them to be deceived [by themselves] And when they rise to pray, they rise reluctantly, only to be seen and praised by men, remembering God but seldom,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/635","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/635.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/635.mp3"]}},{"no":143,"arab":"مُذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَا إِلَىٰ هَٰؤُلَاءِ وَلَا إِلَىٰ هَٰؤُلَاءِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا","latin":"mudzabdzabiina bayna dzaalika laa ilaa haaulaa-i walaa ilaa haaulaa-i waman yudhlili allaahu falan tajida lahu sabiilaan","translate":{"id":"Mereka dalam keadaan ragu-ragu antara yang demikian (iman atau kafir): tidak masuk kepada golongan ini (orang-orang beriman) dan tidak (pula) kepada golongan itu (orang-orang kafir) , maka kamu sekali-kali tidak akan mendapat jalan (untuk memberi petunjuk) baginya.\n","en":"wavering be­tween this and that, [true] neither to these nor those. But for him whom God lets go astray thou canst never find any way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/636","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/636.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/636.mp3"]}},{"no":144,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَتُرِيدُونَ أَنْ تَجْعَلُوا لِلَّهِ عَلَيْكُمْ سُلْطَانًا مُبِينًا","latin":"yaa ayyuhaa alladziina aamanuu laa tattakhidzuu alkaafiriina awliyaa-a min duuni almu/miniina aturiiduuna an taj'aluu lillaahi 'alaykum sulthaanan mubiinaan","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang kafir menjadi wali dengan meninggalkan orang-orang mu'min. Inginkah kamu mengadakan alasan yang nyata bagi Allah (untuk menyiksamu) ?\n","en":"O you who have attained to faith! Do not take the deniers of the truth for your allies in preference to the believers! Do you want to place before God a manifest proof of your guilt?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/637","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/637.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/637.mp3"]}},{"no":145,"arab":"إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَنْ تَجِدَ لَهُمْ نَصِيرًا","latin":"inna almunaafiqiina fii alddarki al-asfali mina alnnaari walan tajida lahum nashiiraan","translate":{"id":"Sesungguhnya orang-orang munafik itu (ditempatkan) pada tingkatan yang paling bawah dari neraka. Dan kamu sekali-kali tidak akan mendapat seorang penolongpun bagi mereka.\n","en":"Verily, the hypocrites shall be in the lowest depth of the fire, and thou wilt find none who could succour them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/638","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/638.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/638.mp3"]}},{"no":146,"arab":"إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ فَأُولَٰئِكَ مَعَ الْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا","latin":"illaa alladziina taabuu wa-ashlahuu wai'tashamuu biallaahi wa-akhlashuu diinahum lillaahi faulaa-ika ma'a almu/miniina wasawfa yu/ti allaahu almu/miniina ajran 'azhiimaan","translate":{"id":"Kecuali orang-orang yang taubat dan mengadakan perbaikan dan berpegang teguh pada (agama) Allah dan tulus ikhlas (mengerjakan) agama mereka karena Allah. Maka mereka itu adalah bersama-sama orang yang beriman dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar.\n","en":"But excepted shall be they who repent, and live righteously, and hold fast unto God, and grow sincere in their faith in God alone: for these shall be one with the believers - and in time God will grant to all believers a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/639","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/639.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/639.mp3"]}},{"no":147,"arab":"مَا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِنْ شَكَرْتُمْ وَآمَنْتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا","latin":"maa yaf'alu allaahu bi'adzaabikum in syakartum waaamantum wakaana allaahu syaakiran 'aliimaan","translate":{"id":"Mengapa Allah akan menyiksamu, jika kamu bersyukur dan beriman ? Dan Allah adalah Maha Mensyukuri lagi Maha Mengetahui.\n","en":"Why would God cause you to suffer [for your past sins] if you are grateful and attain to belief - seeing that God is always responsive to gratitude, all-knowing?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/640","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/640.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/640.mp3"]}},{"no":148,"arab":"لَا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَنْ ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا","latin":"laa yuhibbu allaahu aljahra bialssuu-i mina alqawli illaa man zhulima wakaana allaahu samii'an 'aliimaan","translate":{"id":"Allah tidak menyukai ucapan buruk , (yang diucapkan) dengan terus terang kecuali oleh orang yang dianiaya . Allah adalah Maha Mendengar lagi Maha Mengetahui.\n","en":"God does not like any evil to be mentioned openly, unless it be by him who has been wronged (thereby) And God is indeed all-hearing, all-knowing,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/641","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/641.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/641.mp3"]}},{"no":149,"arab":"إِنْ تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَنْ سُوءٍ فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا","latin":"in tubduu khayran aw tukhfuuhu aw ta'fuu 'an suu-in fa-inna allaaha kaana 'afuwwan qadiiraan","translate":{"id":"Jika kamu melahirkan sesuatu kebaikan atau menyembunyikan atau memaafkan sesuatu kesalahan (orang lain), maka sesungguhnya Allah Maha Pema'af lagi Maha Kuasa.\n","en":"whether you do good openly or in secret, or pardon others for evil [done unto you]: for, behold, God is indeed an absolver of sins, infinite in His power."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/642","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/642.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/642.mp3"]}},{"no":150,"arab":"إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ أَنْ يُفَرِّقُوا بَيْنَ اللَّهِ وَرُسُلِهِ وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ وَنَكْفُرُ بِبَعْضٍ وَيُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذَٰلِكَ سَبِيلًا","latin":"inna alladziina yakfuruuna biallaahi warusulihi wayuriiduuna an yufarriquu bayna allaahi warusulihi wayaquuluuna nu/minu biba'dhin wanakfuru biba'dhin wayuriiduuna an yattakhidzuu bayna dzaalika sabiilaan","translate":{"id":"Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-rasul-Nya, dan bermaksud memperbedakan antara (keimanan kepada) Allah dan rasul-rasul-Nya, dengan mengatakan : \"Kami beriman kepada yang sebahagian dan kami kafir terhadap sebahagian (yang lain)\", serta bermaksud (dengan perkataan itu) mengambil jalan (tengah) di antara yang demikian (iman atau kafir),\n","en":"VERILY, those who deny God and His apostles by endeavouring to make a distinction between [belief in] God and [belief in] His apostles, and who say, \"We believe in the one but we deny the other,\" and want to pursue a path in-between -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/643","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/643.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/643.mp3"]}},{"no":151,"arab":"أُولَٰئِكَ هُمُ الْكَافِرُونَ حَقًّا ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا","latin":"ulaa-ika humu alkaafiruuna haqqan wa-a'tadnaa lilkaafiriina 'adzaaban muhiinaan","translate":{"id":"merekalah orang-orang yang kafir sebenar-benarnya. Kami telah menyediakan untuk orang-orang yang kafir itu siksaan yang menghinakan.\n","en":"it is they, they who are truly denying the truth: and for those who deny the truth We have readied shameful suffering."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/644","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/644.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/644.mp3"]}},{"no":152,"arab":"وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ مِنْهُمْ أُولَٰئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","latin":"waalladziina aamanuu biallaahi warusulihi walam yufarriquu bayna ahadin minhum ulaa-ika sawfa yu/tiihim ujuurahum wakaana allaahu ghafuuran rahiimaan","translate":{"id":"Orang-orang yang beriman kepada Allah dan para rasul-Nya dan tidak membeda-bedakan seorangpun di antara mereka, kelak Allah akan memberikan kepada mereka pahalanya. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.\n","en":"But as for those who believe in God and His apostles and make no distinction between any of them - unto them, in time, will He grant their re­wards [in full]. And God is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/645","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/645.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/645.mp3"]}},{"no":153,"arab":"يَسْأَلُكَ أَهْلُ الْكِتَابِ أَنْ تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِنَ السَّمَاءِ ۚ فَقَدْ سَأَلُوا مُوسَىٰ أَكْبَرَ مِنْ ذَٰلِكَ فَقَالُوا أَرِنَا اللَّهَ جَهْرَةً فَأَخَذَتْهُمُ الصَّاعِقَةُ بِظُلْمِهِمْ ۚ ثُمَّ اتَّخَذُوا الْعِجْلَ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ فَعَفَوْنَا عَنْ ذَٰلِكَ ۚ وَآتَيْنَا مُوسَىٰ سُلْطَانًا مُبِينًا","latin":"yas-aluka ahlu alkitaabi an tunazzila 'alayhim kitaaban mina alssamaa-i faqad sa-aluu muusaa akbara min dzaalika faqaaluu arinaa allaaha jahratan fa-akhadzat-humu alshshaa'iqatu bizhulmihim tsumma ittakhadzuu al'ijla min ba'di maa jaa-at-humu albayyinaatu fa'afawnaa 'an dzaalika waaataynaa muusaa sulthaanan mubiinaan","translate":{"id":"Ahli Kitab meminta kepadamu agar kamu menurunkan kepada mereka sebuah Kitab dari langit. Maka sesungguhnya mereka telah meminta kepada Musa yang lebih besar dari itu. Mereka berkata : \"Perlihatkanlah Allah kepada kami dengan nyata\". Maka mereka disambar petir karena kezalimannya, dan mereka menyembah anak sapi , sesudah datang kepada mereka bukti-bukti yang nyata, lalu Kami ma'afkan (mereka) dari yang demikian. Dan telah Kami berikan kepada Musa keterangan yang nyata.\n","en":"THE FOLLOWERS of the Old Testament demand of thee [O Prophet] that thou cause a revelation to be sent down to them from heaven. And an even greater thing than this did they demand of Moses when they said, \"Make us see God face to face\" - whereupon the thunderbolt of punishment overtook them for this their wickedness. After that, they took to worshipping the [golden] calf - and this after all evidence of the truth had come unto them! None the less, We effaced this [sin of theirs], and vouchsafed unto Moses a clear proof [of the truth],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/646","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/646.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/646.mp3"]}},{"no":154,"arab":"وَرَفَعْنَا فَوْقَهُمُ الطُّورَ بِمِيثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَقُلْنَا لَهُمْ لَا تَعْدُوا فِي السَّبْتِ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا","latin":"warafa'naa fawqahumu alththhuura bimiitsaaqihim waqulnaa lahumu udkhuluu albaaba sujjadan waqulnaa lahum laa ta'duu fii alssabti wa-akhadznaa minhum miitsaaqan ghaliizhaan","translate":{"id":"Dan telah Kami angkat ke atas (kepala) mereka bukit Thursina untuk (menerima) perjanjian (yang telah Kami ambil dari) mereka. Dan kami perintahkan kepada mereka : \"Masuklah pintu gerbang itu sambil bersujud \", dan Kami perintahkan (pula) kepada mereka : \"Janganlah kamu melanggar peraturan mengenai hari Sabtu \", dan Kami telah mengambil dari mereka perjanjian yang kokoh.\n","en":"raising Mount Sinai high above them in witness of their solemn pledge. And We said unto them, “Enter the gate humbly”; and We told them, \"Do not break the Sabbath-law\"; and We accepted from them a most solemn pledge."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/647","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/647.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/647.mp3"]}},{"no":155,"arab":"فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ وَكُفْرِهِمْ بِآيَاتِ اللَّهِ وَقَتْلِهِمُ الْأَنْبِيَاءَ بِغَيْرِ حَقٍّ وَقَوْلِهِمْ قُلُوبُنَا غُلْفٌ ۚ بَلْ طَبَعَ اللَّهُ عَلَيْهَا بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا","latin":"fabimaa naqdhihim miitsaaqahum wakufrihim bi-aayaati allaahi waqatlihimu al-anbiyaa-a bighayri haqqin waqawlihim quluubunaa ghulfun bal thaba'a allaahu 'alayhaa bikufrihim falaa yu/minuuna illaa qaliilaan","translate":{"id":"Maka (Kami lakukan terhadap mereka beberapa tindakan) , disebabkan mereka melanggar perjanjian itu, dan karena kekafiran mereka terhadap keterangan-keterangan Allah dan mereka membunuh nabi-nabi tanpa (alasan) yang benar dan mengatakan : \"Hati kami tertutup.\" Bahkan, sebenarnya Allah telah mengunci mati hati mereka karena kekafirannya, karena itu mereka tidak beriman kecuali sebahagian kecil dari mereka.\n","en":"And so, [We punished them] for the break­ing of their pledge, and their refusal to acknowledge God's messages, and their slaying of prophets against all right, and their boast, \"Our hearts are already full of knowledge\"- nay, but God has sealed their hearts in result of their denial of the truth, and [now] they believe in but few things -;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/648","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/648.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/648.mp3"]}},{"no":156,"arab":"وَبِكُفْرِهِمْ وَقَوْلِهِمْ عَلَىٰ مَرْيَمَ بُهْتَانًا عَظِيمًا","latin":"wabikufrihim waqawlihim 'alaa maryama buhtaanan 'azhiimaan","translate":{"id":"Dan karena kekafiran mereka (terhadap 'Isa) dan tuduhan mereka terhadap Maryam dengan kedustaan besar (zina),\n","en":"and for their refusal to acknowledge the truth, and the awesome calumny which they utter against Mary,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/649","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/649.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/649.mp3"]}},{"no":157,"arab":"وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِنْ شُبِّهَ لَهُمْ ۚ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِنْهُ ۚ مَا لَهُمْ بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًا","latin":"waqawlihim innaa qatalnaa almasiiha 'iisaa ibna maryama rasuula allaahi wamaa qataluuhu wamaa shalabuuhu walaakin syubbiha lahum wa-inna alladziina ikhtalafuu fiihi lafii syakkin minhu maa lahum bihi min 'ilmin illaa ittibaa'a alzhzhanni wamaa qataluuhu yaqiinaan","translate":{"id":"dan karena ucapan mereka : \"Sesungguhnya kami telah membunuh Al Masih, 'Isa putra Maryam, Rasul Allah \", padahal mereka tidak membunuhnya dan tidak (pula) menyalibnya, tetapi (yang mereka bunuh ialah) orang yang diserupakan dengan 'Isa bagi mereka. Sesungguhnya orang-orang yang berselisih paham tentang (pembunuhan) 'Isa, benar-benar dalam keragu-raguan tentang yang dibunuh itu. Mereka tidak mempunyai keyakinan tentang siapa yang dibunuh itu, kecuali mengikuti persangkaan belaka, mereka tidak (pula) yakin bahwa yang mereka bunuh itu adalah 'Isa.\n","en":"and their boast, \"Behold, we have slain the Christ Jesus, son of Mary, [who claimed to be] an apostle of God!\" However, they did not slay him, and neither did they crucify him, but it only seemed to them [as if it had been] so; and, verily, those who hold conflict­ing views thereon are indeed confused, having no [real] knowledge thereof, and following mere con­jecture. For, of a certainty, they did not slay him:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/650","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/650.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/650.mp3"]}},{"no":158,"arab":"بَلْ رَفَعَهُ اللَّهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","latin":"bal rafa'ahu allaahu ilayhi wakaana allaahu 'aziizan hakiimaan","translate":{"id":"Tetapi (yang sebenarnya), Allah telah mengangkat 'Isa kepada-Nya . Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"nay, God exalted him unto Himself - and God is indeed almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/651","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/651.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/651.mp3"]}},{"no":159,"arab":"وَإِنْ مِنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ ۖ وَيَوْمَ الْقِيَامَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا","latin":"wa-in min ahli alkitaabi illaa layu/minanna bihi qabla mawtihi wayawma alqiyaamati yakuunu 'alayhim syahiidaan","translate":{"id":"Tidak ada seorangpun dari Ahli Kitab, kecuali akan beriman kepadanya ('Isa) sebelum kematiannya . Dan di hari kiamat nanti 'Isa itu akan menjadi saksi terhadap mereka.\n","en":"Yet there is not one of the followers of earlier revelation who does not, at the moment of his death, grasp the truth about Jesus; and on the Day of Resurrection he [himself] shall bear witness to the truth against them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/652","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/652.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/652.mp3"]}},{"no":160,"arab":"فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيلِ اللَّهِ كَثِيرًا","latin":"fabizhulmin mina alladziina haaduu harramnaa 'alayhim thayyibaatin uhillat lahum wabishaddihim 'an sabiili allaahi katsiiraan","translate":{"id":"Maka disebabkan kezaliman orang-orang Yahudi, kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka, dan karena mereka banyak menghalangi (manusia) dari jalan Allah,\n","en":"So, then, for the wickedness committed by those who followed the Jewish faith did We deny unto them certain of the good things of life which [aforetime] had been allowed to them; and [We did this] for their having so often turned away from the path of God,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/653","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/653.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/653.mp3"]}},{"no":161,"arab":"وَأَخْذِهِمُ الرِّبَا وَقَدْ نُهُوا عَنْهُ وَأَكْلِهِمْ أَمْوَالَ النَّاسِ بِالْبَاطِلِ ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ مِنْهُمْ عَذَابًا أَلِيمًا","latin":"wa-akhdzihimu alrribaa waqad nuhuu 'anhu wa-aklihim amwaala alnnaasi bialbaathili wa-a'tadnaa lilkaafiriina minhum 'adzaaban aliimaan","translate":{"id":"dan disebabkan mereka memakan riba, padahal sesungguhnya mereka telah dilarang daripadanya, dan karena mereka memakan harta benda orang dengan jalan yang batil. Kami telah menyediakan untuk orang-orang yang kafir di antara mereka itu siksa yang pedih.\n","en":"and [for] their taking usury although it had been forbidden to them, and their wrongful devouring of other people's possessions. And for those from among them who [continue to] deny the truth We have readied grievous suffering."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/654","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/654.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/654.mp3"]}},{"no":162,"arab":"لَٰكِنِ الرَّاسِخُونَ فِي الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُونَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ ۚ وَالْمُقِيمِينَ الصَّلَاةَ ۚ وَالْمُؤْتُونَ الزَّكَاةَ وَالْمُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أُولَٰئِكَ سَنُؤْتِيهِمْ أَجْرًا عَظِيمًا","latin":"laakini alrraasikhuuna fii al'ilmi minhum waalmu/minuuna yu/minuuna bimaa unzila ilayka wamaa unzila min qablika waalmuqiimiina alshshalaata waalmu/tuuna alzzakaata waalmu/minuuna biallaahi waalyawmi al-aakhiri ulaa-ika sanu/tiihim ajran 'azhiimaan","translate":{"id":"Tetapi orang-orang yang mendalam ilmunya di antara mereka dan orang-orang mu'min, mereka beriman kepada apa yang telah diturunkan kepadamu (Al Qur'an), dan apa yang telah diturunkan sebelummu dan orang-orang yang mendirikan shalat, menunaikan zakat, dan yang beriman kepada Allah dan hari kemudian. Orang-orang itulah yang akan Kami berikan kepada mereka pahala yang besar.\n","en":"But as for those from among them who are deeply rooted in knowledge, and the believers who believe in that which has been bestowed upon thee from on high as well as that which was bestowed from on high before thee, and those who are [es­pecially] constant in prayer, and spend in charity, and all who believe in God and the Last Day - these it is unto whom We shall grant a mighty reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/655","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/655.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/655.mp3"]}},{"no":163,"arab":"إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَىٰ نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ ۚ وَأَوْحَيْنَا إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَىٰ وَأَيُّوبَ وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ ۚ وَآتَيْنَا دَاوُودَ زَبُورًا","latin":"innaa awhaynaa ilayka kamaa awhaynaa ilaa nuuhin waalnnabiyyiina min ba'dihi wa-awhaynaa ilaa ibraahiima wa-ismaa'iila wa-ishaaqa waya'quuba waal-asbaathi wa'iisaa wa-ayyuuba wayuunusa wahaaruuna wasulaymaana waaataynaa daawuuda zabuuraan","translate":{"id":"Sesungguhnya Kami telah memberikan wahyu kepadamu sebagaimana Kami telah memberikan wahyu kepada Nuh dan nabi-nabi yang kemudiannya, dan Kami telah memberikan wahyu (pula) kepada Ibrahim, Isma'il, Ishak, Ya'qub dan anak cucunya, 'Isa, Ayyub, Yunus, Harun dan Sulaiman. Dan Kami berikan Zabur kepada Daud.\n","en":"BEHOLD, We have inspired thee [O Prophet] just as We inspired Noah and all the prophets after him - as We inspired Abraham, and Ishmael, and Isaac, and Jacob, and their descendants, including Jesus and Job, and Jonah, and Aaron, and Solomon; and as We vouchsafed unto David a book of divine wisdom;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/656","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/656.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/656.mp3"]}},{"no":164,"arab":"وَرُسُلًا قَدْ قَصَصْنَاهُمْ عَلَيْكَ مِنْ قَبْلُ وَرُسُلًا لَمْ نَقْصُصْهُمْ عَلَيْكَ ۚ وَكَلَّمَ اللَّهُ مُوسَىٰ تَكْلِيمًا","latin":"warusulan qad qashashnaahum 'alayka min qablu warusulan lam naqshushhum 'alayka wakallama allaahu muusaa takliimaan","translate":{"id":"Dan (Kami telah mengutus) rasul-rasul yang sungguh telah Kami kisahkan tentang mereka kepadamu dahulu, dan rasul-rasul yang tidak Kami kisahkan tentang mereka kepadamu. Dan Allah telah berbicara kepada Musa dengan langsung .\n","en":"and as [We inspired other] apostles whom We have mentioned to thee ere this, as well as apostles whom We have not mentioned to thee; and as God spoke His word unto Moses:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/657","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/657.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/657.mp3"]}},{"no":165,"arab":"رُسُلًا مُبَشِّرِينَ وَمُنْذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا","latin":"rusulan mubasysyiriina wamundziriina li-allaa yakuuna lilnnaasi 'alaa allaahi hujjatun ba'da alrrusuli wakaana allaahu 'aziizan hakiimaan","translate":{"id":"(Mereka Kami utus) selaku rasul-rasul pembawa berita gembira dan pemberi peringatan agar supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya rasul-rasul itu. Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"[We sent all these] apostles as heralds of glad tidings and as warners, so that men might have no excuse before God after [the coming of] these apostles: and God is indeed al­mighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/658","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/658.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/658.mp3"]}},{"no":166,"arab":"لَٰكِنِ اللَّهُ يَشْهَدُ بِمَا أَنْزَلَ إِلَيْكَ ۖ أَنْزَلَهُ بِعِلْمِهِ ۖ وَالْمَلَائِكَةُ يَشْهَدُونَ ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا","latin":"laakini allaahu yasyhadu bimaa anzala ilayka anzalahu bi'ilmihi waalmalaa-ikatu yasyhaduuna wakafaa biallaahi syahiidaan","translate":{"id":"(Mereka tidak mau mengakui yang diturunkan kepadamu itu), tetapi Allah mengakui Al Qur'an yang diturunkan-Nya kepadamu. Allah menurunkannya dengan ilmu-Nya; dan malaikat-malaikat pun menjadi saksi (pula). Cukuplah Allah yang mengakuinya.\n","en":"However it be, God [Himself] bears witness to the truth of what He has bestowed from on high upon thee: out of His own wisdom has He bestowed it from on high, with the angels bearing witness thereto - although none can bear witness as God does."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/659","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/659.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/659.mp3"]}},{"no":167,"arab":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ قَدْ ضَلُّوا ضَلَالًا بَعِيدًا","latin":"inna alladziina kafaruu washadduu 'an sabiili allaahi qad dhalluu dhalaalan ba'iidaan","translate":{"id":"Sesungguhnya orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah, benar-benar telah sesat sejauh-jauhnya.\n","en":"Behold, those who are bent on denying the truth and on turning others away from the path of God have indeed gone far astray."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/660","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/660.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/660.mp3"]}},{"no":168,"arab":"إِنَّ الَّذِينَ كَفَرُوا وَظَلَمُوا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا","latin":"inna alladziina kafaruu wazhalamuu lam yakuni allaahu liyaghfira lahum walaa liyahdiyahum thariiqaan","translate":{"id":"Sesungguhnya orang-orang yang kafir dan melakukan kezaliman, Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka,\n","en":"Behold, those who are bent on denying the truth and on evildoing - God will indeed not forgive them, nor will He guide them onto any road"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/661","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/661.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/661.mp3"]}},{"no":169,"arab":"إِلَّا طَرِيقَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا","latin":"illaa thariiqa jahannama khaalidiina fiihaa abadan wakaana dzaalika 'alaa allaahi yasiiraan","translate":{"id":"kecuali jalan ke neraka Jahannam; mereka kekal di dalamnya selama-lamanya. Dan yang demikian itu adalah mudah bagi Allah.\n","en":"but the road that leads to hell, therein to abide beyond the count of time: and this is indeed easy for God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/662","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/662.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/662.mp3"]}},{"no":170,"arab":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ بِالْحَقِّ مِنْ رَبِّكُمْ فَآمِنُوا خَيْرًا لَكُمْ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا","latin":"yaa ayyuhaa alnnaasu qad jaa-akumu alrrasuulu bialhaqqi min rabbikum faaaminuu khayran lakum wa-in takfuruu fa-inna lillaahi maa fii alssamaawaati waal-ardhi wakaana allaahu 'aliiman hakiimaan","translate":{"id":"Wahai manusia, sesungguhnya telah datang Rasul (Muhammad) itu kepadamu dengan (membawa) kebenaran dari Tuhanmu, maka berimanlah kamu, itulah yang lebih baik bagimu. Dan jika kamu kafir, (maka kekafiran itu tidak merugikan Allah sedikitpun) karena sesungguhnya apa yang di langit dan di bumi itu adalah kepunyaan Allah . Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.\n","en":"O mankind! The Apostle has now come unto you with the truth from your Sustainer: believe, then, for your own good! And if you deny the truth - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed all-knowing, wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/663","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/663.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/663.mp3"]}},{"no":171,"arab":"يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَىٰ مَرْيَمَ وَرُوحٌ مِنْهُ ۖ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ ۖ وَلَا تَقُولُوا ثَلَاثَةٌ ۚ انْتَهُوا خَيْرًا لَكُمْ ۚ إِنَّمَا اللَّهُ إِلَٰهٌ وَاحِدٌ ۖ سُبْحَانَهُ أَنْ يَكُونَ لَهُ وَلَدٌ ۘ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَكَفَىٰ بِاللَّهِ وَكِيلًا","latin":"yaa ahla alkitaabi laa taghluu fii diinikum walaa taquuluu 'alaa allaahi illaa alhaqqa innamaa almasiihu 'iisaa ibnu maryama rasuulu allaahi wakalimatuhu alqaahaa ilaa maryama waruuhun minhu faaaminuu biallaahi warusulihi walaa taquuluu tsalaatsatun intahuu khayran lakum innamaa allaahu ilaahun waahidun subhaanahu an yakuuna lahu waladun lahu maa fii alssamaawaati wamaa fii al-ardhi wakafaa biallaahi wakiilaan","translate":{"id":"Wahai Ahli Kitab, janganlah kamu melampaui batas dalam agamamu , dan janganlah kamu mengatakan terhadap Allah kecuali yang benar. Sesungguhnya Al Masih, 'Isa putera Maryam itu, adalah utusan Allah dan (yang diciptakan dengan) kalimat-Nya yang disampaikan-Nya kepada Maryam, dan (dengan tiupan) roh dari-Nya . Maka berimanlah kamu kepada Allah dan rasul-rasul-Nya dan janganlah kamu mengatakan : \"(Tuhan itu) tiga\", berhentilah (dari ucapan itu). (Itu) lebih baik bagimu. Sesungguhnya Allah Tuhan Yang Maha Esa, Maha Suci Allah dari mempunyai anak, segala yang di langit dan di bumi adalah kepunyaan-Nya. Cukuplah Allah menjadi Pemelihara.\n","en":"O FOLLOWERS of the Gospel! Do not overstep the bounds [of truth] in your religious beliefs, and do not say of God anything but the truth. The Christ Jesus, son of Mary, was but God's Apostle - [the fulfilment of] His promise which He had conveyed unto Mary - and a soul created by Him. Believe, then, in God and His apostles, and do not say, \"[God is] a trinity\". Desist [from this assertion] for your own good. God is but One God; utterly remote is He, in His glory, from having a son: unto Him belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/664","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/664.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/664.mp3"]}},{"no":172,"arab":"لَنْ يَسْتَنْكِفَ الْمَسِيحُ أَنْ يَكُونَ عَبْدًا لِلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ ۚ وَمَنْ يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا","latin":"lan yastankifa almasiihu an yakuuna 'abdan lillaahi walaa almalaa-ikatu almuqarrabuuna waman yastankif 'an 'ibaadatihi wayastakbir fasayahsyuruhum ilayhi jamii'aan","translate":{"id":"Al Masih sekali-kali tidak enggan menjadi hamba bagi Allah, dan tidak (pula enggan) malaikat-malaikat yang terdekat (kepada Allah) . Barangsiapa yang enggan dari menyembah-Nya, dan menyombongkan diri, nanti Allah akan mengumpulkan mereka semua kepada-Nya.\n","en":"Never did the Christ feel too proud to be God's servant, nor do the angels who are near unto Him. And those who feel too proud to serve Him and glory in their arrogance [should know that on Judgment Day] He will gather them all unto Himself:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/665","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/665.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/665.mp3"]}},{"no":173,"arab":"فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُمْ مِنْ فَضْلِهِ ۖ وَأَمَّا الَّذِينَ اسْتَنْكَفُوا وَاسْتَكْبَرُوا فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا وَلَا يَجِدُونَ لَهُمْ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا","latin":"fa-ammaa alladziina aamanuu wa'amiluu alshshaalihaati fayuwaffiihim ujuurahum wayaziiduhum min fadhlihi wa-ammaa alladziina istankafuu waistakbaruu fayu'adzdzibuhum 'adzaaban aliiman walaa yajiduuna lahum min duuni allaahi waliyyan walaa nashiiraan","translate":{"id":"Adapun orang-orang yang beriman dan berbuat amal saleh, maka Allah akan menyempurnakan pahala mereka dan menambah untuk mereka sebagian dari karunia-Nya. Adapun orang-orang yang enggan dan menyombongkan diri, maka Allah akan menyiksa mereka dengan siksaan yang pedih, dan mereka tidak akan memperoleh bagi diri mereka, pelindung dan penolong selain dari pada Allah.\n","en":"whereupon unto those who attained to faith and did good deeds He will grant their just rewards, and give them yet more out of His bounty; whereas those who felt too proud and gloried in their arrogance He will chastise with grievous suffering: and they shall find none to protect them from God, and none to bring them succour."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/666","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/666.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/666.mp3"]}},{"no":174,"arab":"يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمْ بُرْهَانٌ مِنْ رَبِّكُمْ وَأَنْزَلْنَا إِلَيْكُمْ نُورًا مُبِينًا","latin":"yaa ayyuhaa alnnaasu qad jaa-akum burhaanun min rabbikum wa-anzalnaa ilaykum nuuran mubiinaan","translate":{"id":"Hai manusia, sesungguhnya telah datang kepadamu bukti kebenaran dari Tuhanmu. (Muhammad dengan mu'jizatnya) dan telah Kami turunkan kepadamu cahaya yang terang benderang (Al Qur'an).\n","en":"O MANKIND! A manifestation of the truth has now come unto you from your Sustainer, and We have sent down unto you a clear light."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/667","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/667.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/667.mp3"]}},{"no":175,"arab":"فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ وَاعْتَصَمُوا بِهِ فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِنْهُ وَفَضْلٍ وَيَهْدِيهِمْ إِلَيْهِ صِرَاطًا مُسْتَقِيمًا","latin":"fa-ammaa alladziina aamanuu biallaahi wai'tashamuu bihi fasayudkhiluhum fii rahmatin minhu wafadhlin wayahdiihim ilayhi shiraathan mustaqiimaan","translate":{"id":"Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepada (agama)-Nya niscaya Allah akan memasukkan mereka ke dalam rahmat yang besar dari-Nya (surga) dan limpahan karunia-Nya. Dan menunjuki mereka kepada jalan yang lurus (untuk sampai) kepada-Nya.\n","en":"And as for those who have attained to faith in God and hold fast unto Him - He will enfold them within His grace and bounty, and guide them unto Himself by a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/668","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/668.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/668.mp3"]}},{"no":176,"arab":"يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَ ۚ وَهُوَ يَرِثُهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ ۚ فَإِنْ كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثَانِ مِمَّا تَرَكَ ۚ وَإِنْ كَانُوا إِخْوَةً رِجَالًا وَنِسَاءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ ۗ يُبَيِّنُ اللَّهُ لَكُمْ أَنْ تَضِلُّوا ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"yastaftuunaka quli allaahu yuftiikum fii alkalaalati ini imruun halaka laysa lahu waladun walahu ukhtun falahaa nishfu maa taraka wahuwa yaritsuhaa in lam yakun lahaa waladun fa-in kaanataa itsnatayni falahumaa altstsulutsaani mimmaa taraka wa-in kaanuu ikhwatan rijaalan wanisaa-an falildzdzakari mitslu hazhzhi aluntsayayni yubayyinu allaahu lakum an tadhilluu waallaahu bikulli syay-in 'aliimunyastaftuunaka quli allaahu yuftiikum fii alkalaalati ini imruun halaka laysa lahu waladun walahu ukhtun falahaa nishfu maa taraka wahuwa yaritsuhaa in lam yakun lahaa waladun fa-in kaanataa itsnatayni falahumaa altstsulutsaani mimmaa taraka wa-in kaanuu ikhwatan rijaalan wanisaa-an falildzdzakari mitslu hazhzhi aluntsayayni yubayyinu allaahu lakum an tadhilluu waallaahu bikulli syay-in 'aliimun","translate":{"id":"Mereka meminta fatwa kepadamu (tentang kalalah) . Katakanlah : \"Allah memberi fatwa kepadamu tentang kalalah (yaitu) : jika seorang meninggal dunia, dan ia tidak mempunyai anak dan mempunyai saudara perempuan, maka bagi saudaranya yang perempuan itu seperdua dari harta yang ditinggalkannya, dan saudaranya yang laki-laki mempusakai (seluruh harta saudara perempuan), jika ia tidak mempunyai anak; tetapi jika saudara perempuan itu dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal. Dan jika mereka (ahli waris itu terdiri dari) saudara-saudara laki dan perempuan, maka bahagian seorang saudara laki-laki sebanyak bahagian dua orang saudara perempuan. Allah menerangkan (hukum ini) kepadamu, supaya kamu tidak sesat. Dan Allah Maha Mengetahui segala sesuatu.\n","en":"THEY WILL ASK thee to enlighten them. Say: \"God enlightens you [thus] about the laws concerning [inheritance from] those who leave no heir in the direct line: If a man dies childless and has a sister, she shall inherit one-half of what he has left, just as he shall inherit from her if she dies childless. But if there are two sisters, both [together] shall have two-thirds of what he has left; and if there are brothers and sisters, then the male shall have the equal of two females' share.\" God makes [all this] clear unto you, lest you go astray; and God knows everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/669","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/669.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/669.mp3"]}}]}