{"alquran":{"no":40,"name":"Al-Ghaafir","arab":"غافر","start":4133,"count":85,"rukku":9,"type":"mecca","description":"Surat Al Mu'min terdiri atas 85 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Az Zumar. Dinamai <i>Al Mu'min</i> (Orang yang beriman), berhubung dengan perkataan <i>mukmin</i> yang terdapat pada ayat 28 surat ini. Pada ayat 28 diterangkan bahwa salah seorang dari kaum Fir'aun telah beriman kepada Nabi Musa a.s. dengan menyembunyikan imannya kepada kaumnya, setelah mendengar keterangan dan melihat mukjizat yang dikemukakan oleh Nabi Musa a.s. Hati kecil orang ini mencela Fir'aun dan kaumnya yang tidak mau beriman kepada Nabi Musa a.s., sekalipun telah dikemukakan keterangan dan mukjizat yang diminta mereka.<br>Dinamakan pula <i>Ghafir</i> (yang mengampuni), karena ada hubungannya dengan kalimat <i>Ghafir</i> yang terdapat pada ayat 3 surat ini. Ayat ini mengingatkan bahwa <i>Maha Pengampun</i> dan <i>Maha Penerima Taubat</i> adalah sebagian dari sifat-sifat Allah, karena itu hamba-hamba Allah tidak usah khawatir terhadap  perbuatan-perbuatan dosa yang telah terlanjur mereka lakukan, semuanya itu akan diampuni Allah asal benar-benar memohon ampun dan bertaubat kepada-Nya dan berjanji tidak akan mengerjakan  perbuatan-perbuatan dosa itu lagi. Dan surat ini dinamai <i>Dzit Thaul</i> (Yang Mempunyai Kurnia) karena perkataan tersebut terdapat pada ayat 3."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim .\n","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4134","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4134.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4134.mp3"]}},{"no":2,"arab":"تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْعَلِيمِ","latin":"tanziilu alkitaabi mina allaahi al'aziizi al'aliimi","translate":{"id":"Diturunkan Kitab ini (Al Qur'an) dari Allah Yang Maha Perkasa lagi Maha Mengetahui,\n","en":"THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the All-Know­ing,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4135","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4135.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4135.mp3"]}},{"no":3,"arab":"غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ذِي الطَّوْلِ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ إِلَيْهِ الْمَصِيرُ","latin":"ghaafiri aldzdzanbi waqaabili alttawbi syadiidi al'iqaabi dzii alththhawli laa ilaaha illaa huwa ilayhi almashiiru","translate":{"id":"Yang Mengampuni dosa dan Menerima taubat lagi keras hukuman-Nya. Yang mempunyai karunia. Tiada Tuhan (yang berhak disembah) selain Dia. Hanya kepada-Nyalah kembali (semua makhluk).\n","en":"forgiving sins and accepting repentance, severe in retribution, limitless in His bounty. There is no deity save Him: with Him is all jour­neys’ end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4136","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4136.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4136.mp3"]}},{"no":4,"arab":"مَا يُجَادِلُ فِي آيَاتِ اللَّهِ إِلَّا الَّذِينَ كَفَرُوا فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِي الْبِلَادِ","latin":"maa yujaadilu fii aayaati allaahi illaa alladziina kafaruu falaa yaghrurka taqallubuhum fii albilaadi","translate":{"id":"Tidak ada yang memperdebatkan tentang ayat-ayat Allah, kecuali orang-orang yang kafir. Karena itu janganlah pulang balik mereka dengan bebas dari suatu kota ke kota yang lain memperdayakan kamu.\n","en":"NONE BUT THOSE who are bent on denying the truth would call God’s messages in question. But let it not deceive thee that they seem to be able to do as they please on earth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4137","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4137.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4137.mp3"]}},{"no":5,"arab":"كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَالْأَحْزَابُ مِنْ بَعْدِهِمْ ۖ وَهَمَّتْ كُلُّ أُمَّةٍ بِرَسُولِهِمْ لِيَأْخُذُوهُ ۖ وَجَادَلُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ فَأَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ","latin":"kadzdzabat qablahum qawmu nuuhin waal-ahzaabu min ba'dihim wahammat kullu ummatin birasuulihim liya/khudzuuhu wajaadaluu bialbaathili liyudhidhuu bihi alhaqqa fa-akhadztuhum fakayfa kaana 'iqaabi","translate":{"id":"Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu sesudah mereka telah mendustakan (rasul) dan tiap-tiap umat telah merencanakan makar terhadap rasul mereka untuk menawannya dan mereka membantah dengan (alasan) yang batil untuk melenyapkan kebenaran dengan yang batil itu; karena itu Aku azab mereka. Maka betapa (pedihnya) azab-Ku?\n","en":"to the truth gave the lie, before their time, the people of Noah and, after them, all those [others] who were leagued together [against God’s message-bearers]; and each of those com­munities schemed against the apostle sent unto them, aiming to lay hands on him; and they contended [against his message] with fallacious arguments, so as to render void the truth thereby: but then I took them to task - and how awesome was My retribution!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4138","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4138.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4138.mp3"]}},{"no":6,"arab":"وَكَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِينَ كَفَرُوا أَنَّهُمْ أَصْحَابُ النَّارِ","latin":"wakadzaalika haqqat kalimatu rabbika 'alaa alladziina kafaruu annahum ash-haabu alnnaari","translate":{"id":"Dan demikianlah telah pasti berlaku ketetapan azab Tuhanmu terhadap orang-orang kafir, karena sesungguhnya mereka adalah penghuni neraka.\n","en":"And thus shall thy Sustainer’s word come true against all who are bent on denying the truth: they shall find themselves in the fire [of hell]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4139","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4139.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4139.mp3"]}},{"no":7,"arab":"الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ","latin":"alladziina yahmiluuna al'arsya waman hawlahu yusabbihuuna bihamdi rabbihim wayu/minuuna bihi wayastaghfiruuna lilladziina aamanuu rabbanaa wasi'ta kulla syay-in rahmatan wa'ilman faighfir lilladziina taabuu waittaba'uu sabiilaka waqihim 'adzaaba aljahiimi","translate":{"id":"(Malaikat-malaikat) yang memikul 'Arsy dan malaikat yang berada di sekelilingnya bertasbih memuji Tuhannya dan mereka beriman kepada-Nya serta memintakan ampun bagi orang-orang yang beriman (seraya mengucapkan): \"Ya Tuhan kami, rahmat dan ilmu Engkau meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertaubat dan mengikuti jalan Engkau dan peliharalah mereka dari siksaan neraka yang menyala-nyala,\n","en":"THEY WHO BEAR [within themselves the knowl­edge of] the throne of [God’s] almightiness, as well as all who are near it, extol their Sustainer’s limitless glory and praise, and have faith in Him, and ask forgiveness for all [others] who have attained to faith: “O our Sustainer! Thou embracest all things within [Thy] grace and knowledge: forgive, then, their sins unto those who repent and follow Thy path, and preserve them from suffering through the blazing fire!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4140","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4140.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4140.mp3"]}},{"no":8,"arab":"رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۚ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ","latin":"rabbanaa wa-adkhilhum jannaati 'adnin allatii wa'adtahum waman shalaha min aabaa-ihim wa-azwaajihim wadzurriyyaatihim innaka anta al'aziizu alhakiimu","translate":{"id":"ya Tuhan kami, dan masukkanlah mereka ke dalam syurga 'and yang telah Engkau janjikan kepada mereka dan orang-orang yang saleh di antara bapak-bapak mereka, dan isteri-isteri mereka, dan keturunan mereka semua. Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana,\n","en":"“And, O our Sustainer, bring them into the gardens of perpetual bliss which Thou hast promised them, together with the righteous from among their forebears, and their spouses, and their offspring - for, verily, Thou alone art almighty, truly wise –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4141","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4141.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4141.mp3"]}},{"no":9,"arab":"وَقِهِمُ السَّيِّئَاتِ ۚ وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","latin":"waqihimu alssayyi-aati waman taqi alssayyi-aati yawma-idzin faqad rahimtahu wadzaalika huwa alfawzu al'azhiimu","translate":{"id":"dan peliharalah mereka dari (balasan) kejahatan. Dan orang-orang yang Engkau pelihara dari (pembalasan) kejahatan pada hari itu maka sesungguhnya telah Engkau anugerahkan rahmat kepadanya dan itulah kemenangan yang besar\".\n","en":"and preserve them from [doing] evil deeds: for anyone whom on that Day [of Judgment] Thou wilt have preserved from [the taint of] evil deeds, him wilt Thou have graced with Thy mercy: and that, that will be the triumph supreme!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4142","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4142.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4142.mp3"]}},{"no":10,"arab":"إِنَّ الَّذِينَ كَفَرُوا يُنَادَوْنَ لَمَقْتُ اللَّهِ أَكْبَرُ مِنْ مَقْتِكُمْ أَنْفُسَكُمْ إِذْ تُدْعَوْنَ إِلَى الْإِيمَانِ فَتَكْفُرُونَ","latin":"inna alladziina kafaruu yunaadawna lamaqtu allaahi akbaru min maqtikum anfusakum idz tud'awna ilaa al-iimaani fatakfuruuna","translate":{"id":"Sesungguhnya orang-orang yang kafir diserukan kepada mereka (pada hari kiamat): \"Sesungguhnya kebencian Allah (kepadamu) lebih besar daripada kebencianmu kepada dirimu sendiri karena kamu diseru untuk beriman lalu kamu kafir\".\n","en":"[But,] behold, as for those who are bent on denying the truth - [on that same Day] a voice will call out unto them: “Indeed, greater than your [present] loathing of yourselves was God’s loathing of you [at the time] when you were called unto faith but went on denying the truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4143","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4143.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4143.mp3"]}},{"no":11,"arab":"قَالُوا رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَىٰ خُرُوجٍ مِنْ سَبِيلٍ","latin":"qaaluu rabbanaa amattanaa itsnatayni wa-ahyaytanaa itsnatayni fai'tarafnaa bidzunuubinaa fahal ilaa khuruujin min sabiilin","translate":{"id":"Mereka menjawab: \"Ya Tuhan kami Engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali (pula), lalu kami mengakui dosa-dosa kami. Maka adakah sesuatu jalan (bagi kami) untuk keluar (dari neraka)?\"\n","en":"[Whereupon] they will exclaim: “O our Sus­tainer! Twice hast Thou caused us to die, just as twice Thou hast brought us to life!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4144","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4144.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4144.mp3"]}},{"no":12,"arab":"ذَٰلِكُمْ بِأَنَّهُ إِذَا دُعِيَ اللَّهُ وَحْدَهُ كَفَرْتُمْ ۖ وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا ۚ فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ","latin":"dzaalikum bi-annahu idzaa du'iya allaahu wahdahu kafartum wa-in yusyrak bihi tu/minuu faalhukmu lillaahi al'aliyyi alkabiiri","translate":{"id":"Yang demikian itu adalah karena kamu kafir apabila Allah saja disembah. Dan kamu percaya apabila Allah dipersekutukan. Maka putusan (sekarang ini) adalah pada Allah Yang Maha Tinggi lagi Maha Besar.\n","en":"[And they will be told:] “This [has befallen you] because, whenever the One God was invoked, you denied this truth; whereas, when divinity was ascribed to aught beside Him, you believed [in it]! But all judgment rests with God, the Exalted, the Great!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4145","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4145.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4145.mp3"]}},{"no":13,"arab":"هُوَ الَّذِي يُرِيكُمْ آيَاتِهِ وَيُنَزِّلُ لَكُمْ مِنَ السَّمَاءِ رِزْقًا ۚ وَمَا يَتَذَكَّرُ إِلَّا مَنْ يُنِيبُ","latin":"huwa alladzii yuriikum aayaatihi wayunazzilu lakum mina alssamaa-i rizqan wamaa yatadzakkaru illaa man yuniibu","translate":{"id":"Dia-lah yang memperlihatkan kepadamu tanda-tanda (kekuasaan)-Nya dan menurunkan untukmu rezki dari langit. Dan tiadalah mendapat pelajaran kecuali orang-orang yang kembali (kepada Allah).\n","en":"HE IT IS who shows you His wonders [in all nature], and sends down sustenance for you from the sky: but none bethinks himself [thereof] save those who are wont to turn to God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4146","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4146.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4146.mp3"]}},{"no":14,"arab":"فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ","latin":"faud'uu allaaha mukhlishiina lahu alddiina walaw kariha alkaafiruuna","translate":{"id":"Maka sembahlah Allah dengan memurnikan ibadat kepada-Nya, meskipun orang-orang kafir tidak menyukai(nya).\n","en":"Invoke, then, God, sincere in your faith in Him alone, however hateful this may be to those who deny the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4147","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4147.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4147.mp3"]}},{"no":15,"arab":"رَفِيعُ الدَّرَجَاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ لِيُنْذِرَ يَوْمَ التَّلَاقِ","latin":"rafii'u alddarajaati dzuu al'arsyi yulqii alrruuha min amrihi 'alaa man yasyaau min 'ibaadihi liyundzira yawma alttalaaqi","translate":{"id":"(Dialah) Yang Maha Tinggi derajat-Nya, Yang mempunyai 'Arsy, Yang mengutus Jibril dengan (membawa) perintah-Nya kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya, supaya dia memperingatkan (manusia) tentang hari pertemuan (hari kiamat).\n","en":"High above all orders [of being] is He, in almightiness enthroned. By His Own will does He bestow inspiration upon whomever He wills of His servants, so as to warn [all human beings of the coming] of the Day when they shall meet Him"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4148","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4148.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4148.mp3"]}},{"no":16,"arab":"يَوْمَ هُمْ بَارِزُونَ ۖ لَا يَخْفَىٰ عَلَى اللَّهِ مِنْهُمْ شَيْءٌ ۚ لِمَنِ الْمُلْكُ الْيَوْمَ ۖ لِلَّهِ الْوَاحِدِ الْقَهَّارِ","latin":"yawma hum baarizuuna laa yakhfaa 'alaa allaahi minhum syay-un limani almulku alyawma lillaahi alwaahidi alqahhaari","translate":{"id":"(Yaitu) hari (ketika) mereka keluar (dari kubur); tiada suatupun dari keadaan mereka yang tersembunyi bagi Allah. (Lalu Allah berfirman): \"Kepunyaan siapakah kerajaan pada hari ini?\" Kepunyaan Allah Yang Maha Esa lagi Maha Mengalahkan.\n","en":"the Day when they shall come forth [from death], with nothing of themselves hidden from God. With whom will sovereignty rest on that Day? With God, the One who holds absolute sway over all that exists!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4149","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4149.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4149.mp3"]}},{"no":17,"arab":"الْيَوْمَ تُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَسَبَتْ ۚ لَا ظُلْمَ الْيَوْمَ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","latin":"alyawma tujzaa kullu nafsin bimaa kasabat laa zhulma alyawma inna allaaha sarii'u alhisaabi","translate":{"id":"Pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya. Tidak ada yang dirugikan pada hari ini. Sesungguhnya Allah amat cepat hisabnya.\n","en":"On that Day will every human being be requited for what he has earned: no wrong [will be done] on that Day: verily, swift in reckoning is God!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4150","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4150.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4150.mp3"]}},{"no":18,"arab":"وَأَنْذِرْهُمْ يَوْمَ الْآزِفَةِ إِذِ الْقُلُوبُ لَدَى الْحَنَاجِرِ كَاظِمِينَ ۚ مَا لِلظَّالِمِينَ مِنْ حَمِيمٍ وَلَا شَفِيعٍ يُطَاعُ","latin":"wa-andzirhum yawma al-aazifati idzi alquluubu ladaa alhanaajiri kaatsimiina maa lilzhzhaalimiina min hamiimin walaa syafii'in yuthaa'u","translate":{"id":"Berilah mereka peringatan dengan hari yang dekat (hari kiamat yaitu) ketika hati (menyesak) sampai di kerongkongan dengan menahan kesedihan. Orang-orang yang zalim tidak mempunyai teman setia seorangpun dan tidak (pula) mempunyai seorang pemberi syafa'at yang diterima syafa'atnya.\n","en":"Hence, warn them of that Day which draws ever nearer, when the hearts will chokingly come up to the throats: no loving friend will the evildoers have, nor any intercessor who would be heeded:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4151","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4151.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4151.mp3"]}},{"no":19,"arab":"يَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَمَا تُخْفِي الصُّدُورُ","latin":"ya'lamu khaa-inata al-a'yuni wamaa tukhfii alshshuduuru","translate":{"id":"Dia mengetahui (pandangan) mata yang khianat dan apa yang disembunyikan oleh hati.\n","en":"[for] He is aware of the [most] stealthy glance, and of all that the hearts would conceal."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4152","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4152.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4152.mp3"]}},{"no":20,"arab":"وَاللَّهُ يَقْضِي بِالْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَقْضُونَ بِشَيْءٍ ۗ إِنَّ اللَّهَ هُوَ السَّمِيعُ الْبَصِيرُ","latin":"waallaahu yaqdhii bialhaqqi waalladziina yad'uuna min duunihi laa yaqdhuuna bisyay-in inna allaaha huwa alssamii'u albashiiru","translate":{"id":"Dan Allah menghukum dengan keadilan. Dan sembahan-sembahan yang mereka sembah selain Allah tiada dapat menghukum dengan sesuatu apapun. Sesungguhnya Allah Dia-lah Yang Maha Mendengar lagi Maha Melihat.\n","en":"And God will judge in accordance with truth and justice, whereas those [beings] whom they invoke beside Him cannot judge at all: for, verily, God alone is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4153","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4153.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4153.mp3"]}},{"no":21,"arab":"أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ كَانُوا مِنْ قَبْلِهِمْ ۚ كَانُوا هُمْ أَشَدَّ مِنْهُمْ قُوَّةً وَآثَارًا فِي الْأَرْضِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ وَمَا كَانَ لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ","latin":"awa lam yasiiruu fii al-ardhi fayanzhuruu kayfa kaana 'aaqibatu alladziina kaanuu min qablihim kaanuu hum asyadda minhum quwwatan waaatsaaran fii al-ardhi fa-akhadzahumu allaahu bidzunuubihim wamaa kaana lahum mina allaahi min waaqin","translate":{"id":"Dan apakah mereka tidak mengadakan perjalanan di muka bumi, lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka. Mereka itu adalah lebih hebat kekuatannya daripada mereka dan (lebih banyak) bekas-bekas mereka di muka bumi {l320}, maka Allah mengazab mereka disebabkan dosa-dosa mereka. Dan mereka tidak mempunyai seorang pelindung dari azab Allah.\n","en":"Have they, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? Greater were they in power than they are, and in the impact which they left on earth: but God took them to task for their sins, and they had none to defend them against God:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4154","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4154.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4154.mp3"]}},{"no":22,"arab":"ذَٰلِكَ بِأَنَّهُمْ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَكَفَرُوا فَأَخَذَهُمُ اللَّهُ ۚ إِنَّهُ قَوِيٌّ شَدِيدُ الْعِقَابِ","latin":"dzaalika bi-annahum kaanat ta/tiihim rusuluhum bialbayyinaati fakafaruu fa-akhadzahumu allaahu innahu qawiyyun syadiidu al'iqaabi","translate":{"id":"Yang demiklan itu adalah karena telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang nyata lalu mereka kafir; maka Allah mengazab mereka. Sesungguhnya Dia Maha Kuat lagi Maha Keras hukuman-Nya.\n","en":"this, because their apostles had come to them with all evidence of the truth, and yet they rejected it: and so God took them to task - for, verily, He is powerful, severe in retribution!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4155","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4155.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4155.mp3"]}},{"no":23,"arab":"وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا وَسُلْطَانٍ مُبِينٍ","latin":"walaqad arsalnaa muusaa bi-aayaatinaa wasulthaanin mubiinin","translate":{"id":"Dan sesungguhnya telah Kami utus Musa dengan membawa ayat-ayat Kami dan keterangan yang nyata,\n","en":"THUS, INDEED, did We send Moses with Our mes­sages and a manifest authority [from Us]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4156","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4156.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4156.mp3"]}},{"no":24,"arab":"إِلَىٰ فِرْعَوْنَ وَهَامَانَ وَقَارُونَ فَقَالُوا سَاحِرٌ كَذَّابٌ","latin":"ilaa fir'awna wahaamaana waqaaruuna faqaaluu saahirun kadzdzaabun","translate":{"id":"kepada Fir'aun, Haman dan Qarun; maka mereka berkata: \"(Ia) adalah seorang ahli sihir yang pendusta\".\n","en":"unto Pharaoh, and Haman, and Qarun; but they [only] said, “A spellbinder is he, a liar!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4157","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4157.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4157.mp3"]}},{"no":25,"arab":"فَلَمَّا جَاءَهُمْ بِالْحَقِّ مِنْ عِنْدِنَا قَالُوا اقْتُلُوا أَبْنَاءَ الَّذِينَ آمَنُوا مَعَهُ وَاسْتَحْيُوا نِسَاءَهُمْ ۚ وَمَا كَيْدُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ","latin":"falammaa jaa-ahum bialhaqqi min 'indinaa qaaluu uqtuluu abnaa-a alladziina aamanuu ma'ahu waistahyuu nisaa-ahum wamaa kaydu alkaafiriina illaa fii dhalaalin","translate":{"id":"Maka tatkala Musa datang kepada mereka membawa kebenaran dari sisi Kami mereka berkata: \"Bunuhlah anak-anak orang-orang yang beriman bersama dengan dia dan biarkanlah hidup wanita-wanita mereka\". Dan tipu daya orang-orang kafir itu tak lain hanyalah sia-sia (belaka).\n","en":"Now [as for Pharaoh and his followers,] when he came to them, setting forth the truth from Us, they said, “Slay the sons of those who share his beliefs, and spare [only] their women!” - but the guile of those deniers of the truth could not lead to aught but failure."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4158","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4158.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4158.mp3"]}},{"no":26,"arab":"وَقَالَ فِرْعَوْنُ ذَرُونِي أَقْتُلْ مُوسَىٰ وَلْيَدْعُ رَبَّهُ ۖ إِنِّي أَخَافُ أَنْ يُبَدِّلَ دِينَكُمْ أَوْ أَنْ يُظْهِرَ فِي الْأَرْضِ الْفَسَادَ","latin":"waqaala fir'awnu dzaruunii aqtul muusaa walyad'u rabbahu innii akhaafu an yubaddila diinakum aw an yuzhhira fii al-ardhi alfasaada","translate":{"id":"Dan berkata Fir'aun (kepada pembesar-pembesarnya): \"Biarkanlah aku membunuh Musa dan hendaklah ia memohon kepada Tuhannya, karena sesungguhnya aku khawatir dia akan menukar agamamu atau menimbulkan kerusakan di muka bumi\".\n","en":"And Pharaoh said: “Leave it to me to slay Moses - and let him invoke his [alleged] sustainer! Behold, I fear lest he cause you to change your religion, or lest he cause corruption to prevail in the land!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4159","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4159.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4159.mp3"]}},{"no":27,"arab":"وَقَالَ مُوسَىٰ إِنِّي عُذْتُ بِرَبِّي وَرَبِّكُمْ مِنْ كُلِّ مُتَكَبِّرٍ لَا يُؤْمِنُ بِيَوْمِ الْحِسَابِ","latin":"waqaala muusaa innii 'udztu birabbii warabbikum min kulli mutakabbirin laa yu/minu biyawmi alhisaabi","translate":{"id":"Dan Musa berkata: \"Sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari berhisab\".\n","en":"But Moses said: “With [Him who is] my Sus­tainer as well as your Sustainer have I indeed found refuge from everyone who, immersed in false pride, will not believe in [the coming of] the Day of Reckon­ing!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4160","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4160.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4160.mp3"]}},{"no":28,"arab":"وَقَالَ رَجُلٌ مُؤْمِنٌ مِنْ آلِ فِرْعَوْنَ يَكْتُمُ إِيمَانَهُ أَتَقْتُلُونَ رَجُلًا أَنْ يَقُولَ رَبِّيَ اللَّهُ وَقَدْ جَاءَكُمْ بِالْبَيِّنَاتِ مِنْ رَبِّكُمْ ۖ وَإِنْ يَكُ كَاذِبًا فَعَلَيْهِ كَذِبُهُ ۖ وَإِنْ يَكُ صَادِقًا يُصِبْكُمْ بَعْضُ الَّذِي يَعِدُكُمْ ۖ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ مُسْرِفٌ كَذَّابٌ","latin":"waqaala rajulun mu/minun min aali fir'awna yaktumu iimaanahu ataqtuluuna rajulan an yaquula rabbiyya allaahu waqad jaa-akum bialbayyinaati min rabbikum wa-in yaku kaadziban fa'alayhi kadzibuhu wa-in yaku shaadiqan yushibkum ba'dhu alladzii ya'idukum inna allaaha laa yahdii man huwa musrifun kadzdzaabun","translate":{"id":"Dan seorang laki-laki yang beriman di antara pengikut-pengikut Fir'aun yang menyembunyikan imannya berkata: \"Apakah kamu akan membunuh seorang laki-laki karena dia menyatakan: \"Tuhanku ialah Allah padahal dia telah datang kepadamu dengan membawa keterangan-keterangan dari Tuhanmu. Dan jika ia seorang pendusta maka dialah yang menanggung (dosa) dustanya itu; dan jika ia seorang yang benar niscaya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu\". Sesungguhnya Allah tidak menunjuki orang-orang yang melampaui batas lagi pendusta.\n","en":"At that, a believing man of Pharaoh’s family, who [until then] had concealed his faith, exclaimed: “Would you slay a man because he says, ‘God is my Sustainer’ - seeing, withal, that he has brought you all evidence of this truth from your Sustainer? Now if he be a liar, his lie will fall back on him; but if he is a man of truth, something [of the punishment] whereof he warns you is bound to befall you: for, verily, God would not grace with His guidance one who has wasted his own self by lying [about Him]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4161","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4161.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4161.mp3"]}},{"no":29,"arab":"يَا قَوْمِ لَكُمُ الْمُلْكُ الْيَوْمَ ظَاهِرِينَ فِي الْأَرْضِ فَمَنْ يَنْصُرُنَا مِنْ بَأْسِ اللَّهِ إِنْ جَاءَنَا ۚ قَالَ فِرْعَوْنُ مَا أُرِيكُمْ إِلَّا مَا أَرَىٰ وَمَا أَهْدِيكُمْ إِلَّا سَبِيلَ الرَّشَادِ","latin":"yaa qawmi lakumu almulku alyawma zhaahiriina fii al-ardhi faman yanshurunaa min ba/si allaahi in jaa-anaa qaala fir'awnu maa uriikum illaa maa araa wamaa ahdiikum illaa sabiila alrrasyaadi","translate":{"id":"(Musa berkata): \"Hai kaumku, untukmulah kerajaan pada hari ini dengan berkuasa di muka bumi. Siapakah yang akan menolong kita dari azab Allah jika azab itu menimpa kita!\" Fir'aun berkata: \"Aku tidak mengemukakan kepadamu, melainkan apa yang aku pandang baik; dan aku tiada menunjukkan kepadamu selain jalan yang benar\".\n","en":"“O my people! Yours is the dominion today, [and] most eminent are you on earth: but who will rescue us from God’s punishment, once it befalls us?” Said Pharaoh: “I but want to make you see what I see myself; and I would never make you follow any path but that of rectitude!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4162","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4162.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4162.mp3"]}},{"no":30,"arab":"وَقَالَ الَّذِي آمَنَ يَا قَوْمِ إِنِّي أَخَافُ عَلَيْكُمْ مِثْلَ يَوْمِ الْأَحْزَابِ","latin":"waqaala alladzii aamana yaa qawmi innii akhaafu 'alaykum mitsla yawmi al-ahzaabi","translate":{"id":"Dan orang yang beriman itu berkata: \"Hai kaumku, sesungguhnya aku khawatir kamu akan ditimpa (bencana) seperti peristiwa kehancuran golongan yang bersekutu.\n","en":"Thereupon exclaimed he who had attained to faith: “O my people! Verily, I fear for you the like of what one day befell those others who were leagued together [against God’s truth] –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4163","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4163.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4163.mp3"]}},{"no":31,"arab":"مِثْلَ دَأْبِ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَالَّذِينَ مِنْ بَعْدِهِمْ ۚ وَمَا اللَّهُ يُرِيدُ ظُلْمًا لِلْعِبَادِ","latin":"mitsla da/bi qawmi nuuhin wa'aadin watsamuuda waalladziina min ba'dihim wamaa allaahu yuriidu zhulman lil'ibaadi","translate":{"id":"(Yakni) seperti keadaan kaum Nuh, 'Aad, Tsamud dan orang-orang yang datang sesudah mereka. Dan Allah tidak menghendaki berbuat kezaliman terhadap hamba-hamba-Nya.\n","en":"the like of what happened to Noah’s people, and to [the tribes of] Ad and Thamud and those who came after them! And, withal, God does not will any wrong for His crea­tures."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4164","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4164.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4164.mp3"]}},{"no":32,"arab":"وَيَا قَوْمِ إِنِّي أَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ","latin":"wayaa qawmi innii akhaafu 'alaykum yawma alttanaadi","translate":{"id":"Hai kaumku, sesungguhnya aku khawatir terhadapmu akan siksaan hari panggil-memanggil {l322}.\n","en":"“And, O my people, I fear for you [the coming of] that Day of [Judgment - the Day when you will be] calling unto one another [in distress] –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4165","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4165.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4165.mp3"]}},{"no":33,"arab":"يَوْمَ تُوَلُّونَ مُدْبِرِينَ مَا لَكُمْ مِنَ اللَّهِ مِنْ عَاصِمٍ ۗ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ","latin":"yawma tuwalluuna mudbiriina maa lakum mina allaahi min 'aasimin waman yudhlili allaahu famaa lahu min haadin","translate":{"id":"(yaitu) hari (ketika) kamu (lari) berpaling ke belakang, tidak ada bagimu seorangpun yang menyelamatkan kamu dari (azab) Allah, dan siapa yang disesatkan Allah, niscaya tidak ada baginya seorangpun yang akan memberi petunjuk.\n","en":"the Day when you will [wish to] turn your backs and flee, having none to defend you against God: for he whom God lets go astray can never find any guide."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4166","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4166.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4166.mp3"]}},{"no":34,"arab":"وَلَقَدْ جَاءَكُمْ يُوسُفُ مِنْ قَبْلُ بِالْبَيِّنَاتِ فَمَا زِلْتُمْ فِي شَكٍّ مِمَّا جَاءَكُمْ بِهِ ۖ حَتَّىٰ إِذَا هَلَكَ قُلْتُمْ لَنْ يَبْعَثَ اللَّهُ مِنْ بَعْدِهِ رَسُولًا ۚ كَذَٰلِكَ يُضِلُّ اللَّهُ مَنْ هُوَ مُسْرِفٌ مُرْتَابٌ","latin":"walaqad jaa-akum yuusufu min qablu bialbayyinaati famaa ziltum fii syakkin mimmaa jaa-akum bihi hattaa idzaa halaka qultum lan yab'atsa allaahu min ba'dihi rasuulan kadzaalika yudhillu allaahu man huwa musrifun murtaabun","translate":{"id":"Dan sesungguhnya telah datang Yusuf kepadamu dengan membawa keterangan-keterangan, tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu, hingga ketika dia meninggal, kamu berkata: \"Allah tidak akan mengirim seorang (rasulpun) sesudahnya. Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu.\n","en":"“And [remember:] it was to you that Joseph came aforetime with all evidence of the truth; but you never ceased to throw doubt on all [the messages] that he brought you - so much so that when he died, you said, ‘Never will God send any apostle [even] after him!’ “In this way God lets go astray such as waste their own selves by throwing suspicion [on His revela­tions] –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4167","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4167.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4167.mp3"]}},{"no":35,"arab":"الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ ۖ كَبُرَ مَقْتًا عِنْدَ اللَّهِ وَعِنْدَ الَّذِينَ آمَنُوا ۚ كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ","latin":"alladziina yujaadiluuna fii aayaati allaahi bighayri sulthaanin ataahum kabura maqtan 'inda allaahi wa'inda alladziina aamanuu kadzaalika yathba'u allaahu 'alaa kulli qalbi mutakabbirin jabbaarin","translate":{"id":"(Yaitu) orang-orang yang memperdebatkan ayat-ayat Allah tanpa alasan yang sampai kepada mereka . Amat besar kemurkaan (bagi mereka) di sisi Allah dan di sisi orang-orang yang beriman. Demikianlah Allah mengunci mati hati orang yang sombong dan sewenang-wenang.\n","en":"such as would call God’s messages in question without having any evidence therefor: [a sin] exceedingly loathsome in the sight of God and of those who have attained to faith. It is in this way that God sets a seal on every arrogant, self-exalting heart.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4168","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4168.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4168.mp3"]}},{"no":36,"arab":"وَقَالَ فِرْعَوْنُ يَا هَامَانُ ابْنِ لِي صَرْحًا لَعَلِّي أَبْلُغُ الْأَسْبَابَ","latin":"waqaala fir'awnu yaa haamaanu ibni lii sharhan la'allii ablughu al-asbaaba","translate":{"id":"Dan berkatalah Fir'aun: \"Hai Haman, buatkanlah bagiku sebuah bangunan yang tinggi supaya aku sampai ke pintu-pintu,\n","en":"But Pharaoh said: “O Haman! Build me a lofty tower, that haply I may attain to the [right] means"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4169","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4169.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4169.mp3"]}},{"no":37,"arab":"أَسْبَابَ السَّمَاوَاتِ فَأَطَّلِعَ إِلَىٰ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ كَاذِبًا ۚ وَكَذَٰلِكَ زُيِّنَ لِفِرْعَوْنَ سُوءُ عَمَلِهِ وَصُدَّ عَنِ السَّبِيلِ ۚ وَمَا كَيْدُ فِرْعَوْنَ إِلَّا فِي تَبَابٍ","latin":"asbaaba alssamaawaati fa-aththhali'a ilaa ilaahi muusaa wa-innii la-azhunnuhu kaadziban wakadzaalika zuyyina lifir'awna suu-u 'amalihi washudda 'ani alssabiili wamaa kaydu fir'awna illaa fii tabaabin","translate":{"id":"(yaitu) pintu-pintu langit, supaya aku dapat melihat Tuhan Musa dan sesungguhnya aku memandangnya seorang pendusta\". Demikianlah dijadikan Fir'aun memandang baik perbuatan yang buruk itu, dan dia dihalangi dari jalan (yang benar); dan tipu daya Fir'aun itu tidak lain hanyalah membawa kerugian.\n","en":"the means of approach to the heavens - and that [thus] I may have a look at the god of Moses: for, behold, I am indeed certain that he is a liar!” And thus, goodly seemed unto Pharaoh the evil of his own doings, and so he was barred from the path [of truth]: and Pharaoh’s guile did not lead to aught but ruin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4170","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4170.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4170.mp3"]}},{"no":38,"arab":"وَقَالَ الَّذِي آمَنَ يَا قَوْمِ اتَّبِعُونِ أَهْدِكُمْ سَبِيلَ الرَّشَادِ","latin":"waqaala alladzii aamana yaa qawmi ittabi'uuni ahdikum sabiila alrrasyaadi","translate":{"id":"Orang yang beriman itu berkata: \"Hai kaumku, ikutilah aku, aku akan menunjukkan kepadamu jalan yang benar.\n","en":"Still, the man who had attained to faith went on: “O my people! Follow me: I shall guide you onto the path of rectitude!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4171","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4171.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4171.mp3"]}},{"no":39,"arab":"يَا قَوْمِ إِنَّمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ","latin":"yaa qawmi innamaa haadzihi alhayaatu alddunyaa mataa'un wa-inna al-aakhirata hiya daaru alqaraari","translate":{"id":"Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara) dan sesungguhnya akhirat itulah negeri yang kekal.\n","en":"“O my people! This worldly life is but a brief enjoyment, whereas, behold, the life to come is the home abiding."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4172","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4172.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4172.mp3"]}},{"no":40,"arab":"مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا ۖ وَمَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ","latin":"man 'amila sayyi-atan falaa yujzaa illaa mitslahaa waman 'amila shaalihan min dzakarin aw untsaa wahuwa mu/minun faulaa-ika yadkhuluuna aljannata yurzaquuna fiihaa bighayri hisaabin","translate":{"id":"Barangsiapa mengerjakan perbuatan jahat, maka dia tidak akan dibalasi melainkan sebanding dengan kejahatan itu. Dan barangsiapa mengerjakan amal yang saleh baik laki-laki maupun perempuan sedang ia dalam keadaan beriman, maka mereka akan masuk surga, mereka diberi rezki di dalamnya tanpa hisab.\n","en":"[There,] anyone who has done a bad deed will be requited with no more than the like thereof, whereas anyone, be it man or woman, who has done righteous deeds and is a believer withal - all such will enter paradise, wherein they shall be blest with good beyond all reckoning!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4173","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4173.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4173.mp3"]}},{"no":41,"arab":"وَيَا قَوْمِ مَا لِي أَدْعُوكُمْ إِلَى النَّجَاةِ وَتَدْعُونَنِي إِلَى النَّارِ","latin":"wayaa qawmi maalii ad'uukum ilaa alnnajaati watad'uunanii ilaa alnnaari","translate":{"id":"Hai kaumku, bagaimanakah kamu, aku menyeru kamu kepada keselamatan, tetapi kamu menyeru aku ke neraka?\n","en":"“And, O my people, how is it that I summon you to salvation, the while you summon me to the fire?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4174","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4174.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4174.mp3"]}},{"no":42,"arab":"تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ وَأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ","latin":"tad'uunanii li-akfura biallaahi wausyrika bihi maa laysa lii bihi 'ilmun wa-anaa ad'uukum ilaa al'aziizi alghaffaari","translate":{"id":"(Kenapa) kamu menyeruku supaya kafir kepada Allah dan mempersekutukan-Nya dengan apa yang tidak kuketahui padahal aku menyeru kamu (beriman) kepada Yang Maha Perkasa lagi Maha Pengampun?\n","en":"- [for] you call upon me to deny [the one­ness of] God and to ascribe a share in His divinity to aught of which I cannot [possibly] have any knowl­edge the while I summon you to [a cognition of] the Almighty, the All-Forgiving!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4175","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4175.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4175.mp3"]}},{"no":43,"arab":"لَا جَرَمَ أَنَّمَا تَدْعُونَنِي إِلَيْهِ لَيْسَ لَهُ دَعْوَةٌ فِي الدُّنْيَا وَلَا فِي الْآخِرَةِ وَأَنَّ مَرَدَّنَا إِلَى اللَّهِ وَأَنَّ الْمُسْرِفِينَ هُمْ أَصْحَابُ النَّارِ","latin":"laa jarama annamaa tad'uunanii ilayhi laysa lahu da'watun fii alddunyaa walaa fii al-aakhirati wa-anna maraddanaa ilaa allaahi wa-anna almusrifiina hum ash-haabu alnnaari","translate":{"id":"Sudah pasti bahwa apa yang kamu seru supaya aku (beriman) kepadanya tidak dapat memperkenankan seruan apapun baik di dunia maupun di akhirat . Dan sesungguhnya kita kembali kepada Allah dan sesungguhnya orang-orang yang melampaui batas, mereka itulah penghuni neraka.\n","en":"“There is no doubt that what you summon me to is something that has no claim to being invoked either in this world or in the life to come - as [there is no doubt] that unto God is our return, and that they who have wasted their own selves shall find them­selves in the fire:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4176","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4176.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4176.mp3"]}},{"no":44,"arab":"فَسَتَذْكُرُونَ مَا أَقُولُ لَكُمْ ۚ وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ ۚ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ","latin":"fasatadzkuruuna maa aquulu lakum waufawwidhu amrii ilaa allaahi inna allaaha bashiirun bial'ibaadi","translate":{"id":"Kelak kamu akan ingat kepada apa yang kukatakan kepada kamu. Dan aku menyerahkan urusanku kepada Allah. Sesungguhnya Allah Maha Melihat akan hamba-hamba-Nya\".\n","en":"and at that time you will [have cause to] remember what I am telling you [now]. “But [as for me,] I commit myself unto God: for, verily, God sees all that is in [the hearts of] His servants.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4177","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4177.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4177.mp3"]}},{"no":45,"arab":"فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا ۖ وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ","latin":"fawaqaahu allaahu sayyi-aati maa makaruu wahaaqa bi-aali fir'awna suu-u al'adzaabi","translate":{"id":"Maka Allah memeliharanya dari kejahatan tipu daya mereka, dan Fir'aun beserta kaumnya dikepung oleh azab yang amat buruk.\n","en":"And God preserved him from the evil of their scheming, whereas suffering vile was to encompass Pharaoh’s folk:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4178","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4178.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4178.mp3"]}},{"no":46,"arab":"النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا ۖ وَيَوْمَ تَقُومُ السَّاعَةُ أَدْخِلُوا آلَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ","latin":"alnnaaru yu'radhuuna 'alayhaa ghuduwwan wa'asyiyyan wayawma taquumu alssaa'atu adkhiluu aala fir'awna asyadda al'adzaabi","translate":{"id":"Kepada mereka dinampakkan neraka pada pagi dan petang , dan pada hari terjadinya Kiamat. (Dikatakan kepada malaikat): \"Masukkanlah Fir'aun dan kaumnya ke dalam azab yang sangat keras\".\n","en":"the fire [of the hereafter - that fire] which they had been made to contemplate [in vain], morning and evening: for on the Day when the Last Hour dawns [God will say], “Make Phar­aoh’s folk enter upon suffering most severe!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4179","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4179.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4179.mp3"]}},{"no":47,"arab":"وَإِذْ يَتَحَاجُّونَ فِي النَّارِ فَيَقُولُ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا نَصِيبًا مِنَ النَّارِ","latin":"wa-idz yatahaajjuuna fii alnnaari fayaquulu aldhdhu'afaau lilladziina istakbaruu innaa kunnaa lakum taba'an fahal antum mughnuuna 'annaa nashiiban mina alnnaari","translate":{"id":"Dan (ingatlah), ketika mereka berbantah-bantah dalam neraka, maka orang-orang yang lemah berkata kepada orang-orang yang menyombongkan diri: \"Sesungguhnya kami adalah pengikut-pengikutmu, maka dapatkah kamu menghindarkan dari kami sebahagian azab api neraka?\"\n","en":"AND LO! They [who in life were wont to deny the truth] will contend with one another in the fire [of the hereafter]; and then the weak will say unto those who had gloried in their arrogance, “Behold, we were but your followers: can you, then, relieve us of some [of our] share of this fire?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4180","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4180.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4180.mp3"]}},{"no":48,"arab":"قَالَ الَّذِينَ اسْتَكْبَرُوا إِنَّا كُلٌّ فِيهَا إِنَّ اللَّهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ","latin":"qaala alladziina istakbaruu innaa kullun fiihaa inna allaaha qad hakama bayna al'ibaadi","translate":{"id":"Orang-orang yang menyombongkan diri menjawab: \"Sesungguhnya kita semua sama-sama dalam neraka karena sesungguhnya Allah telah menetapkan keputusan antara hamba-hamba-(Nya)\".\n","en":"[to which] they who had [once] been arrogant will reply, “Behold, we are all in it [together]! Verily, God has judged between His creatures!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4181","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4181.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4181.mp3"]}},{"no":49,"arab":"وَقَالَ الَّذِينَ فِي النَّارِ لِخَزَنَةِ جَهَنَّمَ ادْعُوا رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِنَ الْعَذَابِ","latin":"waqaala alladziina fii alnnaari likhazanati jahannama ud'uu rabbakum yukhaffif 'annaa yawman mina al'adzaabi","translate":{"id":"Dan orang-orang yang berada dalam neraka berkata kepada penjaga-penjaga neraka Jahannam: \"Mohonkanlah kepada Tuhanmu supaya Dia meringankan azab dari kami barang sehari\".\n","en":"And they who are in the fire will say to the keepers of hell, “Pray unto your Sustainer that He lighten, [though it be] for one day [only], this suffering of ours!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4182","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4182.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4182.mp3"]}},{"no":50,"arab":"قَالُوا أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ ۖ قَالُوا بَلَىٰ ۚ قَالُوا فَادْعُوا ۗ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ","latin":"qaaluu awa lam taku ta/tiikum rusulukum bialbayyinaati qaaluu balaa qaaluu faud'uu wamaa du'aau alkaafiriina illaa fii dhalaalin","translate":{"id":"Penjaga Jahannam berkata: \"Dan apakah belum datang kepada kamu rasul-rasulmu dengan membawa keterangan-keterangan?\" Mereka menjawab: \"Benar, sudah datang\". Penjaga-penjaga Jahannam berkata: \"Berdo'alah kamu\". Dan do'a orang-orang kafir itu hanyalah sia-sia belaka.\n","en":"[But the keepers of hell] will ask, “Is it not [true] that your apostles came unto you with all evidence of the truth?” Those [in the fire] will reply, “Yea, indeed.” [And the keepers of hell] will say, “Pray, then!” - for the prayer of those who deny the truth cannot lead to aught but delusion."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4183","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4183.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4183.mp3"]}},{"no":51,"arab":"إِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ","latin":"innaa lananshuru rusulanaa waalladziina aamanuu fii alhayaati alddunyaa wayawma yaquumu al-asyhaadu","translate":{"id":"Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari berdirinya saksi-saksi (hari kiamat),\n","en":"BEHOLD, We shall indeed succour Our apostles and those who have attained to faith, [both] in this world’s life and on the Day when all the witnesses shall stand up"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4184","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4184.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4184.mp3"]}},{"no":52,"arab":"يَوْمَ لَا يَنْفَعُ الظَّالِمِينَ مَعْذِرَتُهُمْ ۖ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ","latin":"yawma laa yanfa'u alzhzhaalimiina ma'dziratuhum walahumu alla'natu walahum suu-u alddaari","translate":{"id":"(yaitu) hari yang tidak berguna bagi orang-orang zalim permintaan maafnya dan bagi merekalah la'nat dan bagi merekalah tempat tinggal yang buruk.\n","en":"the Day when their excuses will be of no avail to the evildoers, seeing that their lot will be rejection from all that is good, and a woeful hereafter."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4185","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4185.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4185.mp3"]}},{"no":53,"arab":"وَلَقَدْ آتَيْنَا مُوسَى الْهُدَىٰ وَأَوْرَثْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ","latin":"walaqad aataynaa muusaa alhudaa wa-awratsnaa banii israa-iila alkitaaba","translate":{"id":"Dan sesungguhnya telah Kami berikan petunjuk kepada Musa; dan Kami wariskan Taurat kepada Bani Israil,\n","en":"And, indeed, We bestowed aforetime [Our] guidance on Moses, and [thus] made the children of Israel heirs to the divine writ [revealed to him]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4186","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4186.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4186.mp3"]}},{"no":54,"arab":"هُدًى وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ","latin":"hudan wadzikraa li-ulii al-albaabi","translate":{"id":"untuk menjadi petunjuk dan peringatan bagi orang-orang yang berfikir.\n","en":"as a [means of] guidance and a reminder for those who were endowed with insight:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4187","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4187.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4187.mp3"]}},{"no":55,"arab":"فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَاسْتَغْفِرْ لِذَنْبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْإِبْكَارِ","latin":"faishbir inna wa'da allaahi haqqun waistaghfir lidzanbika wasabbih bihamdi rabbika bial'asyiyyi waal-ibkaari","translate":{"id":"Maka bersabarlah kamu, karena sesungguhnya janji Allah itu benar, dan mohonlah ampunan untuk dosamu dan bertasbihlah seraya memuji Tuhanmu pada waktu petang dan pagi.\n","en":"hence, remain thou patient in adversity - for, verily, God’s promise always comes true - and ask forgiveness for thy sins, and extol thy Sustainer’s glory and praise by night and by day."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4188","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4188.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4188.mp3"]}},{"no":56,"arab":"إِنَّ الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ ۙ إِنْ فِي صُدُورِهِمْ إِلَّا كِبْرٌ مَا هُمْ بِبَالِغِيهِ ۚ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ","latin":"inna alladziina yujaadiluuna fii aayaati allaahi bighayri sulthaanin ataahum in fii shuduurihim illaa kibrun maa hum bibaalighiihi faista'idz biallaahi innahu huwa alssamii'u albashiiru","translate":{"id":"Sesungguhhnya orang-orang yang memperdebatkan tentang ayat-ayat Allah tanpa alasan yang sampai kepada mereka tidak ada dalam dada mereka melainkan hanyalah (keinginan akan) kebesaran yang mereka sekali-kali tiada akan mencapainya, maka mintalah perlindungan kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat. ","en":"Behold, as for those who call God’s messages in question without having any evidence therefore in their hearts is nothing but overweening self-con­ceit, which they will never be able to satisfy: seek thou, then, refuge with God - for, verily, He alone is all-hearing, all-seeing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4189","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4189.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4189.mp3"]}},{"no":57,"arab":"لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","latin":"lakhalqu alssamaawaati waal-ardhi akbaru min khalqi alnnaasi walaakinna aktsara alnnaasi laa ya'lamuuna","translate":{"id":"Sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia akan tetapi kebanyakan manusia tidak mengetahui.\n","en":"Greater indeed than the creation of man is the creation of the heavens and the earth: yet most men do not understand [what this implies]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4190","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4190.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4190.mp3"]}},{"no":58,"arab":"وَمَا يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَلَا الْمُسِيءُ ۚ قَلِيلًا مَا تَتَذَكَّرُونَ","latin":"wamaa yastawii al-a'maa waalbashiiru waalladziina aamanuu wa'amiluu alshshaalihaati walaa almusii-u qaliilan maa tatadzakkaruuna","translate":{"id":"Dan tidaklah sama orang yang buta dengan orang yang melihat, dan tidaklah (pula sama) orang-orang yang beriman serta mengerjakan amal saleh dengan orang-orang yang durhaka. Sedikit sekali kamu mengambil pelajaran.\n","en":"But [then,] the blind and the seeing are not equal; and neither [can] they who have attained to faith and do good works and the doers of evil [be deemed equal]. How seldom do you keep this in mind!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4191","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4191.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4191.mp3"]}},{"no":59,"arab":"إِنَّ السَّاعَةَ لَآتِيَةٌ لَا رَيْبَ فِيهَا وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ","latin":"inna alssaa'ata laaatiyatun laa rayba fiihaa walaakinna aktsara alnnaasi laa yu/minuuna","translate":{"id":"Sesungguhnya hari kiamat pasti akan datang, tidak ada keraguan tentangnya, akan tetapi kebanyakan manusia tiada beriman.\n","en":"Verily, the Last Hour is sure to come: of this there is no doubt; yet most men will not believe it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4192","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4192.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4192.mp3"]}},{"no":60,"arab":"وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ ۚ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ","latin":"waqaala rabbukumu ud'uunii astajib lakum inna alladziina yastakbiruuna 'an 'ibaadatii sayadkhuluuna jahannama daakhiriina","translate":{"id":"Dan Tuhanmu berfirman: \"Berdo'alah kepada-Ku, niscaya akan Kuperkenankan bagimu. Sesungguhnya orang-orang yang menyombongkan diri dari menyembah-Ku akan masuk neraka Jahannam dalam keadaan hina dina\".\n","en":"But your Sustainer says: “Call unto Me, [and] I shall respond to you! Verily, they who are too proud to worship Me will enter hell, abased!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4193","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4193.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4193.mp3"]}},{"no":61,"arab":"اللَّهُ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِتَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ","latin":"allaahu alladzii ja'ala lakumu allayla litaskunuu fiihi waalnnahaara mubshiran inna allaaha ladzuu fadhlin 'alaa alnnaasi walaakinna aktsara alnnaasi laa yasykuruuna","translate":{"id":"Allah-lah yang menjadikan malam untuk kamu supaya kamu beristirahat padanya; dan menjadikan siang terang benderang. Sesungguhnya Allah benar-benar mempunyal karunia yang dilimpahkan atas manusia, akan tetapi kebanyakan manusia tidak bersyukur.\n","en":"IT IS GOD who has made the night for you, so that you might rest therein, and the day, to make [you] see. Behold, God is indeed limitless in His bounty unto man - but most men are ungrateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4194","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4194.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4194.mp3"]}},{"no":62,"arab":"ذَٰلِكُمُ اللَّهُ رَبُّكُمْ خَالِقُ كُلِّ شَيْءٍ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُؤْفَكُونَ","latin":"dzaalikumu allaahu rabbukum khaaliqu kulli syay-in laa ilaaha illaa huwa fa-annaa tu/fakuuna","translate":{"id":"Yang demikian itu adalah Allah, Tuhanmu, Pencipta segala sesuatu, tiada Tuhan (yang berhak disembah) melainkan Dia; maka bagaimanakah kamu dapat dipalingkan?\n","en":"Such is God, your Sustainer, the Creator of all that exists: there is no deity save Him. How perverted, then, are your minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4195","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4195.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4195.mp3"]}},{"no":63,"arab":"كَذَٰلِكَ يُؤْفَكُ الَّذِينَ كَانُوا بِآيَاتِ اللَّهِ يَجْحَدُونَ","latin":"kadzaalika yu/faku alladziina kaanuu bi-aayaati allaahi yajhaduuna","translate":{"id":"Seperti demikianlah dipalingkan orang-orang yang selalu mengingkari ayat-ayat Allah.\n","en":"[For] thus it is: perverted are the minds of those who knowingly reject God’s messages."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4196","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4196.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4196.mp3"]}},{"no":64,"arab":"اللَّهُ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ قَرَارًا وَالسَّمَاءَ بِنَاءً وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ ۖ فَتَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ","latin":"allaahu alladzii ja'ala lakumu al-ardha qaraaran waalssamaa-a binaa-an washawwarakum fa-ahsana shuwarakum warazaqakum mina alththhayyibaati dzaalikumu allaahu rabbukum fatabaaraka allaahu rabbu al'aalamiina","translate":{"id":"Allah-lah yang menjadikan bumi bagi kamu tempat menetap dan langit sebagai atap, dan membentuk kamu lalu membaguskan rupamu serta memberi kamu rezki dengan sebahagian yang baik-baik. Yang demikian itu adalah Allah Tuhanmu, Maha Agung Allah, Tuhan semesta alam.\n","en":"It is God who has made the earth a resting- place for you and the sky a canopy, and has formed you - and formed you so well and provided for you sustenance out of the good things of life. Such is God, your Sustainer: hallowed, then, is God, the Sustainer of all the worlds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4197","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4197.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4197.mp3"]}},{"no":65,"arab":"هُوَ الْحَيُّ لَا إِلَٰهَ إِلَّا هُوَ فَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ ۗ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"huwa alhayyu laa ilaaha illaa huwa faud'uuhu mukhlishiina lahu alddiina alhamdu lillaahi rabbi al'aalamiina","translate":{"id":"Dialah Yang hidup kekal, tiada Tuhan (yang berhak disembah) melainkan Dia; maka sembahlah Dia dengan memurnikan ibadat kepada-Nya. Segala puji bagi Allah Tuhan semesta alam.\n","en":"He is the Ever-Living; there is no deity save Him: call, then, unto Him [alone], sincere in your faith in Him. All praise is due to God, the Sustainer of all the worlds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4198","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4198.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4198.mp3"]}},{"no":66,"arab":"قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَمَّا جَاءَنِيَ الْبَيِّنَاتُ مِنْ رَبِّي وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ الْعَالَمِينَ","latin":"qul innii nuhiitu an a'buda alladziina tad'uuna min duuni allaahi lammaa jaa-aniya albayyinaatu min rabbii waumirtu an uslima lirabbi al'aalamiina","translate":{"id":"Katakanlah (ya Muhammad): \"Sesungguhnya aku dilarang menyembah sembahan yang kamu sembah selain Allah setelah datang kepadaku keterangan-keterangan dari Tuhanku; dan aku diperintahkan supaya tunduk patuh kepada Tuhan semesta alam.\n","en":"Say: “Since all evidence of the truth has come to me from my Sustainer, I am forbidden to worship [any of] those beings whom you invoke instead of God; and I am bidden to surrender myself to the Sustainer of all the worlds.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4199","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4199.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4199.mp3"]}},{"no":67,"arab":"هُوَ الَّذِي خَلَقَكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ثُمَّ لِتَكُونُوا شُيُوخًا ۚ وَمِنْكُمْ مَنْ يُتَوَفَّىٰ مِنْ قَبْلُ ۖ وَلِتَبْلُغُوا أَجَلًا مُسَمًّى وَلَعَلَّكُمْ تَعْقِلُونَ","latin":"huwa alladzii khalaqakum min turaabin tsumma min nuthfatin tsumma min 'alaqatin tsumma yukhrijukum thiflan tsumma litablughuu asyuddakum tsumma litakuunuu syuyuukhan waminkum man yutawaffaa min qablu walitablughuu ajalan musamman wala'allakum ta'qiluuna","translate":{"id":"Dia-lah yang menciptakan kamu dari tanah kemudian dari setetes mani, sesudah itu dari segumpal darah, kemudian dilahirkannya kamu sebagai seorang anak, kemudian (kamu dibiarkan hidup) supaya kamu sampai kepada masa (dewasa), kemudian (dibiarkan kamu hidup lagi) sampai tua, di antara kamu ada yang diwafatkan sebelum itu. (Kami perbuat demikian) supaya kamu sampai kepada ajal yang ditentukan dan supaya kamu memahami(nya).\n","en":"It is He who creates you out of dust, and then out of a drop of sperm, and then out of a germ-cell; and then He brings you forth as children; and then [He ordains] that you reach maturity, and then, that you grow old - though some of you [He causes to] die earlier -: and [all this He ordains] so that you might reach a term set [by Him], and that you might [learn to] use your reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4200","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4200.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4200.mp3"]}},{"no":68,"arab":"هُوَ الَّذِي يُحْيِي وَيُمِيتُ ۖ فَإِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ","latin":"huwa alladzii yuhyii wayumiitu fa-idzaa qadaa amran fa-innamaa yaquulu lahu kun fayakuunu","translate":{"id":"Dia-lah yang menghidupkan dan mematikan, maka apabila Dia menetapkan sesuatu urusan, Dia hanya bekata kepadanya: \"Jadilah\", maka jadilah ia.\n","en":"It is He who grants life and deals death; and when He wills a thing to be, He but says unto it, “Be” - and it is."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4201","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4201.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4201.mp3"]}},{"no":69,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ أَنَّىٰ يُصْرَفُونَ","latin":"alam tara ilaa alladziina yujaadiluuna fii aayaati allaahi annaa yushrafuuna","translate":{"id":"Apakah kamu tidak melihat kepada orang-orang yang membantah ayat-ayat Allah? Bagaimanakah mereka dapat dipalingkan?\n","en":"ART THOU NOT aware of how far they who call God’s messages in question have lost sight of the truth?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4202","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4202.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4202.mp3"]}},{"no":70,"arab":"الَّذِينَ كَذَّبُوا بِالْكِتَابِ وَبِمَا أَرْسَلْنَا بِهِ رُسُلَنَا ۖ فَسَوْفَ يَعْلَمُونَ","latin":"alladziina kadzdzabuu bialkitaabi wabimaa arsalnaa bihi rusulanaa fasawfa ya'lamuuna","translate":{"id":"(Yaitu) orang-orang yang mendustakan Al Kitab (Al Qur'an) dan wahyu yang dibawa oleh rasul-rasul Kami yang telah Kami utus. Kelak mereka akan mengetahui,\n","en":"they who give the lie to this divine writ and [thus] to all [the messages] with which We sent forth Our apostles [of old]? But in time they will come to know [how blind they have been: they will know it on Judgment Day],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4203","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4203.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4203.mp3"]}},{"no":71,"arab":"إِذِ الْأَغْلَالُ فِي أَعْنَاقِهِمْ وَالسَّلَاسِلُ يُسْحَبُونَ","latin":"idzi al-aghlaalu fii a'naaqihim waalssalaasilu yushabuuna","translate":{"id":"ketika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret,\n","en":"when they shall have to carry the shackles and chains [of their own making] around their necks,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4204","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4204.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4204.mp3"]}},{"no":72,"arab":"فِي الْحَمِيمِ ثُمَّ فِي النَّارِ يُسْجَرُونَ","latin":"fii alhamiimi tsumma fii alnnaari yusjaruuna","translate":{"id":"ke dalam air yang sangat panas, kemudian mereka dibakar dalam api,\n","en":"and are dragged into burning despair, and in the end become fuel for the fire [of hell]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4205","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4205.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4205.mp3"]}},{"no":73,"arab":"ثُمَّ قِيلَ لَهُمْ أَيْنَ مَا كُنْتُمْ تُشْرِكُونَ","latin":"tsumma qiila lahum ayna maa kuntum tusyrikuuna","translate":{"id":"kemudian dikatakan kepada mereka: \" Manakah berhala-berhala yang selalu kamu persekutukan,\n","en":"And then they will be asked: “Where now are those [powers] to which you were wont to ascribe divinity"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4206","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4206.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4206.mp3"]}},{"no":74,"arab":"مِنْ دُونِ اللَّهِ ۖ قَالُوا ضَلُّوا عَنَّا بَلْ لَمْ نَكُنْ نَدْعُو مِنْ قَبْلُ شَيْئًا ۚ كَذَٰلِكَ يُضِلُّ اللَّهُ الْكَافِرِينَ","latin":"min duuni allaahi qaaluu dhalluu 'annaa bal lam nakun nad'uu min qablu syay-an kadzaalika yudhillu allaahu alkaafiriina","translate":{"id":"(yang kamu sembah) selain Allah?\" Mereka menjawab: \"Mereka telah hilang lenyap dari kami, bahkan kami dahulu tiada pernah menyembah sesuatu\". Seperti demikianlah Allah menyesatkan orang-orang kafir.\n","en":"side by side with God?” They will answer: “They have forsaken us - or, rather, what we were wont to invoke aforetime did not exist at all!” And they will be told:] “It is thus that God lets the deniers of the truth go astray:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4207","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4207.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4207.mp3"]}},{"no":75,"arab":"ذَٰلِكُمْ بِمَا كُنْتُمْ تَفْرَحُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَمْرَحُونَ","latin":"dzaalikum bimaa kuntum tafrahuuna fii al-ardhi bighayri alhaqqi wabimaa kuntum tamrahuuna","translate":{"id":"Yang demikian itu disebabkan karena kamu bersuka ria di muka bumi dengan tidak benar dan karena kamu selalu bersuka ria (dalam kemaksiatan).\n","en":"this is an out­come of your having arrogantly exulted on earth without any [concern for what is] right, and of your having been so full of self-conceit!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4208","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4208.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4208.mp3"]}},{"no":76,"arab":"ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ","latin":"udkhuluu abwaaba jahannama khaalidiina fiihaa fabi/sa matswaa almutakabbiriina","translate":{"id":"(Dikatakan kepada mereka): \"Masuklah kamu ke pintu-pintu neraka Jahannam, sedang kamu kekal di dalamnya. Maka itulah seburuk-buruk tempat bagi orang-orang yang sombong \".\n","en":"Enter [now] the gates of hell, therein to abide: and how vile an abode for all who are given to false pride!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4209","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4209.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4209.mp3"]}},{"no":77,"arab":"فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۚ فَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا يُرْجَعُونَ","latin":"faishbir inna wa'da allaahi haqqun fa-immaa nuriyannaka ba'dha alladzii na'iduhum aw natawaffayannaka fa-ilaynaa yurja'uuna","translate":{"id":"Maka bersabarlah kamu, sesungguhnya janji Allah adalah benar; maka meskipun Kami perlihatkan kepadamu sebagian siksa yang Kami ancamkan kepada mereka ataupun Kami wafatkan kamu (sebelum ajal menimpa mereka), namun kepada Kami sajalah mereka dikembalikan.\n","en":"HENCE, remain thou patient in adversity - for, verily, God’s promise always comes true. And whether We show thee [in this world] something of what We hold in store for those [deniers of the truth], or whether We cause thee to die [ere that retribution takes place - know that, in the end], it is unto Us that they will be brought back."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4210","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4210.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4210.mp3"]}},{"no":78,"arab":"وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ مِنْهُمْ مَنْ قَصَصْنَا عَلَيْكَ وَمِنْهُمْ مَنْ لَمْ نَقْصُصْ عَلَيْكَ ۗ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۚ فَإِذَا جَاءَ أَمْرُ اللَّهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُونَ","latin":"walaqad arsalnaa rusulan min qablika minhum man qashashnaa 'alayka waminhum man lam naqshush 'alayka wamaa kaana lirasuulin an ya/tiya bi-aayatin illaa bi-idzni allaahi fa-idzaa jaa-a amru allaahi qudhiya bialhaqqi wakhasira hunaalika almubthiluuna","translate":{"id":"Dan sesungguhnya telah Kami utus beberapa orang rasul sebelum kamu, di antara mereka ada yang Kami ceritakan kepadamu dan di antara mereka ada (pula) yang tidak Kami ceritakan kepadamu. Tidak dapat bagi seorang rasul membawa suatu mu'jizat, melainkan dengan seizin Allah; maka apabila telah datang perintah Allah, diputuskan (semua perkara) dengan adil. Dan ketika itu rugilah orang-orang yang berpegang kepada yang batil.\n","en":"And, indeed, [O Muhammad,] We sent forth apostles before thy time; some of them We have mentioned to thee, and some of them We have not mentioned to thee. And it was not given to any apostle to bring forth a miracle other than by God’s leave. Yet when God’s will becomes manifest, judgment will [already] have been passed in all justice, and lost will be, then and there, all who tried to reduce to nothing [whatever they could not understand]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4211","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4211.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4211.mp3"]}},{"no":79,"arab":"اللَّهُ الَّذِي جَعَلَ لَكُمُ الْأَنْعَامَ لِتَرْكَبُوا مِنْهَا وَمِنْهَا تَأْكُلُونَ","latin":"allaahu alladzii ja'ala lakumu al-an'aama litarkabuu minhaa waminhaa ta/kuluuna","translate":{"id":"Allahlah yang menjadikan binatang ternak untuk kamu, sebagiannya untuk kamu kendarai dan sebagiannya untuk kamu makan.\n","en":"It is God who [at all times works wonders for you: thus, He] provides for you [all manner of] livestock, so that on some of them you may ride, and from some derive your food,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4212","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4212.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4212.mp3"]}},{"no":80,"arab":"وَلَكُمْ فِيهَا مَنَافِعُ وَلِتَبْلُغُوا عَلَيْهَا حَاجَةً فِي صُدُورِكُمْ وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُونَ","latin":"walakum fiihaa manaafi'u walitablughuu 'alayhaa haajatan fii shuduurikum wa'alayhaa wa'alaa alfulki tuhmaluuna","translate":{"id":"Dan (ada lagi) manfaat-manfaat yang lain pada binatang ternak itu untuk kamu dan supaya kamu mencapai suatu keperluan yang tersimpan dalam hati dengan mengendarainya. Dan kamu dapat diangkut dengan mengendarai binatang-binatang itu dan dengan mengendarai bahtera.\n","en":"and find [yet other] benefits in them; and that through them you may attain to the fulfillment of [many] a heartfelt need: for on them, as on ships, you are borne [through life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4213","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4213.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4213.mp3"]}},{"no":81,"arab":"وَيُرِيكُمْ آيَاتِهِ فَأَيَّ آيَاتِ اللَّهِ تُنْكِرُونَ","latin":"wayuriikum aayaatihi fa-ayya aayaati allaahi tunkiruuna","translate":{"id":"Dan Dia memperlihatkan kepada kamu tanda-tanda (kekuasaan-Nya); maka tanda-tanda (kekuasaan) Allah yang manakah yang kamu ingkari?\n","en":"And [thus] He displays His wonders before you: which, then, of God’s wonders can you still deny?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4214","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4214.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4214.mp3"]}},{"no":82,"arab":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ كَانُوا أَكْثَرَ مِنْهُمْ وَأَشَدَّ قُوَّةً وَآثَارًا فِي الْأَرْضِ فَمَا أَغْنَىٰ عَنْهُمْ مَا كَانُوا يَكْسِبُونَ","latin":"afalam yasiiruu fii al-ardhi fayanzhuruu kayfa kaana 'aaqibatu alladziina min qablihim kaanuu aktsara minhum wa-asyadda quwwatan waaatsaaran fii al-ardhi famaa aghnaa 'anhum maa kaanuu yaksibuuna","translate":{"id":"Maka apakah mereka tiada mengadakan perjalanan di muka bumi lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka. Adalah orang-orang yang sebelum mereka itu lebih hebat kekuatannya dan (lebih banyak) bekas-bekas mereka di muka bumi , maka apa yang mereka usahakan itu tidak dapat menolong mereka.\n","en":"HAVE THEY, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? More numerous were they, and greater in power than they are, and in the impact which they left on earth: but all that they ever achieved was of no avail to them –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4215","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4215.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4215.mp3"]}},{"no":83,"arab":"فَلَمَّا جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَرِحُوا بِمَا عِنْدَهُمْ مِنَ الْعِلْمِ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"falammaa jaa-at-hum rusuluhum bialbayyinaati farihuu bimaa 'indahum mina al'ilmi wahaaqa bihim maa kaanuu bihi yastahzi-uuna","translate":{"id":"Maka tatkala datang kepada mereka rasul-rasul (yang diutus kepada) mereka dengan membawa ketarangan-keterangan, mereka merasa senang dengan pengetahuan yang ada pada mereka dan mereka dikepung oleh azab Allah yang selalu mereka perolok-olokkan itu.\n","en":"for when their apostles came to them with all evidence of the truth, they arrogantly exulted in whatever knowledge they [already] possessed: and [so, in the end,] they were overwhelmed by the very thing which they were wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4216","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4216.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4216.mp3"]}},{"no":84,"arab":"فَلَمَّا رَأَوْا بَأْسَنَا قَالُوا آمَنَّا بِاللَّهِ وَحْدَهُ وَكَفَرْنَا بِمَا كُنَّا بِهِ مُشْرِكِينَ","latin":"falammaa ra-aw ba/sanaa qaaluu aamannaa biallaahi wahdahu wakafarnaa bimaa kunnaa bihi musyrikiina","translate":{"id":"Maka tatkala mereka melihat azab Kami, mereka berkata: \"Kami beriman hanya kepada Allah saja, dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah\".\n","en":"And then, when they [clearly] beheld Our punishment, they said: “We have come to believe in the One God, and we have renounced all belief in that to which we were wont to ascribe a share in His divinity!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4217","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4217.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4217.mp3"]}},{"no":85,"arab":"فَلَمْ يَكُ يَنْفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا ۖ سُنَّتَ اللَّهِ الَّتِي قَدْ خَلَتْ فِي عِبَادِهِ ۖ وَخَسِرَ هُنَالِكَ الْكَافِرُونَ","latin":"falam yaku yanfa'uhum iimaanuhum lammaa ra-aw ba/sanaa sunnata allaahi allatii qad khalat fii 'ibaadihi wakhasira hunaalika alkaafiruuna","translate":{"id":"Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir.\n","en":"But their attaining to faith after they had beheld Our punishment could not possibly benefit them such being the way of God that has always obtained for His creatures -: and so, then and there, lost were they who had denied the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4218","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4218.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4218.mp3"]}}]}