{"alquran":{"no":41,"name":"Fussilat","arab":"فصلت","start":4218,"count":54,"rukku":6,"type":"mecca","description":"Surat Fushshilat terdiri atas 54 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Al Mu'min. Dinamai <i>Fushshilat</i> (yang dijelaskan) karena ada hubungannya dengan perkataan <i>Fushshilat</i> yang terdapat pada permulaan surat ini yang berarti <i>yang dijelaskan</i>. Maksudnya ayat-ayatnya diperinci dengan jelas tentang hukum-hukum, keimanan, janji dan ancaman, budi pekerti, kisah, dan sebagainya. Dinamai juga dengan <i>Haa Miim dan As Sajdah</i> karena surat ini dimulai dengan <i>Haa Miim</i> dan dalam surat ini terdapat ayat Sajdah."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim .\n","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4219","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4219.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4219.mp3"]}},{"no":2,"arab":"تَنْزِيلٌ مِنَ الرَّحْمَٰنِ الرَّحِيمِ","latin":"tanziilun mina alrrahmaani alrrahiimi","translate":{"id":"Diturunkan dari Tuhan Yang Maha Pemurah lagi Maha Penyayang.\n","en":"THE BESTOWAL from on high [of this revelation] issues from the Most Gracious, the Dis­penser of Grace:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4220","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4220.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4220.mp3"]}},{"no":3,"arab":"كِتَابٌ فُصِّلَتْ آيَاتُهُ قُرْآنًا عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ","latin":"kitaabun fushshilat aayaatuhu qur-aanan 'arabiyyan liqawmin ya'lamuuna","translate":{"id":"Kitab yang dijelaskan ayat-ayatnya, yakni bacaan dalam bahasa Arab, untuk kaum yang mengetahui,\n","en":"a divine writ, the messages whereof have been clearly spelled out as a discourse in the Arabic tongue for people of [innate] knowl­edge,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4221","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4221.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4221.mp3"]}},{"no":4,"arab":"بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ","latin":"basyiiran wanadziiran fa-a'radha aktsaruhum fahum laa yasma'uuna","translate":{"id":"yang membawa berita gembira dan yang membawa peringatan, tetapi kebanyakan mereka berpaling, tidak mau mendengarkan.\n","en":"to be a herald of glad tidings as well as a warning. And yet, [whenever this divine writ is offered to men,] most of them turn away, so that they cannot hear [its message];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4222","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4222.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4222.mp3"]}},{"no":5,"arab":"وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ وَفِي آذَانِنَا وَقْرٌ وَمِنْ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ إِنَّنَا عَامِلُونَ","latin":"waqaaluu quluubunaa fii akinnatin mimmaa tad'uunaa ilayhi wafii aatsaaninaa waqrun wamin bayninaa wabaynika hijaabun fai'mal innanaa 'aamiluuna","translate":{"id":"Mereka berkata: \"Hati kami berada dalam tutupan (yang menutupi) apa yang kamu seru kami kepadanya dan telinga kami ada sumbatan dan antara kami dan kamu ada dinding, maka bekerjalah kamu; sesungguhnya kami bekerja (pula).\"\n","en":"and so they say, [as it were:] “Our hearts are veiled from whatever thou callest us to, [O Muhammad,] and in our ears is deafness, and between us and thee is a barrier. Do, then, [whatever thou wilt, whereas,] behold, we shall do [as we have always done]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4223","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4223.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4223.mp3"]}},{"no":6,"arab":"قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَىٰ إِلَيَّ أَنَّمَا إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ ۗ وَوَيْلٌ لِلْمُشْرِكِينَ","latin":"qul innamaa anaa basyarun mitslukum yuuhaa ilayya annamaa ilaahukum ilaahun waahidun faistaqiimuu ilayhi waistaghfiruuhu wawaylun lilmusyrikiina","translate":{"id":"Katakanlah: \"Bahwasanya aku hanyalah seorang manusia seperti kamu, diwahyukan kepadaku bahwasanya Tuhan kamu adalah Tuhan yang Maha Esa, maka tetaplah pada jalan yang lurus menuju kepadaNya dan mohonlah ampun kepadaNya. Dan kecelakaan besarlah bagi orang-orang yang mempersekutukan-Nya,\n","en":"Say thou, [O Prophet:] “I am but a mortal like you. It has been revealed to me that your God is the One God: go, then, straight towards Him and seek His forgiveness!” And woe unto those who ascribe divinity to aught beside Him,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4224","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4224.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4224.mp3"]}},{"no":7,"arab":"الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ","latin":"alladziina laa yu/tuuna alzzakaata wahum bial-aakhirati hum kaafiruuna","translate":{"id":"(yaitu) orang-orang yang tidak menunaikan zakat dan mereka kafir akan adanya (kehidupan) akhirat.\n","en":"[and] those who do not spend in charity: for it is they, they who [thus] deny the truth of the life to come!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4225","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4225.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4225.mp3"]}},{"no":8,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati lahum ajrun ghayru mamnuunin","translate":{"id":"Sesungguhnya orang-orang yang beriman dan beramal saleh, mereka mendapat pahala yang tiada putus-putusnya\".\n","en":"[But,] verily, they who have attained to faith and do good works shall have a reward unending!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4226","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4226.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4226.mp3"]}},{"no":9,"arab":"قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ۚ ذَٰلِكَ رَبُّ الْعَالَمِينَ","latin":"qul a-innakum latakfuruuna bialladzii khalaqa al-ardha fii yawmayni wataj'aluuna lahu andaadan dzaalika rabbu al'aalamiina","translate":{"id":"Katakanlah: \"Sesungguhnya patutkah kamu kafir kepada Yang menciptakan bumi dalam dua masa dan kamu adakan sekutu-sekutu bagiNya? (Yang bersifat) demikian itu adalah Rabb semesta alam\".\n","en":"SAY: “Would you indeed deny Him who has created the earth in two aeons? And do you claim that there is any power that could rival Him, the Sustainer of all the worlds?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4227","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4227.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4227.mp3"]}},{"no":10,"arab":"وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ","latin":"waja'ala fiihaa rawaasiya min fawqihaa wabaaraka fiihaa waqaddara fiihaa aqwaatahaa fii arba'ati ayyaamin sawaa-an lilssaa-iliina","translate":{"id":"Dan dia menciptakan di bumi itu gunung-gunung yang kokoh di atasnya. Dia memberkahinya dan Dia menentukan padanya kadar makanan-makanan (penghuni)nya dalam empat masa. (Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya.\n","en":"For He [it is who, after creating the earth,] placed firm mountains on it, [towering] above its surface, and bestowed [so many] blessings on it, and equitably apportioned its means of subsistence to all who would seek it: [and all this He created] in four aeons."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4228","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4228.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4228.mp3"]}},{"no":11,"arab":"ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ","latin":"tsumma istawaa ilaa alssamaa-i wahiya dukhaanun faqaala lahaa walil-ardhi i/tiyaa thaw'an aw karhan qaalataa ataynaa thaa-i'iina","translate":{"id":"Kemudian Dia menuju kepada penciptaan langit dan langit itu masih merupakan asap, lalu Dia berkata kepadanya dan kepada bumi: \"Datanglah kamu keduanya menurut perintah-Ku dengan suka hati atau terpaksa\". Keduanya menjawab: \"Kami datang dengan suka hati\".\n","en":"And He [it is who] applied His design to the skies, which were [yet but] smoke; and He [it is who] said to them and to the earth, “Come [into being], both of you, willingly or unwillingly!” - to which both responded, “We do come in obedience.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4229","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4229.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4229.mp3"]}},{"no":12,"arab":"فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا ۚ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ","latin":"faqadaahunna sab'a samaawaatin fii yawmayni wa-awhaa fii kulli samaa-in amrahaa wazayyannaa alssamaa-a alddunyaa bimashaabiiha wahifzhan dzaalika taqdiiru al'aziizi al'aliimi","translate":{"id":"Maka Dia menjadikannya tujuh langit dalam dua masa. Dia mewahyukan pada tiap-tiap langit urusannya. Dan Kami hiasi langit yang dekat dengan bintang-bintang yang cemerlang dan Kami memeliharanya dengan sebaik-baiknya. Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui.\n","en":"And He [it is who] decreed that they become seven heavens in two aeons, and imparted unto each heaven its function. And We adorned the skies nearest to the earth with lights, and made them secure: such is the ordaining of the Almighty, the All-Knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4230","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4230.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4230.mp3"]}},{"no":13,"arab":"فَإِنْ أَعْرَضُوا فَقُلْ أَنْذَرْتُكُمْ صَاعِقَةً مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ","latin":"fa-in a'radhuu fuqul andzartukum shaa'iqatan mitsla shaa'iqati 'aadin watsamuuda","translate":{"id":"Jika mereka berpaling maka katakanlah: \"Aku telah memperingatkan kamu dengan petir, seperti petir yang menimpa kaum 'Aad dan Tsamud\".\n","en":"BUT IF they turn away, say: “I warn you of [the coming of] a thunderbolt of punishment like the thunderbolt [that fell upon the tribes] of Ad and Thamud!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4231","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4231.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4231.mp3"]}},{"no":14,"arab":"إِذْ جَاءَتْهُمُ الرُّسُلُ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ ۖ قَالُوا لَوْ شَاءَ رَبُّنَا لَأَنْزَلَ مَلَائِكَةً فَإِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ","latin":"idz jaa-at-humu alrrusulu min bayni aydiihim wamin khalfihim allaa ta'buduu illaa allaaha qaaluu law syaa-a rabbunaa la-anzala malaa-ikatan fa-innaa bimaa ursiltum bihi kaafiruuna","translate":{"id":"Ketika para rasul datang kepada mereka dari depan dan belakang mereka (dengan menyerukan): \"Janganlah kamu menyembah selain Allah\". Mereka menjawab: \"Kalau Tuhan kami menghendaki tentu Dia akan menurunkan malaikat-malaikat-Nya, maka sesungguhnya kami kafir kepada wahyu yang kamu diutus membawanya\".\n","en":"Lo! There came unto them [God’s] apostles, speaking of what lay open before them and what was [still] beyond their ken, [and calling unto them,] “Worship none but God!” They answered: “If our Sustainer had willed [us to believe in what you say], He would have sent down angels [as His message-bearers]. As it is, behold, we deny that there is any truth in what you [claim to] have been sent with!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4232","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4232.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4232.mp3"]}},{"no":15,"arab":"فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً ۖ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً ۖ وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ","latin":"fa-ammaa 'aadun faistakbaruu fii al-ardhi bighayri alhaqqi waqaaluu man asyaddu minnaa quwwatan awa lam yaraw anna allaaha alladzii khalaqahum huwa asyaddu minhum quwwatan wakaanuu bi-aayaatinaa yajhaduuna","translate":{"id":"Adapun kaum 'Aad maka mereka menyombongkan diri di muka bumi tanpa alasan yang benar dan berkata: \"Siapakah yang lebih besar kekuatannya dari kami?\" Dan apakah mereka itu tidak memperhatikan bahwa Allah Yang menciptakan mereka adalah lebih besar kekuatan-Nya daripada mereka? Dan adalah mereka mengingkari tanda-tanda (kekuatan) Kami.\n","en":"Now as for [the tribe of] Ad, they walked arrogantly on earth, [offending] against all right, and saying, “Who could have a power greater than ours?” Why - were they, then, not aware that God, who created them, had a power greater than theirs? But they went on rejecting Our messages;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4233","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4233.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4233.mp3"]}},{"no":16,"arab":"فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَخْزَىٰ ۖ وَهُمْ لَا يُنْصَرُونَ","latin":"fa-arsalnaa 'alayhim riihan sharsharan fii ayyaamin nahisaatin linudziiqahum 'adzaaba alkhizyi fii alhayaati alddunyaa wala'adzaabu al-aakhirati akhzaa wahum laa yunsharuuna","translate":{"id":"Maka Kami meniupkan angin yang amat gemuruh kepada mereka dalam beberapa hari yang sial, karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia. Dan Sesungguhnya siksa akhirat lebih menghinakan sedang mereka tidak diberi pertolongan.\n","en":"and thereupon We let loose upon them a storm wind raging through days of misfortune, so as to give them, in the life of this world, a foretaste of suffering through humiliation: but [their] suffering in the life to come will be far more humiliating, and they will have none to succour them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4234","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4234.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4234.mp3"]}},{"no":17,"arab":"وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَىٰ عَلَى الْهُدَىٰ فَأَخَذَتْهُمْ صَاعِقَةُ الْعَذَابِ الْهُونِ بِمَا كَانُوا يَكْسِبُونَ","latin":"wa-ammaa tsamuudu fahadaynaahum faistahabbuu al'amaa 'alaa alhudaa fa-akhadzat-hum shaa'iqatu al'adzaabi alhuuni bimaa kaanuu yaksibuuna","translate":{"id":"Dan adapun kaum Tsamud, maka mereka telah Kami beri petunjuk tetapi mereka lebih menyukai buta (kesesatan) daripada petunjuk, maka mereka disambar petir azab yang menghinakan disebabkan apa yang telah mereka kerjakan.\n","en":"And as for [the tribe of] Thamud, We offered them guidance, but they chose blindness in pre­ference to guidance: and so the thunderbolt of shame­ful suffering fell upon them as an outcome of all [the evil] that they had wrought;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4235","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4235.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4235.mp3"]}},{"no":18,"arab":"وَنَجَّيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ","latin":"wanajjaynaa alladziina aamanuu wakaanuu yattaquuna","translate":{"id":"Dan Kami selamatkan orang-orang yang beriman dan mereka adalah orang-orang yang bertakwa.\n","en":"and We saved [only] those who had attained to faith and were conscious of Us."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4236","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4236.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4236.mp3"]}},{"no":19,"arab":"وَيَوْمَ يُحْشَرُ أَعْدَاءُ اللَّهِ إِلَى النَّارِ فَهُمْ يُوزَعُونَ","latin":"wayawma yuhsyaru a'daau allaahi ilaa alnnaari fahum yuuza'uuna","translate":{"id":"Dan (ingatlah) hari (ketika) musuh-musuh Allah di giring ke dalam neraka, lalu mereka dikumpulkan semuanya.\n","en":"Hence, [warn all men of] the Day when the enemies of God shall be gathered together before the fire, and then shall be driven onward,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4237","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4237.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4237.mp3"]}},{"no":20,"arab":"حَتَّىٰ إِذَا مَا جَاءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُمْ بِمَا كَانُوا يَعْمَلُونَ","latin":"hattaa idzaa maa jaauuhaa syahida 'alayhim sam'uhum wa-abshaaruhum wajuluuduhum bimaa kaanuu ya'maluuna","translate":{"id":"Sehingga apabila mereka sampai ke neraka, pendengaran, penglihatan dan kulit mereka menjadi saksi terhadap mereka tentang apa yang telah mereka kerjakan.\n","en":"till, when they come close to it, their hearing and their sight and their [very] skins will bear witness against them, speaking of what they were doing [on earth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4238","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4238.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4238.mp3"]}},{"no":21,"arab":"وَقَالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنَا ۖ قَالُوا أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ","latin":"waqaaluu lijuluudihim lima syahidtum 'alaynaa qaaluu anthaqanaa allaahu alladzii anthaqa kulla syay-in wahuwa khalaqakum awwala marratin wa-ilayhi turja'uuna","translate":{"id":"Dan mereka berkata kepada kulit mereka: \"Mengapa kamu menjadi saksi terhadap kami?\" Kulit mereka menjawab: \"Allah yang menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai (pula) berkata, dan Dia-lah yang menciptakan kamu pada kali pertama dan hanya kepada-Nya lah kamu dikembalikan\".\n","en":"And they will ask their skins, “Why did you bear witness against us?” - [and] these will reply: “God, who gives speech to all things, has given speech to us [as well]: for He [it is who] has created you in the first instance - and unto Him you are [now] brought back."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4239","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4239.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4239.mp3"]}},{"no":22,"arab":"وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَٰكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ","latin":"wamaa kuntum tastatiruuna an yasyhada 'alaykum sam'ukum walaa abshaarukum walaa juluudukum walaakin zhanantum anna allaaha laa ya'lamu katsiiran mimmaa ta'maluuna","translate":{"id":"Kamu sekali-sekali tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan dan kulitmu kepadamu bahkan kamu mengira bahwa Allah tidak mengetahui kebanyakan dari apa yang kamu kerjakan.\n","en":"And you did not try to hide [your sins] lest your hearing or your sight or your skins bear witness against you: nay, but you thought that God did not know much of what you were doing –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4240","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4240.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4240.mp3"]}},{"no":23,"arab":"وَذَٰلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ","latin":"wadzaalikum zhannukumu alladzii zhanantum birabbikum ardaakum fa-ashbahtum mina alkhaasiriina","translate":{"id":"Dan yang demikian itu adalah prasangkamu yang telah kamu sangka kepada Tuhanmu, Dia telah membinasakan kamu, maka jadilah kamu termasuk orang-orang yang merugi.\n","en":"and that very thought which you thought about your Sustainer has brought you to perdition, and so now you find yourselves among the lost!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4241","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4241.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4241.mp3"]}},{"no":24,"arab":"فَإِنْ يَصْبِرُوا فَالنَّارُ مَثْوًى لَهُمْ ۖ وَإِنْ يَسْتَعْتِبُوا فَمَا هُمْ مِنَ الْمُعْتَبِينَ","latin":"fa-in yashbiruu faalnnaaru matswan lahum wa-in yasta'tibuu famaa hum mina almu'tabiina","translate":{"id":"Jika mereka bersabar (menderita azab) maka nerakalah tempat diam mereka dan jika mereka mengemukakan alasan-alasan, maka tidaklah mereka termasuk orang-orang yang diterima alasannya.\n","en":"And then, [even] if they endure [their lot] in patience, the fire will still be their abode; and if they pray to be allowed to make amends, they will not be allowed to do so:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4242","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4242.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4242.mp3"]}},{"no":25,"arab":"وَقَيَّضْنَا لَهُمْ قُرَنَاءَ فَزَيَّنُوا لَهُمْ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ","latin":"waqayyadhnaa lahum quranaa-a fazayyanuu lahum maa bayna aydiihim wamaa khalfahum wahaqqa 'alayhimu alqawlu fii umamin qad khalat min qablihim mina aljinni waal-insi innahum kaanuu khaasiriina","translate":{"id":"Dan Kami tetapkan bagi mereka teman-teman yang menjadikan mereka memandang bagus apa yang ada di hadapan dan di belakang mereka dan tetaplah atas mereka keputusan azab pada umat-umat yang terdahulu sebelum mereka dari jinn dan manusia, sesungguhnya mereka adalah\n","en":"for [when they became obli­vious of Us,] We assigned to them [their own evil impulses as their] other selves, and these made appear goodly to them whatever lay open before them and whatever was beyond their ken. And so, the sentence [of doom] will have fallen due upon them together with the [other sinful] com­munities of invisible beings and humans that passed away before their time: verily, they [all] will indeed be lost!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4243","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4243.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4243.mp3"]}},{"no":26,"arab":"وَقَالَ الَّذِينَ كَفَرُوا لَا تَسْمَعُوا لِهَٰذَا الْقُرْآنِ وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ","latin":"waqaala alladziina kafaruu laa tasma'uu lihaadzaa alqur-aani wailghaw fiihi la'allakum taghlibuuna","translate":{"id":"Dan orang-orang yang kafir berkata: \"Janganlah kamu mendengar dengan sungguh-sungguh akan Al Quraan ini dan buatlah hiruk-pikuk terhadapnya, supaya kamu dapat mengalahkan mereka\".\n","en":"NOW THOSE who are bent on denying the truth say [unto one another]: “Do not listen to this Qur’an, but rather talk frivolously about it, so that you might gain the upper hand!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4244","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4244.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4244.mp3"]}},{"no":27,"arab":"فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كَانُوا يَعْمَلُونَ","latin":"falanudziiqanna alladziina kafaruu 'adzaaban syadiidan walanajziyannahum aswa-a alladzii kaanuu ya'maluuna","translate":{"id":"Maka sesungguhnya Kami akan merasakan azab yang keras kepada orang-orang kafir dan Kami akan memberi balasan kepada mereka dengan seburuk-buruk pembalasan bagi apa yang telah mereka kerjakan.\n","en":"But We shall most certainly give those who are [thus] bent on denying the truth a taste of suffering severe, and We shall most certainly requite them according to the worst of their deeds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4245","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4245.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4245.mp3"]}},{"no":28,"arab":"ذَٰلِكَ جَزَاءُ أَعْدَاءِ اللَّهِ النَّارُ ۖ لَهُمْ فِيهَا دَارُ الْخُلْدِ ۖ جَزَاءً بِمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ","latin":"dzaalika jazaau a'daa-i allaahi alnnaaru lahum fiihaa daaru alkhuldi jazaa-an bimaa kaanuu bi-aayaatinaa yajhaduuna","translate":{"id":"Demikianlah balasan terhadap musuh-musuh Allah, (yaitu) neraka; mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami.\n","en":"That requital of God’s enemies will be the fire [of the hereafter]: in it will they have an abode of immeasurable duration as an outcome of their having knowingly rejected Our messages."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4246","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4246.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4246.mp3"]}},{"no":29,"arab":"وَقَالَ الَّذِينَ كَفَرُوا رَبَّنَا أَرِنَا اللَّذَيْنِ أَضَلَّانَا مِنَ الْجِنِّ وَالْإِنْسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ الْأَسْفَلِينَ","latin":"waqaala alladziina kafaruu rabbanaa arinaa alladzayni adhallaanaa mina aljinni waal-insi naj'alhumaa tahta aqdaaminaa liyakuunaa mina al-asfaliina","translate":{"id":"Dan orang-orang kafir berkata: \"Ya Rabb kami perlihatkanlah kepada kami dua jenis orang yang telah menyesatkan kami (yaitu) sebagian dari jinn dan manusia agar kami letakkan keduanya di bawah telapak kaki kami supaya kedua jenis itu menjadi orang-orang yang hina\".\n","en":"And they who [in their life on earth] were bent on denying the truth will [thereupon] exclaim: “O our Sustainer! Show us those of the invisible beings and humans that have led us astray: we shall trample them underfoot, so that they shall be the lowest of all!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4247","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4247.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4247.mp3"]}},{"no":30,"arab":"إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ","latin":"inna alladziina qaaluu rabbunaa allaahu tsumma istaqaamuu tatanazzalu 'alayhimu almalaa-ikatu allaa takhaafuu walaa tahzanuu wa-absyiruu bialjannati allatii kuntum tuu'aduuna","translate":{"id":"Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\".\n","en":"[But,] behold, as for those who say, “Our Sustainer is God,” and then steadfastly pursue the right way - upon them do angels often descend, [say­ing:] “Fear not and grieve not, but receive the glad tiding of that paradise which has been promised to you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4248","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4248.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4248.mp3"]}},{"no":31,"arab":"نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ","latin":"nahnu awliyaaukum fii alhayaati alddunyaa wafii al-aakhirati walakum fiihaa maa tasytahii anfusukum walakum fiihaa maa tadda'uuna","translate":{"id":"Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya kamu memperoleh apa yang kamu inginkan dan memperoleh (pula) di dalamnya apa yang kamu minta.\n","en":"We are close unto you in the life of this world and [will be so] in the life to come; and in that [life to come] you shall have all that your souls may desire, and in it you shall have all that you ever prayed for,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4249","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4249.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4249.mp3"]}},{"no":32,"arab":"نُزُلًا مِنْ غَفُورٍ رَحِيمٍ","latin":"nuzulan min ghafuurin rahiimin","translate":{"id":"Sebagai hidangan (bagimu) dari Tuhan Yang Maha Pengampun lagi Maha Penyayang.\n","en":"as a ready welcome from Him who is much-forgiving, a dispenser of grace!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4250","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4250.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4250.mp3"]}},{"no":33,"arab":"وَمَنْ أَحْسَنُ قَوْلًا مِمَّنْ دَعَا إِلَى اللَّهِ وَعَمِلَ صَالِحًا وَقَالَ إِنَّنِي مِنَ الْمُسْلِمِينَ","latin":"waman ahsanu qawlan mimman da'aa ilaa allaahi wa'amila shaalihan waqaala innanii mina almusl","translate":{"id":"Siapakah yang lebih baik perkataannya daripada orang yang menyeru kepada Allah, mengerjakan amal yang saleh, dan berkata: \"Sesungguhnya aku termasuk orang-orang yang menyerah diri?\"\n","en":"And who could be better of speech than he who calls [his fellow-men] unto God, and does what is just and right, and says, “Verily, I am of those who have surrendered themselves to God”?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4251","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4251.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4251.mp3"]}},{"no":34,"arab":"وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ","latin":"walaa tastawii alhasanatu walaa alssayyi-atu idfa' biallatii hiya ahsanu fa-idzaa alladzii baynaka wabaynahu 'adaawatun ka-annahu waliyyun hamiimun","translate":{"id":"Dan tidaklah sama kebaikan dan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia.\n","en":"But [since] good and evil cannot be equal, repel thou [evil] with something that is better and lo! he between whom and thyself was enmity [may then become] as though he had [always] been close [unto thee], a true friend!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4252","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4252.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4252.mp3"]}},{"no":35,"arab":"وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ","latin":"wamaa yulaqqaahaa illaa alladziina shabaruu wamaa yulaqqaahaa illaa dzuu hazhzhin 'azhiimin","translate":{"id":"Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keuntungan yang besar.\n","en":"Yet [to achieve] this is not given to any but those who are wont to be patient in adversity: it is not given to any but those endowed with the greatest good fortune!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4253","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4253.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4253.mp3"]}},{"no":36,"arab":"وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","latin":"wa-immaa yanzaghannaka mina alsysyaythaani nazghun faista'idz biallaahi innahu huwa alssamii'u al'aliim","translate":{"id":"Dan jika syetan mengganggumu dengan suatu gangguan, maka mohonlah perlindungan kepada Allah. Sesungguhnya Dia-lah yang Maha Mendengar lagi Maha Mengetahui.\n","en":"Hence, if it should happen that a prompting from Satan stirs thee up [to blind anger], seek refuge with God: behold, He alone is all-hearing, all-knowing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4254","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4254.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4254.mp3"]}},{"no":37,"arab":"وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ ۚ لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ","latin":"wamin aayaatihi allaylu waalnnahaaru waalsysyamsu waalqamaru laa tasjuduu lilsysyamsi walaa lilqamari wausjuduu lillaahi aladzii khalaqahunna in kuntum iyyaahu ta'buduuna","translate":{"id":"Dan di antara tanda-tanda kekuasaan-Nya ialah malam, siang, matahari dan bulan. Janganlah sembah matahari maupun bulan, tapi sembahlah Allah Yang menciptakannya, Jika Ialah yang kamu hendak sembah.\n","en":"Now among His signs are the night and the day, as well as the sun and the moon: [hence,] adore not the sun or the moon, but prostrate yourselves in adoration before God, who has created them - if it is Him whom you [really] worship."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4255","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4255.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4255.mp3"]}},{"no":38,"arab":"فَإِنِ اسْتَكْبَرُوا فَالَّذِينَ عِنْدَ رَبِّكَ يُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ ۩","latin":"fa-ini istakbaruu faalladziina 'inda rabbika yusabbihuuna lahu biallayli waalnnahaari wahum laa yas-amuuna","translate":{"id":"Jika mereka menyombongkan diri, maka mereka (malaikat) yang di sisi Tuhanmu bertasbih kepada-Nya di malam dan siang hari, sedang mereka tidak jemu-jemu.\n","en":"And though some be too proud [to listen to this call], they who [in their hearts] are with thy Sustainer extol His limitless glory by night and by day, and never grow weary [thereof]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4256","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4256.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4256.mp3"]}},{"no":39,"arab":"وَمِنْ آيَاتِهِ أَنَّكَ تَرَى الْأَرْضَ خَاشِعَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ ۚ إِنَّ الَّذِي أَحْيَاهَا لَمُحْيِي الْمَوْتَىٰ ۚ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"wamin aayaatihi annaka taraa al-ardha khaasyi'atan fa-idzaa anzalnaa 'alayhaa almaa-a ihtazzat warabat inna alladzii ahyaahaa lamuhyii almawtaa innahu 'alaa kulli syay-in qadiirun","translate":{"id":"Dan di antara tanda-tanda-Nya (Ialah) bahwa kau lihat bumi kering dan gersang, maka apabila Kami turunkan air di atasnya, niscaya ia bergerak dan subur. Sesungguhnya Tuhan Yang menghidupkannya, Pastilah dapat menghidupkan yang mati. Sesungguhnya Dia Maha Kuasa atas segala sesuatu.\n","en":"For among His signs is this: thou seest the earth lying desolate - and lo! when We send down water upon it, it stirs and swells [with life]! Verily, He who brings it to life can surely give life to the dead [of heart as well]: for, behold, He has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4257","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4257.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4257.mp3"]}},{"no":40,"arab":"إِنَّ الَّذِينَ يُلْحِدُونَ فِي آيَاتِنَا لَا يَخْفَوْنَ عَلَيْنَا ۗ أَفَمَنْ يُلْقَىٰ فِي النَّارِ خَيْرٌ أَمْ مَنْ يَأْتِي آمِنًا يَوْمَ الْقِيَامَةِ ۚ اعْمَلُوا مَا شِئْتُمْ ۖ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","latin":"inna alladziina yulhiduuna fii aayaatinaa laa yakhfawna 'alaynaa afaman yulqaa fii alnnaari khayrun amman ya/tii aaminan yawma alqiyaamati i'maluu maa syi/tum innahu bimaa ta'maluuna bashiir","translate":{"id":"Sesungguhnya orang-orang yang mengingkari ayat-ayat Kami, mereka tidak tersembunyi dari Kami. Maka apakah orang-orang yang dilemparkan ke dalam neraka lebih baik, ataukah orang-orang yang datang dengan aman sentosa pada hari Kiamat? Perbuatlah apa yang kamu kehendaki; Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan.\n","en":"VERILY, they who distort the meaning of Our mes­sages are not hidden from Us: hence, which [of the two] will be in a better state - he that is [destined to be] cast into the fire, or he that shall come secure [before Us] on Resurrection Day? Do what you will: verily, He sees all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4258","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4258.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4258.mp3"]}},{"no":41,"arab":"إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ لَمَّا جَاءَهُمْ ۖ وَإِنَّهُ لَكِتَابٌ عَزِيزٌ","latin":"inna alladziina kafaruu bialdzdzikri lammaa jaa-ahum wa-innahu lakitaabun 'aziizun","translate":{"id":"Sesungguhnya orang-orang yang mengingkari Al Quraan ketika Al Quraan itu datang kepada mereka, (mereka itu pasti akan celaka), dan sesungguhnya Al Quraan itu adalah kitab yang mulia.\n","en":"Verily, they who are bent on denying the truth of this reminder as soon as it comes to them - [they are the losers]: for, behold, it is a sublime divine writ:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4259","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4259.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4259.mp3"]}},{"no":42,"arab":"لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ","latin":"laa ya/tiihi albaathilu min bayni yadayhi walaa min khalfihi tanziilun min hakiimin hamiidin","translate":{"id":"Yang tidak datang kepadanya (Al Quraan) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji.\n","en":"no falsehood can ever attain to it openly, and neither in a stealthy manner, [since it is] bestowed from on high by One who is truly wise, ever to be praised."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4260","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4260.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4260.mp3"]}},{"no":43,"arab":"مَا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِنْ قَبْلِكَ ۚ إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ وَذُو عِقَابٍ أَلِيمٍ","latin":"maa yuqaalu laka illaa maa qad qiila lilrrusuli min qablika inna rabbaka ladzuu maghfiratin wadzuu 'iqaabin aliimin","translate":{"id":"Tidaklah ada yang dikatakan (oleh orang-orang kafir) kepadamu itu selain apa yang sesungguhnya telah dikatakan kepada rasul-rasul sebelum kamu. Sesungguhnya Rabb-mu benar-benar mempunyai ampunan dan hukuman yang pedih.\n","en":"[And as for thee, O Prophet,] nothing is being said to thee but what was said to all [of God’s] apostles before thy time. Behold, thy Sustainer is indeed full of forgiveness - but He has also the power to requite most grie­vously!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4261","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4261.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4261.mp3"]}},{"no":44,"arab":"وَلَوْ جَعَلْنَاهُ قُرْآنًا أَعْجَمِيًّا لَقَالُوا لَوْلَا فُصِّلَتْ آيَاتُهُ ۖ أَأَعْجَمِيٌّ وَعَرَبِيٌّ ۗ قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ ۖ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى ۚ أُولَٰئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ","latin":"walaw ja'alnaahu qur-aanan a'jamiyyan laqaaluu lawlaa fushshilat aayaatuhu a-a'jamiyyun wa'arabiyyun qul huwa lilladziina aamanuu hudan wasyifaaun waalladziina laa yu/minuuna fii aatsaanihim waqrun wahuwa 'alayhim 'aman ulaa-ika yunaadawna min makaanin ba'iidin","translate":{"id":"Dan jikalau Kami jadikan Al Quraan itu suatu bacaan dalam bahasa selain Arab, tentulah mereka mengatakan: \"Mengapa tidak dijelaskan ayat-ayatnya?\" Apakah (patut Al Quraan) dalam bahasa asing sedang (rasul adalah orang) Arab? Katakanlah: \"Al Quraan itu adalah petunjuk dan penawar bagi orang-orang mu'min. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, sedang Al Quraan itu suatu kegelapan bagi mereka . Mereka itu adalah (seperti) yang dipanggil dari tempat yang jauh\".\n","en":"Now if We had willed this [divine writ] to be a discourse in a non-Arabic tongue, they [who now reject it] would surely have said, “Why is it that its messages have not been spelled out clearly? Why - [a message in] a non-Arabic tongue, and [its bearer] an Arab?” Say: “Unto all who have attained to faith, this [divine writ] is a guidance and a source of health; but as for those who will not believe - in their ears is deafness, and so it remains obscure to them: they are [like people who are] being called from too far away."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4262","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4262.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4262.mp3"]}},{"no":45,"arab":"وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ ۗ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّهُمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ","latin":"walaqad aataynaa muusaa alkitaaba faikhtulifa fiihi walawlaa kalimatun sabaqat min rabbika laqudhiya baynahum wa-innahum lafii syakkin minhu muriibin","translate":{"id":"\n","en":"Thus, too, have We vouchsafed revelation unto Moses aforetime, and thereupon disputes arose about it. And [then, as now,] had it not been for a decree that had already gone forth from thy Sustainer, all would indeed have been decided between them [from the outset]. As it is, behold, they [who will not believe in this divine writ] are in grave doubt, amounting to suspicion, about what it portends."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4263","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4263.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4263.mp3"]}},{"no":46,"arab":"مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۗ وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ","latin":"man 'amila shaalihan falinafsihi waman asaa-a fa'alayhaa wamaa rabbuka bizhallaamin lil'abiidi","translate":{"id":"Barangsiapa yang mengerjakan amal yang saleh maka (pahalanya) untuk dirinya sendiri dan barangsiapa mengerjakan perbuatan jahat, maka (dosanya) untuk dirinya sendiri; dan sekali-kali tidaklah Rabb-mu menganiaya hamba-hambaNya.\n","en":"WHOEVER does what is just and right, does so for his own good; and whoever does evil, does so to his own hurt: and never does God do the least wrong to His creatures."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4264","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4264.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4264.mp3"]}},{"no":47,"arab":"إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ وَمَا تَخْرُجُ مِنْ ثَمَرَاتٍ مِنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنْثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِنْ شَهِيدٍ","latin":"ilayhi yuraddu 'ilmu alssaa'ati wamaa takhruju min tsamaraatin min akmaamihaa wamaa tahmilu min untsaa walaa tadha'u illaa bi'ilmihi wayawma yunaadiihim ayna syurakaa-ii qaaluu aadzannaaka maa minnaa min syahiidin","translate":{"id":"Kepada-Nyalah dikembalikan pengetahuan tentang hari Kiamat . Dan tidak ada buah-buahan keluar dari kelopaknya dan tidak seorang perempuanpun mengandung dan tidak (pula) melahirkan, melainkan dengan sepengetahuan-Nya. Pada hari Tuhan memanggil mereka: \"Dimanakah sekutu-sekutu-Ku itu?\" , mereka menjawab: \"Kami nyatakan kepada Engkau bahwa tidak ada seorangpun di antara kami yang memberi kesaksian (bahwa Engkau punya sekutu)\".\n","en":"In Him alone is vested the knowledge of when the Last Hour will come. And no fruit bursts forth from its calyx, and no female ever conceives, nor ever gives birth, save with His knowledge. And so, on the Day when He shall call out to them, “Where, now, are those [alleged] partners of Mine?” - they will [surely] answer, “We confess unto Thee that none of us can bear witness [to anyone’s having a share in Thy divinity]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4265","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4265.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4265.mp3"]}},{"no":48,"arab":"وَضَلَّ عَنْهُمْ مَا كَانُوا يَدْعُونَ مِنْ قَبْلُ ۖ وَظَنُّوا مَا لَهُمْ مِنْ مَحِيصٍ","latin":"wadhalla 'anhum maa kaanuu yad'uuna min qablu wazhannuu maa lahum min mahiishin","translate":{"id":"Dan hilang lenyaplah dari mereka apa yang selalu mereka sembah dahulu, dan mereka yakin bahwa tidak ada bagi mereka satu jalan keluarpun.\n","en":"And so, all that they were wont to invoke aforetime will have forsaken them; and they shall know for certain that there is no escape for them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4266","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4266.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4266.mp3"]}},{"no":49,"arab":"لَا يَسْأَمُ الْإِنْسَانُ مِنْ دُعَاءِ الْخَيْرِ وَإِنْ مَسَّهُ الشَّرُّ فَيَئُوسٌ قَنُوطٌ","latin":"laa yas-amu al-insaanu min du'aa-i alkhayri wa-in massahu alsysyarru fayauusun qanuuthu","translate":{"id":"Manusia tidak jemu memohon kebaikan, dan jika mereka ditimpa malapetaka dia menjadi putus asa lagi putus harapan.\n","en":"MAN NEVER TIRES of asking for the good [things of life]; and if evil fortune touches him, he abandons all hope, giving himself up to despair."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4267","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4267.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4267.mp3"]}},{"no":50,"arab":"وَلَئِنْ أَذَقْنَاهُ رَحْمَةً مِنَّا مِنْ بَعْدِ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ هَٰذَا لِي وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُجِعْتُ إِلَىٰ رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنَىٰ ۚ فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُمْ مِنْ عَذَابٍ غَلِيظٍ","latin":"wala-in adzaqnaahu rahmatan minnaa min ba'di dharraa-a massat-hu layaquulanna haadzaa lii wamaa azhunnu alssaa'ata qaa-imatan wala-in ruji'tu ilaa rabbii inna lii 'indahu lalhusnaa falanunabbi-anna alladziina kafaruu bimaa 'amiluu walanudziiqannahum min 'adzaabin ghaliizhin","translate":{"id":"Dan jika Kami merasakan kepadanya sesuatu rahmat dari Kami sesudah dia ditimpa kesusahan, pastilah dia berkata: \"Ini adalah hakku, dan aku tidak yakin bahwa hari Kiamat itu akan datang. Dan jika aku dikembalikan kepada Tuhanku maka sesungguhnya aku akan memperoleh kebaikan pada sisiNya.\" Maka Kami benar-benar akan memberitakan kepada orang-orang kafir apa yang telah mereka kerjakan dan akan Kami rasakan kepada mereka azab yang keras.\n","en":"Yet whenever We let him taste some of Our grace after hardship has visited him, he is sure to say, “This is but my due!” - and, “I do not think that the Last Hour will ever come: but if [it should come, and] I should indeed be brought back unto my Sus­tainer, then, behold, the ultimate good awaits me with Him! But [on the Day of Judgment] We shall most cer­tainly give those who were bent on denying the truth full understanding of all that they ever did, and shall most certainly give them [thereby] a taste of suffering severe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4268","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4268.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4268.mp3"]}},{"no":51,"arab":"وَإِذَا أَنْعَمْنَا عَلَى الْإِنْسَانِ أَعْرَضَ وَنَأَىٰ بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ فَذُو دُعَاءٍ عَرِيضٍ","latin":"wa-idzaa an'amnaa 'alaa al-insaani a'radha wanaaa bijaanibihi wa-idzaa massahu alsysyarru fadzuu du'aa-in 'ariidhin","translate":{"id":"Dan apabila Kami memberikan ni'mat kepada manusia, ia berpaling dan menjauhkan diri; tetapi apabila ia ditimpa malapetaka, maka ia banyak berdo'a.\n","en":"And, too, when We bestow Our blessings upon man, he tends to turn aside and keep aloof [from remembering Us]; but as soon as evil fortune touches him, he is full of wordy prayers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4269","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4269.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4269.mp3"]}},{"no":52,"arab":"قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ ثُمَّ كَفَرْتُمْ بِهِ مَنْ أَضَلُّ مِمَّنْ هُوَ فِي شِقَاقٍ بَعِيدٍ","latin":"qul ara-aytum in kaana min 'indi allaahi tsumma kafartum bihi man adhallu mimman huwa fii syiqaaqin ba'iidin","translate":{"id":"Katakanlah: \"Bagaimana pendapatmu jika (Al Quraan) itu datang dari sisi Allah, kemudian kamu mengingkarinya. Siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh?\"\n","en":"HAVE YOU given thought [to how you will fare] if this be truly [a revelation] from God, the while you deny its truth? Who could be more astray than one who places himself [so] deeply in the wrong?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4270","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4270.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4270.mp3"]}},{"no":53,"arab":"سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ","latin":"sanuriihim aayaatinaa fii al-aafaaqi wafii anfusihim hattaa yatabayyana lahum annahu alhaqqu awa lam yakfi birabbika annahu 'alaa kulli syay-in syahiidun","translate":{"id":"Kami akan memperlihatkan kepada mereka tanda-tanda (kekuasaan) Kami di segala wilayah bumi dan pada diri mereka sendiri, hingga jelas bagi mereka bahwa Al Quraan itu adalah benar. Tiadakah cukup bahwa sesungguhnya Tuhanmu menjadi saksi atas segala sesuatu?\n","en":"In time We shall make them fully understand Our messages [through what they perceive] in the utmost horizons [of the universe] and within them­selves, so that it will become clear unto them that this [revelation] is indeed the truth. [Still,] is it not enough [for them to know] that thy Sustainer is witness unto everything?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4271","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4271.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4271.mp3"]}},{"no":54,"arab":"أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ ۗ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ","latin":"alaa innahum fii miryatin min liqaa-i rabbihim alaa innahu bikulli syay-in muhiithun","translate":{"id":"Ingatlah bahwa sesungguhnya mereka adalah dalam keraguan tentang pertemuan dengan Tuhan mereka. Ingatlah bahwa sesungguhnya Dia Maha Meliputi segala sesuatu.\n","en":"Oh, verily, they are in doubt as to whether they will meet their Sustainer [on Judgment Day]! Oh, verily, He encompasses everything!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4272","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4272.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4272.mp3"]}}]}