{"alquran":{"no":42,"name":"Ash-Shura","arab":"الشورى","start":4272,"count":53,"rukku":5,"type":"mecca","description":"Surat Asy Syuura terdiri atas 53 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Fushshilat. Dinamai dengan <i>Asy Syuura</i> (musyawarat) diambil dari perkataan <i>Syuura</i> yang terdapat pada ayat 38 surat ini. Dalam ayat tersebut diletakkan salah satu dari dasar-dasar pemerintahan Islam ialah musyawarat. Dinamai juga <i>Haa Miim 'Ain Siin Qaaf</i> karena surat ini dimulai dengan huruf-huruf hijaiyah itu."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim .\n","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4273","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4273.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4273.mp3"]}},{"no":2,"arab":"عسق","latin":"'ayn-siin-qaaf","translate":{"id":"'Ain Siin Qaaf .\n","en":"Ayn. Sin. Qaf."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4274","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4274.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4274.mp3"]}},{"no":3,"arab":"كَذَٰلِكَ يُوحِي إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ","latin":"kadzaalika yuuhii ilayka wa-ilaa alladziina min qablika allaahu al'aziizu alhakiimu","translate":{"id":"Demikianlah Allah Yang Maha Perkasa lagi Maha Bijaksana, mewahyukan kepada kamu dan kepada orang-orang sebelum kamu.\n","en":"THUS has God, the Almighty, the Wise, revealed [the truth] unto thee, [O Muhammad,] and unto those who preceded thee:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4275","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4275.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4275.mp3"]}},{"no":4,"arab":"لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَلِيُّ الْعَظِيمُ","latin":"lahu maa fii alssamaawaati wamaa fii al-ardhi wahuwa al'aliyyu al'azhiimu","translate":{"id":"Kepunyaan-Nya-lah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah yang Maha Tinggi lagi Maha Besar.\n","en":"His is all that is in the heavens and all that is on earth; and most exalted, tremendous is He."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4276","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4276.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4276.mp3"]}},{"no":5,"arab":"تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْ فَوْقِهِنَّ ۚ وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ ۗ أَلَا إِنَّ اللَّهَ هُوَ الْغَفُورُ الرَّحِيمُ","latin":"takaadu alssamaawaatu yatafaththharna min fawqihinna waalmalaa-ikatu yusabbihuuna bihamdi rabbihim wayastaghfiruuna liman fii al-ardhi alaa inna allaaha huwa alghafuuru alrrahiimu","translate":{"id":"Hampir saja langit itu pecah dari sebelah atas (karena kebesaran Tuhan) dan malaikat-malaikat bertasbih serta memuji Tuhan-nya dan memohonkan ampun bagi orang-orang yang ada di bumi. Ingatlah, bahwa sesungguhnya Allah Dia-lah Yang Maha Pengampun lagi Penyayang.\n","en":"The uppermost heavens are well-nigh rent asunder [for awe of Him]; and the angels extol their Sustainer’s limitless glory and praise, and ask for­giveness for all who are on earth. Oh, verily, God alone is truly-forgiving, a dispenser of grace!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4277","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4277.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4277.mp3"]}},{"no":6,"arab":"وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ اللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ","latin":"waalladziina ittakhadzuu min duunihi awliyaa-a allaahu hafiizhun 'alayhim wamaa anta 'alayhim biwakiilin","translate":{"id":"Dan orang-orang yang mengambil pelindung-pelindung selain Allah, Allah mengawasi (perbuatan) mereka; dan kamu (ya Muhammad) bukanlah orang yang diserahi mengawasi mereka.\n","en":"NOW AS FOR those who take aught beside Him for their protectors - God watches them, and thou art not responsible for their conduct."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4278","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4278.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4278.mp3"]}},{"no":7,"arab":"وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ قُرْآنًا عَرَبِيًّا لِتُنْذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا وَتُنْذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيهِ ۚ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ","latin":"wakadzaalika awhaynaa ilayka qur-aanan 'arabiyyan litundzira umma alquraa waman hawlahaa watundzira yawma aljam'i laa rayba fiihi fariiqun fii aljannati wafariiqun fii alssa'iiri","translate":{"id":"Demikianlah Kami wahyukan kepadamu Al Qur'an dalam bahasa Arab, supaya kamu memberi peringatan kepada ummul Qura (penduduk Mekah) dan penduduk (negeri-negeri) sekelilingnya serta memberi peringatan (pula) tentang hari berkumpul (kiamat) yang tidak ada keraguan padanya. Segolongan masuk surga, dan segolongan masuk Jahannam.\n","en":"[Thou art but entrusted with Our message:] and so We have revealed unto thee a discourse in the Arabic tongue in order that thou mayest warn the foremost of all cities and all who dwell around it to wit, warn [them] of the Day of the Gathering, [the coming of] which is beyond all doubt: [the Day when] some shall find themselves in paradise, and some in the blazing flame."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4279","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4279.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4279.mp3"]}},{"no":8,"arab":"وَلَوْ شَاءَ اللَّهُ لَجَعَلَهُمْ أُمَّةً وَاحِدَةً وَلَٰكِنْ يُدْخِلُ مَنْ يَشَاءُ فِي رَحْمَتِهِ ۚ وَالظَّالِمُونَ مَا لَهُمْ مِنْ وَلِيٍّ وَلَا نَصِيرٍ","latin":"walaw syaa-a allaahu laja'alahum ummatan waahidatan walaakin yudkhilu man yasyaau fii rahmatihi waalzhzhaalimuuna maa lahum min waliyyin walaa nashiirin","translate":{"id":"Dan kalau Allah menghendaki niscaya Allah menjadikan mereka satu umat (saja), tetapi Dia memasukkan orang-orang yang dikehendaki-Nya ke dalam rahmat-Nya. Dan orang-orang yang zalim tidak ada bagi mereka seorang pelindungpun dan tidak pula seorang penolong.\n","en":"Now had God so willed, He could surely have made them all one single community: none the less, He admits unto His grace him that wills [to be admitted] whereas the evildoers shall have none to protect them and none to succour them [on Judgment Day]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4280","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4280.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4280.mp3"]}},{"no":9,"arab":"أَمِ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ ۖ فَاللَّهُ هُوَ الْوَلِيُّ وَهُوَ يُحْيِي الْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"ami ittakhadzuu min duunihi awliyaa-a faallaahu huwa alwaliyyu wahuwa yuhyii almawtaa wahuwa 'alaa kulli syay-in qadiirun","translate":{"id":"Atau patutkah mereka mengambil pelindung-pelindung selain Allah? Maka Allah, Dialah pelindung (yang sebenarnya) dan Dia menghidupkan orang-orang yang mati, dan Dia adalah Maha Kuasa atas segala sesuatu.\n","en":"Did they, perchance, [think that they could] choose protectors other than Him? But God alone is the Protector [of all that exists], since it is He alone who brings the dead to life, and He alone who has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4281","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4281.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4281.mp3"]}},{"no":10,"arab":"وَمَا اخْتَلَفْتُمْ فِيهِ مِنْ شَيْءٍ فَحُكْمُهُ إِلَى اللَّهِ ۚ ذَٰلِكُمُ اللَّهُ رَبِّي عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ","latin":"wamaa ikhtalaftum fiihi min syay-in fahukmuhu ilaa allaahi dzaalikumu allaahu rabbii 'alayhi tawakkaltu wa-ilayhi uniibu","translate":{"id":"Tentang sesuatu apapun kamu berselisih, maka putusannya (terserah) kepada Allah. (Yang mempunyai sifat-sifat demikian) itulah Allah Tuhanku. Kepada-Nya lah aku bertawakkal dan kepada-Nyalah aku kembali.\n","en":"AND ON WHATEVER you may differ, [O believers,] the verdict thereon rests with God. [Say, therefore:] “Such is God, my Sustainer: in Him have I placed my trust, and unto Him do I always turn!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4282","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4282.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4282.mp3"]}},{"no":11,"arab":"فَاطِرُ السَّمَاوَاتِ وَالْأَرْضِ ۚ جَعَلَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا وَمِنَ الْأَنْعَامِ أَزْوَاجًا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ","latin":"faathiru alssamaawaati waal-ardhi ja'ala lakum min anfusikum azwaajan wamina al-an'aami azwaajan yadzraukum fiihi laysa kamitslihi syay-un wahuwa alssamii'u albashiiru","translate":{"id":"(Dia) Pencipta langit dan bumi. Dia menjadikan bagi kamu dari jenis kamu sendiri pasangan-pasangan dan dari jenis binatang ternak pasangan-pasangan (pula), dijadikan-Nya kamu berkembang biak dengan jalan itu. Tidak ada sesuatupun yang serupa dengan Dia, dan Dia-lah yang Maha Mendengar dan Melihat.\n","en":"The Originator [is He] of the heavens and the earth. He has given you mates of your own kind just as [He has willed that] among the beasts [there be] mates - to multiply you thereby: [but] there is nothing like unto Him, and He alone is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4283","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4283.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4283.mp3"]}},{"no":12,"arab":"لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"lahu maqaaliidu alssamaawaati waal-ardhi yabsuthu alrrizqa liman yasyaau wayaqdiru innahu bikulli syay-in 'aliimun","translate":{"id":"Kepunyaan-Nya-lah perbendaharaan langit dan bumi; Dia melapangkan rezki bagi siapa yang dikehendaki-Nya dan menyempitkan(nya). Sesungguhnya Dia Maha Mengetahui segala sesuatu.\n","en":"His are the keys of the heavens and the earth: He grants abundant sustenance, or gives it in scant measure, unto whomever He wills: for, behold, He has full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4284","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4284.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4284.mp3"]}},{"no":13,"arab":"شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّىٰ بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ ۖ أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ ۚ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ اللَّهُ يَجْتَبِي إِلَيْهِ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ يُنِيبُ","latin":"syara'a lakum mina alddiini maa washshaa bihi nuuhan waalladzii awhaynaa ilayka wamaa washshaynaa bihi ibraahiima wamuusaa wa'iisaa an aqiimuu alddiina walaa tatafarraquu fiihi kabura 'alaa almusyrikiina maa tad'uuhum ilayhi allaahu yajtabii ilayhi man yasyaau wayahdii ilayhi man yuniibu","translate":{"id":"Dia telah mensyari'atkan bagi kamu tentang agama apa yang telah diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu : Tegakkanlah agama dan janganlah kamu berpecah belah tentangnya. Amat berat bagi orang-orang musyrik agama yang kamu seru mereka kepadanya. Allah menarik kepada agama itu orang yang dikehendaki-Nya dan memberi petunjuk kepada (agama)-Nya orang yang kembali (kepada-Nya).\n","en":"In matters of faith, He has ordained for you that which He had enjoined upon Noah - and into which We gave thee [O Muhammad] insight through revelation as well as that which We had enjoined upon Abraham, and Moses, and Jesus: Steadfastly uphold the [true] faith, and do not break up your unity therein. [And even though] that [unity of faith] to which thou callest them appears oppressive to those who are wont to ascribe to other beings or forces a share in His divinity, God draws unto Himself everyone who is willing, and guides unto Himself everyone who turns unto Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4285","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4285.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4285.mp3"]}},{"no":14,"arab":"وَمَا تَفَرَّقُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ إِلَىٰ أَجَلٍ مُسَمًّى لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّ الَّذِينَ أُورِثُوا الْكِتَابَ مِنْ بَعْدِهِمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ","latin":"wamaa tafarraquu illaa min ba'di maa jaa-ahumu al'ilmu baghyan baynahum walawlaa kalimatun sabaqat min rabbika ilaa ajalin musamman laqudhiya baynahum wa-inna alladziina uuritsuu alkitaaba min ba'dihim lafii syakkin minhu muriibin","translate":{"id":"Dan mereka (ahli kitab) tidak berpecah belah, kecuali setelah datang pada mereka ilmu pengetahuan, karena kedengkian di antara mereka . Kalau tidaklah karena sesuatu ketetapan yang telah ada dari Tuhanmu dahulunya (untuk menangguhkan azab) sampai kepada waktu yang ditentukan, pastilah mereka telah dibinasakan. Dan sesungguhnya orang-orang yang diwariskan kepada mereka Al-Kitab (Taurat dan Injil) sesudah mereka, benar-benar berada dalam keraguan yang menggoncangkan tentang kitab itu.\n","en":"And [as for the followers of earlier revelation,] they broke up their unity, out of mutual jealousy, only after they had come to know [the truth]. And had it not been for a decree that had already gone forth from thy Sustainer, [postponing all decision] until a term set [by Him], all would indeed have been decided between them [from the outset]. As it is, behold, they who have inherited their divine writ from those who preceded them are [now] in grave doubt, amounting to suspicion, about what it por­tends."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4286","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4286.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4286.mp3"]}},{"no":15,"arab":"فَلِذَٰلِكَ فَادْعُ ۖ وَاسْتَقِمْ كَمَا أُمِرْتَ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ ۖ وَقُلْ آمَنْتُ بِمَا أَنْزَلَ اللَّهُ مِنْ كِتَابٍ ۖ وَأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ ۖ اللَّهُ رَبُّنَا وَرَبُّكُمْ ۖ لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ ۖ لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ ۖ اللَّهُ يَجْمَعُ بَيْنَنَا ۖ وَإِلَيْهِ الْمَصِيرُ","latin":"falidzaalika faud'u waistaqim kamaa umirta walaa tattabi' ahwaa-ahum waqul aamantu bimaa anzala allaahu min kitaabin waumirtu li-a'dila baynakum allaahu rabbunaa warabbukum lanaa a'maalunaa walakum a'maalukum laa hujjata baynanaa wabaynakumu allaahu yajma'u baynanaa wa-ilayhi almashiiru","translate":{"id":"Maka karena itu serulah (mereka kepada agama ini) dan tetaplah sebagai mana diperintahkan kepadamu dan janganlah mengikuti hawa nafsu mereka dan katakanlah : \"Aku beriman kepada semua Kitab yang diturunkan Allah dan aku diperintahkan supaya berlaku adil diantara kamu. Allah-lah Tuhan kami dan Tuhan kamu. Bagi kami amal-amal kami dan bagi kamu amal-amal kamu. Tidak ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita dan kepada-Nyalah kembali (kita) \".\n","en":"Because of this, then, summon [all mankind], and pursue the right course, as thou hast been bidden [by God]; and do not follow their likes and dislikes, but say: “I believe in whatever revelation God has be­stowed from on high; and I am bidden to bring about equity in your mutual views. God is our Sustainer as well as your Sustainer. To us shall be accounted our deeds, and to you, your deeds. Let there be no contention between us and you: God will bring us all together - for with Him is all journeys’ end.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4287","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4287.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4287.mp3"]}},{"no":16,"arab":"وَالَّذِينَ يُحَاجُّونَ فِي اللَّهِ مِنْ بَعْدِ مَا اسْتُجِيبَ لَهُ حُجَّتُهُمْ دَاحِضَةٌ عِنْدَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَلَهُمْ عَذَابٌ شَدِيدٌ","latin":"waalladziina yuhaajjuuna fii allaahi min ba'di maa istujiiba lahu hujjatuhum daahidhatun 'inda rabbihim wa'alayhim ghadhabun walahum 'adzaabun syadiidun","translate":{"id":"Dan orang-orang yang membantah (agama) Allah sesudah agama itu diterima maka bantahan mereka itu sia-sia saja, di sisi Tuhan mereka. Mereka mendapat kemurkaan (Allah) dan bagi mereka azab yang sangat keras.\n","en":"And as for those who would [still] argue about God after He has been acknowledged [by them] all their arguments are null and void in their Sustainer’s sight, and upon them will fall [His] condemnation, and for them is suffering severe in store:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4288","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4288.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4288.mp3"]}},{"no":17,"arab":"اللَّهُ الَّذِي أَنْزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ ۗ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ","latin":"allaahu alladzii anzala alkitaaba bialhaqqi waalmiizaani wamaa yudriika la'alla alssaa'ata qariibun","translate":{"id":"Allah-lah yang menurunkan kitab dengan (membawa) kebenaran dan (menurunkan) neraca (keadilan). Dan tahukah kamu, boleh jadi hari kiamat itu (sudah) dekat ?\n","en":"[for] it is God [Himself] who has bestowed revelation from on high, setting forth the truth, and [thus given man] a balance [wherewith to weigh right and wrong]. And for all thou knowest, the Last Hour may well be near!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4289","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4289.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4289.mp3"]}},{"no":18,"arab":"يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا ۖ وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَقُّ ۗ أَلَا إِنَّ الَّذِينَ يُمَارُونَ فِي السَّاعَةِ لَفِي ضَلَالٍ بَعِيدٍ","latin":"yasta'jilu bihaa alladziina laa yu/minuuna bihaa waalladziina aamanuu musyfiquuna minhaa waya'lamuuna annahaa alhaqqu alaa inna alladziina yumaaruuna fii alssaa'ati lafii dhalaalin ba'iidin","translate":{"id":"Orang-orang yang tidak beriman kepada hari kiamat meminta supaya hari itu segera didatangkan dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu benar-benar dalam kesesatan yang jauh.\n","en":"Those who do not believe in it [mockingly] ask for its speedy advent whereas those who have attained to faith stand in awe of it, and know it to be the truth. Oh, verily, they who call the Last Hour in question have indeed gone far astray!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4290","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4290.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4290.mp3"]}},{"no":19,"arab":"اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَنْ يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ","latin":"allaahu lathiifun bi'ibaadihi yarzuqu man yasyaau wahuwa alqawiyyu al'aziizu","translate":{"id":"Allah Maha lembut terhadap hamba-hamba-Nya; Dia memberi rezki kepada yang di kehendaki-Nya dan Dialah Yang Maha Kuat lagi Maha Perkasa.\n","en":"GOD is most kind unto His creatures: He provides sustenance for whomever He wills - for He alone is powerful, almighty!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4291","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4291.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4291.mp3"]}},{"no":20,"arab":"مَنْ كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ ۖ وَمَنْ كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِنْ نَصِيبٍ","latin":"man kaana yuriidu hartsa al-aakhirati nazid lahu fii hartsihi waman kaana yuriidu hartsa alddunyaa nu/tihi minhaa wamaa lahu fii al-aakhirati min nashiibin","translate":{"id":"Barang siapa yang menghendaki keuntungan di akhirat akan Kami tambah keuntungan itu baginya dan barang siapa yang menghendaki keuntungan di dunia Kami berikan kepadanya sebagian dari keuntungan dunia dan tidak ada baginya suatu bahagianpun di akhirat.\n","en":"To him who desires a harvest in the life to come, We shall grant an increase in his harvest; whereas to him who desires [but] a harvest in this world, We [may] give something thereof - but he will have no share in [the blessings of] the life to come."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4292","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4292.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4292.mp3"]}},{"no":21,"arab":"أَمْ لَهُمْ شُرَكَاءُ شَرَعُوا لَهُمْ مِنَ الدِّينِ مَا لَمْ يَأْذَنْ بِهِ اللَّهُ ۚ وَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ","latin":"am lahum syurakaau syara'uu lahum mina alddiini maa lam ya/dzan bihi allaahu walawlaa kalimatu alfashli laqudhiya baynahum wa-inna alzhzhaalimiina lahum 'adzaabun aliimun","translate":{"id":"Apakah mereka mempunyai sembahan-sembahan selain Allah yang mensyariatkan untuk mereka agama yang tidak diizinkan Allah? Sekiranya tak ada ketetapan yang menentukan (dari Allah) tentulah mereka telah dibinasakan. Dan sesungguhnya orang-orang yang zalim itu akan memperoleh azab yang amat pedih.\n","en":"Is it that they [who care for no more than this world] believe in forces supposed to have a share in God’s divinity, which enjoin upon them as a moral law something that God has never allowed? Now were it not for [God’s] decree on the final judgment, all would indeed have been decided be­tween them [in this world]: but, verily, grievous suffering awaits the evildoers [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4293","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4293.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4293.mp3"]}},{"no":22,"arab":"تَرَى الظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا وَهُوَ وَاقِعٌ بِهِمْ ۗ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي رَوْضَاتِ الْجَنَّاتِ ۖ لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ","latin":"taraa alzhzhaalimiina musyfiqiina mimmaa kasabuu wahuwa waaqi'un bihim waalladziina aamanuu wa'amiluu alshshaalihaati fii rawdaati aljannaati lahum maa yasyaauuna 'inda rabbihim dzaalika huwa alfadhlu alkabiiru","translate":{"id":"Kamu lihat orang-orang yang zalim sangat ketakutan karena kejahatan-kejahatan yang telah mereka kerjakan, sedang siksaan menimpa mereka. Dan orang-orang yang beriman serta mengerjakan amal saleh (berada) di dalam taman-taman surga, mereka memperoleh apa yang mereka kehendaki di sisi Tuhan mereka. Yang demikian itu adalah karunia yang besar.\n","en":"[In that life to come,] thou wilt see the evil­doers full of fear at [the thought of] what they have earned: for [now] it is bound to fall back upon them. And in the flowering meadows of the gardens [of paradise thou wilt see] those who have attained to faith and done righteous deeds: all that they might desire shall they have with their Sustainer: [and] this, this is the great bounty –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4294","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4294.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4294.mp3"]}},{"no":23,"arab":"ذَٰلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبَادَهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۗ قُلْ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي الْقُرْبَىٰ ۗ وَمَنْ يَقْتَرِفْ حَسَنَةً نَزِدْ لَهُ فِيهَا حُسْنًا ۚ إِنَّ اللَّهَ غَفُورٌ شَكُورٌ","latin":"dzaalika alladzii yubasysyiru allaahu 'ibaadahu alladziina aamanuu wa'amiluu alshshaalihaati qul laa as-alukum 'alayhi ajran illaa almawaddata fii alqurbaa waman yaqtarif hasanatan nazid lahu fiihaa husnan inna allaaha ghafuurun syakuurun","translate":{"id":"Itulah (karunia) yang (dengan itu) Allah menggembirakan hamba- hamba-Nya yang beriman dan mengerjakan amal yang saleh. Katakanlah: \"Aku tidak meminta kepadamu sesuatu upahpun atas seruanku kecuali kasih sayang dalam kekeluargaan\". Dan siapa yang mengerjakan kebaikan akan Kami tambahkan baginya kebaikan pada kebaikannya itu. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri .\n","en":"that [bounty] whereof God gives the glad tiding to such of His servants as attain to faith and do righteous deeds. Say [O Prophet]: “No reward do I ask of you for this [message] other than [that you should] love your fellow-men.” For, if anyone gains [the merit of] a good deed, We shall grant him through it an increase of good: and, verily, God is much-forgiving, ever responsive to gratitude."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4295","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4295.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4295.mp3"]}},{"no":24,"arab":"أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِنْ يَشَإِ اللَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"am yaquuluuna iftaraa 'alaa allaahi kadziban fa-in yasya-i allaahu yakhtim 'alaa qalbika wayamhu allaahu albaathila wayuhiqqu alhaqqa bikalimaatihi innahu 'aliimun bidzaati alshshuduuri","translate":{"id":"Bahkan mereka mengatakan: \" Dia (Muhammad) telah mengada-adakan dusta terhadap Allah \". Maka jika Allah menghendaki niscaya Dia mengunci mati hatimu; dan Allah menghapuskan yang batil dan membenarkan yang hak dengan kalimat-kalimat-Nya (Al Qur'an). Sesungguhnya Dia Maha Mengetahui segala isi hati.\n","en":"DO THEY, perchance, say, “[Muhammad] has attri­buted his own lying inventions to God”? But then, had God so willed, He could have sealed thy heart [forever]: for God blots out all falsehood, and by His words proves the truth to be true. Verily, He has full knowledge of what is in the hearts [of men];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4296","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4296.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4296.mp3"]}},{"no":25,"arab":"وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ","latin":"wahuwa alladzii yaqbalu alttawbata 'an 'ibaadihi waya'fuu 'ani alssayyi-ati waya'lamu maa taf'aluuna","translate":{"id":"Dan Dialah yang menerima taubat dari hamba-hamba-Nya dan memaafkan kesalahan-kesalahan dan mengetahui apa yang kamu kerjakan,\n","en":"and it is He who accepts repen­tance from His servants, and pardons bad deeds, and knows all that you do,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4297","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4297.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4297.mp3"]}},{"no":26,"arab":"وَيَسْتَجِيبُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَيَزِيدُهُمْ مِنْ فَضْلِهِ ۚ وَالْكَافِرُونَ لَهُمْ عَذَابٌ شَدِيدٌ","latin":"wayastajiibu alladziina aamanuu wa'amiluu alshshaalihaati wayaziiduhum min fadhlihi waalkaafiruuna lahum 'adzaabun syadiidun","translate":{"id":"dan Dia memperkenankan (doa) orang-orang yang beriman serta mengerjakan amal yang saleh dan menambah (pahala) kepada mereka dari karunia-Nya. Dan orang-orang yang kafir bagi mereka azab yang sangat keras.\n","en":"and responds unto all who attain to faith and do righteous deeds; and [it is He who, in the life to come,] will give them, out of His bounty, far more [than they will have deserved], whereas for the deniers of the truth there is [but] suffering severe in store."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4298","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4298.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4298.mp3"]}},{"no":27,"arab":"وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ ۚ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ","latin":"walaw basatha allaahu alrrizqa li'ibaadihi labaghaw fii al-ardhi walaakin yunazzilu biqadarin maa yasyaau innahu bi'ibaadihi khabiirun bashiirun","translate":{"id":"Dan jikalau Allah melapangkan rezki kepada hamba-hamba-Nya tentulah mereka akan melampaui batas di muka bumi, tetapi Allah menurunkan apa yang dikehendaki-Nya dengan ukuran. Sesungguhnya Dia Maha Mengetahui (keadaan) hamba-hamba-Nya lagi Maha Melihat.\n","en":"For, if God were to grant [in this world] abundant sustenance to [all of] His servants, they would behave on earth with wanton insolence: but as it is, He bestows [His grace] from on high in due measure, as He wills: for, verily, He is fully aware of [the needs of] His creatures, and sees them all."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4299","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4299.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4299.mp3"]}},{"no":28,"arab":"وَهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ مِنْ بَعْدِ مَا قَنَطُوا وَيَنْشُرُ رَحْمَتَهُ ۚ وَهُوَ الْوَلِيُّ الْحَمِيدُ","latin":"wahuwa alladzii yunazzilu alghaytsa min ba'di maa qanathuu wayansyuru rahmatahu wahuwa alwaliyyu alhamiidu","translate":{"id":"Dan Dialah Yang menurunkan hujan sesudah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Yang Maha Pelindung lagi Maha Terpuji.\n","en":"And it is He who sends down rain after [men] have lost all hope, and unfolds His grace [thereby]: for He alone is [their] Protector, the One to whom all praise is due."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4300","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4300.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4300.mp3"]}},{"no":29,"arab":"وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَثَّ فِيهِمَا مِنْ دَابَّةٍ ۚ وَهُوَ عَلَىٰ جَمْعِهِمْ إِذَا يَشَاءُ قَدِيرٌ","latin":"wamin aayaatihi khalqu alssamaawaati waal-ardhi wamaa batstsa fiihimaa min daabbatin wahuwa 'alaa jam'ihim idzaa yasyaau qadiirun","translate":{"id":"Di antara (ayat-ayat) tanda-tanda-Nya ialah menciptakan langit dan bumi dan makhluk-makhluk yang melata Yang Dia sebarkan pada keduanya. Dan Dia Maha Kuasa mengumpulkan semuanya apabila dikehendaki-Nya.\n","en":"And among His signs is the [very] creation of the heavens and the earth, and of all the living creatures which He has caused to multiply throughout them: and [since He has created them,] He has [also] the power to gather them [unto Him­self] whenever He wills."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4301","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4301.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4301.mp3"]}},{"no":30,"arab":"وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَنْ كَثِيرٍ","latin":"wamaa ashaabakum min mushiibatin fabimaa kasabat aydiikum waya'fuu 'an katsiirin","translate":{"id":"Dan apa saja musibah yang menimpa kamu maka adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan sebagian besar (dari kesalahan-kesalahanmu).\n","en":"Now whatever calamity may befall you [on Judgment Day] will be an outcome of what your own hands have wrought, although He pardons much;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4302","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4302.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4302.mp3"]}},{"no":31,"arab":"وَمَا أَنْتُمْ بِمُعْجِزِينَ فِي الْأَرْضِ ۖ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ","latin":"wamaa antum bimu'jiziina fii al-ardhi wamaa lakum min duuni allaahi min waliyyin walaa nashiirin","translate":{"id":"Dan kamu tidak dapat melepaskan diri (dari azab Allah) di muka bumi, dan kamu tidak memperoleh seorang pelindung dan tidak pula penolong selain Allah.\n","en":"and you cannot elude Him on earth, and you will have none to protect you from God [in the life to come], and none to bring you succour."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4303","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4303.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4303.mp3"]}},{"no":32,"arab":"وَمِنْ آيَاتِهِ الْجَوَارِ فِي الْبَحْرِ كَالْأَعْلَامِ","latin":"wamin aayaatihi aljawaari fii albahri kaal-a'laami","translate":{"id":"Dan di antara tanda-tanda kekuasaan-Nya ialah kapal-kapal di tengah (yang berlayar) di laut seperti gunung-gunung.\n","en":"And among His signs are the ships that sail like [floating] mountains through the seas:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4304","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4304.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4304.mp3"]}},{"no":33,"arab":"إِنْ يَشَأْ يُسْكِنِ الرِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ","latin":"in yasya/ yuskini alrriiha fayazhlalna rawaakida 'alaa zhahrihi inna fii dzaalika laaayaatin likulli shabbaarin syakuurin","translate":{"id":"Jika Dia menghendaki, Dia akan menenangkan angin, maka jadilah kapal-kapal itu terhenti di permukaan laut. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaannya) bagi setiap orang yang banyak bersabar dan banyak bersyukur,\n","en":"if He so wills, He stills the wind, and then they lie motion­less on the sea’s surface - [and] herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4305","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4305.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4305.mp3"]}},{"no":34,"arab":"أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا وَيَعْفُ عَنْ كَثِيرٍ","latin":"aw yuubiqhunna bimaa kasabuu waya'fu 'an katsiirin","translate":{"id":"atau kapal-kapal itu dibinasakan-Nya karena perbuatan mereka atau Dia memberi maaf sebagian besar (dari mereka).\n","en":"or else He may cause them to perish because of what they have wrought; and [withal,] He pardons much."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4306","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4306.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4306.mp3"]}},{"no":35,"arab":"وَيَعْلَمَ الَّذِينَ يُجَادِلُونَ فِي آيَاتِنَا مَا لَهُمْ مِنْ مَحِيصٍ","latin":"waya'lama alladziina yujaadiluuna fii aayaatinaa maa lahum min mahiishin","translate":{"id":"Dan supaya orang-orang yang membantah ayat-ayat (kekuasaan) Kami mengetahui bahwa mereka sekali-kali tidak akan memperoleh jalan ke luar (dari siksaan).\n","en":"And let them know, those who call Our mes­sages in question, that for them there is no escape."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4307","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4307.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4307.mp3"]}},{"no":36,"arab":"فَمَا أُوتِيتُمْ مِنْ شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَىٰ لِلَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","latin":"famaa uutiitum min syay-in famataa'u alhayaati alddunyaa wamaa 'inda allaahi khayrun wa-abqaa lilladziina aamanuu wa'alaa rabbihim yatawakkaluuna","translate":{"id":"Maka sesuatu yang diberikan kepadamu, itu adalah keni'matan hidup di dunia; dan yang ada pada sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka, mereka bertawakkal.\n","en":"AND [remember that] whatever you are given [now] is but for the [passing] enjoyment of life in this world - whereas that which is with God is far better and more enduring. [It shall be given] to all who attain to faith and in their Sustainer place their trust;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4308","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4308.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4308.mp3"]}},{"no":37,"arab":"وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ","latin":"waalladziina yajtanibuuna kabaa-ira al-itsmi waalfawaahisya wa-idzaa maa ghadhibuu hum yaghfiruuna","translate":{"id":"Dan (bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah mereka memberi maaf.\n","en":"and who shun the more heinous sins and abominations; and who, whenever they are moved to anger, readily forgive;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4309","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4309.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4309.mp3"]}},{"no":38,"arab":"وَالَّذِينَ اسْتَجَابُوا لِرَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ","latin":"waalladziina istajaabuu lirabbihim wa-aqaamuu alshshalaata wa-amruhum syuuraa baynahum wamimmaa razaqnaahum yunfiquuna","translate":{"id":"Dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhannya dan mendirikan shalat, sedang urusan mereka (diputuskan) dengan musyawarat antara mereka; dan mereka menafkahkan sebagian dari rezki yang Kami berikan kepada mereka.\n","en":"and who respond to [the call of] their Sustainer and are constant in prayer; and whose rule [in all matters of common concern] is consultation among themselves; and who spend on others out of what We provide for them as sustenance;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4310","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4310.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4310.mp3"]}},{"no":39,"arab":"وَالَّذِينَ إِذَا أَصَابَهُمُ الْبَغْيُ هُمْ يَنْتَصِرُونَ","latin":"waalladziina idzaa ashaabahumu albaghyu hum yantashiruuna","translate":{"id":"Dan ( bagi) orang-orang yang apabila mereka diperlakukan dengan zalim mereka membela diri.\n","en":"and who, whenever tyranny afflicts them, defend themselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4311","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4311.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4311.mp3"]}},{"no":40,"arab":"وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ","latin":"wajazaau sayyi-atin sayyi-atun mitsluhaa faman 'afaa wa-ashlaha fa-ajruhu 'alaa allaahi innahu laa yuhibbu alzhzhaalimiina","translate":{"id":"Dan balasan suatu kejahatan adalah kejahatan yang serupa, maka barang siapa mema'afkan dan berbuat baik maka pahalanya atas (tanggungan) Allah. Sesungguhnya Dia tidak menyukai orang-orang yang zalim.\n","en":"But [remember that an attempt at] requiting evil may, too, become an evil: hence, whoever par­dons [his foe] and makes peace, his reward rests with God - for, verily, He does not love evildoers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4312","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4312.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4312.mp3"]}},{"no":41,"arab":"وَلَمَنِ انْتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِمْ مِنْ سَبِيلٍ","latin":"walamani intashara ba'da zhulmihi faulaa-ika maa 'alayhim min sabiilin","translate":{"id":"Dan sesungguhnya orang-orang yang membela diri sesudah teraniaya, tidak ada satu dosapun terhadap mereka.\n","en":"Yet indeed, as for any who defend themselves after having been wronged - no blame whatever attaches to them:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4313","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4313.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4313.mp3"]}},{"no":42,"arab":"إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ","latin":"innamaa alssabiilu 'alaa alladziina yazhlimuuna alnnaasa wayabghuuna fii al-ardhi bighayri alhaqqi ulaa-ika lahum 'adzaabun aliimun","translate":{"id":"Sesungguhnya dosa itu atas orang-orang yang berbuat zalim kepada manusia dan melampaui batas di muka bumi tanpa hak. Mereka itu mendapat azab yang pedih.\n","en":"blame attaches but to those who oppress [other] people and behave outrageously on earth, offending against all right: for them there is grievous suffering in store!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4314","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4314.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4314.mp3"]}},{"no":43,"arab":"وَلَمَنْ صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ","latin":"walaman shabara waghafara inna dzaalika lamin 'azmi al-umuuri","translate":{"id":"Tetapi orang yang bersabar dan mema'afkan, sesungguhnya (perbuatan ) yang demikian itu termasuk hal-hal yang diutamakan.\n","en":"But withal, if one is patient in adversity and forgives - this, behold, is indeed something to set one’s heart upon!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4315","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4315.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4315.mp3"]}},{"no":44,"arab":"وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ وَلِيٍّ مِنْ بَعْدِهِ ۗ وَتَرَى الظَّالِمِينَ لَمَّا رَأَوُا الْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِنْ سَبِيلٍ","latin":"waman yudhlili allaahu famaa lahu min waliyyin min ba'dihi wataraa alzhzhaalimiina lammaa ra-awuu al'adzaaba yaquuluuna hal ilaa maraddin min sabiilin","translate":{"id":"Dan siapa yang disesatkan Allah maka tidak ada baginya seorang pemimpinpun sesudah itu. Dan kamu akan melihat orang-orang yang zalim ketika mereka melihat azab berkata: \" Adakah kiranya jalan untuk kembali (ke dunia)?\"\n","en":"AND [thus it is:] he whom God lets go astray has henceforth no protector whatever: and so thou wilt see such evildoers [on Judgment Day, and wilt hear how] they exclaim as soon as they behold the suffering [that awaits them], “Is there any way of return?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4316","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4316.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4316.mp3"]}},{"no":45,"arab":"وَتَرَاهُمْ يُعْرَضُونَ عَلَيْهَا خَاشِعِينَ مِنَ الذُّلِّ يَنْظُرُونَ مِنْ طَرْفٍ خَفِيٍّ ۗ وَقَالَ الَّذِينَ آمَنُوا إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا إِنَّ الظَّالِمِينَ فِي عَذَابٍ مُقِيمٍ","latin":"wataraahum yu'radhuuna 'alayhaa khaasyi'iina mina aldzdzulli yanzhuruuna min tharfin khafiyyin waqaala alladziina aamanuu inna alkhaasiriina alladziina khasiruu anfusahum wa-ahliihim yawma alqiyaamati alaa inna alzhzhaalimiina fii 'adzaabin muqiimin","translate":{"id":"Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tunduk karena (merasa) hina, mereka melihat dengan pandangan yang lesu. Dan orang-orang yang beriman berkata: \"Sesungguhnya orang-orang yang merugi ialah orang-orang yang kehilangan diri mereka sendiri dan (kehilangan) keluarga mereka pada hari kiamat . Ingatlah, sesungguhnya orang-orang yang zalim itu berada dalam azab yang kekal.\n","en":"And thou wilt see them exposed to that [doom], humbling themselves in abasement, looking [around] with a furtive glance - the while those who had attained to faith will say, “Verily, lost on [this] Day of Resurrection are they who have squandered their own and their followers’ selves!” Oh, verily, the evildoers will fall into long-lasting suffering,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4317","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4317.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4317.mp3"]}},{"no":46,"arab":"وَمَا كَانَ لَهُمْ مِنْ أَوْلِيَاءَ يَنْصُرُونَهُمْ مِنْ دُونِ اللَّهِ ۗ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ سَبِيلٍ","latin":"wamaa kaana lahum min awliyaa-a yanshuruunahum min duuni allaahi waman yudhlili allaahu famaa lahu min sabiilin","translate":{"id":"Dan mereka sekali-kali tidak mempunyai pelindung-pelindung yang dapat menolong mereka selain Allah. Dan siapa yang disesatkan Allah maka tidaklah ada baginya satu jalanpun (untuk mendapat petunjuk).\n","en":"and will have no protector whatever to succour them against God: for he whom God lets go astray shall find no way [of escape]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4318","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4318.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4318.mp3"]}},{"no":47,"arab":"اسْتَجِيبُوا لِرَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا مَرَدَّ لَهُ مِنَ اللَّهِ ۚ مَا لَكُمْ مِنْ مَلْجَإٍ يَوْمَئِذٍ وَمَا لَكُمْ مِنْ نَكِيرٍ","latin":"istajiibuu lirabbikum min qabli an ya/tiya yawmun laa maradda lahu mina allaahi maa lakum min malja-in yawma-idzin wamaa lakum min nakiirin","translate":{"id":"Patuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak kedatangannya. Kamu tidak memperoleh tempat berlindung pada hari itu dan tidak (pula) dapat mengingkari (dosa-dosamu).\n","en":"[Hence, O men,] respond to your Sustainer before there comes, at God’s behest, a Day on which there will be no turning back: [for] on that Day you will have no place of refuge, and neither will you be able to deny aught [of the wrong that you have done]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4319","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4319.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4319.mp3"]}},{"no":48,"arab":"فَإِنْ أَعْرَضُوا فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ ۗ وَإِنَّا إِذَا أَذَقْنَا الْإِنْسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَإِنَّ الْإِنْسَانَ كَفُورٌ","latin":"fa-in a'radhuu famaa arsalnaaka 'alayhim hafiizhan in 'alayka illaa albalaaghu wa-innaa idzaa adzaqnaa al-insaana minnaa rahmatan fariha bihaa wa-in tushibhum sayyi-atun bimaa qaddamat aydiihim fa-inna al-insaana kafuurun","translate":{"id":"Jika mereka berpaling maka Kami tidak mengutus kamu sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah). Sesungguhnya apabila Kami merasakan kepada manusia sesuatu rahmat dari Kami dia bergembira ria karena rahmat itu. Dan jika mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri (niscaya mereka ingkar) karena sesungguhnya manusia itu amat ingkar (kepada nikmat).\n","en":"BUT IF they turn away [from thee, O Prophet, know that] We have not sent thee to be their keeper: thou art not bound to do more than deliver the message [entrusted to thee]. And, behold, [such as turn away from Our mes­sages are but impelled by the weakness and incon­stancy of human nature: thus,] when We give man a taste of Our grace, he is prone to exult in it; but if misfortune befalls [any of] them in result of what their own hands have sent forth, then, behold, man shows how bereft he is of all gratitude!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4320","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4320.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4320.mp3"]}},{"no":49,"arab":"لِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَخْلُقُ مَا يَشَاءُ ۚ يَهَبُ لِمَنْ يَشَاءُ إِنَاثًا وَيَهَبُ لِمَنْ يَشَاءُ الذُّكُورَ","latin":"lillaahi mulku alssamaawaati waal-ardhi yakhluqu maa yasyaau yahabu liman yasyaau inaatsan wayahabu liman yasyaau aldzdzukuura","translate":{"id":"Kepunyaan Allah-lah kerajaan langit dan bumi, Dia menciptakan apa yang Dia kehendaki. Dia memberikan anak-anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak-anak lelaki kepada siapa yang Dia kehendaki,\n","en":"God’s alone is the dominion over the heavens and the earth. He creates whatever He wills: He bestows the gift of female offspring on whomever He wills, and the gift of male offspring on whomever He wills;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4321","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4321.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4321.mp3"]}},{"no":50,"arab":"أَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَإِنَاثًا ۖ وَيَجْعَلُ مَنْ يَشَاءُ عَقِيمًا ۚ إِنَّهُ عَلِيمٌ قَدِيرٌ","latin":"aw yuzawwijuhum dzukraanan wa-inaatsan wayaj'alu man yasyaau 'aqiiman innahu 'aliimun qadiirun","translate":{"id":"atau Dia menganugerahkan kedua jenis laki-laki dan perempuan (kepada siapa) yang dikehendaki-Nya, dan Dia menjadikan mandul siapa yang Dia kehendaki. Sesungguhnya Dia Maha Mengetahui lagi Maha Kuasa.\n","en":"or He gives both male and female [to whomever He wills], and causes to be barren whomever He wills: for, verily, He is all-knowing, infinite in His power."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4322","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4322.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4322.mp3"]}},{"no":51,"arab":"وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاءُ ۚ إِنَّهُ عَلِيٌّ حَكِيمٌ","latin":"wamaa kaana libasyarin an yukallimahu allaahu illaa wahyan aw min waraa-i hijaabin aw yursila rasuulan fayuuhiya bi-idznihi maa yasyaau innahu 'aliyyun hakiimun","translate":{"id":"Dan tidak mungkin bagi seorang manusiapun bahwa Allah berkata-kata dengan dia kecuali dengan perantaraan wahyu atau dibelakang tabir atau dengan mengutus seorang utusan (malaikat) lalu diwahyukan kepadanya dengan seizin-Nya apa yang Dia kehendaki. Sesungguhnya Dia Maha Tinggi lagi Maha Bijaksana.\n","en":"And it is not given to mortal man that God should speak unto him otherwise than through sudden inspiration, or [by a voice, as it were,] from behind a veil, or by sending an apostle to reveal, by His leave, whatever He wills [to reveal]: for, verily, He is exalted, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4323","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4323.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4323.mp3"]}},{"no":52,"arab":"وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا ۚ مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَٰكِنْ جَعَلْنَاهُ نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا ۚ وَإِنَّكَ لَتَهْدِي إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"wakadzaalika awhaynaa ilayka ruuhan min amrinaa maa kunta tadrii maa alkitaabu walaa al-iimaanu walaakin ja'alnaahu nuuran nahdii bihi man nasyaau min 'ibaadinaa wa-innaka latahdii ilaa shiraathin mustaqiimin","translate":{"id":"Dan demikianlah Kami wahyukan kepadamu wahyu (Al Qur'an) dengan perintah Kami. Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Qur'an) dan tidak pula mengetahui apakah iman itu, tetapi Kami menjadikan Al Qur'an itu cahaya, yang Kami tunjuki dengan dia siapa yang kami kehendaki di antara hamba-hamba Kami. Dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus.\n","en":"And thus, too, [O Muhammad,] have We revealed unto thee a life-giving message, [coming] at Our behest. [Ere this message came unto thee,] thou didst not know what revelation is, nor what faith [implies]: but [now] We have caused this [message] to be a light, whereby We guide whom We will of Our ser­vants: and, verily, [on the strength thereof] thou, too, shalt guide [men] onto the straight way –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4324","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4324.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4324.mp3"]}},{"no":53,"arab":"صِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ","latin":"shiraathi allaahi alladzii lahu maa fii alssamaawaati wamaa fii al-ardhi alaa ilaa allaahi tashiiru al-umuuru","translate":{"id":"(Yaitu) jalan Allah yang kepunyaan-Nya segala apa yang ada di langit dan apa yang ada di bumi. Ingatlah, bahwa kepada Allah-lah kembali semua urusan.\n","en":"the way that leads to God, to whom all that is in the heavens and all that is on earth belongs. Oh, verily, with God is the beginning and the end of all things!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4325","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4325.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4325.mp3"]}}]}