{"alquran":{"no":43,"name":"Az-Zukhruf","arab":"الزخرف","start":4325,"count":89,"rukku":7,"type":"mecca","description":"Surat Az Zukhruf terdiri atas 89 ayat, termasuk golongan  surat-surat Makkiyyah, diturunkan sesudah surat Asy Syuura. <br>Dinamai <i>Az Zukhruf</i> (Perhiasan) diambil dari perkataan <i>Az Zukhruf</i> yang terdapat pada ayat 35 surat ini.  Orang-orang musyrik mengukur tinggi rendahnya derajat seseorang tergantung kepada perhiasan dan harta benda yang ia punyai, karena Muhammad s.a.w. adalah seorang anak yatim lagi miskin, ia tidak pantas diangkat Allah sebagai seorang rasul dan nabi.  Pangkat rasul dan nabi harus diberikan kepada orang yang kaya.  Ayat ini menegaskan bahwa harta tidak dapat dijadikan dasar untuk mengukur tinggi rendahnya derajat seseorang, karena harta itu merupakan hiasan kehidupan duniawi, bukan berarti kesenangan akhirat."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim .\n","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4326","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4326.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4326.mp3"]}},{"no":2,"arab":"وَالْكِتَابِ الْمُبِينِ","latin":"waalkitaabi almubiini","translate":{"id":"Demi Kitab (Al Qur'an) yang menerangkan.\n","en":"CONSIDER this divine writ, clear in itself and clearly showing the truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4327","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4327.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4327.mp3"]}},{"no":3,"arab":"إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَعَلَّكُمْ تَعْقِلُونَ","latin":"innaa ja'alnaahu qur-aanan 'arabiyyan la'allakum ta'qiluunaa","translate":{"id":"Sesungguhnya Kami menjadikan Al Qur'an dalam bahasa Arab supaya kamu memahami(nya).\n","en":"behold, We have caused it to be a discourse in the Arabic tongue, so that you might encompass it with your reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4328","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4328.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4328.mp3"]}},{"no":4,"arab":"وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ","latin":"wa-innahu fii ummi alkitaabi ladaynaa la'aliyyun hakiimun","translate":{"id":"Dan sesungguhnya Al Qur'an itu dalam induk Al Kitab (Lauh Mahfuzh) di sisi Kami, adalah benar-benar tinggi (nilainya) dan amat banyak mengandung hikmah.\n","en":"And, verily, [originating as it does] in the source, with Us, of all revelation, it is indeed sublime, full of wisdom."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4329","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4329.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4329.mp3"]}},{"no":5,"arab":"أَفَنَضْرِبُ عَنْكُمُ الذِّكْرَ صَفْحًا أَنْ كُنْتُمْ قَوْمًا مُسْرِفِينَ","latin":"afanadhribu 'ankumu aldzdzikra shafhan an kuntum qawman musrifiina","translate":{"id":"Maka apakah Kami akan berhenti menurunkan Al Qur'an kepadamu, karena kamu adalah kaum yang melampaui batas?\n","en":"[O YOU who deny the truth!] Should We, perchance, withdraw this reminder from you altogether, seeing that you are people bent on wasting your own selves?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4330","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4330.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4330.mp3"]}},{"no":6,"arab":"وَكَمْ أَرْسَلْنَا مِنْ نَبِيٍّ فِي الْأَوَّلِينَ","latin":"wakam arsalnaa min nabiyyin fii al-awwaliina","translate":{"id":"Berapa banyaknya nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu.\n","en":"And how many a prophet did We send to people of olden times!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4331","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4331.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4331.mp3"]}},{"no":7,"arab":"وَمَا يَأْتِيهِمْ مِنْ نَبِيٍّ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"wamaa ya/tiihim min nabiyyin illaa kaanuu bihi yastahzi-uuna","translate":{"id":"Dan tiada seorang nabipun datang kepada mereka melainkan mereka selalu memperolok-olokkannya.\n","en":"But never yet came a prophet to them without their deriding him –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4332","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4332.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4332.mp3"]}},{"no":8,"arab":"فَأَهْلَكْنَا أَشَدَّ مِنْهُمْ بَطْشًا وَمَضَىٰ مَثَلُ الْأَوَّلِينَ","latin":"fa-ahlaknaa asyadda minhum bathsyan wamadaa matsalu al-awwaliina","translate":{"id":"Maka telah Kami binasakan orang-orang yang lebih besar kekuatannya dari mereka itu (musyrikin Mekah) dan telah terdahulu (tersebut dalam Al Qur'an) perumpamaan umat-umat masa dahulu.\n","en":"and so, [in the end,] We destroyed them [even though they were] of greater might than these: and the [very] image of those people of old became a thing of the past."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4333","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4333.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4333.mp3"]}},{"no":9,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ","latin":"wala-in sa-altahum man khalaqa alssamaawaati waal-ardha layaquulunna khalaqahunna al'aziizu al'aliimu","translate":{"id":"Dan sungguh jika kamu tanyakan kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\", niscaya mereka akan menjawab: \"Semuanya diciptakan oleh Yang Maha Perkasa lagi Maha Mengetahui\".\n","en":"Yet thus it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “The Almighty, the All-Knowing has created them.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4334","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4334.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4334.mp3"]}},{"no":10,"arab":"الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَعَلَّكُمْ تَهْتَدُونَ","latin":"alladzii ja'ala lakumu al-ardha mahdan waja'ala lakum fiihaa subulan la'allakum tahtaduuna","translate":{"id":"Yang menjadikan bumi untuk kamu sebagai tempat menetap dan Dia membuat jalan-jalan di atas bumi untuk kamu supaya kamu mendapat petunjuk.\n","en":"He it is who has made the earth a cradle for you, and has provided for you ways [of livelihood] thereon, so that you might follow the right path."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4335","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4335.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4335.mp3"]}},{"no":11,"arab":"وَالَّذِي نَزَّلَ مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَنْشَرْنَا بِهِ بَلْدَةً مَيْتًا ۚ كَذَٰلِكَ تُخْرَجُونَ","latin":"waalladzii nazzala mina alssamaa-i maa-an biqadarin fa-ansyarnaa bihi baldatan maytan kadzaalika tukhrajuuna","translate":{"id":"Dan Yang menurunkan air dari langit menurut kadar (yang diperlukan) lalu Kami hidupkan dengan air itu negeri yang mati, seperti itulah kamu akan dikeluarkan (dari dalam kubur).\n","en":"And He it is who sends down, again and again, waters from the sky in due measure: and [as] We raise therewith dead land to life, even thus will you be brought forth [from the dead]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4336","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4336.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4336.mp3"]}},{"no":12,"arab":"وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ","latin":"waalladzii khalaqa al-azwaaja kullahaa waja'ala lakum mina alfulki waal-an'aami maa tarkabuuna","translate":{"id":"Dan Yang menciptakan semua yang berpasang-pasangan dan menjadikan untukmu kapal dan binatang ternak yang kamu tunggangi.\n","en":"And He it is who has created all opposites. And He [it is who] has provided for you all those ships and animals whereon you ride,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4337","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4337.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4337.mp3"]}},{"no":13,"arab":"لِتَسْتَوُوا عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ","latin":"litastawuu 'alaa zhuhuurihi tsumma tadzkuruu ni'mata rabbikum idzaa istawaytum 'alayhi wataquuluu subhaana alladzii sakhkhara lanaa haadzaa wamaa kunnaa lahu muqriniina","translate":{"id":"Supaya kamu duduk di atas punggungnya kemudian kamu ingat ni'mat Tuhanmu apabila kamu telah duduk di atasnya; dan supaya kamu mengucapkan: \"Maha Suci Tuhan yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya,\n","en":"in order that you might gain mastery over them, and that, whenever you have mastered them, you might remember your Sustainer’s blessings and say: “Limitless in His glory is He who has made [all] this subservient to our use - since [but for Him,] we would not have been able to attain to it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4338","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4338.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4338.mp3"]}},{"no":14,"arab":"وَإِنَّا إِلَىٰ رَبِّنَا لَمُنْقَلِبُونَ","latin":"wa-innaa ilaa rabbinaa lamunqalibuuna","translate":{"id":"dan sesungguhnya kami akan kembali kepada Tuhan kami\".\n","en":"Hence, verily, it is unto Him that we must always turn.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4339","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4339.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4339.mp3"]}},{"no":15,"arab":"وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا ۚ إِنَّ الْإِنْسَانَ لَكَفُورٌ مُبِينٌ","latin":"waja'aluu lahu min 'ibaadihi juz-an inna al-insaana lakafuurun mubiinun","translate":{"id":"Dan mereka menjadikan sebahagian dari hamba-hamba-Nya sebagai bahagian daripada-Nya . Sesungguhnya manusia itu benar-benar pengingkar yang nyata (terhadap rahmat Allah).\n","en":"AND YET, they attribute to Him offspring from among some of the beings created by Him! Verily, most obviously bereft of all gratitude is man!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4340","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4340.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4340.mp3"]}},{"no":16,"arab":"أَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنَاتٍ وَأَصْفَاكُمْ بِالْبَنِينَ","latin":"ami ittakhadza mimmaa yakhluqu banaatin wa-ashfaakum bialbaniina","translate":{"id":"Patutkah Dia mengambil anak perempuan dari yang diciptakan-Nya dan Dia mengkhususkan buat kamu anak laki-laki.\n","en":"Or [do you think], perchance, that out of all His creation He has chosen for Himself daughters, and favoured you with sons?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4341","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4341.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4341.mp3"]}},{"no":17,"arab":"وَإِذَا بُشِّرَ أَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ","latin":"wa-idzaa busysyira ahaduhum bimaa dharaba lilrrahmaani matsalan zhalla wajhuhu muswaddan wahuwa kazhiimun","translate":{"id":"Padahal apabila salah seorang di antara mereka diberi kabar gembira dengan apa yang dijadikan sebagai misal bagi Allah Yang Maha Pemurah; jadilah mukanya hitam pekat sedang dia amat menahan sedih .\n","en":"For [thus it is:] if any of them is given the glad tiding of [the birth of] what he so readily attributes to the Most Gracious, his face darkens, and he is filled with suppressed anger:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4342","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4342.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4342.mp3"]}},{"no":18,"arab":"أَوَمَنْ يُنَشَّأُ فِي الْحِلْيَةِ وَهُوَ فِي الْخِصَامِ غَيْرُ مُبِينٍ","latin":"awaman yunasysyau fii alhilyati wahuwa fii alkhishaami ghayru mubiinin","translate":{"id":"Dan apakah patut (menjadi anak Allah) orang yang dibesarkan dalam keadaan berperhiasan sedang dia tidak dapat memberi alasan yang terang dalam pertengkaran .\n","en":"“What! [Am I to have a daughter -] one who is to be reared [only] for the sake of ornament?” and thereupon he finds himself torn by a vague inner conflict."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4343","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4343.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4343.mp3"]}},{"no":19,"arab":"وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا ۚ أَشَهِدُوا خَلْقَهُمْ ۚ سَتُكْتَبُ شَهَادَتُهُمْ وَيُسْأَلُونَ","latin":"waja'aluu almalaa-ikata alladziina hum 'ibaadu alrrahmaani inaatsan asyahiduu khalqahum satuktabu syahaadatuhum wayus-aluuna","translate":{"id":"Dan mereka menjadikan malaikat-malaikat yang mereka itu adalah hamba-hamba Allah Yang Maha Pemurah sebagai orang-orang perempuan. Apakah mereka menyaksikan penciptaan malaika-malaikat itu? Kelak akan dituliskan persaksian mereka dan mereka akan dimintai pertanggung-jawaban.\n","en":"And [yet] they claim that the angels - who in themselves are but beings created by the Most Gracious - are females: [but] did they witness their creation? This false claim of theirs will be recorded, and they will be called to account [for it on Judgment Day]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4344","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4344.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4344.mp3"]}},{"no":20,"arab":"وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُمْ ۗ مَا لَهُمْ بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَخْرُصُونَ","latin":"waqaaluu law syaa-a alrrahmaanu maa 'abadnaahum maa lahum bidzaalika min 'ilmin in hum illaa yakhrushuuna","translate":{"id":"Dan mereka berkata: \"Jikalau Allah Yang Maha Pemurah menghendaki tentulah kami tidak menyembah mereka (malaikat)\". Mereka tidak mempunyai pengetahuan sedikitpun tentang itu, mereka tidak lain hanyalah menduga-duga belaka.\n","en":"Yet they say, “Had [not] the Most Gracious so willed, we would never have worshipped them!” [But] they cannot have any knowledge of [His having willed] such a thing: they do nothing but guess."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4345","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4345.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4345.mp3"]}},{"no":21,"arab":"أَمْ آتَيْنَاهُمْ كِتَابًا مِنْ قَبْلِهِ فَهُمْ بِهِ مُسْتَمْسِكُونَ","latin":"am aataynaahum kitaaban min qablihi fahum bihi mustamsikuuna","translate":{"id":"Atau adakah Kami memberikan sebuah kitab kepada mereka sebelum Al Qur'an, lalu mereka berpegang dengan kitab itu ?\n","en":"Or have We, perchance, vouchsafed them, before this one, a revelation [to the contrary,] to which they are still holding fast?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4346","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4346.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4346.mp3"]}},{"no":22,"arab":"بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُهْتَدُونَ","latin":"bal qaaluu innaa wajadnaa aabaa-anaa 'alaa ummatin wa-innaa 'alaa aatsaarihim muhtaduuna","translate":{"id":"Bahkan mereka berkata: \"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka\".\n","en":"Nay, but they say, “Behold, We found our forefathers agreed on what to believe - and, verily, it is in their footsteps that we find our guidance!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4347","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4347.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4347.mp3"]}},{"no":23,"arab":"وَكَذَٰلِكَ مَا أَرْسَلْنَا مِنْ قَبْلِكَ فِي قَرْيَةٍ مِنْ نَذِيرٍ إِلَّا قَالَ مُتْرَفُوهَا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُقْتَدُونَ","latin":"wakadzaalika maa arsalnaa min qablika fii qaryatin min nadziirin illaa qaala mutrafuuhaa innaa wajadnaa aabaa-anaa 'alaa ummatin wa-innaa 'alaa aatsaarihim muqtaduuna","translate":{"id":"Dan demikianlah, Kami tidak mengutus sebelum kamu seorang pemberi peringatanpun dalam suatu negeri, melainkan orang-orang yang hidup mewah di negeri itu berkata: \"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak-jejak mereka\".\n","en":"And thus it is: whenever We sent, before thy time, a warner to any community, those of its people who had lost themselves entirely in the pursuit of pleasures would always say, “Behold, we found our forefathers agreed on what to believe - and, verily, it is but in their footsteps that we follow!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4348","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4348.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4348.mp3"]}},{"no":24,"arab":"قَالَ أَوَلَوْ جِئْتُكُمْ بِأَهْدَىٰ مِمَّا وَجَدْتُمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ","latin":"qaala awa law ji/tukum bi-ahdaa mimmaa wajadtum 'alayhi aabaa-akum qaaluu innaa bimaa ursiltum bihi kaafiruuna","translate":{"id":"(Rasul itu) berkata: \"Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih (nyata) memberi petunjuk daripada apa yang kamu dapati bapak-bapakmu menganutnya?\" Mereka menjawab: \"Sesungguhnya kami mengingkari agama yang kamu diutus untuk menyampaikannya.\"\n","en":"[Whereupon each prophet] would say, “Why, even though I bring you guidance better than that which you found your forefathers believing in?” - [to which] the others would reply, “Behold, we deny that there is any truth in [what you claim to be] your messages!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4349","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4349.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4349.mp3"]}},{"no":25,"arab":"فَانْتَقَمْنَا مِنْهُمْ ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","latin":"faintaqamnaa minhum faunzhur kayfa kaana 'aaqibatu almukadzdzibiina","translate":{"id":"Maka Kami binasakan mereka maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu.\n","en":"And so We inflicted Our retribution on them: and behold what happened in the end to those who gave the lie to the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4350","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4350.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4350.mp3"]}},{"no":26,"arab":"وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِمَّا تَعْبُدُونَ","latin":"wa-idz qaala ibraahiimu li-abiihi waqawmihi innanii baraaun mimmaa ta'buduuna","translate":{"id":"Dan ingatlah ketika Ibrahim berkata kepada bapaknya dan kaumnya: \"Sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu sembah ,\n","en":"AND WHEN Abraham spoke to his father and his people, [he had this very truth in mind:] “Verily, far be it from me to worship what you worship!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4351","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4351.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4351.mp3"]}},{"no":27,"arab":"إِلَّا الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ","latin":"illaa alladzii fatharanii fa-innahu sayahdiini","translate":{"id":"tetapi (aku menyembah) Tuhan Yang menjadikanku; karena sesungguhnya Dia akan memberi hidayah kepadaku\".\n","en":"None [do I worship] but Him who has brought me into being: and, behold, it is He who will guide me!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4352","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4352.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4352.mp3"]}},{"no":28,"arab":"وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ","latin":"waja'alahaa kalimatan baaqiyatan fii 'aqibihi la'allahum yarji'uuna","translate":{"id":"Dan (lbrahim a. s.) menjadikan kalimat tauhid itu kalimat yang kekal pada keturunannya supaya mereka kembali kepada kalimat tauhid itu .\n","en":"And he uttered this as a word destined to endure among those who would come after him, so that they might [always] return [to it]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4353","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4353.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4353.mp3"]}},{"no":29,"arab":"بَلْ مَتَّعْتُ هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ جَاءَهُمُ الْحَقُّ وَرَسُولٌ مُبِينٌ","latin":"bal matta'tu haaulaa-i waaabaa-ahum hattaa jaa-ahumu alhaqqu warasuulun mubiinun","translate":{"id":"Tetapi Aku telah memberikan keni'matan hidup kepada mereka dan bapak-bapak mereka sehingga datanglah kepada mereka kebenaran (Al Qur'an) dan seorang rasul yang memberi penjelasan .\n","en":"Now [as for those who did come after him,] I allowed them - as [I had allowed] their forebears - to enjoy their lives freely until the truth should come unto them through an apostle who would make all things clear:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4354","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4354.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4354.mp3"]}},{"no":30,"arab":"وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ","latin":"walammaa jaa-ahumu alhaqqu qaaluu haadzaa sihrun wa-innaa bihi kaafiruuna","translate":{"id":"Dan tatkala kebenaran (Al Qur'an) itu datang kepada mereka, mereka berkata: \"Ini adalah sihir dan sesungguhnya kami adalah orang-orang yang mengingkarinya\".\n","en":"but now that the truth has come to them, they say, “All this is mere spellbinding eloquence” - and, behold, we deny that there is any truth in it!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4355","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4355.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4355.mp3"]}},{"no":31,"arab":"وَقَالُوا لَوْلَا نُزِّلَ هَٰذَا الْقُرْآنُ عَلَىٰ رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ","latin":"waqaaluu lawlaa nuzzila haadzaa alqur-aanu 'alaa rajulin mina alqaryatayni 'azhiimun","translate":{"id":"Dan mereka berkata: \"Mengapa Al Qur'an ini tidak diturunkan kepada seorang besar dari salah satu dua negeri (Mekah dan Thaif) ini ?\"\n","en":"And they say, too, “Why was not this Qur’an bestowed from on high on some great man of the two cities?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4356","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4356.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4356.mp3"]}},{"no":32,"arab":"أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ نَحْنُ قَسَمْنَا بَيْنَهُمْ مَعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا ۗ وَرَحْمَتُ رَبِّكَ خَيْرٌ مِمَّا يَجْمَعُونَ","latin":"ahum yaqsimuuna rahmata rabbika nahnu qasamnaa baynahum ma'iisyatahum fii alhayaati alddunyaa warafa'naa ba'dhahum fawqa ba'dhin darajaatin liyattakhidza ba'dhuhum ba'dhan sukhriyyan warahmatu rabbika khayrun mimmaa yajma'uuna","translate":{"id":"Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia, dan kami telah meninggikan sebahagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat mempergunakan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan.\n","en":"But is it they who distribute thy Sustainer’s grace? [Nay, as] it is We who distribute their means of livelihood among them in the life of this world, and raise some of them by degrees above others, to the end that they might avail themselves of one another’s help - [so, too, it is We who bestow gifts of the spirit upon whomever We will]: and this thy Sustainer’s grace is better than all [the worldly wealth] that they may amass."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4357","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4357.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4357.mp3"]}},{"no":33,"arab":"وَلَوْلَا أَنْ يَكُونَ النَّاسُ أُمَّةً وَاحِدَةً لَجَعَلْنَا لِمَنْ يَكْفُرُ بِالرَّحْمَٰنِ لِبُيُوتِهِمْ سُقُفًا مِنْ فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ","latin":"walawlaa an yakuuna alnnaasu ummatan waahidatan laja'alnaa liman yakfuru bialrrahmaani libuyuutihim suqufan min fidhdhatin wama'aarija 'alayhaa yazhharuuna","translate":{"id":"Dan sekiranya bukan karena hendak menghindari manusia menjadi umat yang satu (dalam kekafiran), tentulah kami buatkan bagi orang-orang yang kafir kepada Tuhan Yang Maha Pemurah loteng-loteng perak bagi rumah mereka dan (juga) tangga-tangga (perak) yang mereka menaikinya.\n","en":"And were it not that [with the prospect of boundless riches before them] all people would become one [evil] community, We might indeed have provided for those who [now] deny the Most Gracious roofs of silver for their houses, and [silver] stairways whereon to ascend,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4358","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4358.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4358.mp3"]}},{"no":34,"arab":"وَلِبُيُوتِهِمْ أَبْوَابًا وَسُرُرًا عَلَيْهَا يَتَّكِئُونَ","latin":"walibuyuutihim abwaaban wasururan 'alayhaa yattaki-uuna","translate":{"id":"Dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka dan (begitu pula) dipan-dipan yang mereka bertelekan atasnya.\n","en":"and [silver] doors for their houses, and [silver] couches whereon to recline,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4359","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4359.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4359.mp3"]}},{"no":35,"arab":"وَزُخْرُفًا ۚ وَإِنْ كُلُّ ذَٰلِكَ لَمَّا مَتَاعُ الْحَيَاةِ الدُّنْيَا ۚ وَالْآخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِينَ","latin":"wazukhrufan wa-in kullu dzaalika lammaa mataa'u alhayaati alddunyaa waal-aakhiratu 'inda rabbika lilmuttaqiina","translate":{"id":"Dan (Kami buatkan pula) perhiasan-perhiasan (dari emas untuk mereka). Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia, dan kehidupan akhirat itu di sisi Tuhanmu adalah bagi orang-orang yang bertakwa.\n","en":"and gold [beyond count]. Yet all this would have been nothing but a [brief] enjoyment of life in this world - whereas [happiness in] the life to come awaits the God-conscious with thy Sustainer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4360","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4360.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4360.mp3"]}},{"no":36,"arab":"وَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ","latin":"waman ya'syu 'an dzikri alrrahmaani nuqayyidh lahu syaythaanan fahuwa lahu qariinun","translate":{"id":"Barangsiapa yang berpaling dari pengajaran Tuhan Yang Maha Pemurah (Al Qur'an), kami adakan baginya syaitan (yang menyesatkan) maka syaitan itulah yang menjadi teman yang selalu menyertainya.\n","en":"But as for anyone who chooses to remain blind to the remembrance of the Most Gracious, to him We assign an [enduring] evil impulse, to become his other self:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4361","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4361.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4361.mp3"]}},{"no":37,"arab":"وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُمْ مُهْتَدُونَ","latin":"wa-innahum layashudduunahum 'ani alssabiili wayahsabuuna annahum muhtaduuna","translate":{"id":"Dan sesungguhnya syaitan-syaitan itu benar-benar menghalangi mereka dari jalan yang benar dan mereka menyangka bahwa mereka mendapat petunjuk.\n","en":"whereupon, behold, these [evil impulses] bar all such from the path [of truth], making them think that they are guided aright!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4362","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4362.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4362.mp3"]}},{"no":38,"arab":"حَتَّىٰ إِذَا جَاءَنَا قَالَ يَا لَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ","latin":"hattaa idzaa jaa-anaa qaala yaa layta baynii wabaynaka bu'da almasyriqayni fabi/sa alqariinu","translate":{"id":"Sehingga apabila orang-orang yang berpaling itu datang kepada kami (di hari kiamat) dia berkata: \"Aduhai, semoga (jarak) antaraku dan kamu seperti jarak antara masyrik dan maghrib, maka syaitan itu adalah sejahat-jahat teman (yang menyertai manusia)\".\n","en":"But in the end, when he [who has thus sinned] appears before us [on Judgment Day], he will say [to his other self], “Would that between me and thee there had been the distance of east and west!” for, evil indeed [has proved] that other self!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4363","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4363.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4363.mp3"]}},{"no":39,"arab":"وَلَنْ يَنْفَعَكُمُ الْيَوْمَ إِذْ ظَلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ","latin":"walan yanfa'akumu alyawma idz zhalamtum annakum fii al'adzaabi musytarikuuna","translate":{"id":"(Harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu di hari itu karena kamu telah menganiaya (dirimu sendiri). Sesungguhnya kamu bersekutu dalam azab itu.\n","en":"On that Day it will not profit you in the least [to know] that, since you have sinned [together], you are now to share your suffering [as well]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4364","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4364.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4364.mp3"]}},{"no":40,"arab":"أَفَأَنْتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِي الْعُمْيَ وَمَنْ كَانَ فِي ضَلَالٍ مُبِينٍ","latin":"afa-anta tusmi'u alshshumma aw tahdii al'umya waman kaana fii dhalaalin mubiinin","translate":{"id":"Maka apakah kamu dapat menjadikan orang yang pekak bisa mendengar atau (dapatkah) kamu memberi petunjuk kepada orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?\n","en":"CANST THOU, perchance, [O Muhammad,] make the deaf hear, or show the right way to the blind or to such as are obviously lost in error?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4365","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4365.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4365.mp3"]}},{"no":41,"arab":"فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُمْ مُنْتَقِمُونَ","latin":"fa-immaa nadzhabanna bika fa-innaa minhum muntaqimuuna","translate":{"id":"Sungguh, jika Kami mewafatkan kamu (sebelum kamu mencapai kemenangan) maka sesungguhnya Kami akan menyiksa mereka (di akhirat).\n","en":"But whether We do [or do not] take thee away [ere thy message prevails] - verily, We shall inflict Our retribution on them;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4366","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4366.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4366.mp3"]}},{"no":42,"arab":"أَوْ نُرِيَنَّكَ الَّذِي وَعَدْنَاهُمْ فَإِنَّا عَلَيْهِمْ مُقْتَدِرُونَ","latin":"aw nuriyannaka alladzii wa'adnaahum fa-innaa 'alayhim muqtadiruuna","translate":{"id":"Atau Kami memperlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka . Maka sesungguhnya Kami berkuasa atas mereka.\n","en":"and whether We show thee [or do not show thee in this world] the fulfillment of what We have promised them - verily, We have full power over them!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4367","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4367.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4367.mp3"]}},{"no":43,"arab":"فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ ۖ إِنَّكَ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"faistamsik bialladzii uuhiya ilayka innaka 'alaa shiraathin mustaqiimin","translate":{"id":"Maka berpegang teguhlah kamu kepada agama yang telah diwahyukan kepadamu. Sesungguhnya kamu berada di atas jalan yang lurus.\n","en":"So hold fast to all that has been revealed to thee: for, behold, thou art on a straight way;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4368","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4368.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4368.mp3"]}},{"no":44,"arab":"وَإِنَّهُ لَذِكْرٌ لَكَ وَلِقَوْمِكَ ۖ وَسَوْفَ تُسْأَلُونَ","latin":"wa-innahu ladzikrun laka waliqawmika wasawfa tus-aluuna","translate":{"id":"Dan sesungguhnya Al Qur'an itu benar-benar adalah suatu kemuliaan besar bagimu dan bagi kaummu dan kelak kamu akan diminta pertanggungan jawab.\n","en":"and, verily, this [revelation] shall indeed become [a source of] eminence for thee and thy people: but in time you all will be called to account [for what you have done with it]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4369","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4369.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4369.mp3"]}},{"no":45,"arab":"وَاسْأَلْ مَنْ أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُسُلِنَا أَجَعَلْنَا مِنْ دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ","latin":"wais-al man arsalnaa min qablika min rusulinaa aja'alnaa min duuni alrrahmaani aalihatan yu'baduuna","translate":{"id":"Dan tanyakanlah kepada rasul-rasul Kami yang telah Kami utus sebelum kamu: \"Adakah Kami menentukan tuhan-tuhan untuk disembah selain Allah Yang Maha Pemurah?\"\n","en":"Yet [above all else,] ask any of Our apostles whom We sent forth before thy time whether We have ever allowed that deities other than the Most Gracious be worshipped!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4370","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4370.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4370.mp3"]}},{"no":46,"arab":"وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَقَالَ إِنِّي رَسُولُ رَبِّ الْعَالَمِينَ","latin":"walaqad arsalnaa muusaa bi-aayaatinaa ilaa fir'awna wamala-ihi faqaala innii rasuulu rabbi al'aalamiina","translate":{"id":"Dan sesunguhnya Kami telah mengutus Musa dengan membawa mu'jizat-mu'jizat Kami kepada Fir'aun dan pemuka-pemuka kaumnya. Maka Musa berkata: \"Sesungguhnya aku adalah utusan dari Tuhan seru sekalian alam\".\n","en":"THUS, INDEED, have We sent Moses with Our messages unto Pharaoh and his great ones; and he said: “Behold, I am an apostle of the Sustainer of all the worlds!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4371","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4371.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4371.mp3"]}},{"no":47,"arab":"فَلَمَّا جَاءَهُمْ بِآيَاتِنَا إِذَا هُمْ مِنْهَا يَضْحَكُونَ","latin":"falammaa jaa-ahum bi-aayaatinaa idzaa hum minhaa yadhakuuna","translate":{"id":"Maka tatkala dia datang kepada mereka dengan membawa mu'jizat-mu'jizat Kami dengan serta merta mereka mentertawakannya.\n","en":"But as soon as he came before them with Our [miraculous] signs, lo! they derided them,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4372","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4372.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4372.mp3"]}},{"no":48,"arab":"وَمَا نُرِيهِمْ مِنْ آيَةٍ إِلَّا هِيَ أَكْبَرُ مِنْ أُخْتِهَا ۖ وَأَخَذْنَاهُمْ بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ","latin":"wamaa nuriihim min aayatin illaa hiya akbaru min ukhtihaa wa-akhadznaahum bial'adzaabi la'allahum yarji'uuna","translate":{"id":"Dan tidaklah Kami perlihatkan kepada mereka sesuatu mu'jizat kecuali mu'jizat itu lebih besar dari mu'jizat-mu'jizat yang sebelumnya. Dan Kami timpakan kepada mereka azab supaya mereka kembali (ke jalan yang benar).\n","en":"although each sign that We showed them was weigh­tier than the preceding one: and [each time] We took them to task through suffering, so that they might return [to Us]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4373","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4373.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4373.mp3"]}},{"no":49,"arab":"وَقَالُوا يَا أَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ إِنَّنَا لَمُهْتَدُونَ","latin":"waqaaluu yaa ayyuhaa alsaahiru ud'u lanaa rabbaka bimaa 'ahida 'indaka innanaa lamuhtaduuna","translate":{"id":"Dan mereka berkata: \"Hai ahli sihir , berdo'alah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadmu; sesungguhnya kami (jika do'amu dikabulkan) benar-benar akan menjadi orang yang mendapat petunjuk.\n","en":"And [every time] they exclaimed: “O thou sorcerer! Pray for us to thy Sustainer on the strength of the covenant [of prophethood] which He has made with thee: for, verily, we shall now follow the right way!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4374","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4374.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4374.mp3"]}},{"no":50,"arab":"فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنْكُثُونَ","latin":"falammaa kasyafnaa 'anhumu al'adzaaba idzaa hum yankutsuuna","translate":{"id":"Maka tatkala Kami hilangkan azab itu dari mereka, dengan serta merta mereka memungkiri (janjinya).\n","en":"But whenever We removed the suffering from them, lo! they would break their word."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4375","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4375.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4375.mp3"]}},{"no":51,"arab":"وَنَادَىٰ فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَٰذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي ۖ أَفَلَا تُبْصِرُونَ","latin":"wanaadaa fir'awnu fii qawmihi qaala yaa qawmi alaysa lii mulku mishra wahaadzihi al-anhaaru tajrii min tahtii afalaa tubshiruuna","translate":{"id":"Dan Fir'aun berseru kepada kaumnya (seraya) berkata: \"Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku dan (bukankah) sungai-sungai ini mengalir di bawahku; maka apakah kamu tidak melihat(nya)?\n","en":"And Pharaoh issued a call to his people, say­ing: “O my people! Does not the dominion over Egypt belong to me, since all these running waters flow at my feet? Can you not, then, see [that I am your lord supreme]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4376","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4376.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4376.mp3"]}},{"no":52,"arab":"أَمْ أَنَا خَيْرٌ مِنْ هَٰذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ","latin":"am anaa khayrun min haadzaa alladzii huwa mahiinun walaa yakaadu yubiinu","translate":{"id":"Bukankah aku lebih baik dari orang yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?\n","en":"Am I not better than this contemptible man who can hardly make his meaning clear?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4377","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4377.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4377.mp3"]}},{"no":53,"arab":"فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِنْ ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ","latin":"falawlaa ulqiya 'alayhi aswiratun min dzahabin aw jaa-a ma'ahu almalaa-ikatu muqtariniina","translate":{"id":"Mengapa tidak dipakaikan kepadanya gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya?\"\n","en":"“And then - why have no golden armlets been bestowed on him? or why have no angels come together with him?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4378","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4378.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4378.mp3"]}},{"no":54,"arab":"فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ","latin":"faistakhaffa qawmahu fa-athaa'uuhu innahum kaanuu qawman faasiqiina","translate":{"id":"Maka Fir'aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. Karena sesungguhnya mereka adalah kaum yang fasik.\n","en":"Thus he incited his people to levity, and they obeyed him: for, behold, they were people depraved!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4379","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4379.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4379.mp3"]}},{"no":55,"arab":"فَلَمَّا آسَفُونَا انْتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ","latin":"falammaa aasafuunaa intaqamnaa minhum fa-aghraqnaahum ajma'iina","translate":{"id":"Maka tatkala mereka membuat Kami murka, Kami menghukum mereka lalu kami tenggelamkan mereka semuanya (di laut),\n","en":"But when they continued to challenge Us, We inflicted Our retribution on them, and drowned them all:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4380","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4380.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4380.mp3"]}},{"no":56,"arab":"فَجَعَلْنَاهُمْ سَلَفًا وَمَثَلًا لِلْآخِرِينَ","latin":"faja'alnaahum salafan wamatsalan lil-aakhiriina","translate":{"id":"dan Kami jadikan mereka sebagai pelajaran dan contoh bagi orang-orang yang kemudian.\n","en":"and so We made them a thing of the past, and an example to those who would come after them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4381","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4381.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4381.mp3"]}},{"no":57,"arab":"وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ","latin":"walammaa dhuriba ibnu maryama matsalan idzaa qawmuka minhu yashidduuna","translate":{"id":"Dan tatkala putra Maryam (Isa) dijadikan perumpamnaan tiba-tiba kaummu (Quraisy) bersorak karenanya.\n","en":"NOW WHENEVER [the nature of] the son of Mary is set forth as an example, [O Muhammad,] lo! thy people raise an outcry on this score,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4382","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4382.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4382.mp3"]}},{"no":58,"arab":"وَقَالُوا أَآلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا ۚ بَلْ هُمْ قَوْمٌ خَصِمُونَ","latin":"waqaaluu aaalihatunaa khayrun am huwa maa dharabuuhu laka illaa jadalan bal hum qawmun khashimuuna","translate":{"id":"Dan mereka berkata: \"Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?\" Mereka tidak memberikan perumpamaan itu kepadamu melainkan dengan maksud membantah saja, sebenarnya mereka adalah kaum yang suka bertengkar .\n","en":"and say, “Which is better - our deities or he?” [But] it is only in the spirit of dispute that they put this comparison before thee: yea, they are conten­tious folk!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4383","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4383.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4383.mp3"]}},{"no":59,"arab":"إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِبَنِي إِسْرَائِيلَ","latin":"in huwa illaa 'abdun an'amnaa 'alayhi waja'alnaahu matsalan libanii israa-iila","translate":{"id":"Isa tidak lain hanyalah seorang hamba yang Kami berikan kepadanya ni'mat (kenabian) dan Kami jadikan dia sebagai tanda bukti (kekuasaan Allah) untuk Bani lsrail ","en":"[As for Jesus,] he was nothing but [a human being -] a servant [of Ours] whom We had graced [with prophethood], and whom We made an example for the children of Israel."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4384","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4384.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4384.mp3"]}},{"no":60,"arab":"وَلَوْ نَشَاءُ لَجَعَلْنَا مِنْكُمْ مَلَائِكَةً فِي الْأَرْضِ يَخْلُفُونَ","latin":"walaw nasyaau laja'alnaa minkum malaa-ikatan fii al-ardhi yakhlufuuna","translate":{"id":"Dan kalau Kami kehendaki benar-benar Kami jadikan sebagai gantimu di muka bumi malaikat-malaikat yang turun temurun.\n","en":"And had We so willed, [O you who worship angels,] We could indeed have made you into angels succeeding one another on earth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4385","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4385.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4385.mp3"]}},{"no":61,"arab":"وَإِنَّهُ لَعِلْمٌ لِلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُونِ ۚ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ","latin":"wa-innahu la'ilmun lilssaa'ati falaa tamtarunna bihaa waittabi'uuni haadzaa shiraathun mustaqiimun","translate":{"id":"Dan sesungguhnya Isa itu benar-benar memberikan pengetahuan tentang hari kiamat. Karena itu janganlah kamu ragu-ragu tentang kiamat itu dan ikutilah Aku. Inilah jalan yang lurus.\n","en":"AND, BEHOLD, this [divine writ] is indeed a means to know [that] the Last Hour [is bound to come]; hence, have no doubt whatever about it, but follow Me: this [alone] is a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4386","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4386.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4386.mp3"]}},{"no":62,"arab":"وَلَا يَصُدَّنَّكُمُ الشَّيْطَانُ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ","latin":"walaa yashuddannakumu alsysyaythaanu innahu lakum 'aduwwun mubiinun","translate":{"id":"Dan janganlah kamu sekali-kali dipalingkan oleh syaitan; sesungguhnya syaitan itu musuh yang nyata bagimu.\n","en":"And let not Satan bars you [from it] - for, verily, he is your open foe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4387","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4387.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4387.mp3"]}},{"no":63,"arab":"وَلَمَّا جَاءَ عِيسَىٰ بِالْبَيِّنَاتِ قَالَ قَدْ جِئْتُكُمْ بِالْحِكْمَةِ وَلِأُبَيِّنَ لَكُمْ بَعْضَ الَّذِي تَخْتَلِفُونَ فِيهِ ۖ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ","latin":"walammaa jaa-a 'iisaa bialbayyinaati qaala qad ji/tukum bialhikmati wali-ubayyina lakum ba'dha alladzii takhtalifuuna fiihi faittaquu allaaha wa-athii'uuni","translate":{"id":"Dan tatkala Isa datang membawa keterangan dia berkata: \"Sesungguhnya aku datang kepadamu dengan membawa hikmat dan untuk menjelaskan kepadamu sebagian dari apa yang kamu berselisih tentangnya, maka bertakwalah kepada Allah dan taatlah (kepada) ku\".\n","en":"NOW WHEN Jesus came [to his people] with all evidence of the truth, he said: “I have now come unto you with wisdom, and to make clear Unto you some of that on which you are at variance: hence, be conscious of God, and pay heed unto me."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4388","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4388.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4388.mp3"]}},{"no":64,"arab":"إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ","latin":"inna allaaha huwa rabbii warabbukum fau'buduuhu haadzaa shiraathun mustaqiimun","translate":{"id":"Sesungguhnya Allah Dialah Tuhanku dan Tuhan kamu maka sembahlah Dia, ini adalah jalan yang lurus.\n","en":"“Verily, God is my Sustainer as well as your Sustainer; so worship [none but] Him: this [alone] is a straight way!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4389","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4389.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4389.mp3"]}},{"no":65,"arab":"فَاخْتَلَفَ الْأَحْزَابُ مِنْ بَيْنِهِمْ ۖ فَوَيْلٌ لِلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ","latin":"faikhtalafa al-ahzaabu min baynihim fawaylun lilladziina zhalamuu min 'adzaabi yawmin aliimin","translate":{"id":"Maka berselisihlah golongan-golongan (yang terdapat) di antara mereka, lalu kecelakaan yang besarlah bagi orang-orang yang zalim ya'ni siksaan hari yang pedih (kiamat).\n","en":"But factions from among those [who came after Jesus] began to hold divergent views: woe, then, unto those who are bent on evildoing - [woe] for the suffering [that will befall them] on a grie­vous Day!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4390","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4390.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4390.mp3"]}},{"no":66,"arab":"هَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ","latin":"hal yanzhuruuna illaa alssaa'ata an ta/tiyahum baghtatan wahum laa yasy'uruuna","translate":{"id":"Mereka tidak menunggu kecuali kedatangan hari kiamat kepada mereka dengan tiba-tiba sedang mereka tidak menyadarinya.\n","en":"ARE THEY [who are lost in sin] but waiting for the Last Hour - [waiting] that it come upon them of a sudden, without their being aware [of its approach]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4391","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4391.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4391.mp3"]}},{"no":67,"arab":"الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ","latin":"al-akhillaau yawma-idzin ba'dhuhum liba'dhin 'aduwwun illaa almuttaqiina","translate":{"id":"Teman-teman akrab pada hari itu sebagiannya menjadi musuh bagi sebagian yang lain kecuali orang-orang yang bertakwa.\n","en":"On that Day, [erstwhile] friends will be foes unto one another - [all] save the God-conscious."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4392","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4392.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4392.mp3"]}},{"no":68,"arab":"يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنْتُمْ تَحْزَنُونَ","latin":"yaa 'ibaadi laa khawfun 'alaykumu alyawma walaa antum tahzanuuna","translate":{"id":"\"Hai hamba-hamba-Ku, tiada kekhawatiran terhadapmu pada hari ini dan tidak pula kamu bersedih hati.\n","en":"[And God will say:] “O you servants of Mine! No fear need you have today, and neither shall you grieve –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4393","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4393.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4393.mp3"]}},{"no":69,"arab":"الَّذِينَ آمَنُوا بِآيَاتِنَا وَكَانُوا مُسْلِمِينَ","latin":"alladziina aamanuu bi-aayaatinaa wakaanuu muslimiina","translate":{"id":"(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan adalah mereka dahulu orang-orang yang berserah diri.\n","en":"[O you] who have attained to faith in Our messages and have surrendered your own selves unto Us!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4394","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4394.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4394.mp3"]}},{"no":70,"arab":"ادْخُلُوا الْجَنَّةَ أَنْتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ","latin":"udkhuluu aljannata antum wa-azwaajukum tuhbaruuna","translate":{"id":"Masuklah kamu ke dalam surga, kamu dan isteri-isteri kamu digembirakan\".\n","en":"Enter paradise, you and your spouses, with happiness blest!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4395","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4395.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4395.mp3"]}},{"no":71,"arab":"يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِنْ ذَهَبٍ وَأَكْوَابٍ ۖ وَفِيهَا مَا تَشْتَهِيهِ الْأَنْفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنْتُمْ فِيهَا خَالِدُونَ","latin":"yuthaafu 'alayhim bishihaafin min dzahabin wa-akwaabin wafiihaa maa tasytahiihi al-anfusu wataladzdzu al-a'yunu wa-antum fiihaa khaaliduuna","translate":{"id":"Diedarkan kepada mereka piring-piring dari emas, dan piala-piala dan di dalam surga itu terdapat segala apa yang diingini oleh hati dan sedap (dipandang) mata dan kamu kekal di dalamnya\".\n","en":"[And there] they will be waited upon with trays and goblets of gold; and there will be found all that the souls might desire, and [all that] the eyes might delight in. And therein shall you abide, [O you who believe:]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4396","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4396.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4396.mp3"]}},{"no":72,"arab":"وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"watilka aljannatu allatii uuritstumuuhaa bimaa kuntum ta'maluuna","translate":{"id":"Dan itulah surga yang diwariskan kepada kamu disebabkan amal-amal yang dahulu kamu kerjakan.\n","en":"for such will be the paradise which you shall have inherited by virtue of your past deeds:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4397","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4397.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4397.mp3"]}},{"no":73,"arab":"لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ مِنْهَا تَأْكُلُونَ","latin":"lakum fiihaa faakihatun katsiiratun minhaa ta/kuluuna","translate":{"id":"Di dalam surga itu ada buah-buahan yang banyak untukmu yang sebahagiannya kamu makan.\n","en":"fruits [of those deeds] shall you have in abundance, [and] thereof shall you partake!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4398","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4398.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4398.mp3"]}},{"no":74,"arab":"إِنَّ الْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ","latin":"inna almujrimiina fii 'adzaabi jahannama khaaliduuna","translate":{"id":"Sesungguhnya orang-orang yang berdosa kekal di dalam azab neraka Jahannam.\n","en":"[But,] behold, they who are lost in sin shall abide in the suffering of hell:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4399","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4399.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4399.mp3"]}},{"no":75,"arab":"لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ","latin":"laa yufattaru 'anhum wahum fiihi mublisuuna","translate":{"id":"Tidak diringankan azab itu dari mereka dan mereka di dalamnya berputus asa.\n","en":"it will not be lightened for them; and therein they will be lost in hopeless despair."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4400","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4400.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4400.mp3"]}},{"no":76,"arab":"وَمَا ظَلَمْنَاهُمْ وَلَٰكِنْ كَانُوا هُمُ الظَّالِمِينَ","latin":"wamaa zhalamnaahum walaakin kaanuu humu alzhzhaalimiina","translate":{"id":"Dan tidaklah Kami menganiaya mereka tetapi merekalah yang menganiaya diri mereka sendiri.\n","en":"And it is not We who will be doing wrong unto them, but it is they who will have wronged them­selves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4401","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4401.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4401.mp3"]}},{"no":77,"arab":"وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُمْ مَاكِثُونَ","latin":"wanaadaw yaa maaliku liyaqdhi 'alaynaa rabbuka qaala innakum maakitsuuna","translate":{"id":"Mereka berseru: \"Hai Malik biarlah Tuhanmu membunuh kami saja\". Dia menjawab: \"Kamu akan tetap tinggal (di neraka ini)\".\n","en":"And they will cry: “O thou [angel] who rulest [over hell]! Let thy Sustainer put an end to us!” - whereupon] he will reply: “Verily, you must live on [in this state]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4402","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4402.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4402.mp3"]}},{"no":78,"arab":"لَقَدْ جِئْنَاكُمْ بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ","latin":"laqad ji/naakum bialhaqqi walaakinna aktsarakum lilhaqqi kaarihuuna","translate":{"id":"Sesungguhnya Kami benar-benar telah memhawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu.\n","en":"INDEED, [O you sinners,] We have conveyed the truth unto you; but most of you abhor the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4403","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4403.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4403.mp3"]}},{"no":79,"arab":"أَمْ أَبْرَمُوا أَمْرًا فَإِنَّا مُبْرِمُونَ","latin":"am abramuu amran fa-innaa mubrimuuna","translate":{"id":"Bahkan mereka telah menetapkan satu tipu daya (jahat), maka sesungguhnya Kami menetapkan pula .\n","en":"Why - can they [who deny the truth ever] determine what [the truth] should be?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4404","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4404.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4404.mp3"]}},{"no":80,"arab":"أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُمْ ۚ بَلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ","latin":"am yahsabuuna annaa laa nasma'u sirrahum wanajwaahum balaa warusulunaa ladayhim yaktubuuna","translate":{"id":"Apakah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan (malaikat-malaikat) Kami selalu mencatat di sisi mereka.\n","en":"Or do they, perchance, think that We do not hear their hidden thoughts and their secret confabulations? Yea, indeed, [We do,] and Our heavenly forces are with them, recording [all]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4405","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4405.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4405.mp3"]}},{"no":81,"arab":"قُلْ إِنْ كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ","latin":"qul in kaana lilrrahmaani waladun fa-anaa awwalu al'aabidiina","translate":{"id":"Katakanlah, jika benar Tuhan Yang Maha Pemurah mempunyai anak, maka akulah (Muhammad) orang yang mula-mula memuliakan (anak itu).\n","en":"Say [O Prophet]: “If the Most Gracious [truly] had a son, I would be the first to worship him!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4406","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4406.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4406.mp3"]}},{"no":82,"arab":"سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ","latin":"subhaana rabbi alssamaawaati waal-ardhi rabbi al'arsyi 'ammaa yashifuuna","translate":{"id":"Maha Suci Tuhan Yang empunya langit dan bumi, Tuhan Yang empunya 'Arsy, dari apa yang mereka sifatkan itu.\n","en":"Utterly remote, in His glory, is the Sustainer of the heavens and the earth - the Sustainer, in almigh­tiness enthroned from all that they may attribute to Him by way of definition!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4407","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4407.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4407.mp3"]}},{"no":83,"arab":"فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ","latin":"fadzarhum yakhuudhuu wayal'abuu hattaa yulaaquu yawmahumu alladzii yuu'aduuna","translate":{"id":"Maka biarlah mereka tenggelam (dalam kesesatan) dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka.\n","en":"But leave them to indulge in idle talk and play [with words] until they face that [Judgment] Day of theirs which they have been promised:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4408","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4408.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4408.mp3"]}},{"no":84,"arab":"وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ","latin":"wahuwa alladzii fii alssamaa-i ilaahun wafii al-ardhi ilaahun wahuwa alhakiimu al'aliimu","translate":{"id":"Dan Dialah Tuhan (Yang disembah) di langit dan Tuhan (Yang disembah) di bumi dan Dia-lah Yang Maha Bijaksana lagi Maha Mengetahui.\n","en":"for [then they will come to know that] it is He [alone] who is God in heaven and God on earth, and [that] He alone is truly wise, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4409","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4409.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4409.mp3"]}},{"no":85,"arab":"وَتَبَارَكَ الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَعِنْدَهُ عِلْمُ السَّاعَةِ وَإِلَيْهِ تُرْجَعُونَ","latin":"watabaaraka alladzii lahu mulku alssamaawaati waal-ardhi wamaa baynahumaa wa'indahu 'ilmu alssaa'ati wa-ilayhi turja'uuna","translate":{"id":"Dan Maha Suci Tuhan Yang mempunyai kerajaan langit dan bumi; dan apa yang ada di antara keduanya; dan di sisi-Nyalah pengetahuan tentang hari kiamat dan hanya kepada-Nyalah kamu dikembalikan.\n","en":"And hallowed be He unto whom the dominion over the heavens and the earth and all that is between them belongs, and with whom the knowledge of the Last Hour rests, and unto whom you all shall be brought back!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4410","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4410.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4410.mp3"]}},{"no":86,"arab":"وَلَا يَمْلِكُ الَّذِينَ يَدْعُونَ مِنْ دُونِهِ الشَّفَاعَةَ إِلَّا مَنْ شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ","latin":"walaa yamliku alladziina yad'uuna min duunihi alsysyafaa'ata illaa man syahida bialhaqqi wahum ya'lamuuna","translate":{"id":"Dan sembahan-sembahan yang mereka sembah selain Allah tidak dapat memberi syafa'at; akan tetapi (orang yang dapat memberi syafa'at ialah) orang yang mengakui yang hak (tauhid) dan mereka meyakini(nya) .\n","en":"And those [beings] whom some invoke beside God have it not in their power to intercede [on Judgment Day] for any but such as have [in their lifetime] borne witness to the truth, and have been aware [that God is one and unique]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4411","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4411.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4411.mp3"]}},{"no":87,"arab":"وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ","latin":"wala-in sa-altahum man khalaqahum layaquulunna allaahu fa-annaa yu/fakuuna","translate":{"id":"Dan sungguh jika kamu bertanya kepada mereka: \"Siapakah yang menciptakan mereka, niscaya mereka menjawab: \"Allah\", maka bagaimanakah mereka dapat dipalingkan (dari menyembah Allah)?,\n","en":"Now if thou ask those [who worship any being other than God] as to who it is that has created them, they are sure to answer, “God.” How perverted, then, are their minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4412","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4412.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4412.mp3"]}},{"no":88,"arab":"وَقِيلِهِ يَا رَبِّ إِنَّ هَٰؤُلَاءِ قَوْمٌ لَا يُؤْمِنُونَ","latin":"waqiilihi yaa rabbi inna haaulaa-i qawmun laa yu/minuuna","translate":{"id":"dan (Allah mengetabui) ucapan Muhammad: \"Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman\".\n","en":"[But God has full knowledge of the true be­liever] and of his [despairing] cry: “O my Sustainer! Verily, these are people who will not believe!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4413","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4413.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4413.mp3"]}},{"no":89,"arab":"فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌ ۚ فَسَوْفَ يَعْلَمُونَ","latin":"faishfah 'anhum waqul salaamun fasawfa ya'lamuuna","translate":{"id":"Maka berpalinglah (hai Muhammad) dari mereka dan katakanlah: \"Salam (selamat tinggal).\" Kelak mereka akan mengetahui (nasib mereka yang buruk).\n","en":"Yet bear thou with them, and say, “Peace [be upon you]!” - for in time they will come to know [the truth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4414","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4414.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4414.mp3"]}}]}