{"alquran":{"no":45,"name":"Al-Jaathiya","arab":"الجاثية","start":4473,"count":37,"rukku":4,"type":"mecca","description":"Surat Al Jaatsiyah terdiri atas 37 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Ad Dukhaan. Dinamai dengan <i>Al Jaatsiyah</i> (yang berlutut) diambil dari perkataan <i>Jaatsiyah</i> yang terdapat pada ayat 28 surat ini. Ayat tersebut menerangkan tentang keadaan manusia pada hari kiamat, yaitu semua manusia dikumpulkan ke hadapan mahkamah Allah Yang Maha Tinggi yang memberikan keputusan terhadap perbuatan yang telah mereka lakukan di dunia. Pada hari itu semua manusia berlutut di hadapan Allah. Dinamai juga dengan <i>Asy Syari'ah</i> diambil dari perkataan <i>Syari'ah</i> (Syari'at) yang terdapat pada ayat 18 surat ini."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim ","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4474","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4474.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4474.mp3"]}},{"no":2,"arab":"تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ","latin":"tanziilu alkitaabi mina allaahi al'aziizi alhakiimi","translate":{"id":"Kitab (ini) diturunkan dari Allah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4475","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4475.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4475.mp3"]}},{"no":3,"arab":"إِنَّ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِلْمُؤْمِنِينَ","latin":"inna fii alssamaawaati waal-ardhi laaayaatin lilmu/miniina","translate":{"id":"Sesungguhnya pada langit dan bumi benar-benar terdapat tanda-tanda (kekuasaan Allah) untuk orang-orang yang beriman.\n","en":"Behold, in the heavens as well as on earth there are indeed messages for all who [are willing to] believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4476","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4476.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4476.mp3"]}},{"no":4,"arab":"وَفِي خَلْقِكُمْ وَمَا يَبُثُّ مِنْ دَابَّةٍ آيَاتٌ لِقَوْمٍ يُوقِنُونَ","latin":"wafii khalqikum wamaa yabutstsu min daabbatin aayaatun liqawmin yuuqinuuna","translate":{"id":"Dan pada penciptakan kamu dan pada binatang-binatang yang melata yang bertebaran (di muka bumi) terdapat tanda-tanda (kekuasaan Allah) untuk kaum yang meyakini,\n","en":"And in your own nature, and in [that of] all the animals which He scatters [over the earth] there are messages for people who are endowed with inner certainty."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4477","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4477.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4477.mp3"]}},{"no":5,"arab":"وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ رِزْقٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ الرِّيَاحِ آيَاتٌ لِقَوْمٍ يَعْقِلُونَ","latin":"waikhtilaafi allayli waalnnahaari wamaa anzala allaahu mina alssamaa-i min rizqin fa-ahyaa bihi al-ardha ba'da mawtihaa watashriifi alrriyaahi aayaatun liqawmin ya'qiluuna","translate":{"id":"dan pada pergantian malam dan siang dan hujan yang diturunkan Allah dari langit lalu dihidupkan-Nya dengan air hujan itu bumi sesudah matinya; dan pada perkisaran angin terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berakal.\n","en":"And in the succession of night and day, and in the means of subsistence which God sends down from the skies, giving life thereby to the earth after it had been lifeless, and in the change of the winds: [in all this] there are messages for people who use their reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4478","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4478.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4478.mp3"]}},{"no":6,"arab":"تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ","latin":"tilka aayaatu allaahi natluuhaa 'alayka bialhaqqi fabi-ayyi hadiitsin ba'da allaahi waaayaatihi yu/minuuna","translate":{"id":"Itulah ayat-ayat Allah yang Kami membacakannya kepadamu dengan sebenarnya; maka dengan perkataan manakah lagi mereka akan beriman sesudah (kalam) Allah dan keterangan-keterangan-Nya.\n","en":"These messages of God do We convey unto thee, setting forth the truth. In what other tiding, if not in God’s messages, will they, then, believe?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4479","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4479.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4479.mp3"]}},{"no":7,"arab":"وَيْلٌ لِكُلِّ أَفَّاكٍ أَثِيمٍ","latin":"waylun likulli affaakin atsiimin","translate":{"id":"Kecelakaan besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,\n","en":"Woe unto every sinful self-deceiver"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4480","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4480.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4480.mp3"]}},{"no":8,"arab":"يَسْمَعُ آيَاتِ اللَّهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ","latin":"yasma'u aayaati allaahi tutlaa 'alayhi tsumma yushirru mustakbiran ka-an lam yasma'haa fabasysyirhu bi'adzaabin aliimin","translate":{"id":"dia mendengar ayat-ayat Allah dibacakan kepadanya kemudian dia tetap menyombongkan diri seakan-akan dia tidak mendengarnya. Maka beri khabar gembiralah dia dengan azab yang pedih.\n","en":"who hears God’s messages when they are conveyed to him, and yet, as though he had not heard them, persists in his haughty disdain! Hence, announce unto him grievous suffering –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4481","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4481.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4481.mp3"]}},{"no":9,"arab":"وَإِذَا عَلِمَ مِنْ آيَاتِنَا شَيْئًا اتَّخَذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ","latin":"wa-idzaa 'alima min aayaatinaa syay-an ittakhadzahaa huzuwan ulaa-ika lahum 'adzaabun muhiinun","translate":{"id":"Dan apabila dia mengetahui barang sedikit tentang ayat-ayat Kami, maka ayat-ayat itu dijadikan olok-olok. Merekalah yang memperoleh azab yang menghinakan.\n","en":"for when he does become aware of any of Our messages, he makes them a target of his mockery! For all such there is shameful suffering in store."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4482","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4482.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4482.mp3"]}},{"no":10,"arab":"مِنْ وَرَائِهِمْ جَهَنَّمُ ۖ وَلَا يُغْنِي عَنْهُمْ مَا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ","latin":"min waraa-ihim jahannamu walaa yughnii 'anhum maa kasabuu syay-an walaa maa ittakhadzuu min duuni allaahi awliyaa-a walahum 'adzaabun 'azhiimun","translate":{"id":"Di hadapan mereka neraka Jahannam dan tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan, dan tidak pula berguna apa yang mereka jadikan sebagai sembahan-sembahan (mereka) dari selain Allah. Dan bagi mereka azab yang besar.\n","en":"Hell is ahead of them; and all that they may have gained [in this world] shall be of no avail whatever to them, and neither shall any of those things which, instead of God, they have come to regard as their protectors: for, awesome suffering awaits them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4483","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4483.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4483.mp3"]}},{"no":11,"arab":"هَٰذَا هُدًى ۖ وَالَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِنْ رِجْزٍ أَلِيمٌ","latin":"haadzaa hudan waalladziina kafaruu bi-aayaati rabbihim lahum 'adzaabun min rijzin aliimin","translate":{"id":"Ini (Al Qur'an) adalah petunjuk. Dan orang-orang yang kafir kepada ayat-ayat Tuhannya bagi mereka azab yaitu siksaan yang sangat pedih.\n","en":"[To pay heed to God’s signs and messages:] this is [the meaning of] guidance; on the other hand, for those who are bent on denying the truth of their Sustainer’s messages there is grievous suffering in store as an outcome of [their] vileness."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4484","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4484.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4484.mp3"]}},{"no":12,"arab":"اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","latin":"allaahu alladzii sakhkhara lakumu albahra litajriya alfulku fiihi bi-amrihi walitabtaghuu min fadhlihi wala'allakum tasykuruuna","translate":{"id":"Allah-lah yang menundukkan lautan untukmu supaya kapal-kapal dapat berlayar padanya dengan seizin-Nya dan supaya kamu dapat mencari karunia-Nya dan mudah-mudahan kamu bersyukur.\n","en":"IT IS GOD who has made the sea subservient [to His laws, so that it be of use] to you so that ships might sail through it at His behest, and that you might seek to obtain [what you need] of His bounty, and that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4485","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4485.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4485.mp3"]}},{"no":13,"arab":"وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ","latin":"wasakhkhara lakum maa fii alssamaawaati wamaa fii al-ardhi jamii'an minhu inna fii dzaalika laaayaatin liqawmin yatafakkaruuna","translate":{"id":"Dan Dia telah menundukkan untukmu apa yang di langit dan apa yang di bumi semuanya, (sebagai rahmat) daripada-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berfikir.\n","en":"And He has made subservient to you, [as a gift] from Himself, all that is in the heavens and on earth: in this, behold, there are messages indeed for people who think!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4486","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4486.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4486.mp3"]}},{"no":14,"arab":"قُلْ لِلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ","latin":"qul lilladziina aamanuu yaghfiruu lilladziina laa yarjuuna ayyaama allaahi liyajziya qawman bimaa kaanuu yaksibuuna","translate":{"id":"Katakanlah kepada orang-orang yang beriman hendaklah mereka memaafkan orang-orang yang tiada takut hari-hari Allah karena Dia akan membalas sesuatu kaum terhadap apa yang telah mereka kerjakan.\n","en":"Tell all who have attained to faith that they should forgive those who do not believe in the com­ing of the Days of God, [since it is] for Him [alone] to requite people for whatever they may have earned."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4487","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4487.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4487.mp3"]}},{"no":15,"arab":"مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۖ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ","latin":"man 'amila shaalihan falinafsihi waman asaa-a fa'alayhaa tsumma ilaa rabbikum turja'uuna","translate":{"id":"Barangsiapa yang mengerjakan amal saleh, maka itu adalah untuk dirinya sendiri, dan barangsiapa yang mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmulah kamu dikembalikan.\n","en":"Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own hurt; and in the end unto your Sustainer you all will be brought back."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4488","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4488.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4488.mp3"]}},{"no":16,"arab":"وَلَقَدْ آتَيْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى الْعَالَمِينَ","latin":"walaqad aataynaa banii israa-iila alkitaaba waalhukma waalnnubuwwata warazaqnaahum mina alththhayyibaati wafadhdhalnaahum 'alaa al'aalamiina","translate":{"id":"Dan sesungguhnya telah Kami berikan kepada Bani Israil Al Kitab (Taurat), kekuasaan dan kenabian dan Kami berikan kepada mereka rezki-rezki yang baik dan Kami lebihkan mereka atas bangsa-bangsa (pada masanya).\n","en":"AND, INDEED, [already] unto the children of Israel did We vouchsafe revelation, and wisdom, and prophethood; and We provided for them sustenance out of the good things of life, and favoured them above all other people [of their time]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4489","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4489.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4489.mp3"]}},{"no":17,"arab":"وَآتَيْنَاهُمْ بَيِّنَاتٍ مِنَ الْأَمْرِ ۖ فَمَا اخْتَلَفُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ","latin":"waaataynaahum bayyinaatin mina al-amri famaa ikhtalafuu illaa min ba'di maa jaa-ahumu al'ilmu baghyan baynahum inna rabbaka yaqdhii baynahum yawma alqiyaamati fiimaa kaanuu fiihi yakhtalifuuna","translate":{"id":"Dan Kami berikan kepada mereka keterangan-keterangan yang nyata tentang urusan (agama); maka mereka tidak berselisih melainkan sesudah datang kepada mereka pengetahuan karena kedengkian yang ada di antara mereka. Sesungguhnya Tuhanmu akan memutuskan antara mereka pada hari kiamat terhadap apa yang mereka selalu berselisih padanya.\n","en":"And We gave them clear indications of the purpose [of faith]; and it was only after all this knowledge had been vouchsafed to them that they began, out of mutual jealousy, to hold divergent views: [but,] verily, thy Sustainer will judge be­tween them on Resurrection Day regarding all whereon they were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4490","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4490.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4490.mp3"]}},{"no":18,"arab":"ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ","latin":"tsumma ja'alnaaka 'alaa syarii'atin mina al-amri faittabi'haa walaa tattabi' ahwaa-a alladziina laa ya'lamuuna","translate":{"id":"Kemudian Kami jadikan kamu berada di atas suatu syariat (peraturan) dari urusan (agama itu), maka ikutilah syariat itu dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui.\n","en":"And, finally, [O Muhammad,] We have set thee on a way by which the purpose [of faith] may be fulfilled: so follow thou this [way], and follow not the likes and dislikes of those who do not know [the truth]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4491","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4491.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4491.mp3"]}},{"no":19,"arab":"إِنَّهُمْ لَنْ يُغْنُوا عَنْكَ مِنَ اللَّهِ شَيْئًا ۚ وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۖ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ","latin":"innahum lan yughnuu 'anka mina allaahi syay-an wa-inna alzhzhaalimiina ba'dhuhum awliyaau ba'dhin waallaahu waliyyu almuttaqiina","translate":{"id":"Sesungguhnya mereka sekali-kali tidak akan dapat menolak dari kamu sedikitpun dari siksaan Allah. Dan Sesungguhnya orang-orang yang zalim itu sebagian mereka menjadi penolong bagi sebagian yang lain, dan Allah adalah pelindung orang-orang yang bertakwa.\n","en":"Behold, they could never be of any avail to thee if thou wert to defy the will of God for, verily, such evildoers are but friends and protectors of one another, whereas God is the Protector of all who are conscious of Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4492","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4492.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4492.mp3"]}},{"no":20,"arab":"هَٰذَا بَصَائِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِقَوْمٍ يُوقِنُونَ","latin":"haadzaa bashaa-iru lilnnaasi wahudan warahmatun liqawmin yuuqinuuna","translate":{"id":"Al Qur'an ini adalah pedoman bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini.\n","en":"This [revelation, then,] is a means of insight for mankind, and a guidance and grace unto people who are endowed with inner certainty."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4493","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4493.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4493.mp3"]}},{"no":21,"arab":"أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئَاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَوَاءً مَحْيَاهُمْ وَمَمَاتُهُمْ ۚ سَاءَ مَا يَحْكُمُونَ","latin":"am hasiba alladziina ijtarahuu alssayyi-aati an naj'alahum kaalladziina aamanuu wa'amiluu alshshaalihaati sawaa-an mahyaahum wamamaatuhum saa-a maa yahkumuuna","translate":{"id":"Apakah orang-orang yang membuat kejahatan itu menyangka bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal saleh, yaitu sama antara kehidupan dan kematian mereka? Amat buruklah apa yang mereka sangka itu.\n","en":"Now as for those who indulge in sinful doings - do they think that We place them, both in their life and their death, on an equal footing with those who have attained to faith and do righteous deeds? Bad, indeed, is their judgment:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4494","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4494.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4494.mp3"]}},{"no":22,"arab":"وَخَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَلِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ","latin":"wakhalaqa allaahu alssamaawaati waal-ardha bialhaqqi walitujzaa kullu nafsin bimaa kasabat wahum laa yuzhlamuuna","translate":{"id":"Dan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar dibalasi tiap-tiap diri terhadap apa yang dikerjakannya, dan mereka tidak akan dirugikan.\n","en":"for, God has created the heavens and the earth in accordance with [an inner] truth, and [has therefore willed] that every human being shall be recompensed for what he has earned and none shall be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4495","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4495.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4495.mp3"]}},{"no":23,"arab":"أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَىٰ عِلْمٍ وَخَتَمَ عَلَىٰ سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلَىٰ بَصَرِهِ غِشَاوَةً فَمَنْ يَهْدِيهِ مِنْ بَعْدِ اللَّهِ ۚ أَفَلَا تَذَكَّرُونَ","latin":"afara-ayta mani ittakhadza ilaahahu hawaahu wa-adhallahu allaahu 'alaa 'ilmin wakhatama 'alaa sam'ihi waqalbihi waja'ala 'alaa basharihi ghisyaawatan faman yahdiihi min ba'di allaahi afalaa tadzakkaruuna","translate":{"id":"Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya dan Allah membiarkannya berdasarkan ilmu-Nya dan Allah telah mengunci mati pendengaran dan hatinya dan meletakkan tutupan atas penglihatannya? Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat). Maka mengapa kamu tidak mengambil pelajaran?\n","en":"HAST THOU ever considered [the kind of man] who makes his own desires his deity, and whom God has [thereupon] let go astray, knowing [that his mind is closed to all guidance], and whose hearing and heart He has sealed, and upon whose sight He has placed a veil? Who, then, could guide him after God [has abandoned him]? Will you not, then, bethink your­selves?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4496","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4496.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4496.mp3"]}},{"no":24,"arab":"وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ ۚ وَمَا لَهُمْ بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ","latin":"waqaaluu maa hiya illaa hayaatunaa alddunyaa namuutu wanahyaa wamaa yuhlikunaa illaa alddahru wamaa lahum bidzaalika min 'ilmin in hum illaa yazhunnuuna","translate":{"id":"Dan mereka berkata: \"Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup dan tidak ada yang akan membinasakan kita selain masa\", dan mereka sekali-kali tidak mempunyai pengetahuan tentang itu, mereka tidak lain hanyalah menduga-duga saja.\n","en":"And yet they say: “There is nothing beyond our life in this world. We die as we come to life, and nothing but time destroys us.” But of this they have no knowledge whatever: they do nothing but guess."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4497","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4497.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4497.mp3"]}},{"no":25,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ مَا كَانَ حُجَّتَهُمْ إِلَّا أَنْ قَالُوا ائْتُوا بِآبَائِنَا إِنْ كُنْتُمْ صَادِقِينَ","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa bayyinaatin maa kaana hujjatahum illaa an qaaluu i/tuu bi-aabaa-inaa in kuntum shaadiqiina","translate":{"id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami yang jelas, tidak ada bantahan mereka selain dari mengatakan: \"Datangkanlah nenek moyang kami jika kamu adalah orang-orang yang benar.\"\n","en":"And [so,] whenever Our messages are conveyed to them in all their clarity, their only argument is this: “Bring forth our fore­fathers [as witnesses], if what you claim is true!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4498","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4498.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4498.mp3"]}},{"no":26,"arab":"قُلِ اللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ","latin":"quli allaahu yuhyiikum tsumma yumiitukum tsumma yajma'ukum ilaa yawmi alqiyaamati laa rayba fiihi walaakinna aktsara alnnaasi laa ya'lamuuna","translate":{"id":"Katakanlah: \"Allah-lah yang menghidupkan kamu kemudian mematikan kamu, setelah itu mengumpulkan kamu pada hari kiamat yang tidak ada keraguan padanya; akan tetapi kebanyakan manusia tidak mengetahui.\n","en":"Say: “It is God who gives you life, and then causes you to die; and in the end He will gather you together on Resurrection Day, [the coming of] which is beyond all doubt - but most human beings under­stand it not.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4499","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4499.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4499.mp3"]}},{"no":27,"arab":"وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ","latin":"walillaahi mulku alssamaawaati waal-ardhi wayawma taquumu alssaa'atu yawma-idzin yakhsaru almubthiluuna","translate":{"id":"Dan hanya kepunyaan Allah kerajaan langit dan bumi. Dan pada hari terjadinya kebangkitan, akan rugilah pada hari itu orang-orang yang mengerjakan kebathilan.\n","en":"For, God’s is the dominion over the heavens and the earth; and on the Day when the Last Hour dawns - on that Day will be lost all who [in their lifetime] tried to reduce to nothing [whatever they could not understand]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4500","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4500.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4500.mp3"]}},{"no":28,"arab":"وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً ۚ كُلُّ أُمَّةٍ تُدْعَىٰ إِلَىٰ كِتَابِهَا الْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ","latin":"wataraa kulla ummatin jaatsiyatan kullu ummatin tud'aa ilaa kitaabihaa alyawma tujzawna maa kuntum ta'maluuna","translate":{"id":"Dan (pada hari itu) kamu lihat tiap-tiap umat berlutut. Tiap-tiap umat dipanggil untuk (melihat) buku catatan amalnya. Pada hari itu kamu diberi balasan terhadap apa yang telah kamu kerjakan.\n","en":"And [on that Day] thou wilt see all people kneeling down [in humility]: all people will be called upon to [face] their record: “Today you shall be requited for all that you ever did!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4501","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4501.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4501.mp3"]}},{"no":29,"arab":"هَٰذَا كِتَابُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنْسِخُ مَا كُنْتُمْ تَعْمَلُونَ","latin":"haadzaa kitaabunaa yanthiqu 'alaykum bialhaqqi innaa kunnaa nastansikhu maa kuntum ta'maluuna","translate":{"id":"(Allah berfirman): \"Inilah kitab (catatan) Kami yang menuturkan terhadapmu dengan benar. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan\".\n","en":"This Our record speaks of you in all truth: for, verily, We have caused to be recorded all that you ever did!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4502","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4502.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4502.mp3"]}},{"no":30,"arab":"فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِي رَحْمَتِهِ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْمُبِينُ","latin":"fa-ammaa alladziina aamanuu wa'amiluu alshshaalihaati fayudkhiluhum rabbuhum fii rahmatihi dzaalika huwa alfawzu almubiinu","translate":{"id":"Adapun orang-orang yang beriman dan mengerjakan amal saleh maka Tuhan mereka memasukkan mereka ke dalam rahmat-Nya (surga). Itulah keberuntungan yang nyata.\n","en":"Now as for those who have attained to faith and done righteous deeds, their Sustainer will admit them to His grace: that will be [their] manifest triumph!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4503","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4503.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4503.mp3"]}},{"no":31,"arab":"وَأَمَّا الَّذِينَ كَفَرُوا أَفَلَمْ تَكُنْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْمًا مُجْرِمِينَ","latin":"wa-ammaa alladziina kafaruu afalam takun aayaatii tutlaa 'alaykum faistakbartum wakuntum qawman mujrimiina","translate":{"id":"Dan adapun orang-orang yang kafir (kepada mereka dikatakan): \"Maka apakah belum ada ayat-ayat Ku yang dibacakan kepadamu lalu kamu menyombongkan diri dan kamu jadi kaum yang berbuat dosa?\"\n","en":"But as for those who were bent on denying the truth, [they will be told:] “Were not My messages conveyed to you? And withal, you gloried in your arrogance, and so you became people lost in sin:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4504","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4504.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4504.mp3"]}},{"no":32,"arab":"وَإِذَا قِيلَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَالسَّاعَةُ لَا رَيْبَ فِيهَا قُلْتُمْ مَا نَدْرِي مَا السَّاعَةُ إِنْ نَظُنُّ إِلَّا ظَنًّا وَمَا نَحْنُ بِمُسْتَيْقِنِينَ","latin":"wa-idzaa qiila inna wa'da allaahi haqqun waalssaa'atu laa rayba fiihaa qultum maa nadrii maa alssaa'atu in nazhunnu illaa zhannan wamaa nahnu bimustayqiniina","translate":{"id":"Dan apabila dikatakan (kepadamu): \"Sesungguhnya janji Allah itu adalah benar dan hari berbangkit itu tidak ada keraguan padanya\", niscaya kamu menjawab: \"Kami tidak tahu apakah hari kiamat itu, kami sekali-kali tidak lain hanyalah menduga-duga saja dan kami sekali-kali tidak meyakini(nya)\".\n","en":"for when it was said, ‘Behold, God’s promise always comes true, and there can be no doubt about [the coming of] the Last Hour’ - you would answer, ‘We do not know what that Last Hour may be: we think it is no more than an empty guess, and [so] we are by no means convinced!’”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4505","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4505.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4505.mp3"]}},{"no":33,"arab":"وَبَدَا لَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"wabadaa lahum sayyi-aatu maa 'amiluu wahaaqa bihim maa kaanuu bihi yastahzi-uuna","translate":{"id":"Dan nyatalah bagi mereka keburukan-keburukan dari apa yang mereka kerjakan dan mereka diliputi oleh (azab) yang mereka selalu memperolok-olokkannya.\n","en":"And [on that Day,] the evil of their doings will become obvious to them, and they will be over­whelmed by the very thing which they were wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4506","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4506.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4506.mp3"]}},{"no":34,"arab":"وَقِيلَ الْيَوْمَ نَنْسَاكُمْ كَمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُمْ مِنْ نَاصِرِينَ","latin":"waqiila alyawma nansaakum kamaa nasiitum liqaa-a yawmikum haadzaa wama/waakumu alnnaaru wamaa lakum min naasiriina","translate":{"id":"Dan dikatakan (kepada mereka): \"Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini dan tempat kembalimu ialah neraka dan kamu sekali-kali tidak memperoleh penolong\".\n","en":"And [the word] will be spoken: “Today We shall be oblivious of you as you were oblivious of the coming of this your Day [of Judgment]; and so your goal is the fire, and you shall have none to succour you:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4507","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4507.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4507.mp3"]}},{"no":35,"arab":"ذَٰلِكُمْ بِأَنَّكُمُ اتَّخَذْتُمْ آيَاتِ اللَّهِ هُزُوًا وَغَرَّتْكُمُ الْحَيَاةُ الدُّنْيَا ۚ فَالْيَوْمَ لَا يُخْرَجُونَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُونَ","latin":"dzaalikum bi-annakumu ittakhadztum aayaati allaahi huzuwan wagharratkumu alhayaatu alddunyaa faalyawma laa yukhrajuuna minhaa walaa hum yusta'tabuuna","translate":{"id":"Yang demikian itu, karena sesungguhnya kamu menjadikan ayat-ayat Allah sebagai olok-olokan dan kamu telah ditipu oleh kehidupan dunia, maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan untuk bertaubat.\n","en":"this, because you made God’s messages the target of your mockery, having allowed the life of this world to beguile you!” On that Day, therefore, they will not be brought out of the fire, nor will they be allowed to make amends."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4508","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4508.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4508.mp3"]}},{"no":36,"arab":"فَلِلَّهِ الْحَمْدُ رَبِّ السَّمَاوَاتِ وَرَبِّ الْأَرْضِ رَبِّ الْعَالَمِينَ","latin":"falillaahi alhamdu rabbi alssamaawaati warabbi al-ardhi rabbi al'aalamiina","translate":{"id":"Maka bagi Allah-lah segala puji, Tuhan langit dan Tuhan bumi, Tuhan semesta alam.\n","en":"AND THUS, all praise is due to God, Sustainer of the heavens and Sustainer of the earth: the Sustainer of all the worlds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4509","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4509.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4509.mp3"]}},{"no":37,"arab":"وَلَهُ الْكِبْرِيَاءُ فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"walahu alkibriyaau fii alssamaawaati waal-ardhi wahuwa al'aziizu alhakiimu","translate":{"id":"Dan bagi-Nyalah keagungan di langit dan bumi, Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"And His alone is all majesty in the heavens and on earth; and He alone is almighty, truly wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4510","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4510.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4510.mp3"]}}]}