{"alquran":{"no":46,"name":"Al-Ahqaf","arab":"الأحقاف","start":4510,"count":35,"rukku":4,"type":"mecca","description":"Surat Al Ahqaaf terdiri dari 35 ayat termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Al Jaatsiyah. Dinamai <i>Al Ahqaaf</i>  (bukit-bukit pasir) dari perkataan <i>Al Ahqaaf</i> yang terdapat pada ayat 21 surat ini.<br>Dalam ayat tersebut dan ayat-ayat sesudahnya diterangkan bahwa Nabi Hud a.s. telah menyampaikan risalahnya kepada kaumnya di <i>Al Ahqaaf</i> yang sekarang dikenal dengan Ar Rab'ul Khaali, tetapi kaumnya tetap ingkar sekalipun mereka telah diberi peringatan pula oleh rasul-rasul yang sebelumnya.  Akhirnya Allah menghancurkan mereka dengan tiupan angin kencang.  Hal ini adalah sebagai isyarat dari Allah kepada kaum musyrikin Quraisy bahwa mereka akan dihancurkan bila mereka tidak mengindahkan seruan Rasul."},"surah":[{"no":1,"arab":" حم","latin":"haa-miim","translate":{"id":"Haa Miim .\n","en":"Ha. Mim."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4511","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4511.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4511.mp3"]}},{"no":2,"arab":"تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ","latin":"tanziilu alkitaabi mina allaahi al'aziizi alhakiimi","translate":{"id":"Diturunkan Kitab ini dari Allah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"THE BESTOWAL from on high of this divine writ I issues from God, the Almighty, the Wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4512","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4512.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4512.mp3"]}},{"no":3,"arab":"مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ وَأَجَلٍ مُسَمًّى ۚ وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ","latin":"maa khalaqnaa alssamaawaati waal-ardha wamaa baynahumaa illaa bialhaqqi wa-ajalin musamman waalladziina kafaruu 'ammaa undziruu mu'ridhuuna","translate":{"id":"Kami tiada menciptakan langit dan bumi dan apa yang ada antara keduanya melainkan dengan (tujuan) yang benar dan dalam waktu yang ditentukan. Dan orang-orang yang kafir berpaling dari apa yang diperingatkan kepada mereka.\n","en":"We have not created the heavens and the earth and all that is between them otherwise than in accord­ance with [an inner] truth, and for a term set [by Us]: and yet, they who are bent on denying the truth turn aside from the warning which has been conveyed unto them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4513","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4513.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4513.mp3"]}},{"no":4,"arab":"قُلْ أَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ ۖ ائْتُونِي بِكِتَابٍ مِنْ قَبْلِ هَٰذَا أَوْ أَثَارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صَادِقِينَ","latin":"qul ara-aytum maa tad'uuna min duuni allaahi aruunii maatsaa khalaquu mina al-ardhi am lahum syirkun fii alssamaawaati iituunii bikitaabin min qabli haadzaa aw atsaaratin min 'ilmin in kuntum shaadiqiina","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku tentang apa yang kamu sembah selain Allah; perlihatkan kepada-Ku apakah yang telah mereka ciptakan dari bumi ini atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit? Bawalah kepada-Ku Kitab yang sebelum (Al Qur'an) ini atau peninggalan dari pengetahuan (orang-orang dahulu), jika kamu adalah orang-orang yang benar\"\n","en":"Say: “Have you [really] given thought to what it is that you invoke instead of God? Show me what these [beings or forces] have created anywhere on earth! Or had they, perchance, a share in [creating] the heavens? [If so,] bring me any divine writ pre­ceding this one, or any [other] vestige of knowledge - if what you claim is true!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4514","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4514.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4514.mp3"]}},{"no":5,"arab":"وَمَنْ أَضَلُّ مِمَّنْ يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَىٰ يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ","latin":"waman adhallu mimman yad'uu min duuni allaahi man laa yastajiibu lahu ilaa yawmi alqiyaamati wahum 'an du'aa-ihim ghaafiluuna","translate":{"id":"Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (do'a) nya sampai hari kiamat dan mereka lalai dari (memperhatikan) do'a mereka?\n","en":"And who could be more astray than one who invokes, instead of God, such as will not respond to him either now or on the Day of Resurrection, and are not even conscious of being invoked?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4515","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4515.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4515.mp3"]}},{"no":6,"arab":"وَإِذَا حُشِرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ","latin":"wa-idzaa husyira alnnaasu kaanuu lahum a'daa-an wakaanuu bi'ibaadatihim kaafiriina","translate":{"id":"Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.\n","en":"such as, when all mankind is gathered [for judgment], will be enemies unto those [who worshipped them], and will utterly reject their worship?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4516","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4516.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4516.mp3"]}},{"no":7,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلْحَقِّ لَمَّا جَاءَهُمْ هَٰذَا سِحْرٌ مُبِينٌ","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa bayyinaatin qaala alladziina kafaruu lilhaqqi lammaa jaa-ahum haadzaa sihrun mubiinun","translate":{"id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami yang menjelaskan, berkatalah orang-orang yang mengingkari kebenaran ketika kebenaran itu datang kepada mereka: \"Ini adalah sihir yang nyata\".\n","en":"But whenever Our messages are conveyed to them in all their clarity, they who are bent on denying the truth speak thus of the truth as soon as it is brought to them: “This is clearly nothing but spell­binding eloquence!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4517","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4517.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4517.mp3"]}},{"no":8,"arab":"أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا ۖ هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ ۖ كَفَىٰ بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ ۖ وَهُوَ الْغَفُورُ الرَّحِيمُ","latin":"am yaquuluuna iftaraahu qul ini iftaraytuhu falaa tamlikuuna lii mina allaahi syay-an huwa a'lamu bimaa tufiidhuuna fiihi kafaa bihi syahiidan baynii wabaynakum wahuwa alghafuuru alrrahiimu","translate":{"id":"Bahkan mereka mengatakan: \"Dia (Muhammad) telah mengada-adakannya (Al Qur'an)\". Katakanlah: \"Jika aku mengada-adakannya, maka kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu. Dia lebih mengetahui apa-apa yang kamu percakapkan tentang Al Qur'an itu. Cukuplah Dia menjadi saksi antaraku dan antaramu dan Dia-lah Yang Maha Pengampun lagi Maha Penyayang\".\n","en":"Or do they say, “He has invented all this”? Say [O Muhammad]: “Had I invented it, you would not be of the least help to me against God. He is fully aware of that [slander] into which you so reck­lessly plunge: enough is He as a witness between me and you! And [withal,] He alone is truly-forgiving, a true dispenser of grace.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4518","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4518.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4518.mp3"]}},{"no":9,"arab":"قُلْ مَا كُنْتُ بِدْعًا مِنَ الرُّسُلِ وَمَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ وَمَا أَنَا إِلَّا نَذِيرٌ مُبِينٌ","latin":"qul maa kuntu bid'an mina alrrusuli wamaa adrii maa yuf'alu bii walaa bikum in attabi'u illaa maa yuuhaa ilayya wamaa anaa illaa nadziirun mubiinun","translate":{"id":"Katakanlah: \"Aku bukanlah rasul yang pertama di antara rasul-rasul dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu. Aku tidak lain hanyalah mengikuti apa yang diwahyukan kepadaku dan aku tidak lain hanyalah seorang pemberi peringatan yang menjelaskan\".\n","en":"Say: “I am not the first of [God’s] apostles; and [like all of them,] I do not know what will be done with me or with you: for I am nothing but a plain warner.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4519","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4519.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4519.mp3"]}},{"no":10,"arab":"قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ وَكَفَرْتُمْ بِهِ وَشَهِدَ شَاهِدٌ مِنْ بَنِي إِسْرَائِيلَ عَلَىٰ مِثْلِهِ فَآمَنَ وَاسْتَكْبَرْتُمْ ۖ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","latin":"qul ara-aytum in kaana min 'indi allaahi wakafartum bihi wasyahida syaahidun min banii israa-iila 'alaa mitslihi faaamana waistakbartum inna allaaha laa yahdii alqawma alzhzhaalimiina","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku, bagaimanakah pendapatmu jika Al Qur'an itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari Bani Israil mengakui (kebenaran) yang serupa dengan (yang tersebut dalam) Al Qur'an lalu dia beriman , sedang kamu menyombongkan diri. Sesungguhnya Allah tiada memberi petunjuk kepada orang-orang yang zalim\".\n","en":"Say: “Have you given thought [to how you will fare] if this be truly [a revelation] from God and yet you deny its truth? - even though a witness from among the children of Israel has already borne wit­ness to [the advent of] one like himself, and has believed [in him], the while you glory in your arro­gance [and reject his message]? Verily, God does not grace [such] evildoing folk with His guidance!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4520","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4520.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4520.mp3"]}},{"no":11,"arab":"وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا لَوْ كَانَ خَيْرًا مَا سَبَقُونَا إِلَيْهِ ۚ وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَٰذَا إِفْكٌ قَدِيمٌ","latin":"waqaala alladziina kafaruu lilladziina aamanuu law kaana khayran maa sabaquunaa ilayhi wa-idz lam yahtaduu bihi fasayaquuluuna haadzaa ifkun qadiimun","translate":{"id":"Dan orang-orang kafir berkata kepada orang-orang yang beriman: \"Kalau sekiranya di (Al Qur'an) adalah suatu yang baik, tentulah mereka tiada mendahului kami (beriman) kepadanya . Dan karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata: \"Ini adalah dusta yang lama\".\n","en":"But they who are bent on denying the truth speak thus of those who have attained to faith: “If this [message] were any good, these [people] would not have preceded us in accepting it!” And since they refuse to be guided by it, they will always say, “This is [but] an ancient falsehood!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4521","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4521.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4521.mp3"]}},{"no":12,"arab":"وَمِنْ قَبْلِهِ كِتَابُ مُوسَىٰ إِمَامًا وَرَحْمَةً ۚ وَهَٰذَا كِتَابٌ مُصَدِّقٌ لِسَانًا عَرَبِيًّا لِيُنْذِرَ الَّذِينَ ظَلَمُوا وَبُشْرَىٰ لِلْمُحْسِنِينَ","latin":"wamin qablihi kitaabu muusaa imaaman warahmatan wahaadzaa kitaabun mushaddiqun lisaanan 'arabiyyan liyundzira alladziina zhalamuu wabusyraa lilmuhsiniina","translate":{"id":"Dan sebelum Al Qur'an itu telah ada kitab Musa sebagai petunjuk dan rahmat. Dan ini (Al Qur'an) adalah kitab yang membenarkannya dalam bahasa Arab untuk memberi peringatan kepada orang-orang yang zalim dan memberi kabar gembira kepada orang-orang yang berbuat baik.\n","en":"And yet, before this there was the revelation of Moses, a guide and a [sign of God’s] grace; and this [Qur’an] is a divine writ confirming the truth [of the Torah] in the Arabic tongue, to warn those who are bent on evildoing, and [to bring] a glad tiding to the doers of good:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4522","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4522.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4522.mp3"]}},{"no":13,"arab":"إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","latin":"inna alladziina qaaluu rabbunaa allaahu tsumma istaqaamuu falaa khawfun 'alayhim walaa hum yahzanuuna","translate":{"id":"Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\", kemudian mereka tetap istiqamah maka tidak ada kekhawatiran terhadap mereka dan mereka tiada (pula) berduka cita.\n","en":"for, behold, all who say, “Our Sustainer is God”, and thereafter stand firm [in their faith] - no fear need they have, and neither shall they grieve:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4523","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4523.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4523.mp3"]}},{"no":14,"arab":"أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ خَالِدِينَ فِيهَا جَزَاءً بِمَا كَانُوا يَعْمَلُونَ","latin":"ulaa-ika ash-haabu aljannati khaalidiina fiihaa jazaa-an bimaa kaanuu ya'maluuna","translate":{"id":"Mereka itulah penghuni-penghuni surga, mereka kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan.\n","en":"it is they who are destined for paradise, therein to abide as a reward for all that they have done."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4524","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4524.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4524.mp3"]}},{"no":15,"arab":"وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ","latin":"wawashshaynaa al-insaana biwaalidayhi ihsaanan hamalat-hu ummuhu kurhan wawadha'at-hu kurhan wahamluhu wafishaaluhu tsalaatsuuna syahran hattaa idzaa balagha asyuddahu wabalagha arba'iina sanatan qaala rabbi awzi'nii an asykura ni'mataka allatii an'amta 'alayya wa'alaa waalidayya wa-an a'mala shaalihan tardaahu wa-ashlih lii fii dzurriyyatii innii tubtu ilayka wa-innii mina almuslimiina","translate":{"id":"Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya, ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula). Mengandungnya sampai menyapihnya adalah tiga puluh bulan, sehingga apabila dia telah dewasa dan umurnya sampai empat puluh tahun ia berdo'a: \"Ya Tuhanku, tunjukilah aku untuk mensyukuri ni'mat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai; berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sesungguhnya aku termasuk orang-orang yang berserah diri\".\n","en":"NOW [among the best of the deeds which] We have enjoined upon man is goodness towards his parents. In pain did his mother bear him, and in pain did she give him birth; and her bearing him and his utter dependence on her took thirty months. and so, when he attains to full maturity and reaches forty years, he [that is righteous] prays: “O my Sustainer! Inspire me so that I may forever be grateful for those blessings of Thine with which Thou hast graced me and my parents, and that I may do what is right [in a manner] that will meet with Thy goodly acceptance; and grant me righteousness in my offspring [as well]. Verily, unto Thee have I turned in repentance: for, verily, I am of those who have surrendered themselves unto Thee!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4525","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4525.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4525.mp3"]}},{"no":16,"arab":"أُولَٰئِكَ الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا وَنَتَجَاوَزُ عَنْ سَيِّئَاتِهِمْ فِي أَصْحَابِ الْجَنَّةِ ۖ وَعْدَ الصِّدْقِ الَّذِي كَانُوا يُوعَدُونَ","latin":"ulaa-ika alladziina nataqabbalu 'anhum ahsana maa 'amiluu wanatajaawazu 'an sayyi-aatihim fii ash-haabi aljannati wa'da alshshidqi alladzii kaanuu yuu'aduuna","translate":{"id":"Mereka itulah orang-orang yang Kami terima dari mereka amal yang baik yang telah mereka kerjakan dan Kami ampuni kesalahan-kesalahan mereka, bersama penghuni-penghuni surga, sebagai janji yang benar yang telah dijanjikan kepada mereka.\n","en":"It is [such as] these from whom We shall accept the best that they ever did, and whose bad deeds We shall overlook: [they will find themselves] among those who are destined for paradise, in fulfillment of the true promise which they were given [in this world]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4526","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4526.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4526.mp3"]}},{"no":17,"arab":"وَالَّذِي قَالَ لِوَالِدَيْهِ أُفٍّ لَكُمَا أَتَعِدَانِنِي أَنْ أُخْرَجَ وَقَدْ خَلَتِ الْقُرُونُ مِنْ قَبْلِي وَهُمَا يَسْتَغِيثَانِ اللَّهَ وَيْلَكَ آمِنْ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَيَقُولُ مَا هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","latin":"waalladzii qaala liwaalidayhi uffin lakumaa ata'idaaninii an ukhraja waqad khalati alquruunu min qablii wahumaa yastaghiitsaani allaaha waylaka aamin inna wa'da allaahi haqqun fayaquulu maa haadzaa illaa asaathiiru al-awwaliina","translate":{"id":"Dan orang yang berkata kepada dua orang ibu bapaknya: \"Cis bagi kamu keduanya, apakah kamu keduanya memperingatkan kepadaku bahwa aku akan dibangkitkan, padahal sungguh telah berlalu beberapa umat sebelumku? lalu kedua ibu bapaknya itu memohon pertolongan kepada Allah seraya mengatakan: \"Celaka kamu, berimanlah! Sesungguhnya janji Allah adalah benar\". Lalu dia berkata: \"Ini tidak lain hanyalah dongengan orang-orang dahulu belaka\".\n","en":"But [there is many a one] who says to his parents [whenever they try to imbue him with faith in God]: “Fie upon both of you! Do you promise me that I shall be brought forth [from the dead], although [so many] generations have passed away before me?” And [while] they both pray for God’s help [and say], “Alas for thee! For, behold, God’s promise always comes true!” - he but answers, “All this is nothing but fables of ancient times!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4527","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4527.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4527.mp3"]}},{"no":18,"arab":"أُولَٰئِكَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ","latin":"ulaa-ika alladziina haqqa 'alayhimu alqawlu fii umamin qad khalat min qablihim mina aljinni waal-insi innahum kaanuu khaasiriina","translate":{"id":"Mereka itulah orang-orang yang telah pasti ketetapan (azab) atas mereka bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia. Sesungguhnya mereka adalah orang-orang yang merugi.\n","en":"It is [such as] these upon whom the sentence [of doom] will fall due, together with the [other sinful] communities of invisible beings and humans that have passed away before their time. Verily, they will be lost:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4528","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4528.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4528.mp3"]}},{"no":19,"arab":"وَلِكُلٍّ دَرَجَاتٌ مِمَّا عَمِلُوا ۖ وَلِيُوَفِّيَهُمْ أَعْمَالَهُمْ وَهُمْ لَا يُظْلَمُونَ","latin":"walikullin darajaatun mimmaa 'amiluu waliyuwaffiyahum a'maalahum wahum laa yuzhlamuuna","translate":{"id":"Dan bagi masing-masing mereka derajat menurut apa yang telah mereka kerjakan dan agar Allah mencukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka sedang mereka tiada dirugikan.\n","en":"for, [in the life to come,] all shall have their degrees in accordance with whatever [good or evil] they did: and so, He will repay them in full for their doings, and none shall be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4529","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4529.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4529.mp3"]}},{"no":20,"arab":"وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُمْ بِهَا فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنْتُمْ تَسْتَكْبِرُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَفْسُقُونَ","latin":"wayawma yu'radhu alladziina kafaruu 'alaa alnnaari adzhabtum thayyibaatikum fii hayaatikumu alddunyaa waistamta'tum bihaa faalyawma tujzawna 'adzaaba alhuuni bimaa kuntum tastakbiruuna fii al-ardhi bighayri alhaqqi wabimaa kuntum tafsuquuna","translate":{"id":"Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan): \"Kamu telah menghabiskan rezkimu yang baik dalam kehidupan duniawimu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik\".\n","en":"And on the Day when those who were bent on denying the truth will be brought within sight of the fire, [they will be told:] “You have exhausted your [share of] good things in your worldly life, having enjoyed them [without any thought of the hereafter]: and so today you shall be requited with the suffering of humiliation for having gloried on earth in your arrogance, offending against all that is right, and for all your iniquitous doings!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4530","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4530.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4530.mp3"]}},{"no":21,"arab":"وَاذْكُرْ أَخَا عَادٍ إِذْ أَنْذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ","latin":"waudzkur akhaa 'aadin idz andzara qawmahu bial-ahqaafi waqad khalati alnnudzuru min bayni yadayhi wamin khalfihi allaa ta'buduu illaa allaaha innii akhaafu 'alaykum 'adzaaba yawmin 'azhiimin","translate":{"id":"Dan ingatlah (Hud) saudara kaum 'Aad yaitu ketika dia memberi peringatan kepada kaumnya di Al Ahqaaf dan sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebelumnya dan sesudahnya (dengan mengatakan): \"Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan ditimpa azab hari yang besar\".\n","en":"AND REMEMBER that brother of [the tribe of] Ad, how - seeing that [other] warnings had already come and gone within his own knowledge as well as in times beyond his ken - he warned his people [who lived] among those sand-dunes: “Worship none but God! Verily, I fear lest suffering befall you on an awesome day!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4531","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4531.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4531.mp3"]}},{"no":22,"arab":"قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ","latin":"qaaluu aji/tanaa lita/fikanaa 'an aalihatinaa fa/tinaa bimaa ta'idunaa in kunta mina alshshaadiqiina","translate":{"id":"Mereka menjawab: \"Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) tuhan-tuhan kami? Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar\".\n","en":"They answered: “Hast thou come to seduce us away from our gods? Bring, then, upon us that [doom] with which thou threaten us, if thou art a man of truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4532","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4532.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4532.mp3"]}},{"no":23,"arab":"قَالَ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ وَأُبَلِّغُكُمْ مَا أُرْسِلْتُ بِهِ وَلَٰكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ","latin":"qaala innamaa al'ilmu 'inda allaahi wauballighukum maa ursiltu bihi walaakinnii araakum qawman tajhaluuna","translate":{"id":"Ia berkata: \"Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya tetapi aku lihat kamu adalah kaum yang bodoh\".\n","en":"Said he: “Knowledge [of when it is to befall you] rests with God alone: I but convey unto you the message with which I have been entrusted; but I see that you are people ignorant [of right and wrong]!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4533","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4533.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4533.mp3"]}},{"no":24,"arab":"فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ","latin":"falammaa ra-awhu 'aaridhan mustaqbila awdiyatihim qaaluu haadzaa 'aaridhun mumthirunaa bal huwa maa ista'jaltum bihi riihun fiihaa 'adzaabun aliimun","translate":{"id":"Maka tatkala mereka melihat azab itu berupa awan yang menuju ke lembah-lembah mereka, berkatalah mereka: \"Inilah awan yang akan menurunkan hujan kepada kami\". (Bukan!) bahkan itulah azab yang kamu minta supaya datang dengan segera (yaitu) angin yang mengandung azab yang pedih,\n","en":"And so, when they beheld it in the shape of a dense cloud approaching their valleys, they exclaimed, “This is but a heavy cloud which will bring us [wel­come] rain!” [But Hud said:] “Nay, but it is the very thing which you [so contemptuously] sought to hasten - a wind bearing grievous suffering,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4534","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4534.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4534.mp3"]}},{"no":25,"arab":"تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لَا يُرَىٰ إِلَّا مَسَاكِنُهُمْ ۚ كَذَٰلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ","latin":"tudammiru kulla syay-in bi-amri rabbihaa fa-ashbahuu laa yuraa illaa masaakinuhum kadzaalika najzii alqawma almujrimiina","translate":{"id":"yang menghancurkan segala sesuatu dengan perintah Tuhannya, maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka. Demikianlah Kami memberi balasan kepada kaum yang berdosa.\n","en":"bound to destroy everything at its Sustainer’s behest!” And then they were so utterly wiped out that nothing could be seen save their [empty] dwellings: thus do We requite people lost in sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4535","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4535.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4535.mp3"]}},{"no":26,"arab":"وَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِنْ مَكَّنَّاكُمْ فِيهِ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً فَمَا أَغْنَىٰ عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُمْ مِنْ شَيْءٍ إِذْ كَانُوا يَجْحَدُونَ بِآيَاتِ اللَّهِ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"walaqad makkannaahum fiimaa in makkannaakum fiihi waja'alnaa lahum sam'an wa-abshaaran wa-af-idatan famaa aghnaa 'anhum sam'uhum walaa abshaaruhum walaa af-idatuhum min syay-in idz kaanuu yajhaduuna bi-aayaati allaahi wahaaqa bihim maa kaanuu bihi yastahzi-uuna","translate":{"id":"Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukanmu dalam hal itu dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati; tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit juapun bagi mereka, karena mereka selalu mengingkari ayat-ayat Allah dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokkannya.\n","en":"And yet, We had established them securely in a manner in which We have never established you, [O people of later times;] and We had endowed them with hearing, and sight, and [knowledgeable] hearts: but neither their hearing, nor their sight, nor their hearts were of the least avail to them, seeing that they went on rejecting God’s messages; and [in the end] they were overwhelmed by the very thing which they had been wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4536","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4536.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4536.mp3"]}},{"no":27,"arab":"وَلَقَدْ أَهْلَكْنَا مَا حَوْلَكُمْ مِنَ الْقُرَىٰ وَصَرَّفْنَا الْآيَاتِ لَعَلَّهُمْ يَرْجِعُونَ","latin":"walaqad ahlaknaa maa hawlakum mina alquraa washarrafnaa al-aayaati la'allahum yarji'uuna","translate":{"id":"Dan sesungguhnya Kami telah membinasakan negeri-negeri di sekitarmu dan Kami telah mendatangkan tanda-tanda kebesaran Kami berulang-ulang supaya mereka kembali (bertaubat).\n","en":"Thus have We destroyed many a [sinful] community living round about you; and yet, [before destroying them,] We had given many facets to [Our warning] messages, so that they might turn back [from their evil ways]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4537","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4537.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4537.mp3"]}},{"no":28,"arab":"فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ قُرْبَانًا آلِهَةً ۖ بَلْ ضَلُّوا عَنْهُمْ ۚ وَذَٰلِكَ إِفْكُهُمْ وَمَا كَانُوا يَفْتَرُونَ","latin":"falawlaa nasharahumu alladziina ittakhadzuu min duuni allaahi qurbaanan aalihatan bal dhalluu 'anhum wadzaalika ifkuhum wamaa kaanuu yaftaruuna","translate":{"id":"Maka mengapa yang mereka sembah selain Allah sebagai Tuhan untuk mendekatkan diri (kepada Allah) tidak dapat menolong mereka. Bahkan tuhan-tuhan itu telah lenyap dari mereka? Itulah akibat kebohongan mereka dan apa yang dahulu mereka ada-adakan.\n","en":"But, then, did those [beings] whom they had chosen to worship as deities beside God, hoping that they would bring them nearer [to Him], help them [in the end]? Nay, they forsook them: for that [alleged divinity] was but an outcome of their self-delusion and all their false imagery."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4538","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4538.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4538.mp3"]}},{"no":29,"arab":"وَإِذْ صَرَفْنَا إِلَيْكَ نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا ۖ فَلَمَّا قُضِيَ وَلَّوْا إِلَىٰ قَوْمِهِمْ مُنْذِرِينَ","latin":"wa-idz sharafnaa ilayka nafaran mina aljinni yastami'uuna alqur-aana falammaa hadharuuhu qaaluu anshituu falammaa qudhiya wallaw ilaa qawmihim mundziriina","translate":{"id":"Dan (ingatlah) ketika Kami hadapkan serombongan jin kepadamu yang mendengarkan Al Qur'an, maka tatkala mereka menghadiri pembacaan (nya) lalu mereka berkata: \"Diamlah kamu (untuk mendengarkannya)\". Ketika pembacaan telah selesai mereka kembali kepada kaumnya (untuk) memberi peringatan.\n","en":"AND LO! We caused a group of unseen beings to incline towards thee, [O Muhammad,] so that they might give ear to the Qur’an; and so, as soon as they became aware of it, they said [unto one another], “Listen in silence!” And when [the recitation] was ended, they returned to their people as warners."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4539","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4539.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4539.mp3"]}},{"no":30,"arab":"قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَىٰ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وَإِلَىٰ طَرِيقٍ مُسْتَقِيمٍ","latin":"qaaluu yaa qawmanaa innaa sami'naa kitaaban unzila min ba'di muusaa mushaddiqan limaa bayna yadayhi yahdii ilaa alhaqqi wa-ilaa thariiqin mustaqiimin","translate":{"id":"Mereka berkata: \"Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al Qur'an) yang telah diturunkan sesudah Musa yang membenarkan kitab-kitab yang sebelumnya lagi memimpin kepada kebenaran dan kepada jalan yang lurus.\n","en":"They said: “O our people! Behold, we have been listening to a revelation bestowed from on high after [that of] Moses, confirming the truth of what­ever there still remains [of the Torah]: it guides towards the truth, and onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4540","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4540.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4540.mp3"]}},{"no":31,"arab":"يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ","latin":"yaa qawmanaa ajiibuu daa'iya allaahi waaaminuu bihi yaghfir lakum min dzunuubikum wayujirkum min 'adzaabin aliimin","translate":{"id":"Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah dan berimanlah kepada-Nya, niscaya Allah akan mengampuni dosa-dosa kamu dan melepaskan kamu dari azab yang pedih.\n","en":"“O our people! Respond to God’s call, and have faith in Him: He will forgive you [whatever is past] of your sins, and deliver you from grievous suffering [in the life to come]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4541","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4541.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4541.mp3"]}},{"no":32,"arab":"وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ","latin":"waman laa yujib daa'iya allaahi falaysa bimu'jizin fii al-ardhi walaysa lahu min duunihi awliyaa-a ulaa-ika fii dhalaalin mubiinin","translate":{"id":"Dan orang yang tidak menerima (seruan) orang yang menyeru kepada Allah maka dia tidak akan melepaskan diri dari azab Allah di muka bumi dan tidak ada baginya pelindung selain Allah. Mereka itu dalam kesesatan yang nyata\".\n","en":"But he who does not respond to God’s call can never elude [Him] on earth, nor can he has any protector against Him [in the life to come]: all such are most obviously lost in error.”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4542","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4542.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4542.mp3"]}},{"no":33,"arab":"أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَلَمْ يَعْيَ بِخَلْقِهِنَّ بِقَادِرٍ عَلَىٰ أَنْ يُحْيِيَ الْمَوْتَىٰ ۚ بَلَىٰ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"awa lam yaraw anna allaaha alladzii khalaqa alssamaawaati waal-ardha walam ya'ya bikhalqihinna biqaadirin 'alaa an yuhyiya almawtaa balaa innahu 'alaa kulli syay-in qadiirun","translate":{"id":"Dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan Dia tidak merasa payah karena menciptakannya, kuasa menghidupkan orang-orang mati? Ya (bahkan) sesungguhnya Dia Maha Kuasa atas segala sesuatu.\n","en":"ARE, THEN, they [who deny the life to come] not aware that God, who has created the heavens and the earth and never been wearied by their creation, has [also] the power to bring the dead back to life? Yea, verily, He has the power to will anything!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4543","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4543.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4543.mp3"]}},{"no":34,"arab":"وَيَوْمَ يُعْرَضُ الَّذِينَ كَفَرُوا عَلَى النَّارِ أَلَيْسَ هَٰذَا بِالْحَقِّ ۖ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ","latin":"wayawma yu'radhu alladziina kafaruu 'alaa alnnaari alaysa haadzaa bialhaqqi qaaluu balaa warabbinaa qaala fadzuuquu al'adzaaba bimaa kuntum takfuruuna","translate":{"id":"Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan kepada neraka, (dikatakan kepada mereka): \"Bukankah (azab) ini benar?\" Mereka menjawab: \"Ya benar, demi Tuhan kami\". Allah berfirman \"Maka rasakanlah azab ini disebabkan kamu selalu ingkar\".\n","en":"And so, on the Day when those who were bent on denying the truth will be brought within sight of the fire [and will be asked], “Is not this the truth?” - they will answer, “Yea, by Our Sustainer!” [And] He will say: “Taste, then, this suffering as an outcome of your denial of the truth!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4544","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4544.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4544.mp3"]}},{"no":35,"arab":"فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِلْ لَهُمْ ۚ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِنْ نَهَارٍ ۚ بَلَاغٌ ۚ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ","latin":"faishbir kamaa shabara uluu al'azmi mina alrrusuli walaa tasta'jil lahum ka-annahum yawma yarawna maa yuu'aduuna lam yalbatsuu illaa saa'atan min nahaarin balaaghun fahal yuhlaku illaa alqawmu alfaasiquuna","translate":{"id":"Maka bersabarlah kamu seperti orang-orang yang mempunyai keteguhan hati dari rasul-rasul telah bersabar dan janganlah kamu meminta disegerakan (azab) bagi mereka. Pada hari mereka melihat azab yang diancamkan kepada mereka (merasa) seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari. (Inilah) suatu pelajaran yang cukup, maka tidak dibinasakan melainkan kaum yang fasik.\n","en":"REMAIN, then, [O believer,] patient in adversity, just as all of the apostles, endowed with firmness of heart, bore themselves with patience. And do not ask for a speedy doom of those [who still deny the truth]: on the Day when they see [the fulfillment of] what they were promised, [it will seem to them] as though they had dwelt [on earth] no longer than one hour of [an earthly] day! [This is Our] message. Will, then, any be [really] destroyed save iniquitous folk?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4545","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4545.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4545.mp3"]}}]}