{"alquran":{"no":47,"name":"Muhammad","arab":"محمد","start":4545,"count":38,"rukku":4,"type":"medina","description":"Surat Muhammad terdiri atas 38 ayat, termasuk golongan surat-surat Madaniyyah, diturunkan sesudah surat Al Hadiid. Nama <i>Muhammad</i> sebagai nama surat ini diambil dari perkataan Muhammad yang terdapat pada ayat 2 surat ini. Pada ayat 1, 2, dan 3 surat ini, Allah membandingkan antara hasil yang diperoleh oleh orang-orang yang tidak percaya kepada apa yang diturunkan kepada Nabi Muhammad s.a.w dan hasil yang diperoleh oleh orang-orang yang tidak percaya kepadanya. Orang-orang yang percaya kepada apa yang dibawa oleh Muhammad s.a.w merekalah orang-orang yang beriman dan mengikuti yang hak, diterima Allah semua amalnya, diampuni segala kesalahannya. Adapun orang-orang yang tidak percaya kepada Muhammad s.a.w adalah orang-orang yang mengikuti kebatilan, amalnya tidak diterima, dosa mereka tidak diampuni, kepada mereka dijanjikan azab di dunia dan di akhirat.<br>Dinamai juga dengan <i>Al Qital</i> (peperangan), karena sebahagian besar surat ini mengutarakan tentang peperangan dan pokok-pokok hukumnya, serta bagaimana seharusnya sikap orang-orang mukmin terhadap orang-orang kafir."},"surah":[{"no":1,"arab":" الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ","latin":"alladziina kafaruu washadduu 'an sabiili allaahi adhalla a'maalahum","translate":{"id":"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka .\n","en":"AS FOR THOSE who are bent on denying the truth and on barring [others] from the path of God - all their [good] deeds will He let go to waste;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4546","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4546.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4546.mp3"]}},{"no":2,"arab":"وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ ۙ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ","latin":"waalladziina aamanuu wa'amiluu alshshaalihaati waaamanuu bimaa nuzzila 'alaa muhammadin wahuwa alhaqqu min rabbihim kaffara 'anhum sayyi-aatihim wa-ashlaha baalahum","translate":{"id":"Dan orang-orang mu'min dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka.\n","en":"whereas those who have attained to faith and do righteous deeds, and have come to believe in what has been bestowed from on high on Muhammad - for it is the truth from their Sustainer - [shall attain to God’s grace:] He will efface their [past] bad deeds, and will set their hearts at rest."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4547","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4547.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4547.mp3"]}},{"no":3,"arab":"ذَٰلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ","latin":"dzaalika bi-anna alladziina kafaruu ittaba'uu albaathila wa-anna alladziina aamanuu ittaba'uu alhaqqa min rabbihim kadzaalika yadhribu allaahu lilnnaasi amtsaalahum","translate":{"id":"Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mu'min mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.\n","en":"This, because they who are bent on denying the truth pursue falsehood, whereas they who have attained to faith pursue [but] the truth [that flows] from their Sustainer. In this way does God set forth unto man the parables of their true state."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4548","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4548.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4548.mp3"]}},{"no":4,"arab":"فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانْتَصَرَ مِنْهُمْ وَلَٰكِنْ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ ۗ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَنْ يُضِلَّ أَعْمَالَهُمْ","latin":"fa-idzaa laqiitumu alladziina kafaruu fadharba alrriqaabi hattaa idzaa atskhantumuuhum fasyudduu alwatsaaqa fa-immaa mannan ba'du wa-immaa fidaa-an hattaa tadha'a alharbu awzaarahaa dzaalika walaw yasyaau allaahu laintashara minhum walaakin liyabluwa ba'dhakum biba'dhin waalladziina qutiluu fii sabiili allaahi falan yudhilla a'maalahum sayahdiihim wayushlihu baalahum","translate":{"id":"Apabila kamu bertemu dengan orang-orang kafir (di medan perang) maka pancunglah batang leher mereka. Sehingga apabila kamu telah mengalahkan mereka maka tawanlah mereka dan sesudah itu kamu boleh membebaskan mereka atau menerima tebusan sampai perang berakhir. Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebahagian kamu dengan sebahagian yang lain. Dan orang-orang yang syahid pada jalan Allah, Allah tidak akan menyia-nyiakan amal mereka.\n","en":"NOW WHEN you meet [in war] those who are bent on denying the truth, smite their necks until you overcome them fully, and then tighten their bonds; but thereafter [set them free,] either by an act of grace or against ransom, so that the burden of war may be lifted: thus [shall it be]. And [know that] had God so willed, He could indeed punish them [Himself]; but [He wills you to struggle] so as to test you [all] by means of one another. And as for those who are slain in God’s cause, never will He let their deeds go to waste:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4549","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4549.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4549.mp3"]}},{"no":5,"arab":"سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ","latin":"sayahdihim wa yushlihu baa lahum","translate":{"id":"Allah akan memberi pimpinan kepada mereka dan memperbaiki keadaan mereka,\n","en":"He will guide them [in the hereafter as well], and will set their hearts at rest,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4550","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4550.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4550.mp3"]}},{"no":6,"arab":"وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ","latin":"wayudkhiluhumu aljannata 'arrafahaa lahum","translate":{"id":"dan memasukkan mereka ke dalam jannah yang telah diperkenankanNya kepada mereka.\n","en":"and will admit them to the paradise which He has promised them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4551","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4551.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4551.mp3"]}},{"no":7,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَنْصُرُوا اللَّهَ يَنْصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ","latin":"yaa ayyuhaa alladziina aamanuu in tanshuruu allaaha yanshurkum wayutsabbit aqdaamakum","translate":{"id":"Hai orang-orang mu'min, jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.\n","en":"O you who have attained to faith! If you help [the cause of] God, He will help you, and will make firm your steps;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4552","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4552.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4552.mp3"]}},{"no":8,"arab":"وَالَّذِينَ كَفَرُوا فَتَعْسًا لَهُمْ وَأَضَلَّ أَعْمَالَهُمْ","latin":"waalladziina kafaruu fata'san lahum wa-adhalla a'maalahum","translate":{"id":"Dan orang-orang yang kafir, maka kecelakaanlah bagi mereka dan Allah menyesatkan amal-amal mereka.\n","en":"but as for those who are bent on denying the truth, ill fortune awaits them, since He will let all their [good] deeds go to waste:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4553","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4553.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4553.mp3"]}},{"no":9,"arab":"ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ","latin":"dzaalika bi-annahum karihuu maa anzala allaahu fa-ahbatha a'maalahum","translate":{"id":"Yang demikian itu adalah karena Sesungguhnya mereka benci kepada apa yang diturunkan Allah (Al Quraan) lalu Allah menghapuskan (pahala-pahala) amal-amal mereka.\n","en":"this, because they hate [the very thought of] what God has bestowed from on high and thus He causes all their deeds to come to nought!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4554","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4554.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4554.mp3"]}},{"no":10,"arab":"أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا","latin":"afalam yasiiruu fii al-ardhi fayanzhuruu kayfa kaana 'aaqibatu alladziina min qablihim dammara allaahu 'alayhim walilkaafiriina amtsaaluhaa","translate":{"id":"Maka apakah mereka tidak mengadakan perjalanan di muka bumi sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang sebelum mereka; Allah telah menimpakan kebinasaan atas mereka dan orang-orang kafir akan menerima (akibat-akibat) seperti itu.\n","en":"Have they, then, never journeyed about the earth and beheld what happened in the end to those [willful sinners] who lived before their time? God destroyed them utterly: and the like thereof awaits all who deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4555","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4555.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4555.mp3"]}},{"no":11,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ","latin":"dzaalika bi-anna allaaha mawlaa alladziina aamanuu wa-anna alkaafiriina laa mawlaa lahum","translate":{"id":"Yang demikian itu karena sesungguhnya Allah adalah pelindung orang-orang yang beriman dan karena sesungguhnya orang-orang kafir itu tidak mempunyai pelindung.\n","en":"This, because God is the Protector of all who have attained to faith, whereas they who deny the truth have no protector."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4556","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4556.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4556.mp3"]}},{"no":12,"arab":"إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَهُمْ","latin":"inna allaaha yudkhilu alladziina aamanuu wa'amiluu alshshaalihaati jannaatin tajrii min tahtihaa al-anhaaru waalladziina kafaruu yatamatta'uuna waya/kuluuna kamaa ta/kulu al-an'aamu waalnnaaru matswan lahum","translate":{"id":"Sesungguhnya Allah memasukkan orang-orang mu'min dan beramal saleh ke dalam jannah yang mengalir di bawahnya sungai-sungai. Dan orang-orang kafir bersenang-senang (di dunia) dan mereka makan seperti makannya binatang. Dan jahannam adalah tempat tinggal mereka.\n","en":"Verily, God will admit all who attain to faith and do righteous deeds into gardens through which running waters flow, whereas they who are bent on denying the truth shall have - even though they may enjoy their life [in this world] and eat as cattle eat - the fire [of the hereafter] for their abode."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4557","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4557.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4557.mp3"]}},{"no":13,"arab":"وَكَأَيِّنْ مِنْ قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِنْ قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ","latin":"waka-ayyin min qaryatin hiya asyaddu quwwatan min qaryatika allatii akhrajatka ahlaknaahum falaa naasira lahum","translate":{"id":"Dan betapa banyaknya negeri yang (penduduknya) lebih kuat dari pada (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka, maka tidak ada seorang penolongpun bagi mereka.\n","en":"And how many a community of greater power than this thy community which has driven thee out, [O Muhammad,] have We destroyed, with none to succour them!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4558","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4558.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4558.mp3"]}},{"no":14,"arab":"أَفَمَنْ كَانَ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُمْ","latin":"afaman kaana 'alaa bayyinatin min rabbihi kaman zuyyina lahu suu-u 'amalihi waittaba'uu ahwaa-ahum","translate":{"id":"Maka apakah orang yang berpegang pada keterangan yang datang dari Rabbnya sama dengan orang yang (shaitan) menjadikan dia memandang baik perbuatannya yang buruk itu dan mengikuti hawa nafsunya?\n","en":"CAN, THEN, he who takes his stand on a clear evidence from his Sustainer be likened Unto one to whom the evil of his own doings [always] seems goodly, and unto such as would follow but their own lusts?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4559","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4559.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4559.mp3"]}},{"no":15,"arab":"مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى ۖ وَلَهُمْ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ ۖ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ","latin":"matsalu aljannati allatii wu'ida almuttaquuna fiihaa anhaarun min maa-in ghayri aasinin wa-anhaarun min labanin lam yataghayyar tha'muhu wa-anhaarun min khamrin ladzdzatin lilsysyaaribiina wa-anhaarun min 'asalin mushaffan walahum fiihaa min kulli altstsamaraati wamaghfiratun min rabbihim kaman huwa khaalidun fii alnnaari wasuquu maa-an hamiiman faqaththha'a am'aa-ahum","translate":{"id":"(Apakah) perumpamaan (penghuni) jannah yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tidak berubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh di dalamnya segala macam buah-buahan dan ampunan dari Rabb mereka, sama dengan orang yang kekal dalam jahannam dan diberi minuman dengan air yang mendidih sehingga memotong ususnya?\n","en":"[And can] the parable of the paradise which the God-conscious are promised [a paradise] wherein there are rivers of water which time does not corrupt, and rivers of milk the taste whereof never alters, and rivers of wine delightful to those who drink it, and rivers of honey of all impurity cleansed, and the enjoyment of all the fruits [of their good deeds] and of forgiveness from their Sustainer -: can this [parable of paradise] be likened unto [the parable of the recompense of] such as are to abide in the fire and be given waters of burning despair to drink, so that it will tear their bowels asunder?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4560","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4560.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4560.mp3"]}},{"no":16,"arab":"وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ حَتَّىٰ إِذَا خَرَجُوا مِنْ عِنْدِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا ۚ أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ","latin":"waminhum man yastami'u ilayka hattaa idzaa kharajuu min 'indika qaaluu lilladziina uutuu al'ilma maatsaa qaala aanifan ulaa-ika alladziina thaba'a allaahu 'alaa quluubihim waittaba'uu ahwaa-ahum","translate":{"id":"Dan di antara mereka ada orang yang mendengarkan perkataanmu sehingga apabila mereka keluar dari sisimu orang-orang berkata kepada orang yang telah diberi ilmu pengetahuan (sahabat-sahabat Nabi): \"Apakah yang dikatakannya tadi?\" Mereka itulah orang-orang yang dikunci mati hati mereka oleh Allah dan mengikuti hawa nafsu mereka.\n","en":"Now among those [hapless sinners] are such as [pretend to] listen to thee, [O Muhammad,] and then, as soon as they leave thy presence, speak [with scorn] unto those who have understood [thy mes­sage]: “What is it that he has said just now?” It is such as these whose hearts God has sealed because they [always] followed but their own lusts"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4561","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4561.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4561.mp3"]}},{"no":17,"arab":"وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ","latin":"waalladziina ihtadaw zaadahum hudan waaataahum taqwaahum","translate":{"id":"Dan oraang-orang yang mau menerima petunjuk, Allah menambah petunjuk kepada mereka dan memberikan balasan ketaqwaannya.\n","en":"just as for those who are [willing to be] guided, He increases their [ability to follow His] guidance and causes them to grow in God-consciousness."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4562","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4562.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4562.mp3"]}},{"no":18,"arab":"فَهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً ۖ فَقَدْ جَاءَ أَشْرَاطُهَا ۚ فَأَنَّىٰ لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ","latin":"fahal yanzhuruuna illaa alssaa'ata an ta/tiyahum baghtatan faqad jaa-a asyraathuhaa fa-annaa lahum idzaa jaa-at-hum dzikraahum","translate":{"id":"Maka tidaklah yang mereka tunggu-tunggu melainkan hari kiamat (yaitu) kedatangannya kepada mereka dengan tiba-tiba, karena sesungguhnya telah datang tanda-tandanya. Maka apakah faedahnya bagi mereka kesadaran mereka itu apabila Kiamat sudah datang?\n","en":"Are, then, they [whose hearts are sealed] wait­ing for the Last Hour - [waiting] that it come upon them of a sudden? But it has already been foretold! And what will their remembrance [of their past sins] avail them, once it has come upon them?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4563","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4563.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4563.mp3"]}},{"no":19,"arab":"فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ","latin":"fai'lam annahu laa ilaaha illaa allaahu waistaghfir lidzanbika walilmu/miniina waalmu/minaati waallaahu ya'lamu mutaqallabakum wamatswaakum","translate":{"id":"Maka ketahuilah, bahwa sesungguhnya tidak ada Ilah (sesembahan, tuhan) selain Allah dan mohonlah ampunan bagi dosamu dan bagi (dosa) orang-orang mu'min, laki-laki dan perempuan. Dan Allah mengetahui tempat kamu berusaha dan tempat kamu tinggal.\n","en":"Know, then, [O man,] that there is no deity save God, and [while there is yet time,] ask forgive­ness for thy sins and for [the sins of] all other believing men and women: for God knows all your comings and goings as well as your abiding [at rest]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4564","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4564.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4564.mp3"]}},{"no":20,"arab":"وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ ۖ فَإِذَا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ ۙ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَأَوْلَىٰ لَهُمْ","latin":"wayaquulu alladziina aamanuu lawlaa nuzzilat suuratun fa-idzaa unzilat suuratun muhkamatun wadzukira fiihaa alqitaalu ra-ayta alladziina fii quluubihim maradhun yanzhuruuna ilayka nazhara almaghsyiyyi 'alayhi mina almawti fa-awlaa lahum","translate":{"id":"Dan orang-orang yang beriman berkata: \"Mengapa tiada diturunkan suatu surat?\" Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka.\n","en":"NOW THOSE who have attained to faith say, “Would that a revelation [allowing us to fight] was bestowed from on high!” But now that a revelation clear in and by itself, mentioning war, has been bestowed from on high, thou canst see those in whose hearts is disease look­ing at thee, [O Muhammad,] with the look of one who is about to faint for fear of death! And yet, far better for them would be"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4565","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4565.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4565.mp3"]}},{"no":21,"arab":"طَاعَةٌ وَقَوْلٌ مَعْرُوفٌ ۚ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ","latin":"thaa'atun waqawlun ma'ruufun fa-idzaa 'azama al-amru falaw shadaquu allaaha lakaana khayran lahum","translate":{"id":"Ta'at dan mengucapkan perkataan yang baik (adalah lebih baik bagi mereka). Apabila telah tetap perintah perang (mereka tidak menyukainya). Tetapi jikalau mereka benar (imannya) terhadap Allah, niscaya yang demikian itu lebih baik bagi mereka.\n","en":"obedience [to God’s call] and a word that could win [His] approval: for, since the matter has been resolved [by His revelation], it would be but for their own good to remain true to God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4566","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4566.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4566.mp3"]}},{"no":22,"arab":"فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ","latin":"fahal 'asaytum in tawallaytum an tufsiduu fii al-ardhi watuqaththhi'uu arhaamakum","translate":{"id":"Maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan?\n","en":"[Ask them:] “Would you, perchance, after having turned away [from God’s commandment, pre­fer to revert to your old ways, and] spread corruption on earth, and [once again] cut asunder your ties of kinship?”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4567","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4567.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4567.mp3"]}},{"no":23,"arab":"أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ","latin":"ulaa-ika alladziina la'anahumu allaahu fa-ashammahum wa-a'maa abshaarahum","translate":{"id":"Mereka itulah orang-orang yang dila'nati Allah dan ditulikan-Nya telinga mereka dan dibutakan-Nya penglihatan mereka.\n","en":"It is such as these whom God rejects, and whom He makes deaf [to the voice of truth], and whose eyes He blinds [to its sight]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4568","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4568.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4568.mp3"]}},{"no":24,"arab":"أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا","latin":"afalaa yatadabbaruuna alqur-aana am 'alaa quluubin aqfaaluhaa","translate":{"id":"Maka apakah mereka tidak memperhatikan Al Quraan ataukah hati mereka terkunci?\n","en":"Will they not, then, ponder over this Qur’an? - or are there locks upon their hearts?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4569","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4569.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4569.mp3"]}},{"no":25,"arab":"إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ","latin":"inna alladziina irtadduu 'alaa adbaarihim min ba'di maa tabayyana lahumu alhudaa alsysyaythaanu sawwala lahum wa-amlaa lahum","translate":{"id":"Sesungguhnya orang-orang yang kembali ke belakang (kepada kekafiran) sesudah petunjuk itu jelas bagi mereka, syaitan telah menjadikan mereka mudah (berbuat dosa) dan memanjangkan angan-angan mereka.\n","en":"VERILY, those who turn their backs [on this mes­sage] after guidance has been vouchsafed to them, [do it because] Satan has embellished their fancies and filled them with false hopes:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4570","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4570.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4570.mp3"]}},{"no":26,"arab":"ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ","latin":"dzaalika bi-annahum qaaluu lilladziina karihuu maa nazzala allaahu sanuthii'ukum fii ba'dhi al-amri waallaahu ya'lamu israarahum","translate":{"id":"Yang demikian itu karena sesungguhnya mereka (orang-orang munafik) itu berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah (orang-orang Yahudi): \"Kami akan mematuhi kamu dalam beberapa urusan\", sedang Allah mengetahui rahasia mereka.\n","en":"[they do turn their backs on it] inasmuch as they are wont to say unto those who abhor all that God has revealed, “We will comply with your views on some points.” But God knows their secret thoughts:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4571","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4571.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4571.mp3"]}},{"no":27,"arab":"فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ","latin":"fakayfa idzaa tawaffat-humu almalaa-ikatu yadhribuuna wujuuhahum wa-adbaarahum","translate":{"id":"Bagaimanakah (keadaan mereka) apabila malaikat mencabut nyawa mereka seraya memukul-mukul muka mereka dan punggung mereka?\n","en":"hence, how [will they fare] when the angels gather them in death, striking their faces and their backs?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4572","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4572.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4572.mp3"]}},{"no":28,"arab":"ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ","latin":"dzaalika bi-annahumu ittaba'uu maa askhatha allaaha wakarihuu ridhwaanahu fa-ahbatha a'maalahum","translate":{"id":"Yang demikian itu adalah karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan karena mereka membenci keridhaan-Nya, sebab itu Allah menghapus (pahala) amal-amal mereka.\n","en":"This, because they were wont to pursue what God con­demns and to hate [whatever would meet with] His goodly acceptance: and so He has caused all their [good] deeds to come to nought."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4573","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4573.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4573.mp3"]}},{"no":29,"arab":"أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ أَنْ لَنْ يُخْرِجَ اللَّهُ أَضْغَانَهُمْ","latin":"am hasiba alladziina fii quluubihim maradhun an lan yukhrija allaahu adhghaanahum","translate":{"id":"Atau apakah orang-orang yang ada penyakit dalam hatinya mengira bahwa Allah tidak akan menampakkan kedengkian mereka ?\n","en":"Or do they in whose hearts is disease think, perchance, that God would never bring their moral failings to light?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4574","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4574.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4574.mp3"]}},{"no":30,"arab":"وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُمْ بِسِيمَاهُمْ ۚ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ ۚ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ","latin":"walaw nasyaau la-araynaakahum fala'araftahum bisiimaahum walata'rifannahum fii lahni alqawli waallaahu ya'lamu a'maalakum","translate":{"id":"Dan kalau Kami kehendaki, niscaya Kami tunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya. Dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka dan Allah mengetahui perbuatan-perbuatan kamu.\n","en":"Now had We so willed, We could have shown them clearly to thee, so that thou wouldst know them for sure as by a visible mark: but [even so,] thou wilt most certainly recognize them by the tone of their voice. And God knows all that you do, [O men;]"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4575","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4575.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4575.mp3"]}},{"no":31,"arab":"وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ","latin":"walanabluwannakum hattaa na'lama almujaahidiina minkum waalshshaabiriina wanabluwa akhbaarakum","translate":{"id":"Dan sesungguhnya Kami benar-benar akan menguji kamu agar Kami mengetahui orang-orang yang berjihad dan bersabar di antara kamu, dan agar Kami menyatakan (baik buruknya) hal ihwalmu.\n","en":"and most certainly We shall try you all, so that We might mark out those of you who strive hard [in Our cause] and are patient in adversity: for We shall put to a test [the truth of] all your assertions."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4576","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4576.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4576.mp3"]}},{"no":32,"arab":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَنْ يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ","latin":"inna alladziina kafaruu washadduu 'an sabiili allaahi wasyaaqquu alrrasuula min ba'di maa tabayyana lahumu alhudaa lan yadhuruu allaaha syay-an wasayuhbithu a'maalahum","translate":{"id":"Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah serta memusuhi Rasul setelah petunjuk itu jelas bagi mereka, mereka tidak dapat memberi mudharat kepada Allah sedikitpun. Dan Allah akan menghapuskan (pahala) amal-amal mereka.\n","en":"Verily, they who are bent on denying the truth and on barring [others] from the path of God, and [who thus] cut themselves off from the Apostle after guidance has been vouchsafed to them, can in no wise harm God; but He will cause all their deeds to come to nought."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4577","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4577.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4577.mp3"]}},{"no":33,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ","latin":"yaa ayyuhaa alladziina aamanuu athii'uu allaaha wa-athii'uu alrrasuula walaa tubthiluu a'maalakum","translate":{"id":"Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul dan janganlah kamu merusakkan (pahala) amal-amalmu.\n","en":"O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle, and let not your [good] deeds come to nought!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4578","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4578.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4578.mp3"]}},{"no":34,"arab":"إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ","latin":"inna alladziina kafaruu washadduu 'an sabiili allaahi tsumma maatuu wahum kuffaarun falan yaghfira allaahu lahum","translate":{"id":"Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka sekali-kali Allah tidak akan memberi ampun kepada mereka.\n","en":"Verily, as for those who are bent on denying the truth and on barring [others] from the path of God, and then die as deniers of the truth - indeed, God will not grant them forgiveness!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4579","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4579.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4579.mp3"]}},{"no":35,"arab":"فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنْتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَنْ يَتِرَكُمْ أَعْمَالَكُمْ","latin":"falaa tahinuu watad'uu ilaa alssalmi wa-antumu al-a'lawna waallaahu ma'akum walan yatirakum a'maalakum","translate":{"id":"Janganlah kamu lemah dan minta damai padahal kamulah yang di atas dan Allah pun bersamamu dan Dia sekali-kali tidak akan mengurangi pahala amal-amalmu.\n","en":"AND SO, [when you fight in a just cause,] do not lose heart and [never] beg for peace: for, seeing that God is with you, you are bound to rise high [in the end]; and never will He let your [good] deeds go to waste."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4580","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4580.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4580.mp3"]}},{"no":36,"arab":"إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ","latin":"innamaa alhayaatu alddunyaa la'ibun walahwun wa-in tu/minuu watattaquu yu/tikum ujuurakum walaa yas-alkum amwaalakum","translate":{"id":"Sesungguhnya kehidupan dunia hanyalah permainan dan senda gurau. Dan jika kamu beriman dan bertakwa, Allah akan memberikan pahala keppadamu dan Dia tidak akan memint harta-hartamu.\n","en":"The life of this world is but a play and a passing delight: but if you believe [in God] and are conscious of Him, He will grant you your deserts. And withal, He does not demand of you [to sacrifice in His cause all of] your possessions:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4581","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4581.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4581.mp3"]}},{"no":37,"arab":"إِنْ يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ","latin":"in yas-alkumuuhaa fayuhfikum tabkhaluu wayukhrij adhghaanakum","translate":{"id":"Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu.\n","en":"[for,] if He were to demand of you all of them, and urge you, you would niggardly cling [to them], and so He would [but] bring out your moral failings."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4582","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4582.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4582.mp3"]}},{"no":38,"arab":"هَا أَنْتُمْ هَٰؤُلَاءِ تُدْعَوْنَ لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ فَمِنْكُمْ مَنْ يَبْخَلُ ۖ وَمَنْ يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَنْ نَفْسِهِ ۚ وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَرَاءُ ۚ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُمْ","latin":"haa antum haaulaa-i tud'awna litunfiquu fii sabiili allaahi faminkum man yabkhalu waman yabkhal fa-innamaa yabkhalu 'an nafsihi waallaahu alghaniyyu wa-antumu alfuqaraau wa-in tatawallaw yastabdil qawman ghayrakum tsumma laa yakuunuu amtsaalakum","translate":{"id":"Ingatlah, kamu ini orang-orang yang diajak untuk menafkahkan (hartamu) pada jalan Allah. Maka di antara kamu ada yang kikir, dan siapa yang kikir sesungguhnya dia hanyalah kikir terhadap dirinya sendiri. Dan Allah-lah yang Maha Kaya sedangkan kamulah orang-orang yang berkehendak (kepada-Nya); dan jika kamu berpaling niscaya Dia akan mengganti (kamu) dengan kaum yang lain; dan mereka tidak akan seperti kamu ini.\n","en":"Behold, [O believers,] it is you who are called upon to spend freely in God’s cause: but [even] among you are such as turn out to be niggardly! And yet, he who acts niggardly [in God’s cause] is but niggardly towards his own self: for God is indeed self-sufficient, whereas you stand in need [of Him]; and if you turn away [from Him], He will cause other people to take your place, and they will not be the likes of you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4583","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/4583.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/4583.mp3"]}}]}