{"alquran":{"no":5,"name":"Al-Maaida","arab":"المائدة","start":669,"count":120,"rukku":16,"type":"medina","description":"Surat Al Maa'idah terdiri dari 120 ayat; termasuk golongan surat Madaniyyah. Sekalipun ada ayatnya yang turun di Mekah, namun ayat ini diturunkan sesudah Nabi Muhammad s.a.w. hijrah ke Medinah, yaitu di waktu haji wadaa'. Surat ini dinamakan <i>Al Maa'idah</i> (hidangan) karena memuat kisah pengikut-pengikut setia Nabi Isa a.s. meminta kepada Nabi Isa a.s. agar Allah menurunkan untuk mereka Al Maa'idah (hidangan makanan) dari langit (ayat 112). Dan dinamakan <i>Al Uqud</i> (perjanjian), karena kata itu terdapat pada ayat pertama surat ini, dimana Allah menyuruh agar hamba-hamba-Nya memenuhi janji prasetia terhadap Allah dan perjanjian-perjanjian yang mereka buat sesamanya. Dinamakan juga <i>Al Munqidz</i> (yang menyelamatkan), karena akhir surat ini mengandung kisah tentang Nabi Isa a.s. penyelamat pengikut-pengikut setianya dari azab Allah."},"surah":[{"no":1,"arab":" يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ۚ أُحِلَّتْ لَكُمْ بَهِيمَةُ الْأَنْعَامِ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ غَيْرَ مُحِلِّي الصَّيْدِ وَأَنْتُمْ حُرُمٌ ۗ إِنَّ اللَّهَ يَحْكُمُ مَا يُرِيدُ","latin":"yaa ayyuhaa alladziina aamanuu awfuu bial'uquudi uhillat lakum bahiimatu al-an'aami illaa maa yutlaa 'alaykum ghayra muhillii alshshaydi wa-antum hurumun inna allaaha yahkumu maa yuriidu","translate":{"id":"Hai orang-orang yang beriman, penuhilah aqad-aqad itu . Dihalalkan bagimu binatang ternak, kecuali yang akan dibacakan kepadamu. (Yang demikian itu) dengan tidak menghalalkan berburu ketika kamu sedang mengerjakan haji. Sesungguhnya Allah menetapkan hukum-hukum menurut yang dikehendaki-Nya.\n","en":"O YOU who have attained to faith! Be true to your covenants! Lawful to you is the [flesh of every] beast that feeds on plants, save what is mentioned to you [hereinafter]: but you are not allowed to hunt while you are in the state of pilgrimage. Behold, God ordains in accordance with His will."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/670","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/670.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/670.mp3"]}},{"no":2,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحِلُّوا شَعَائِرَ اللَّهِ وَلَا الشَّهْرَ الْحَرَامَ وَلَا الْهَدْيَ وَلَا الْقَلَائِدَ وَلَا آمِّينَ الْبَيْتَ الْحَرَامَ يَبْتَغُونَ فَضْلًا مِنْ رَبِّهِمْ وَرِضْوَانًا ۚ وَإِذَا حَلَلْتُمْ فَاصْطَادُوا ۚ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ أَنْ صَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ أَنْ تَعْتَدُوا ۘ وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ ۖ وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ","latin":"yaa ayyuhaa alladziina aamanuu laa tuhilluu sya'aa-ira allaahi walaa alsysyahra alharaama walaa alhadya walaa alqalaa-ida walaa aammiina albayta alharaama yabtaghuuna fadhlan min rabbihim waridhwaanan wa-idzaa halaltum faistaaduu walaa yajrimannakum syanaaanu qawmin an shadduukum 'ani almasjidi alharaami an ta'taduu wata'aawanuu 'alaa albirri waalttaqwaa walaa ta'aawanuu 'alaa al-itsmi waal'udwaani waittaquu allaaha inna allaaha syadiidu al'iqaabi","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu melanggar syi'ar-syi'ar Allah , dan jangan melanggar kehormatan bulan-bulan haram , jangan (mengganggu) binatang-binatang had-ya , dan binatang-binatang qalaa-id , dan jangan (pula) mengganggu orang-orang yang mengunjungi Baitullah sedang mereka mencari kurnia dan keredhaan dari Tuhannya dan apabila kamu telah menyelesaikan ibadah haji, maka bolehlah berburu. Dan janganlah sekali-kali kebencian(mu) kepada sesuatu kaum karena mereka menghalang-halangi kamu dari Masjidilharam, mendorongmu berbuat aniaya (kepada mereka). Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa, dan jangan tolong-menolong dalam berbuat dosa dan pelanggaran. Dan bertakwalah kamu kepada Allah, sesungguhnya Allah amat berat siksa-Nya.\n","en":"O you who have attained to faith! Offend not against the symbols set up by God, nor against the sacred month [of pilgrimage], nor against the garlanded offerings, nor against those who flock to the Inviolable Temple, seeking favour with their Sustainer and His goodly acceptance; and [only] after your pilgrimage is over are you free to hunt. And never let your hatred of people who would bar you from the Inviolable House of Worship lead you into the sin of aggression: but rather help one another in furthering virtue and God-consciousness, and do not help one another in furthering evil and enmity; and remain conscious of God: for, behold, God is severe in retribution!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/671","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/671.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/671.mp3"]}},{"no":3,"arab":"حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ وَمَا أَكَلَ السَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى النُّصُبِ وَأَنْ تَسْتَقْسِمُوا بِالْأَزْلَامِ ۚ ذَٰلِكُمْ فِسْقٌ ۗ الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِنْ دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"hurrimat 'alaykumu almaytatu waalddamu walahmu alkhinziiri wamaa uhilla lighayri allaahi bihi waalmunkhaniqatu waalmawquudzatu waalmutaraddiyatu waalnnathiihatu wamaa akala alssabu'u illaa maa tsakkaytum wamaa dzubiha 'alaa alnnushubi wa-an tastaqsimuu bial-azlaami dzaalikum fisqun alyawma ya-isa alladziina kafaruu min diinikum falaa takhsyawhum waikhsyawni alyawma akmaltu lakum diinakum wa-atmamtu 'alaykum ni'matii waradhiitu lakumu al-islaama diinan famani idthurra fii makhmashatin ghayra mutajaanifin li-itsmin fa-inna allaaha ghafuurun rahiimun","translate":{"id":"Diharamkan bagimu (memakan) bangkai, darah , daging babi, (daging hewan) yang disembelih atas nama selain Allah, yang tercekik, yang terpukul, yang jatuh, yang ditanduk, dan diterkam binatang buas, kecuali yang sempat kamu menyembelihnya , dan (diharamkan bagimu) yang disembelih untuk berhala. Dan (diharamkan juga) mengundi nasib dengan anak panah , (mengundi nasib dengan anak panah itu) adalah kefasikan. Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu ni'mat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"FORBIDDEN to you is carrion, and blood, and the flesh of swine, and that over which any name other than God's has been invoked, and the animal that has been strangled, or beaten to death, or killed by a fall, or gored to death, or savaged by a beast of prey, save that which you [yourselves] may have slaughtered while it was still alive; and [forbidden to you is] all that has been slaughtered on idolatrous altars. And [you are forbidden] to seek to learn through divination what the future may hold in store for you: this is sinful conduct. Today, those who are bent on denying the truth have lost all hope of [your ever forsaking] your religion: do not, then, hold them in awe, but stand in awe of Me! Today have I perfected your religious law for you, and have bestowed upon you the full measure of My blessings, and willed that self-surrender unto Me shall be your religion. As for him, however, who is driven [to what is forbidden] by dire necessity and not by an inclination to sinning -behold, God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/672","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/672.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/672.mp3"]}},{"no":4,"arab":"يَسْأَلُونَكَ مَاذَا أُحِلَّ لَهُمْ ۖ قُلْ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۙ وَمَا عَلَّمْتُمْ مِنَ الْجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ اللَّهُ ۖ فَكُلُوا مِمَّا أَمْسَكْنَ عَلَيْكُمْ وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ","latin":"yas-aluunaka maatsaa uhilla lahum qul uhilla lakumu alththhayyibaatu wamaa 'allamtum mina aljawaarihi mukallibiina tu'allimuunahunna mimmaa 'allamakumu allaahu fakuluu mimmaa amsakna 'alaykum waudzkuruu isma allaahi 'alayhi waittaquu allaaha inna allaaha sarii'u alhisaabi","translate":{"id":"Mereka menanyakan kepadamu: \"Apakah yang dihalalkan bagi mereka?\". Katakanlah: \"Dihalalkan bagimu yang baik-baik dan (buruan yang ditangkap) oleh binatang buas yang telah kamu ajar dengan melatih nya untuk berburu; kamu mengajarnya menurut apa yang telah diajarkan Allah kepadamu . Maka makanlah dari apa yang ditangkapnya untukmu , dan sebutlah nama Allah atas binatang buas itu (waktu melepaskannya) . Dan bertakwalah kepada Allah, sesungguhnya Allah amat cepat hisab-Nya.\n","en":"They will ask thee as to what is lawful to them. Say: \"Lawful to you are all the good things of life.\" And as for those hunting animals which you train by imparting to them something of the knowledge that God has imparted to yourselves-eat of what they seize for you, but mention God's name over it. and remain conscious of God: verily, God is swift in reckoning."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/673","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/673.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/673.mp3"]}},{"no":5,"arab":"الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۖ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ ۖ وَالْمُحْصَنَاتُ مِنَ الْمُؤْمِنَاتِ وَالْمُحْصَنَاتُ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلَا مُتَّخِذِي أَخْدَانٍ ۗ وَمَنْ يَكْفُرْ بِالْإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ","latin":"alyawma uhilla lakumu alththhayyibaatu watha'aamu alladziina uutuu alkitaaba hillun lakum watha'aamukum hillun lahum waalmuhsanaatu mina almu/minaati waalmuhsanaatu mina alladziina uutuu alkitaaba min qablikum idzaa aataytumuuhunna ujuurahunna muhsiniina ghayra musaafihiina walaa muttakhidzii akhdaanin waman yakfur bial-iimaani faqad habitha 'amaluhu wahuwa fii al-aakhirati mina alkhaasiriina","translate":{"id":"Pada hari ini dihalalkan bagimu yang baik-baik. Makanan (sembelihan) orang-orang yang diberi Al Kitab itu halal bagimu, dan makanan kamu halal (pula) bagi mereka. (Dan dihalalkan mangawini) wanita yang menjaga kehormatan diantara wanita-wanita yang beriman dan wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al Kitab sebelum kamu, bila kamu telah membayar mas kawin mereka dengan maksud menikahinya, tidak dengan maksud berzina dan tidak (pula) menjadikannya gundik-gundik. Barangsiapa yang kafir sesudah beriman (tidak menerima hukum-hukum Islam) maka hapuslah amalannya dan ia di hari kiamat termasuk orang-orang merugi.\n","en":"Today, all the good things of life have been made lawful to you. And the food of those who have been vouchsafed revelation aforetime is lawful to you, and your food is lawful to them. And [lawful to you are], in wedlock, women from among those who believe [in this divine writ], and, in wedlock, women from among those who have been vouchsafed revelation before your time -provided that you give them their dowers, taking them in honest wedlock, not in fornication, nor as secret love-companions. But as for him who rejects belief [in God] - in vain will be all his works: for in the life to come he shall be among the lost."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/674","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/674.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/674.mp3"]}},{"no":6,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِنْ كُنْتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِنْ كُنْتُمْ مَرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ مِنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَٰكِنْ يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ","latin":"yaa ayyuhaa alladziina aamanuu idzaa qumtum ilaa alshshalaati faighsiluu wujuuhakum wa-aydiyakum ilaa almaraafiqi waimsahuu biruuusikum wa-arjulakum ilaa alka'bayni wa-in kuntum junuban faiththhahharuu wa-in kuntum mardaa aw 'alaa safarin aw jaa-a ahadun minkum mina alghaa-ithi aw laamastumu alnnisaa-a falam tajiduu maa-an fatayammamuu sha'iidan thayyiban faimsahuu biwujuuhikum wa-aydiikum minhu maa yuriidu allaahu liyaj'ala 'alaykum min harajin walaakin yuriidu liyuthahhirakum waliyutimma ni'matahu 'alaykum la'allakum tasykuruuna","translate":{"id":"Hai orang-orang yang beriman, apabila kamu hendak mengerjakan shalat, maka basuhlah mukamu dan tanganmu sampai dengan siku, dan sapulah kepalamu dan (basuh) kakimu sampai dengan kedua mata kaki, dan jika kamu junub maka mandilah, dan jika kamu sakit atau dalam perjalanan atau kembali dari tempat buang air (kakus) atau menyentuh perempuan, lalu kamu tidak memperoleh air, maka bertayammumlah dengan tanah yang baik (bersih); sapulah mukamu dan tanganmu dengan tanah itu. Allah tidak hendak menyulitkan kamu, tetapi Dia hendak membersihkan kamu dan menyempurnakan ni'mat-Nya bagimu, supaya kamu bersyukur.\n","en":"O YOU who have attained to faith! When you are about to pray, wash your face, and your hands and arms up to the elbows, and pass your [wet] hands lightly over your head, and [wash] your feet up to the ankles. And if you are in a state. requiring total ablution, purify yourselves. But if you are ill, or are travelling, or have just satisfied a want of nature, or have cohabited with a woman, and can find no water-then take resort to pure dust, passing therewith lightly over your face and your hands. God does not want to impose any hardship on you, but wants to make you pure, and to bestow upon you the full measure of His blessings, so that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/675","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/675.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/675.mp3"]}},{"no":7,"arab":"وَاذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ وَمِيثَاقَهُ الَّذِي وَاثَقَكُمْ بِهِ إِذْ قُلْتُمْ سَمِعْنَا وَأَطَعْنَا ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"waudzkuruu ni'mata allaahi 'alaykum wamiitsaaqahu alladzii waatsaqakum bihi idz qultum sami'naa wa-atha'naa waittaquu allaaha inna allaaha 'aliimun bidzaati alshshuduuri","translate":{"id":"Dan ingatlah karunia Allah kepadamu dan perjanjian-Nya yang telah diikat-Nya dengan kamu, ketika kamu mengatakan: \"Kami dengar dan kami ta'ati\". Dan bertakwalah kepada Allah, sesungguhnya Allah Mengetahui isi hati(mu).\n","en":"And [always] remember the blessings which God has bestowed upon you, and the solemn pledge by which He bound you to Himself when you said, \"We have heard, and we pay heed.\" Hence, remain conscious of God: verily, God has full knowledge of what is in the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/676","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/676.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/676.mp3"]}},{"no":8,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ","latin":"yaa ayyuhaa alladziina aamanuu kuunuu qawwaamiina lillaahi syuhadaa-a bialqisthi walaa yajrimannakum syanaaanu qawmin 'alaa allaa ta'diluu i'diluu huwa aqrabu lilttaqwaa waittaquu allaaha inna allaaha khabiirun bimaa ta'maluuna","translate":{"id":"Hai orang-orang yang beriman hendaklah kamu jadi orang-orang yang selalu menegakkan (kebenaran) karena Allah, menjadi saksi dengan adil. Dan janganlah sekali-kali kebencianmu terhadap sesuatu kaum, mendorong kamu untuk berlaku tidak adil. Berlaku adillah, karena adil itu lebih dekat kepada takwa. Dan bertakwalah kepada Allah, sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"O YOU who have attained to faith! Be ever steadfast in your devotion to God, bearing witness to the truth in all equity; and never let hatred of any-one lead you into the sin of deviating from justice. Be just: this is closest to being God-conscious. And remain conscious of God: verily, God is aware of all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/677","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/677.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/677.mp3"]}},{"no":9,"arab":"وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۙ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ","latin":"wa'ada allaahu alladziina aamanuu wa'amiluu alshshaalihaati lahum maghfiratun wa-ajrun 'azhiimun","translate":{"id":"Allah telah menjanjikan kepada orang-orang yang beriman dan yang beramal saleh, (bahwa) untuk mereka ampunan dan pahala yang besar.\n","en":"God has promised unto those who attain to faith and do good works [that] theirs shall be forgiveness of sins, and a mighty reward;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/678","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/678.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/678.mp3"]}},{"no":10,"arab":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ","latin":"waalladziina kafaruu wakadzdzabuu bi-aayaatinaa ulaa-ika ash-haabu aljahiimi","translate":{"id":"Adapun orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itu adalah penghuni neraka.\n","en":"whereas they who are bent on denying the truth and giving the lie to Our messages-they are destined for the blazing fire."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/679","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/679.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/679.mp3"]}},{"no":11,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَنْ يَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ فَكَفَّ أَيْدِيَهُمْ عَنْكُمْ ۖ وَاتَّقُوا اللَّهَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","latin":"yaa ayyuhaa alladziina aamanuu udzkuruu ni'mata allaahi 'alaykum idz hamma qawmun an yabsuthuu ilaykum aydiyahum fakaffa aydiyahum 'ankum waittaquu allaaha wa'alaa allaahi falyatawakkali almu/minuuna","translate":{"id":"Hai orang-orang yang beriman, ingatlah kamu akan ni'mat Allah (yang diberikan-Nya) kepadamu, di waktu suatu kaum bermaksud hendak menggerakkan tangannya kepadamu (untuk berbuat jahat), maka Allah menahan tangan mereka dari kamu. Dan bertakwalah kepada Allah, dan hanya kepada Allah sajalah orang-orang mu'min itu harus bertawakkal.\n","en":"O you who have attained to faith! Remember the blessings which God bestowed upon you when [hostile] people were about to lay hands on you and He stayed their hands from you. Remain, then, conscious of God: and in God let the believers place their trust."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/680","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/680.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/680.mp3"]}},{"no":12,"arab":"وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي إِسْرَائِيلَ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا ۖ وَقَالَ اللَّهُ إِنِّي مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ الصَّلَاةَ وَآتَيْتُمُ الزَّكَاةَ وَآمَنْتُمْ بِرُسُلِي وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ اللَّهَ قَرْضًا حَسَنًا لَأُكَفِّرَنَّ عَنْكُمْ سَيِّئَاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ فَمَنْ كَفَرَ بَعْدَ ذَٰلِكَ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ","latin":"walaqad akhadza allaahu miitsaaqa banii israa-iila waba'atsnaa minhumu itsnay 'asyara naqiiban waqaala allaahu innii ma'akum la-in aqamtumu alshshalaata waaataytumu alzzakaata waaamantum birusulii wa'azzartumuuhum wa-aqradhtumu allaaha qardhan hasanan laukaffiranna 'ankum sayyi-aatikum walaudkhilannakum jannaatin tajrii min tahtihaa al-anhaaru faman kafara ba'da dzaalika minkum faqad dhalla sawaa-a alssabiili","translate":{"id":"Dan sesungguhnya Allah telah mengambil perjanjian (dari) Bani Israil dan telah Kami angkat diantara mereka 12 orang pemimpin dan Allah berfirman: \"Sesungguhnya Aku beserta kamu, sesungguhnya jika kamu mendirikan shalat dan menunaikan zakat serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka dan kamu pinjamkan kepada Allah pinjaman yang baik sesungguhnya Aku akan menutupi dosa-dosamu. Dan sesungguhnya kamu akan Kumasukkan ke dalam surga yang mengalir air didalamnya sungai-sungai. Maka barangsiapa yang kafir di antaramu sesudah itu, sesungguhnya ia telah tersesat dari jalan yang lurus.\n","en":"AND, INDEED, God accepted a [similar] solemn pledge from the children of Israel when We caused twelve of their leaders to be sent [to Canaan as spies]. And God said: \"Behold, I shall be with you! If you are constant in prayer, and spend in charity, and believe in My apostles and aid them, and offer up unto God a goodly loan, I will surely efface your bad deeds and bring you into gardens through which running waters flow. But he from among you who, after this, denies the truth, will indeed have strayed from the right path!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/681","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/681.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/681.mp3"]}},{"no":13,"arab":"فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ لَعَنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ۖ يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ ۙ وَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ ۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَائِنَةٍ مِنْهُمْ إِلَّا قَلِيلًا مِنْهُمْ ۖ فَاعْفُ عَنْهُمْ وَاصْفَحْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ","latin":"fabimaa naqdhihim miitsaaqahum la'annaahum waja'alnaa quluubahum qaasiyatan yuharrifuuna alkalima 'an mawaadi'ihi wanasuu hazhzhan mimmaa dzukkiruu bihi walaa tazaalu taththhali'u 'alaa khaa-inatin minhum illaa qaliilan minhum fau'fu 'anhum waishfah inna allaaha yuhibbu almuhsiniina","translate":{"id":"(Tetapi) karena mereka melanggar janjinya, Kami kutuki mereka, dan Kami jadikan hati mereka keras membatu. Mereka suka merobah perkataan (Allah) dari tempat-tempatnya , dan mereka (sengaja) melupakan sebagian dari apa yang mereka telah diperingatkan dengannya, dan kamu (Muhammad) senantiasa akan melihat kekhianatan dari mereka kecuali sedikit diantara mereka (yang tidak berkhianat), maka maafkanlah mereka dan biarkan mereka, sesungguhnya Allah menyukai orang-orang yang berbuat baik.\n","en":"Then, for having broken their solemn pledge, We rejected them and caused their hearts to harden-[so that now] they distort the meaning of the [re-vealed] words, taking them out of their context; and they have forgotten much of what they had been told to bear in mind; and from all but a few of them thou wilt always experience treachery. But pardon them, and forbear: verily, God loves the doers of good."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/682","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/682.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/682.mp3"]}},{"no":14,"arab":"وَمِنَ الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ أَخَذْنَا مِيثَاقَهُمْ فَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ فَأَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَىٰ يَوْمِ الْقِيَامَةِ ۚ وَسَوْفَ يُنَبِّئُهُمُ اللَّهُ بِمَا كَانُوا يَصْنَعُونَ","latin":"wamina alladziina qaaluu innaa nashaaraa akhadznaa miitsaaqahum fanasuu hazhzhan mimmaa dzukkiruu bihi fa-aghraynaa baynahumu al'adaawata waalbaghdhaa-a ilaa yawmi alqiyaamati wasawfa yunabbi-uhumu allaahu bimaa kaanuu yashna'uuna","translate":{"id":"Dan diantara orang-orang yang mengatakan: \"Sesungguhnya kami ini orang-orang Nasrani\", ada yang telah kami ambil perjanjian mereka, tetapi mereka (sengaja) melupakan sebagian dari apa yang mereka telah diberi peringatan dengannya; maka Kami timbulkan di antara mereka permusuhan dan kebencian sampai hari kiamat. Dan kelak Allah akan memberitakan kepada mereka apa yang mereka kerjakan.\n","en":"And [likewise,] from those who say, \"Behold, we are Christians.\" We have accepted a solemn pledge: and they, too, have forgotten much of what they had been told to bear in mind - wherefore We have given rise among them to enmity and hatred, [to last] until Resurrection Day: and in time God will cause them to understand what they have contrived."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/683","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/683.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/683.mp3"]}},{"no":15,"arab":"يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِمَّا كُنْتُمْ تُخْفُونَ مِنَ الْكِتَابِ وَيَعْفُو عَنْ كَثِيرٍ ۚ قَدْ جَاءَكُمْ مِنَ اللَّهِ نُورٌ وَكِتَابٌ مُبِينٌ","latin":"yaa ahla alkitaabi qad jaa-akum rasuulunaa yubayyinu lakum katsiiran mimmaa kuntum tukhfuuna mina alkitaabi waya'fuu 'an katsiirin qad jaa-akum mina allaahi nuurun wakitaabun mubiinun","translate":{"id":"Hai Ahli Kitab, sesungguhnya telah datang kepadamu Rasul Kami, menjelaskan kepadamu banyak dari isi Al Kitab yang kamu sembunyi kan, dan banyak (pula yang) dibiarkannya. Sesungguhnya telah datang kepadamu cahaya dari Allah, dan Kitab yang menerangkan .\n","en":"O followers of the Bible! Now there has come unto you Our Apostle, to make clear unto you much of what you have been concealing [from yourselves) of the Bible, and to pardon much. Now there has come unto you from God a light, and a clear divine writ,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/684","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/684.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/684.mp3"]}},{"no":16,"arab":"يَهْدِي بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِهِ وَيَهْدِيهِمْ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"yahdii bihi allaahu mani ittaba'a ridhwaanahu subula alssalaami wayukhrijuhum mina alzhzhulumaati ilaa alnnuuri bi-idznihi wayahdiihim ilaa shiraathin mustaqiimin","translate":{"id":"Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keredhaan-Nya ke jalan keselamatan, dan (dengan kitab itu pula) Allah mengeluarkan orang-orang itu dari gelap gulita kepada cahaya yang terang benderang dengan seizin-Nya, dan menunjuki mereka ke jalan yang lurus.\n","en":"through which God shows unto all that seek His goodly acceptance the paths leading to salvation and, by His grace, brings them out of the depths of darkness into the light and guides them onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/685","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/685.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/685.mp3"]}},{"no":17,"arab":"لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۚ قُلْ فَمَنْ يَمْلِكُ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ أَنْ يُهْلِكَ الْمَسِيحَ ابْنَ مَرْيَمَ وَأُمَّهُ وَمَنْ فِي الْأَرْضِ جَمِيعًا ۗ وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۚ يَخْلُقُ مَا يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"laqad kafara alladziina qaaluu inna allaaha huwa almasiihu ibnu maryama qul faman yamliku mina allaahi syay-an in araada an yuhlika almasiiha ibna maryama waummahu waman fii al-ardhi jamii'an walillaahi mulku alssamaawaati waal-ardhi wamaa baynahumaa yakhluqu maa yasyaau waallaahu 'alaa kulli syay-in qadiirun","translate":{"id":"Sesungguhnya telah kafirlah orang-orang yang berkata: \"Sesungguhnya Allah itu ialah Al Masih putera Maryam\". Katakanlah: \"Maka siapakah (gerangan) yang dapat menghalang-halangi kehendak Allah, jika Dia hendak membinasakan Al Masih putera Maryam itu beserta ibunya dan seluruh orang-orang yang berada di bumi kesemuanya?\". Kepunyaan Allahlah kerajaan langit dan bumi dan apa yang ada diantara keduanya; Dia menciptakan apa yang dikehendaki-Nya. Dan Allah Maha Kuasa atas segala sesuatu.\n","en":"Indeed, the truth deny they who say, \"Behold, God is the Christ, son of Mary.\" Say: \"And who could have prevailed with God in any way had it been His will to destroy the Christ, son of Mary, and his mother, and everyone who is on earth-all of them? For, God's is the dominion over the heavens and the earth and all that is between them; He creates what He wills: and God has the power to will anything!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/686","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/686.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/686.mp3"]}},{"no":18,"arab":"وَقَالَتِ الْيَهُودُ وَالنَّصَارَىٰ نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ ۚ قُلْ فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ ۖ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ ۚ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۚ وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ وَإِلَيْهِ الْمَصِيرُ","latin":"waqaalati alyahuudu waalnnashaaraa nahnu abnaau allaahi wa-ahibbaauhu qul falima yu'adzdzibukum bidzunuubikum bal antum basyarun mimman khalaqa yaghfiru liman yasyaau wayu'adzdzibu man yasyaau walillaahi mulku alssamaawaati waal-ardhi wamaa baynahumaa wa-ilayhi almashiiru","translate":{"id":"Orang-orang Yahudi dan Nasrani mengatakan: \"Kami ini adalah anak-anak Allah dan kekasih-kekasih-Nya\". Katakanlah: \"Maka mengapa Allah menyiksa kamu karena dosa-dosamu?\" (Kamu bukanlah anak-anak Allah dan kekasih-kekasih-Nya), tetapi kamu adalah manusia(biasa) diantara orang-orang yang diciptakan-Nya dan menyiksa siapa yang dikehendaki-Nya dan menyiksa siapa yang dikehendaki-Nya. Dan Kepunyaan Allah-lah kerajaan antara keduanya. Dan kepada Allah-lah kembali (segala sesuatu).\n","en":"And [both] the Jews and the Christians say, \"We are God's children, and His beloved ones.\" Say: \"Why, then, does He cause you to suffer for your sins? Nay, you are but human beings of His creating. He forgives whom He wills, and He causes to suffer whom He wills: for God's is the dominion over the heavens and the earth and all that is between them, and with Him is all journeys' end.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/687","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/687.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/687.mp3"]}},{"no":19,"arab":"يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ عَلَىٰ فَتْرَةٍ مِنَ الرُّسُلِ أَنْ تَقُولُوا مَا جَاءَنَا مِنْ بَشِيرٍ وَلَا نَذِيرٍ ۖ فَقَدْ جَاءَكُمْ بَشِيرٌ وَنَذِيرٌ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"yaa ahla alkitaabi qad jaa-akum rasuulunaa yubayyinu lakum 'alaa fatratin mina alrrusuli an taquuluu maa jaa-anaa min basyiirin walaa nadziirin faqad jaa-akum basyiirun wanadziirun waallaahu 'alaa kulli syay-in qadiirun","translate":{"id":"Hai Ahli Kitab, sesungguhnya telah datang kepada kamu Rasul Kami, menjelaskan (syari'at Kami) kepadamu ketika terputus (pengiriman) rasul-rasul agar kamu tidak mengatakan: \"Tidak ada datang kepada kami baik seorang pembawa berita gembira maupun seorang pemberi peringatan\". Sesungguhnya telah datang kepadamu pembawa berita gembira dan pemberi peringatan. Allah Maha Kuasa atas segala sesuatu.\n","en":"O followers of the Bible! Now, after a long time during which no apostles have appeared, there has come unto you [this] Our Apostle to make [the truth] clear to you, lest you say, \"No bearer of glad tidings has come unto us, nor any warner \": for now there has come unto you a bearer of glad tidings and a warner -since God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/688","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/688.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/688.mp3"]}},{"no":20,"arab":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَعَلَ فِيكُمْ أَنْبِيَاءَ وَجَعَلَكُمْ مُلُوكًا وَآتَاكُمْ مَا لَمْ يُؤْتِ أَحَدًا مِنَ الْعَالَمِينَ","latin":"wa-idz qaala muusaa liqawmihi yaa qawmi udzkuruu ni'mata allaahi 'alaykum idz ja'ala fiikum anbiyaa-a waja'alakum muluukan waaataakum maa lam yu/ti ahadan mina al'aalamiina","translate":{"id":"Dan (ingatlah) ketika Musa berkata kepada kaumnya: \"Hai kaumku, ingatlah ni'mat Allah atasmu ketika Dia mengangkat nabi nabi diantaramu, dan dijadikan-Nya kamu orang-orang merdeka, dan diberikan-Nya kepadamu apa yang belum pernah diberikan-Nya kepada seorangpun diantara umat-umat yang lain\".\n","en":"AND, LO, Moses said unto his people:\" O my people! Remember the blessings which God bestowed upon you when he raised up prophets among you, and made you your own masters, and granted unto you [favours] such as He had not granted to anyone else in the world."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/689","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/689.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/689.mp3"]}},{"no":21,"arab":"يَا قَوْمِ ادْخُلُوا الْأَرْضَ الْمُقَدَّسَةَ الَّتِي كَتَبَ اللَّهُ لَكُمْ وَلَا تَرْتَدُّوا عَلَىٰ أَدْبَارِكُمْ فَتَنْقَلِبُوا خَاسِرِينَ","latin":"yaa qawmi udkhuluu al-ardha almuqaddasata allatii kataba allaahu lakum walaa tartadduu 'alaa adbaarikum fatanqalibuu khaasiriina","translate":{"id":"Hai kaumku, masuklah ke tanah suci (Palestina) yang telah ditentukan Allah bagimu , dan janganlah kamu lari kebelakang (karena takut kepada musuh), maka kamu menjadi orang-orang yang merugi.\n","en":"O my people! Enter the holy land which God has promised you; but do not turn back [on your faith], for then you will be lost!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/690","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/690.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/690.mp3"]}},{"no":22,"arab":"قَالُوا يَا مُوسَىٰ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَنْ نَدْخُلَهَا حَتَّىٰ يَخْرُجُوا مِنْهَا فَإِنْ يَخْرُجُوا مِنْهَا فَإِنَّا دَاخِلُونَ","latin":"qaaluu yaa muusaa inna fiihaa qawman jabbaariina wa-innaa lan nadkhulahaa hattaa yakhrujuu minhaa fa-in yakhrujuu minhaa fa-innaa daakhiluuna","translate":{"id":"Mereka berkata: \"Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang gagah perkasa, sesungguhnya kami sekali-kali tidak akan memasukinya sebelum mereka ke luar daripadanya. Jika mereka ke luar daripadanya, pasti kami akan memasukinya\".\n","en":"They answered: \"O Moses! Behold, ferocious people -dwell in that land, and we will surely not enter it unless they depart therefrom; but if they depart therefrom, then, behold, we will enter it.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/691","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/691.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/691.mp3"]}},{"no":23,"arab":"قَالَ رَجُلَانِ مِنَ الَّذِينَ يَخَافُونَ أَنْعَمَ اللَّهُ عَلَيْهِمَا ادْخُلُوا عَلَيْهِمُ الْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ ۚ وَعَلَى اللَّهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ","latin":"qaala rajulaani mina alladziina yakhaafuuna an'ama allaahu 'alayhimaa udkhuluu 'alayhimu albaaba fa-idzaa dakhaltumuuhu fa-innakum ghaalibuuna wa'alaa allaahi fatawakkaluu in kuntum mu/miniina","translate":{"id":"Berkatalah dua orang diantara orang-orang yang takut (kepada Allah) yang Allah telah memberi ni'mat atas keduanya: \"Serbulah mereka dengan melalui pintu gerbang (kota) itu, maka bila kamu memasukinya niscaya kamu akan menang. Dan hanya kepada Allah hendaknya kamu bertawakkal, jika kamu benar-benar orang yang beriman\".\n","en":"[Whereupon] two men from among those who feared [God, and] whom God had blessed, said: \"Enter upon them through the gate' -for as soon as you enter it, behold, you shall be victorious! And in God you must place your trust if you are [truly] believers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/692","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/692.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/692.mp3"]}},{"no":24,"arab":"قَالُوا يَا مُوسَىٰ إِنَّا لَنْ نَدْخُلَهَا أَبَدًا مَا دَامُوا فِيهَا ۖ فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ","latin":"qaaluu yaa muusaa innaa lan nadkhulahaa abadan maa daamuu fiihaa fa-idzhab anta warabbuka faqaatilaa innaa haahunaa qaa'iduuna","translate":{"id":"Mereka berkata: \"Hai Musa, kami sekali sekali tidak akan memasuki nya selama-lamanya, selagi mereka ada didalamnya, karena itu pergilah kamu bersama Tuhanmu, dan berperanglah kamu berdua, sesungguhnya kami hanya duduk menanti disini saja\".\n","en":"[But] they said: \"O Moses! Behold, never shall we enter that [land] so long as those others are in it. Go forth, then, thou and thy Sustainer, and fight, both of you! We, behold, shall remain here!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/693","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/693.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/693.mp3"]}},{"no":25,"arab":"قَالَ رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي ۖ فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ","latin":"qaala rabbi innii laa amliku illaa nafsii wa-akhii faufruq baynanaa wabayna alqawmi alfaasiqiina","translate":{"id":"Berkata Musa: \"Ya Tuhanku, aku tidak menguasai kecuali diriku sendiri dan saudaraku. Sebab itu pisahkanlah antara kami dengan orang-orang yang fasik itu\".\n","en":"Prayed [Moses]: \"O my Sustainer! Of none am I master but of myself and my brother [Aaron]: draw Thou, then, a dividing-line between us and these iniquitous folk!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/694","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/694.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/694.mp3"]}},{"no":26,"arab":"قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ ۛ أَرْبَعِينَ سَنَةً ۛ يَتِيهُونَ فِي الْأَرْضِ ۚ فَلَا تَأْسَ عَلَى الْقَوْمِ الْفَاسِقِينَ","latin":"qaala fa-innahaa muharramatun 'alayhim arba'iina sanatan yatiihuuna fii al-ardhi falaa ta/sa 'alaa alqawmi alfaasiqiina","translate":{"id":"Allah berfirman: \"(Jika demikian), maka sesungguhnya negeri itu diharamkan atas mereka selama empat puluh tahun, (selama itu) mereka akan berputar-putar kebingungan di bumi (padang Tiih) itu. Maka janganlah kamu bersedih hati (memikirkan nasib) orang-orang yang fasik itu.\"\n","en":"Answered He: \"Then, verily, this [land] shall be forbidden to them for forty years, while they wander on earth, bewildered, to and fro; and sorrow thou not over these iniquitous folk.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/695","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/695.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/695.mp3"]}},{"no":27,"arab":"وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْآخَرِ قَالَ لَأَقْتُلَنَّكَ ۖ قَالَ إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ","latin":"wautlu 'alayhim naba-a ibnay aadama bialhaqqi idz qarrabaa qurbaanan fatuqubbila min ahadihimaa walam yutaqabbal mina al-aakhari qaala la-aqtulannaka qaala innamaa yataqabbalu allaahu mina almuttaqiina","translate":{"id":"Ceritakanlah kepada mereka kisah kedua putera Adam (Habil dan Qabil) menurut yang sebenarnya, ketika keduanya mempersembahkan korban, maka diterima dari salah seorang dari mereka berdua (Habil) dan tidak diterima dari yang lain (Qabil). Ia berkata (Qabil): \"Aku pasti membunuhmu!\". Berkata Habil: \"Sesungguhnya Allah hanya menerima (korban) dari orang-orang yang bertakwa\".\n","en":"AND CONVEY unto them, setting forth the truth, the story of the two sons of Adam -how each offered a sacrifice, and it was accepted from one of them whereas it was not accepted from the other. [And Cain] said: \"I will surely slay thee!\" [Abel] replied: \"Behold, God accepts only from those who are conscious of Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/696","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/696.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/696.mp3"]}},{"no":28,"arab":"لَئِنْ بَسَطْتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ ۖ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ","latin":"la-in basathta ilayya yadaka litaqtulanii maa anaa bibaasithin yadiya ilayka li-aqtulaka innii akhaafu allaaha rabba al'aalamiina","translate":{"id":"\"Sungguh kalau kamu menggerakkan tanganmu kepadaku untuk membunuhku, aku sekali-kali tidak akan menggerakkan tanganku kepadamu untuk membunuhmu. Sesungguhnya aku takut kepada Allah, Tuhan seru sekalian alam.\"\n","en":"Even if thou lay thy hand on me to slay me, I shall not lay my hand on thee to slay thee: behold, I fear God, the Sustainer of all the worlds."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/697","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/697.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/697.mp3"]}},{"no":29,"arab":"إِنِّي أُرِيدُ أَنْ تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ","latin":"innii uriidu an tabuu-a bi-itsmii wa-itsmika fatakuuna min ash-haabi alnnaari wadzaalika jazaau alzhzhaalimiina","translate":{"id":"\"Sesungguhnya aku ingin agar kamu kembali dengan (membawa) dosa (membunuh)ku dan dosamu sendiri, maka kamu akan menjadi penghuni neraka, dan yang demikian itulah pembalasan bagi orang-orang yang zalim.\"\n","en":"I am willing, indeed, for thee to bear [the burden of] all the sins ever done by me as well as of the sin done by thee: [but] then thou wouldst be destined for the fire, since that is the requital of evildoers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/698","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/698.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/698.mp3"]}},{"no":30,"arab":"فَطَوَّعَتْ لَهُ نَفْسُهُ قَتْلَ أَخِيهِ فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ","latin":"fathawwa'at lahu nafsuhu qatla akhiihi faqatalahu fa-ashbaha mina alkhaasiriina","translate":{"id":"Maka hawa nafsu Qabil menjadikannya menganggap mudah membunuh saudaranya, sebab itu dibunuhnyalah, maka jadilah ia seorang diantara orang-orang yang merugi.\n","en":"But the other's passion drove him to slaying his brother; and he slew him: and thus he became one of the lost."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/699","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/699.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/699.mp3"]}},{"no":31,"arab":"فَبَعَثَ اللَّهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ ۚ قَالَ يَا وَيْلَتَا أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي ۖ فَأَصْبَحَ مِنَ النَّادِمِينَ","latin":"faba'atsa allaahu ghuraaban yabhatsu fii al-ardhi liyuriyahu kayfa yuwaarii saw-ata akhiihi qaala yaa waylataa a'ajaztu an akuuna mitsla haadzaa alghuraabi fauwaariya saw-ata akhii fa-ashbaha mina alnnaadimiina","translate":{"id":"Kemudian Allah menyuruh seekor burung gagak menggali-gali di bumi untuk memperlihatkan kepadanya (Qabil) bagaimana seharusnya menguburkan mayat saudaranya . Berkata Qabil: \"Aduhai celaka aku, mengapa aku tidak mampu berbuat seperti burung gagak ini, lalu aku dapat menguburkan mayat saudaraku ini?\" Karena itu jadilah dia seorang diantara orang-orang yang menyesal.\n","en":"Thereupon God sent forth a raven which scratched the earth, to show him how he might conceal the nakedness of his brother's body. [And Cain] cried out: \"Oh, woe is me! Am I then too weak to do what this raven did, and to conceal the nakedness of my brother's body?\" - and was thereupon smitten with remorse."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/700","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/700.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/700.mp3"]}},{"no":32,"arab":"مِنْ أَجْلِ ذَٰلِكَ كَتَبْنَا عَلَىٰ بَنِي إِسْرَائِيلَ أَنَّهُ مَنْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ فِي الْأَرْضِ فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا وَمَنْ أَحْيَاهَا فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا ۚ وَلَقَدْ جَاءَتْهُمْ رُسُلُنَا بِالْبَيِّنَاتِ ثُمَّ إِنَّ كَثِيرًا مِنْهُمْ بَعْدَ ذَٰلِكَ فِي الْأَرْضِ لَمُسْرِفُونَ","latin":"min ajli dzaalika katabnaa 'alaa banii israa-iila annahu man qatala nafsan bighayri nafsin aw fasaadin fii al-ardhi faka-annamaa qatala alnnaasa jamii'an waman ahyaahaa faka-annamaa ahyaa alnnaasa jamii'an walaqad jaa-at-hum rusulunaa bialbayyinaati tsumma inna katsiiran minhum ba'da dzaalika fii al-ardhi lamusrifuuna","translate":{"id":"Oleh karena itu Kami tetapkan (suatu hukum) bagi Bani Israil, bahwa: barangsiapa yang membunuh seorang manusia, bukan karena orang itu (membunuh) orang lain , atau bukan karena membuat kerusakan dimuka bumi, maka seakan-akan dia telah membunuh manusia seluruhnya . Dan barangsiapa yang memelihara kehidupan seorang manusia, maka seolah-olah dia telah memelihara kehidupan manusia semuanya. Dan sesungguhnya telah datang kepada mereka rasul-rasul Kami dengan (membawa) keterangan-keterangan yang jelas, kemudian banyak diantara mereka sesudah itu sungguh-sungguh melampaui batas dalam berbuat kerusakan dimuka bumi.\n","en":"Because of this did We ordain unto the children of Israel that if anyone slays a human being-unless it be [in punishment] for murder or for spreading corruption on earth-it shall be as though he had slain all mankind; whereas, if anyone saves a life, it shall be as though he had saved the lives of all mankind. And, indeed, there came unto them Our apostles with all evidence of the truth: yet, behold, notwithstanding all this, many of them go on committing all manner of excesses on earth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/701","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/701.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/701.mp3"]}},{"no":33,"arab":"إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلَافٍ أَوْ يُنْفَوْا مِنَ الْأَرْضِ ۚ ذَٰلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ","latin":"innamaa jazaau alladziina yuhaaribuuna allaaha warasuulahu wayas'awna fii al-ardhi fasaadan an yuqattaluu aw yushallabuu aw tuqaththha'a aydiihim wa-arjuluhum min khilaafin aw yunfaw mina al-ardhi dzaalika lahum khizyun fii alddunyaa walahum fii al-aakhirati 'adzaabun 'azhiimun","translate":{"id":"Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya dan membuat kerusakan di muka bumi, hanyalah mereka dibunuh atau disalib, atau dipotong tangan dan kaki mereka dengan bertimbal balik , atau dibuang dari negeri (tempat kediamannya). Yang demikian itu (sebagai) suatu penghinaan untuk mereka didunia, dan di akhirat mereka beroleh siksaan yang besar,\n","en":"It is but a just recompense for those who make war on God and His apostle, and endeavour to spread corruption on earth, that they are being slain in great' numbers, or crucified in great numbers, or have, in l' result of their perverseness, their hands and feet cut off in great numbers, or are being [entirely] banished from [the face of] the earth: such is their ignominy in this world. But in the life to come [yet more] awesome suffering awaits them-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/702","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/702.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/702.mp3"]}},{"no":34,"arab":"إِلَّا الَّذِينَ تَابُوا مِنْ قَبْلِ أَنْ تَقْدِرُوا عَلَيْهِمْ ۖ فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"illaa alladziina taabuu min qabli an taqdiruu 'alayhim fai'lamuu anna allaaha ghafuurun rahiimun","translate":{"id":"kecuali orang-orang yang taubat (di antara mereka) sebelum kamu dapat menguasai (menangkap) mereka; maka ketahuilah bahwasanya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"save for such [of them] as repent ere you [O believers] become more powerful than they: for you must know that God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/703","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/703.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/703.mp3"]}},{"no":35,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ","latin":"yaa ayyuhaa alladziina aamanuu ittaquu allaaha waibtaghuu ilayhi alwasiilata wajaahiduu fii sabiilihi la'allakum tuflihuuna","translate":{"id":"Hai orang-orang yang beriman, bertakwalah kepada Allah dan carilah jalan yang mendekatkan diri kepada-Nya, dan berjihadlah pada jalan-Nya, supaya kamu mendapat keberuntungan.\n","en":"O YOU who have attained to faith! Remain conscious of God, and seek to come closer unto Him, and strive hard in His cause, so that you might attain to a happy state."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/704","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/704.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/704.mp3"]}},{"no":36,"arab":"إِنَّ الَّذِينَ كَفَرُوا لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُوا بِهِ مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ مَا تُقُبِّلَ مِنْهُمْ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"inna alladziina kafaruu law anna lahum maa fii al-ardhi jamii'an wamitslahu ma'ahu liyaftaduu bihi min 'adzaabi yawmi alqiyaamati maa tuqubbila minhum walahum 'adzaabun aliimun","translate":{"id":"Sesungguhnya orang-orang yang kafir sekiranya mereka mempunyai apa yang dibumi ini seluruhnya dan mempunyai yang sebanyak itu (pula) untuk menebusi diri mereka dengan itu dari azab hari kiamat, niscaya (tebusan itu) tidak akan diterima dari mereka, dan mereka beroleh azab yang pedih.\n","en":"Verily, if those who are bent on denying the truth had all that is on earth, and twice as much, to offer as ransom from suffering on the Day of Resurrection, it would not be accepted from them: for grievous suffering awaits them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/705","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/705.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/705.mp3"]}},{"no":37,"arab":"يُرِيدُونَ أَنْ يَخْرُجُوا مِنَ النَّارِ وَمَا هُمْ بِخَارِجِينَ مِنْهَا ۖ وَلَهُمْ عَذَابٌ مُقِيمٌ","latin":"yuriiduuna an yakhrujuu mina alnnaari wamaa hum bikhaarijiina minhaa walahum 'adzaabun muqiimun","translate":{"id":"Mereka ingin keluar dari neraka, padahal mereka sekali-kali tidak dapat keluar daripadanya, dan mereka beroleh azab yang kekal.\n","en":"They will wish to come out of the fire, but they shall not come out of it; and long-lasting suffering awaits them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/706","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/706.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/706.mp3"]}},{"no":38,"arab":"وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا جَزَاءً بِمَا كَسَبَا نَكَالًا مِنَ اللَّهِ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ","latin":"waalssaariqu waalssaariqatu faiqtha'uu aydiyahumaa jazaa-an bimaa kasabaa nakaalan mina allaahi waallaahu 'aziizun hakiimun","translate":{"id":"Laki-laki yang mencuri dan perempuan yang mencuri, potonglah tangan keduanya (sebagai) pembalasan bagi apa yang mereka kerjakan dan sebagai siksaan dari Allah. Dan Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"NOW AS FOR the man who steals and the woman who steals, cut off the hand of either of them in requital for what they have wrought, as a deterrent ordained by God: for God is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/707","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/707.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/707.mp3"]}},{"no":39,"arab":"فَمَنْ تَابَ مِنْ بَعْدِ ظُلْمِهِ وَأَصْلَحَ فَإِنَّ اللَّهَ يَتُوبُ عَلَيْهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"faman taaba min ba'di zhulmihi wa-ashlaha fa-inna allaaha yatuubu 'alayhi inna allaaha ghafuurun rahiimun","translate":{"id":"Maka barangsiapa bertaubat (di antara pencuri-pencuri itu) sesudah melakukan kejahatan itu dan memperbaiki diri, maka sesungguhnya Allah menerima taubatnya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"But as for him who repents after having thus done wrong, and makes amends, behold, God will accept his repentance: verily, God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/708","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/708.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/708.mp3"]}},{"no":40,"arab":"أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يُعَذِّبُ مَنْ يَشَاءُ وَيَغْفِرُ لِمَنْ يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"alam ta'lam anna allaaha lahu mulku alssamaawaati waal-ardhi yu'adzdzibu man yasyaau wayaghfiru liman yasyaau waallaahu 'alaa kulli syay-in qadiirun","translate":{"id":"Tidakkah kamu tahu, sesungguhnya Allah-lah yang mempunyai kerajaan langit dan bumi, disiksa-Nya siapa yang dikehendaki-Nya dan diampuni-Nya bagi siapa yang dikehendaki-Nya. Dan Allah Maha Kuasa atas segala sesuatu.\n","en":"Dost thou not know that God's is the dominion over the heavens and the earth? He chastises whom He wills, and He forgives whom He wills: for God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/709","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/709.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/709.mp3"]}},{"no":41,"arab":"يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُوا آمَنَّا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِنْ قُلُوبُهُمْ ۛ وَمِنَ الَّذِينَ هَادُوا ۛ سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ ۖ يُحَرِّفُونَ الْكَلِمَ مِنْ بَعْدِ مَوَاضِعِهِ ۖ يَقُولُونَ إِنْ أُوتِيتُمْ هَٰذَا فَخُذُوهُ وَإِنْ لَمْ تُؤْتَوْهُ فَاحْذَرُوا ۚ وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا ۚ أُولَٰئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَنْ يُطَهِّرَ قُلُوبَهُمْ ۚ لَهُمْ فِي الدُّنْيَا خِزْيٌ ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ","latin":"yaa ayyuhaa alrrasuulu laa yahzunka alladziina yusaari'uuna fii alkufri mina alladziina qaaluu aamannaa bi-afwaahihim walam tu/min quluubuhum wamina alladziina haaduu sammaa'uuna lilkadzibi sammaa'uuna liqawmin aakhariina lam ya/tuuka yuharrifuuna alkalima min ba'di mawaadi'ihi yaquuluuna in uutiitum haadzaa fakhudzuuhu wa-in lam tu/tawhu faihtsaruu waman yuridi allaahu fitnatahu falan tamlika lahu mina allaahi syay-an ulaa-ika alladziina lam yuridi allaahu an yuthahhira quluubahum lahum fii alddunyaa khizyun walahum fii al-aakhirati 'adzaabun 'azhiimun","translate":{"id":"Hari Rasul, janganlah hendaknya kamu disedihkan oleh orang-orang yang bersegera (memperlihatkan) kekafirannya, yaitu diantara orang-orang yang mengatakan dengan mulut mereka:\"Kami telah beriman\", padahal hati mereka belum beriman; dan (juga) di antara orang-orang Yahudi. (Orang-orang Yahudi itu) amat suka mendengar (berita-berita) bohong dan amat suka mendengar perkataan-perkataan orang lain yang belum pernah datang kepadamu ; mereka merobah perkataan-perkataan (Taurat) dari tempat-tempatnya. Mereka mengatakan: \"Jika diberikan ini (yang sudah di robah-robah oleh mereka) kepada kamu, maka terimalah, dan jika kamu diberi yang bukan ini maka hati-hatilah\". Barangsiapa yang Allah menghendaki kesesatannya, maka sekali-kali kamu tidak akan mampu menolak sesuatupun (yang datang) daripada Allah. Mereka itu adalah orang-orang yang Allah tidak hendak mensucikan hati mereka. Mereka beroleh kehinaan di dunia dan di akhirat mereka beroleh siksaan yang besar.\n","en":"O APOSTLE! Be not grieved by those who vie with one another in denying the truth: such as those who say with their mouths, \"We believe,\" the while their hearts do not believe; and such of the Jewish faith as eagerly listen to any falsehood, eagerly listen to other people without having come to thee [for enlightenment]. They distort the meaning of the [revealed] words, taking them out of their context, saying [to themselves], \"If such-and-such [teaching] is vouchsafed unto you, accept it; but if it is not vouchsafed unto you, be on your guard!\" [Be not grieved by them-] for if God wills anyone to be tempted to evil, thou canst in no wise prevail with God in his behalf. It is they whose hearts God is not willing to cleanse. Theirs shall be ignominy in this world, and awesome suffering in the life to come-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/710","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/710.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/710.mp3"]}},{"no":42,"arab":"سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ ۚ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ۖ وَإِنْ تُعْرِضْ عَنْهُمْ فَلَنْ يَضُرُّوكَ شَيْئًا ۖ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ","latin":"sammaa'uuna lilkadzibi akkaaluuna lilssuhti fa-in jaauuka fauhkum baynahum aw a'ridh 'anhum wa-in tu'ridh 'anhum falan yadhurruuka syay-an wa-in hakamta fauhkum baynahum bialqisthi inna allaaha yuhibbu almuqsithiina","translate":{"id":"Mereka itu adalah orang-orang yang suka mendengar berita bohong, banyak memakan yang haram . Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka; jika kamu berpaling dari mereka maka mereka tidak akan memberi mudharat kepadamu sedikitpun. Dan jika kamu memutuskan perkara mereka, maka putuskanlah (perkara itu) diantara mereka dengan adil, sesungguhnya Allah menyukai orang-orang yang adil.\n","en":"those who eagerly listen to any falsehood, greedily swallowing all that is evil! Hence, if they come to thee [for judgment], thou mayest either judge between them or leave them alone: for, if thou leave them alone, they cannot harm thee in any way. But if thou dost judge, judge between them with equity: verily, God knows those who act equitably."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/711","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/711.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/711.mp3"]}},{"no":43,"arab":"وَكَيْفَ يُحَكِّمُونَكَ وَعِنْدَهُمُ التَّوْرَاةُ فِيهَا حُكْمُ اللَّهِ ثُمَّ يَتَوَلَّوْنَ مِنْ بَعْدِ ذَٰلِكَ ۚ وَمَا أُولَٰئِكَ بِالْمُؤْمِنِينَ","latin":"wakayfa yuhakkimuunaka wa'indahumu alttawraatu fiihaa hukmu allaahi tsumma yatawallawna min ba'di dzaalika wamaa ulaa-ika bialmu/miniina","translate":{"id":"Dan bagaimanakah mereka mengangkatmu menjadi hakim mereka, padahal mereka mempunyai Taurat yang didalamnya (ada) hukum Allah, kemudian mereka berpaling sesudah itu (dari putusanmu)? Dan mereka sungguh-sungguh bukan orang yang beriman.\n","en":"But how is it that they ask thee for judgment seeing that they have the Torah, containing God's injunctions - and thereafter turn away [from thy judgment]? Such as these, then, are no [true] believers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/712","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/712.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/712.mp3"]}},{"no":44,"arab":"إِنَّا أَنْزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ ۚ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُوا لِلَّذِينَ هَادُوا وَالرَّبَّانِيُّونَ وَالْأَحْبَارُ بِمَا اسْتُحْفِظُوا مِنْ كِتَابِ اللَّهِ وَكَانُوا عَلَيْهِ شُهَدَاءَ ۚ فَلَا تَخْشَوُا النَّاسَ وَاخْشَوْنِ وَلَا تَشْتَرُوا بِآيَاتِي ثَمَنًا قَلِيلًا ۚ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الْكَافِرُونَ","latin":"innaa anzalnaa alttawraata fiihaa hudan wanuurun yahkumu bihaa alnnabiyyuuna alladziina aslamuu lilladziina haaduu waalrrabbaaniyyuuna waal-ahbaaru bimaa istuhfizhuu min kitaabi allaahi wakaanuu 'alayhi syuhadaa-a falaa takhsyawuu alnnaasa waikhsyawni walaa tasytaruu bi-aayaatii tsamanan qaliilan waman lam yahkum bimaa anzala allaahu faulaa-ika humu alkaafiruuna","translate":{"id":"Sesungguhnya Kami telah menurunkan Kitab Taurat di dalamnya (ada) petunjuk dan cahaya (yang menerangi), yang dengan Kitab itu diputuskan perkara orang-orang Yahudi oleh nabi-nabi yang menyerah diri kepada Allah, oleh orang-orang alim mereka dan pendeta-pendeta mereka, disebabkan mereka diperintahkan memelihara kitab-kitab Allah dan mereka menjadi saksi terhadapnya. Karena itu janganlah kamu takut kepada manusia, (tetapi) takutlah kepada-Ku. Dan janganlah kamu menukar ayat-ayat-Ku dengan harga yang sedikit. Barangsiapa yang tidak memutuskan menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang kafir.\n","en":"Verily, it is We who bestowed from on high the Torah, wherein there was guidance and light. On `its strength did the prophets, who had surrendered themselves unto God, deliver judgment unto those who followed the Jewish faith; and so did the [early] men of God and the rabbis, inasmuch as some of God's writ had been entrusted to their care; and they [all] bore witness to its truth. Therefore, [O children of Israel,] hold not men in awe, but stand in awe of Me; and do not barter away My messages for a trifling gain: for they who do not judge in accordance with what God has bestowed from on high are, indeed, deniers of the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/713","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/713.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/713.mp3"]}},{"no":45,"arab":"وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالْأَنْفَ بِالْأَنْفِ وَالْأُذُنَ بِالْأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ ۚ فَمَنْ تَصَدَّقَ بِهِ فَهُوَ كَفَّارَةٌ لَهُ ۚ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ","latin":"wakatabnaa 'alayhim fiihaa anna alnnafsa bialnnafsi waal'ayna bial'ayni waal-anfa bial-anfi waaludzuna bialudzuni waalssinna bialssinni waaljuruuha qisasun faman tashaddaqa bihi fahuwa kaffaaratun lahu waman lam yahkum bimaa anzala allaahu faulaa-ika humu alzhzhaalimuuna","translate":{"id":"Dan Kami telah tetapkan terhadap mereka di dalamnya (At Taurat) bahwasanya jiwa (dibalas) dengan jiwa, mata dengan mata, hidung dengan hidung, telinga dengan telinga, gigi dengan gigi, dan luka luka (pun) ada kisasnya. Barangsiapa yang melepaskan (hak kisas) nya, maka melepaskan hak itu (menjadi) penebus dosa baginya. Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang zalim.\n","en":"And We ordained for them in that [Torah]: A life for a life, and an eye for an eye, and a nose for a nose, and an ear for an ear, and a tooth for a tooth, and a [similar] retribution for wounds; but he who shall forgo it out of charity will atone thereby for some of his past sins. And they who do not judge in accordance with what God has revealed - they, they are the evildoers!,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/714","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/714.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/714.mp3"]}},{"no":46,"arab":"وَقَفَّيْنَا عَلَىٰ آثَارِهِمْ بِعِيسَى ابْنِ مَرْيَمَ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ ۖ وَآتَيْنَاهُ الْإِنْجِيلَ فِيهِ هُدًى وَنُورٌ وَمُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ وَهُدًى وَمَوْعِظَةً لِلْمُتَّقِينَ","latin":"waqaffaynaa 'alaa aatsaarihim bi'iisaa ibni maryama mushaddiqan limaa bayna yadayhi mina alttawraati waaataynaahu al-injiila fiihi hudan wanuurun wamushaddiqan limaa bayna yadayhi mina alttawraati wahudan wamaw'izhatan lilmuttaqiina","translate":{"id":"Dan Kami iringkan jejak mereka (nabi nabi Bani Israil) dengan 'Isa putera Maryam, membenarkan Kitab yang sebelumnya, yaitu: Taurat. Dan Kami telah memberikan kepadanya Kitab Injil sedang didalamnya (ada) petunjuk dan dan cahaya (yang menerangi), dan membenarkan kitab yang sebelumnya, yaitu Kitab Taurat. Dan menjadi petunjuk serta pengajaran untuk orang-orang yang bertakwa.\n","en":"And We caused Jesus, the son of Mary, to follow in the footsteps of those [earlier prophets], confirming the truth of whatever there still remained of the Torah; and We vouchsafed unto him the Gospel, wherein there was guidance and light, confirming the truth of whatever there still remained of the Torah, and as a guidance and admonition unto the God-conscious."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/715","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/715.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/715.mp3"]}},{"no":47,"arab":"وَلْيَحْكُمْ أَهْلُ الْإِنْجِيلِ بِمَا أَنْزَلَ اللَّهُ فِيهِ ۚ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الْفَاسِقُونَ","latin":"walyahkum ahlu al-injiili bimaa anzala allaahu fiihi waman lam yahkum bimaa anzala allaahu faulaa-ika humu alfaasiquuna","translate":{"id":"Dan hendaklah orang-orang pengikut Injil, memutuskan perkara menurut apa yang diturunkan Allah didalamnya . Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang fasik .\n","en":"Let, then, the followers of the Gospel judge in accordance with what God has revealed therein: for they who do not judge in the light of what God has bestowed from on high-it is they, they who are truly iniquitous!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/716","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/716.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/716.mp3"]}},{"no":48,"arab":"وَأَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ الْكِتَابِ وَمُهَيْمِنًا عَلَيْهِ ۖ فَاحْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ عَمَّا جَاءَكَ مِنَ الْحَقِّ ۚ لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا ۚ وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً وَلَٰكِنْ لِيَبْلُوَكُمْ فِي مَا آتَاكُمْ ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ إِلَى اللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ","latin":"wa-anzalnaa ilayka alkitaaba bialhaqqi mushaddiqan limaa bayna yadayhi mina alkitaabi wamuhayminan 'alayhi fauhkum baynahum bimaa anzala allaahu walaa tattabi' ahwaa-ahum 'ammaa jaa-aka mina alhaqqi likullin ja'alnaa minkum syir'atan waminhaajan walaw syaa-a allaahu laja'alakum ummatan waahidatan walaakin liyabluwakum fiimaa aataakum faistabiquu alkhayraati ilaa allaahi marji'ukum jamii'an fayunabbi-ukum bimaa kuntum fiihi takhtalifuuna","translate":{"id":"Dan Kami telah turunkan kepadamu Al Qur'an dengan membawa kebenaran, membenarkan apa yang sebelumnya, yaitu kitab-kitab (yang diturunkan sebelumnya) dan batu ujian terhadap kitab-kitab yang lain itu; maka putuskanlah perkara mereka menurut apa yang Allah turunkan dan janganlah kamu mengikuti hawa nafsu mereka dengan meninggalkan kebenaran yang telah datang kepadamu. Untuk tiap-tiap umat diantara kamu , Kami berikan aturan dan jalan yang terang. Sekiranya Allah menghendaki, niscaya kamu dijadikan-Nya satu umat (saja), tetapi Allah hendak menguji kamu terhadap pemberian-Nya kepadamu, maka berlomba-lombalah berbuat kebajikan. Hanya kepada Allah-lah kembali kamu semuanya, lalu diberitahukan-Nya kepadamu apa yang telah kamu perselisihkan itu,\n","en":"And unto thee [O Prophet] have We vouchsafed this divine writ, setting forth the truth, confirming the truth of whatever there still remains of earlier revelations and determining what is true therein. Judge, then, between the followers of earlier revelation in accordance with what God has bestowed from on high, and do not follow their errant views, forsaking the truth that has come unto thee. Unto every one of you have We appointed a [different] law and way of life. And if God had so willed, He could surely have made you all one single community: but [He willed it otherwise] in order to test you by means of what He has vouchsafed unto, you. Vie, then, with one another in doing good works! Unto God you all must return; and then He will make you truly understand all that on which you were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/717","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/717.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/717.mp3"]}},{"no":49,"arab":"وَأَنِ احْكُمْ بَيْنَهُمْ بِمَا أَنْزَلَ اللَّهُ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ وَاحْذَرْهُمْ أَنْ يَفْتِنُوكَ عَنْ بَعْضِ مَا أَنْزَلَ اللَّهُ إِلَيْكَ ۖ فَإِنْ تَوَلَّوْا فَاعْلَمْ أَنَّمَا يُرِيدُ اللَّهُ أَنْ يُصِيبَهُمْ بِبَعْضِ ذُنُوبِهِمْ ۗ وَإِنَّ كَثِيرًا مِنَ النَّاسِ لَفَاسِقُونَ","latin":"wa-ani uhkum baynahum bimaa anzala allaahu walaa tattabi' ahwaa-ahum waihtsarhum an yaftinuuka 'an ba'dhi maa anzala allaahu ilayka fa-in tawallaw fai'lam annamaa yuriidu allaahu an yushiibahum biba'dhi dzunuubihim wa-inna katsiiran mina alnnaasi lafaasiquuna","translate":{"id":"dan hendaklah kamu memutuskan perkara di antara mereka menurut apa yang diturunkan Allah, dan janganlah kamu mengikuti hawa nafsu mereka. Dan berhati-hatilah kamu terhadap mereka, supaya mereka tidak memalingkan kamu dari sebahagian apa yang telah diturunkan Allah kepadamu. Jika mereka berpaling (dari hukum yang telah diturunkan Allah), maka ketahuilah bahwa sesungguhnya Allah menghendaki akan menimpakan mushibah kepada mereka disebabkan sebahagian dosa-dosa mereka. Dan sesungguhnya kebanyakan manusia adalah orang-orang yang fasik.\n","en":"Hence, judge between the followers of earlier revelation in accordance with what God has bestowed from on high, and do not follow their errant views; and beware of them, lest they tempt thee away from aught that God has bestowed from on high upon thee. And if they turn away [from His commandments], then know that it is but God's will [thus] to afflict them for some of their sins: for, behold, a great many people are iniquitous indeed."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/718","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/718.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/718.mp3"]}},{"no":50,"arab":"أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ ۚ وَمَنْ أَحْسَنُ مِنَ اللَّهِ حُكْمًا لِقَوْمٍ يُوقِنُونَ","latin":"afahukma aljaahiliyyati yabghuuna waman ahsanu mina allaahu hukman liqawmin yuuqinuuna","translate":{"id":"Apakah hukum Jahiliyah yang mereka kehendaki, dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin ?\n","en":"Do they, perchance, desire [to be ruled by] the law of pagan ignorance? But for people who have inner certainty, who could be a better law-giver than God?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/719","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/719.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/719.mp3"]}},{"no":51,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَىٰ أَوْلِيَاءَ ۘ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","latin":"yaa ayyuhaa alladziina aamanuu laa tattakhidzuu alyahuuda waalnnashaaraa awliyaa-a ba'dhuhum awliyaau ba'dhin waman yatawallahum minkum fa-innahu minhum inna allaaha laa yahdii alqawma alzhzhaalimiina","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang Yahudi dan Nasrani menjadi pemimpin-pemimpin(mu); sebahagian mereka adalah pemimpin bagi sebahagian yang lain. Barangsiapa diantara kamu mengambil mereka menjadi pemimpin, maka sesungguhnya orang itu termasuk golongan mereka. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim.\n","en":"O YOU who have attained to faith! Do not take the Jews and the Christians for your allies: they are but allies of one another and whoever of you allies himself with them becomes, verily, one of them; behold, God does not guide such evildoers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/720","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/720.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/720.mp3"]}},{"no":52,"arab":"فَتَرَى الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَىٰ أَنْ تُصِيبَنَا دَائِرَةٌ ۚ فَعَسَى اللَّهُ أَنْ يَأْتِيَ بِالْفَتْحِ أَوْ أَمْرٍ مِنْ عِنْدِهِ فَيُصْبِحُوا عَلَىٰ مَا أَسَرُّوا فِي أَنْفُسِهِمْ نَادِمِينَ","latin":"fataraa alladziina fii quluubihim maradhun yusaari'uuna fiihim yaquuluuna nakhsyaa an tushiibanaa daa-iratun fa'asaa allaahu an ya/tiya bialfathi aw amrin min 'indihi fayushbihuu 'alaa maa asarruu fii anfusihim naadimiina","translate":{"id":"Maka kamu akan melihat orang-orang yang ada penyakit dalam hatinya (orang-orang munafik) bersegera mendekati mereka (Yahudi dan Nasrani), seraya berkata: \"Kami takut akan mendapat bencana\". Mudah-mudahan Allah akan mendatangkan kemenangan (kepada Rasul-Nya), atau sesuatu keputusan dari sisi-Nya. Maka karena itu, mereka menjadi menyesal terhadap apa yang mereka rahasiakan dalam diri mereka.\n","en":"And yet thou canst see how those in whose hearts there is disease vie with one another for their good will, saying [to themselves], \"We fear lest fortune turn against us.\" But God may well bring about good fortune [for the believers] or any [other] event of His own devising, whereupon those [waverers] will be smitten with remorse for the thoughts which they had secretly harboured within themselves-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/721","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/721.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/721.mp3"]}},{"no":53,"arab":"وَيَقُولُ الَّذِينَ آمَنُوا أَهَٰؤُلَاءِ الَّذِينَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ إِنَّهُمْ لَمَعَكُمْ ۚ حَبِطَتْ أَعْمَالُهُمْ فَأَصْبَحُوا خَاسِرِينَ","latin":"wayaquulu alladziina aamanuu ahaaulaa-i alladziina aqsamuu biallaahi jahda aymaanihim innahum lama'akum habithat a'maaluhum fa-ashbahuu khaasiriina","translate":{"id":"Dan orang-orang yang beriman akan mengatakan: \"Inikah orang-orang yang bersumpah sungguh-sungguh dengan nama Allah, bahwasanya mereka benar-benar beserta kamu?\" Rusak binasalah segala amal mereka, lalu mereka menjadi orang-orang yang merugi.\n","en":"while those who have attained to faith will say [to one another], \"Are these the selfsame people who swore by God with their most solemn oaths that they were indeed with you? In vain are all their works, for now they are lost!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/722","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/722.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/722.mp3"]}},{"no":54,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَائِمٍ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ وَاسِعٌ عَلِيمٌ","latin":"yaa ayyuhaa alladziina aamanuu man yartadda minkum 'an diinihi fasawfa ya/tii allaahu biqawmin yuhibbuhum wayuhibbuunahu adzillatin 'alaa almu/miniina a'izzatin 'alaa alkaafiriina yujaahiduuna fii sabiili allaahi walaa yakhaafuuna lawmata laa-imin dzaalika fadhlu allaahi yu/tiihi man yasyaau waallaahu waasi'un 'aliimun","translate":{"id":"Hai orang-orang yang beriman, barangsiapa di antara kamu yang murtad dari agamanya, maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintaiNya, yang bersikap lemah lembut terhadap orang yang mu'min, yang bersikap keras terhadap orang-orang kafir, yang berjihad dijalan Allah, dan yang tidak takut kepada celaan orang yang suka mencela. Itulah karunia Allah, diberikan-Nya kepada siapa yang dikehendaki-Nya, dan Allah Maha Luas (pemberian-Nya), lagi Maha Mengetahui.\n","en":"O you who have attained to faith! If you ever abandon your faith,\" God will in time bring forth [in your stead] people whom He loves and who love Him - humble towards the believers, proud towards all who deny the truth: [people] who strive hard in God's cause, and do not fear to be censured by anyone who might censure them: such is God's favour, which He grants unto whom He wills. And God is infinite, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/723","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/723.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/723.mp3"]}},{"no":55,"arab":"إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ رَاكِعُونَ","latin":"innamaa waliyyukumu allaahu warasuuluhu waalladziina aamanuu alladziina yuqiimuuna alshshalaata wayu/tuuna alzzakaata wahum raaki'uuna","translate":{"id":"Sesungguhnya penolong kamu hanyalah Allah, Rasul-Nya, dan orang-orang yang beriman, yang mendirikan shalat dan menunaikan zakat, seraya mereka tunduk (kepada Allah).\n","en":"Behold, your only helper shall be God, and His Apostle, and those who have attained to faith - those that are constant in prayer, and render the purifying dues, and bow down [before God]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/724","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/724.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/724.mp3"]}},{"no":56,"arab":"وَمَنْ يَتَوَلَّ اللَّهَ وَرَسُولَهُ وَالَّذِينَ آمَنُوا فَإِنَّ حِزْبَ اللَّهِ هُمُ الْغَالِبُونَ","latin":"waman yatawalla allaaha warasuulahu waalladziina aamanuu fa-inna hizba allaahi humu alghaalibuuna","translate":{"id":"Dan barangsiapa mengambil Allah, Rasul-Nya dan orang-orang yang beriman menjadi penolongnya, maka sesungguhnya pengikut (agama) Allah itulah yang pasti menang.\n","en":"for, all who ally themselves with God and His Apostle and those who have attained to faith - behold, it is they, the partisans of God, who shall be victorious!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/725","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/725.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/725.mp3"]}},{"no":57,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الَّذِينَ اتَّخَذُوا دِينَكُمْ هُزُوًا وَلَعِبًا مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَالْكُفَّارَ أَوْلِيَاءَ ۚ وَاتَّقُوا اللَّهَ إِنْ كُنْتُمْ مُؤْمِنِينَ","latin":"yaa ayyuhaa alladziina aamanuu laa tattakhidzuu alladziina ittakhadzuu diinakum huzuwan wala'iban mina alladziina uutuu alkitaaba min qablikum waalkuffaara awliyaa-a waittaquu allaaha in kuntum mu/miniina","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu mengambil jadi pemimpinmu, orang-orang yang membuat agamamu jadi buah ejekan dan permainan, (yaitu) di antara orang-orang yang telah diberi kitab sebelummu, dan orang-orang yang kafir (orang-orang musyrik). Dan bertakwalah kepada Allah jika kamu betul-betul orang-orang yang beriman.\n","en":"O you who have attained to faith! Do not take for your friends such as mock at your, faith and make a jest of it-be they from among those who have been vouchsafed revelation before your time, or [from among] those who deny the truth [of revelation as such] -but remain conscious of God, if you are [truly] believers:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/726","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/726.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/726.mp3"]}},{"no":58,"arab":"وَإِذَا نَادَيْتُمْ إِلَى الصَّلَاةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ","latin":"wa-idzaa naadaytum ilaa alshshalaati ittakhadzuuhaa huzuwan wala'iban dzaalika bi-annahum qawmun laa ya'qiluuna","translate":{"id":"Dan apabila kamu menyeru (mereka) untuk (mengerjakan) sembahyang, mereka menjadikannya buah ejekan dan permainan. Yang demikian itu adalah karena mereka benar-benar kaum yang tidak mau mempergunakan akal.\n","en":"for, when you call to prayer, they mock at it and make a jest of it-simply because they are people who do not use their reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/727","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/727.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/727.mp3"]}},{"no":59,"arab":"قُلْ يَا أَهْلَ الْكِتَابِ هَلْ تَنْقِمُونَ مِنَّا إِلَّا أَنْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ مِنْ قَبْلُ وَأَنَّ أَكْثَرَكُمْ فَاسِقُونَ","latin":"qul yaa ahla alkitaabi hal tanqimuuna minnaa illaa an aamannaa biallaahi wamaa unzila ilaynaa wamaa unzila min qablu wa-anna aktsarakum faasiquuna","translate":{"id":"Katakanlah: \"Hai Ahli Kitab, apakah kamu memandang kami salah, hanya lantaran kami beriman kepada Allah, kepada apa yang diturunkan kepada kami dan kepada apa yang diturunkan sebelumnya, sedang kebanyakan di antara kamu benar-benar orang-orang yang fasik ?\n","en":"Say: \"O followers of earlier revelation! Do you find fault with us for no other reason than that we believe in God [alone], and in that which He has bestowed from on high upon us as well as that which He has bestowed aforetime? - or [is it only] because most of you are iniquitous?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/728","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/728.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/728.mp3"]}},{"no":60,"arab":"قُلْ هَلْ أُنَبِّئُكُمْ بِشَرٍّ مِنْ ذَٰلِكَ مَثُوبَةً عِنْدَ اللَّهِ ۚ مَنْ لَعَنَهُ اللَّهُ وَغَضِبَ عَلَيْهِ وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ ۚ أُولَٰئِكَ شَرٌّ مَكَانًا وَأَضَلُّ عَنْ سَوَاءِ السَّبِيلِ","latin":"qul hal unabbi-ukum bisyarrin min dzaalika matsuubatan 'inda allaahi man la'anahu allaahu waghadhiba 'alayhi waja'ala minhumu alqiradata waalkhanaaziira wa'abada alththaaghuuti ulaa-ika syarrun makaanan wa-adhallu 'an sawaa-i alssabiili","translate":{"id":"Katakanlah: \"Apakah akan aku beritakan kepadamu tentang orang-orang yang lebih buruk pembalasannya dari (orang-orang fasik) itu disisi Allah, yaitu orang-orang yang dikutuki dan dimurkai Allah, di antara mereka (ada) yang dijadikan kera dan babi dan (orang yang) menyembah thaghut ?\". Mereka itu lebih buruk tempatnya dan lebih tersesat dari jalan yang lurus.\n","en":"Say: \"Shall I tell you who, in the sight of God, deserves a yet worse retribution than these? They whom God has rejected and whom He has condemned, and whom He has turned into apes and swine because they worshipped the powers of evil: these are yet worse in station, and farther astray from the right path [than the mockers].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/729","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/729.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/729.mp3"]}},{"no":61,"arab":"وَإِذَا جَاءُوكُمْ قَالُوا آمَنَّا وَقَدْ دَخَلُوا بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوا بِهِ ۚ وَاللَّهُ أَعْلَمُ بِمَا كَانُوا يَكْتُمُونَ","latin":"wa-idzaa jaauukum qaaluu aamannaa waqad dakhaluu bialkufri wahum qad kharajuu bihi waallaahu a'lamu bimaa kaanuu yaktumuuna","translate":{"id":"Dan apabila orang-orang (Yahudi atau munafik) datang kepadamu, mereka mengatakan: \"Kami telah beriman\", padahal mereka datang kepadamu dengan kekafirannya dan mereka pergi (daripada kamu) dengan kekafirannya (pula); dan Allah lebih mengetahui apa yang mereka sembunyikan.\n","en":"For, when they come unto you, they say, \"We do believe\": whereas, in fact, they come with the resolve to deny the truth, and depart in the same state. But God is fully aware of all that they would conceal."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/730","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/730.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/730.mp3"]}},{"no":62,"arab":"وَتَرَىٰ كَثِيرًا مِنْهُمْ يُسَارِعُونَ فِي الْإِثْمِ وَالْعُدْوَانِ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَعْمَلُونَ","latin":"wataraa katsiiran minhum yusaari'uuna fii al-itsmi waal'udwaani wa-aklihimu alssuhta labi/sa maa kaanuu ya'maluuna","translate":{"id":"Dan kamu akan melihat kebanyakan dari mereka (orang-orang Yahudi) bersegera membuat dosa, permusuhan dan memakan yang haram .Sesungguhnya amat buruk apa yang mereka telah kerjakan itu.\n","en":"And thou canst see many of them vie with one another in sinning and tyrannical conduct and in their swallowing of all that is evil."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/731","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/731.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/731.mp3"]}},{"no":63,"arab":"لَوْلَا يَنْهَاهُمُ الرَّبَّانِيُّونَ وَالْأَحْبَارُ عَنْ قَوْلِهِمُ الْإِثْمَ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَصْنَعُونَ","latin":"lawlaa yanhaahumu alrrabbaaniyyuuna waal-ahbaaru 'an qawlihimu al-itsma wa-aklihimu alssuhta labi/sa maa kaanuu yashna'uuna","translate":{"id":"Mengapa orang-orang alim mereka, pendeta-pendeta mereka tidak melarang mereka mengucapkan perkataan bohong dan memakan yang haram ?. Sesungguhnya amat buruk apa yang telah mereka kerjakan itu.\n","en":"Why do not their men of God and their rabbis forbid them to make sinful assertions and to swallow all that is evil? Vile indeed is what they contrive!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/732","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/732.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/732.mp3"]}},{"no":64,"arab":"وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ ۚ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا ۘ بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ ۚ وَلَيَزِيدَنَّ كَثِيرًا مِنْهُمْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ طُغْيَانًا وَكُفْرًا ۚ وَأَلْقَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَىٰ يَوْمِ الْقِيَامَةِ ۚ كُلَّمَا أَوْقَدُوا نَارًا لِلْحَرْبِ أَطْفَأَهَا اللَّهُ ۚ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا ۚ وَاللَّهُ لَا يُحِبُّ الْمُفْسِدِينَ","latin":"waqaalati alyahuudu yadu allaahi maghluulatun ghullat aydiihim walu'inuu bimaa qaaluu bal yadaahu mabsuuthataani yunfiqu kayfa yasyaau walayaziidanna katsiiran minhum maa unzila ilayka min rabbika thughyaanan wakufran wa-alqaynaa baynahumu al'adaawata waalbaghdhaa-a ilaa yawmi alqiyaamati kullamaa awqaduu naaran lilharbi athfa-ahaa allaahu wayas'awna fii al-ardhi fasaadan waallaahu laa yuhibbu almufsidiina","translate":{"id":"Orang-orang Yahudi berkata: \"Tangan Allah terbelenggu\" , sebenarnya tangan merekalah yang dibelenggu dan merekalah yang dila'nat disebabkan apa yang telah mereka katakan itu. (Tidak demikian), tetapi kedua-dua tangan Allah terbuka; Dia menafkahkan sebagaimana Dia kehendaki. Dan Al Qur'an yang diturunkan kepadamu dari Tuhanmu sungguh-sungguh akan menambah kedurhakaan dan kekafiran bagi kebanyakan di antara mereka. Dan Kami telah timbulkan permusuhan dan kebencian di antara mereka sampai hari kiamat. Setiap mereka menyalakan api peperangan Allah memadamkannya dan mereka berbuat kerusakan dimuka bumi dan Allah tidak menyukai orang-orang yang membuat kerusakan.\n","en":"And the Jews say, \"God's hand is shackled!\" It is their own hands that are shackled; and rejected [by God] are they because of this their assertion. Nay, but wide are His hands stretched out: He dispenses [bounty] as He wills. But all that has been bestowed from on high upon thee [O Prophet] by thy Sustainer is bound to make many of them yet more stubborn in their overweening arrogance and in their denial of the truth. And so We have cast enmity and hatred among the followers of the Bible, [to last] until Resurrection Day; every time they light the fires of war, God extinguishes them; and they labour hard to spread corruption on earth: and God does not -love the spreaders of corruption."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/733","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/733.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/733.mp3"]}},{"no":65,"arab":"وَلَوْ أَنَّ أَهْلَ الْكِتَابِ آمَنُوا وَاتَّقَوْا لَكَفَّرْنَا عَنْهُمْ سَيِّئَاتِهِمْ وَلَأَدْخَلْنَاهُمْ جَنَّاتِ النَّعِيمِ","latin":"walaw anna ahla alkitaabi aamanuu waittaqaw lakaffarnaa 'anhum sayyi-aatihim wala-adkhalnaahum jannaati alnna'iimi","translate":{"id":"Dan sekiranya Ahli Kitab beriman dan bertakwa, tentulah Kami tutup (hapus) kesalahan-kesalahan mereka dan tentulah Kami masukkan mereka kedalam surga-surga yang penuh kenikmatan.\n","en":"If the followers of the Bible would but attain to [true] faith and God-consciousness, We should indeed efface their [previous] bad deeds, and indeed bring them into gardens of bliss;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/734","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/734.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/734.mp3"]}},{"no":66,"arab":"وَلَوْ أَنَّهُمْ أَقَامُوا التَّوْرَاةَ وَالْإِنْجِيلَ وَمَا أُنْزِلَ إِلَيْهِمْ مِنْ رَبِّهِمْ لَأَكَلُوا مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ أَرْجُلِهِمْ ۚ مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ ۖ وَكَثِيرٌ مِنْهُمْ سَاءَ مَا يَعْمَلُونَ","latin":"walaw annahum aqaamuu alttawraata waal-injiila wamaa unzila ilayhim min rabbihim la-akaluu min fawqihim wamin tahti arjulihim minhum ummatun muqtashidatun wakatsiirun minhum saa-a maa ya'maluuna","translate":{"id":"Dan sekiranya mereka sungguh-sungguh menjalankan (hukum) Taurat dan Injil dan (Al Qur\\rquote an) yang diturunkan kepada mereka dari Tuhannya, niscaya mereka akan mendapat makanan dari atas dan dari bawah kaki mereka . Diantara mereka ada golongan yang pertengahan . Dan alangkah buruknya apa yang dikerjakan oleh kebanyakan mereka.\n","en":"and if they would but truly observe the Torah and the Gospel and all [the revelation] that has been bestowed from on high upon them by their Sustainer, they would indeed partake of all the blessings of heaven and earth. Some of them do pursue a right course; but as for most of them -vile indeed is what they do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/735","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/735.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/735.mp3"]}},{"no":67,"arab":"يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ ۖ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ ۚ وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ","latin":"yaa ayyuhaa alrrasuulu balligh maa unzila ilayka min rabbika wa-in lam taf'al famaa ballaghta risaalatahu waallaahu ya'shimuka mina alnnaasi inna allaaha laa yahdii alqawma alkaafiriina","translate":{"id":"Hai Rasul, sampaikanlah apa yang diturunkan kepadamu dari Tuhanmu. Dan jika tidak kamu kerjakan (apa yang diperintahkan itu, berarti) kamu tidak menyampaikan amanat-Nya. Allah memelihara kamu dari (gangguan) manusia . Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang kafir.\n","en":"O APOSTLE! Announce all that has been bestowed from on high upon thee by thy Sustainer: for unless thou doest it fully, thou wilt not have delivered His message [at all]. And God will protect thee from [unbelieving] men: behold, God does not guide people who refuse to acknowledge the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/736","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/736.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/736.mp3"]}},{"no":68,"arab":"قُلْ يَا أَهْلَ الْكِتَابِ لَسْتُمْ عَلَىٰ شَيْءٍ حَتَّىٰ تُقِيمُوا التَّوْرَاةَ وَالْإِنْجِيلَ وَمَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ ۗ وَلَيَزِيدَنَّ كَثِيرًا مِنْهُمْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ طُغْيَانًا وَكُفْرًا ۖ فَلَا تَأْسَ عَلَى الْقَوْمِ الْكَافِرِينَ","latin":"qul yaa ahla alkitaabi lastum 'alaa syay-in hattaa tuqiimuu alttawraata waal-injiila wamaa unzila ilaykum min rabbikum walayaziidanna katsiiran minhum maa unzila ilayka min rabbika thughyaanan wakufran falaa ta/sa 'alaa alqawmi alkaafiriina","translate":{"id":"Katakanlah: \"Hai Ahli Kitab, kamu tidak dipandang beragama sedikitpun hingga kamu menegakkan ajaran-ajaran Taurat, Injil, dan Al Qur'an yang diturunkan kepadamu dari Tuhanmu\". Sesungguhnya apa yang diturunkan kepadamu (Muhammad) dari Tuhanmu akan menambah kedurhakaan dan kekafiran kepada kebanyakan dari mereka; maka janganlah kamu bersedih hati terhadap orang-orang yang kafir itu.\n","en":"Say: \"O followers of the Bible! You have no valid ground for your beliefs -unless you [truly] observe the Torah and the Gospel, and all that has been bestowed from on high upon you by your Sustainer!\" Yet all that has been bestowed from on high upon thee [O Prophet] by thy Sustainer is bound to make many of them yet more stubborn in their overweening arrogance and in their denial of the truth. But sorrow not over people who deny the truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/737","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/737.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/737.mp3"]}},{"no":69,"arab":"إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئُونَ وَالنَّصَارَىٰ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَعَمِلَ صَالِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","latin":"inna alladziina aamanuu waalladziina haaduu waalshshaabi-uuna waalnnashaaraa man aamana biallaahi waalyawmi al-aakhiri wa'amila shaalihan falaa khawfun 'alayhim walaa hum yahzanuuna","translate":{"id":"Sesungguhnya orang-orang mu'min, orang-orang Yahudi, Shabiin dan orang-orang Nasrani, siapa saja (diantara mereka) yang benar-benar saleh, maka tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati.\n","en":"for, verily, those who have attained to faith [in this divine writ], as well as those who follow the Jewish faith, and the Sabians, and the Christians - all who believe in God and the Last Day and do righteous deeds - no fear need they have, and neither shall they grieve."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/738","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/738.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/738.mp3"]}},{"no":70,"arab":"لَقَدْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ وَأَرْسَلْنَا إِلَيْهِمْ رُسُلًا ۖ كُلَّمَا جَاءَهُمْ رَسُولٌ بِمَا لَا تَهْوَىٰ أَنْفُسُهُمْ فَرِيقًا كَذَّبُوا وَفَرِيقًا يَقْتُلُونَ","latin":"laqad akhadznaa miitsaaqa banii israa-iila wa-arsalnaa ilayhim rusulan kullamaa jaa-ahum rasuulun bimaa laa tahwaa anfusuhum fariiqan kadzdzabuu wafariiqan yaqtuluuna","translate":{"id":"Sesungguhnya Kami telah mengambil perjanjian dari Bani Israil , dan telah Kami utus kepada mereka rasul-rasul. Tetapi setiap datang seorang rasul kepada mereka dengan membawa apa yang yang tidak diingini oleh hawa nafsu mereka, (maka) sebagian dari rasul-rasul itu mereka dustakan dan sebagian yang lain mereka bunuh.\n","en":"INDEED, We accepted a solemn pledge from the children of Israel, and We sent apostles unto them; [but] every time an apostle came unto them with anything that was not to their liking, [they rebelled:] to some of them they gave the lie, while others they would slay,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/739","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/739.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/739.mp3"]}},{"no":71,"arab":"وَحَسِبُوا أَلَّا تَكُونَ فِتْنَةٌ فَعَمُوا وَصَمُّوا ثُمَّ تَابَ اللَّهُ عَلَيْهِمْ ثُمَّ عَمُوا وَصَمُّوا كَثِيرٌ مِنْهُمْ ۚ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ","latin":"wahasibuu allaa takuuna fitnatun fa'amuu washammuu tsumma taaba allaahu 'alayhim tsumma 'amuu washammuu katsiirun minhum waallaahu bashiirun bimaa ya'maluuna","translate":{"id":"Dan mereka mengira bahwa tidak akan terjadi suatu bencanapun (terhadap mereka dengan membunuh nabi-nabi itu), maka (karena itu) mereka menjadi buta dan pekak, kemudian Allah menerima taubat mereka, kemudian kebanyakan dari mereka buta dan tuli (lagi). Dan Allah Maha Melihat apa yang mereka kerjakan.\n","en":"thinking that no harm would befall them; and so they became blind and deaf [of heart]. Thereafter God accepted their repentance: and again many of them became blind and deaf. But God sees all that they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/740","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/740.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/740.mp3"]}},{"no":72,"arab":"لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۖ وَقَالَ الْمَسِيحُ يَا بَنِي إِسْرَائِيلَ اعْبُدُوا اللَّهَ رَبِّي وَرَبَّكُمْ ۖ إِنَّهُ مَنْ يُشْرِكْ بِاللَّهِ فَقَدْ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ وَمَأْوَاهُ النَّارُ ۖ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ","latin":"laqad kafara alladziina qaaluu inna allaaha huwa almasiihu ibnu maryama waqaala almasiihu yaa banii israa-iila u'buduu allaaha rabbii warabbakum innahu man yusyrik biallaahi faqad harrama allaahu 'alayhi aljannata wama/waahu alnnaaru wamaa lilzhzhaalimiina min anshaarin","translate":{"id":"Sesungguhnya telah kafirlah orang-orang yang berkata: \"Sesungguhnya Allah ialah Al Masih putera Maryam\", padahal Al Masih (sendiri) berkata: \"Hai Bani Israil, sembahlah Allah Tuhanku dan Tuhanmu\". Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah, maka pasti Allah mengharamkan kepadanya surga, dan tempatnya ialah neraka, tidaklah ada bagi orang-orang zalim itu seorang penolongpun.\n","en":"Indeed, the truth deny they who say, \"Behold, God is the Christ, son of Mary\" - seeing that the Christ [himself] said, \"O children of Israel! Worship God [alone], who is my Sustainer as well as your Sustainer.\" Behold, whoever ascribes divinity to any being beside God, unto him will God deny paradise, and his goal shall be the fire: and such evildoers will have none to succour them!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/741","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/741.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/741.mp3"]}},{"no":73,"arab":"لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ ثَالِثُ ثَلَاثَةٍ ۘ وَمَا مِنْ إِلَٰهٍ إِلَّا إِلَٰهٌ وَاحِدٌ ۚ وَإِنْ لَمْ يَنْتَهُوا عَمَّا يَقُولُونَ لَيَمَسَّنَّ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ","latin":"laqad kafara alladziina qaaluu inna allaaha tsaalitsu tsalaatsatin wamaa min ilaahin illaa ilaahun waahidun wa-in lam yantahuu 'ammaa yaquuluuna layamassanna alladziina kafaruu minhum 'adzaabun aliimun","translate":{"id":"Sesungguhnya kafirlah orang0orang yang mengatakan: \"Bahwasanya Allah salah seorang dari yang tiga\", padahal sekali-kali tidak ada Tuhan selain dari Tuhan Yang Esa. Jika mereka tidak berhenti dari apa yang mereka katakan itu, pasti orang-orang yang kafir diantara mereka akan ditimpa siksaan yang pedih.\n","en":"Indeed, the truth deny they who say, \"Behold, God is the third of a trinity\" - seeing that there is no deity whatever save the One God. And unless they desist from this their assertion, grievous suffering is bound to befall such of them as are bent on denying the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/742","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/742.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/742.mp3"]}},{"no":74,"arab":"أَفَلَا يَتُوبُونَ إِلَى اللَّهِ وَيَسْتَغْفِرُونَهُ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ","latin":"afalaa yatuubuuna ilaa allaahi wayastaghfiruunahu waallaahu ghafuurun rahiimun","translate":{"id":"Maka mengapa mereka tidak bertaubat kepada Allah dan memohon ampun kepada-Nya ?. Dan Allah Maha Pengampun lagi Maha Penyayang.\n","en":"Will they not, then, turn towards God in repentance, and ask His forgiveness? For God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/743","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/743.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/743.mp3"]}},{"no":75,"arab":"مَا الْمَسِيحُ ابْنُ مَرْيَمَ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ وَأُمُّهُ صِدِّيقَةٌ ۖ كَانَا يَأْكُلَانِ الطَّعَامَ ۗ انْظُرْ كَيْفَ نُبَيِّنُ لَهُمُ الْآيَاتِ ثُمَّ انْظُرْ أَنَّىٰ يُؤْفَكُونَ","latin":"maa almasiihu ibnu maryama illaa rasuulun qad khalat min qablihi alrrusulu waummuhu shiddiiqatun kaanaa ya/kulaani alththha'aama unzhur kayfa nubayyinu lahumu al-aayaati tsumma unzhur annaa yu/fakuuna","translate":{"id":"Al Masih putera Maryam itu hanyalah seorang Rasul yang sesungguhnya telah berlalu sebelumnya beberapa rasul, dan ibunya seorang yang sangat benar, kedua-duanya biasa memakan makanan . Perhatikan bagaimana Kami menjelaskan kepada mereka (ahli kitab) tanda-tanda kekuasaan (Kami), kemudian perhatikanlah bagaimana mereka berpaling (dari memperhatikan ayat-ayat Kami itu).\n","en":"The Christ, son of Mary, was but an apostle: all [other] apostles had passed away before him; and his mother was one who never deviated from the truth; and they both ate food [like other mortals]. Behold how clear We make these messages unto them: and then behold how perverted are their minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/744","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/744.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/744.mp3"]}},{"no":76,"arab":"قُلْ أَتَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَلَا نَفْعًا ۚ وَاللَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","latin":"qul ata'buduuna min duuni allaahi maa laa yamliku lakum dharran walaa naf'an waallaahu huwa alssamii'u al'aliimu","translate":{"id":"Katakanlah: \"Mengapa kamu menyembah selain daripada Allah, sesuatu yang tidak dapat memberi mudharat kepadamu dan tidak (pula) memberi manfa'at ?\" Dan Allah-lah Yang Maha Mendengar lagi Maha Mengetahui.\n","en":"Say: \"Would you worship, beside God, aught that has no power either to harm or to benefit you-when God alone is all-hearing, all-knowing?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/745","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/745.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/745.mp3"]}},{"no":77,"arab":"قُلْ يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ غَيْرَ الْحَقِّ وَلَا تَتَّبِعُوا أَهْوَاءَ قَوْمٍ قَدْ ضَلُّوا مِنْ قَبْلُ وَأَضَلُّوا كَثِيرًا وَضَلُّوا عَنْ سَوَاءِ السَّبِيلِ","latin":"qul yaa ahla alkitaabi laa taghluu fii diinikum ghayra alhaqqi walaa tattabi'uu ahwaa-a qawmin qad dhalluu min qablu wa-adhalluu katsiiran wadhalluu 'an sawaa-i alssabiili","translate":{"id":"Katakanlah: \"Hai Ahli Kitab, janganlah kamu berlebih-lebihan (melampaui batas) dengan cara tidak benar dalam agamamu. Dan janganlah kamu mengikuti hawa nafsu orang-orang yang telah sesat dahulunya (sebelum kedatangan Muhammad) dan mereka telah menyesatkan kebanyakan (manusia), dan mereka tersesat dari jalan yang lurus\".\n","en":"Say: \"O followers of the Gospel! Do not overstep the bounds [of truth] in your religious beliefs; and do not follow the errant views of people who have gone astray aforetime, and have led many [others] astray, and are still straying from the right path.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/746","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/746.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/746.mp3"]}},{"no":78,"arab":"لُعِنَ الَّذِينَ كَفَرُوا مِنْ بَنِي إِسْرَائِيلَ عَلَىٰ لِسَانِ دَاوُودَ وَعِيسَى ابْنِ مَرْيَمَ ۚ ذَٰلِكَ بِمَا عَصَوْا وَكَانُوا يَعْتَدُونَ","latin":"lu'ina alladziina kafaruu min banii israa-iila 'alaa lisaani daawuuda wa'iisaa ibni maryama dzaalika bimaa 'ashaw wakaanuu ya'taduuna","translate":{"id":"Telah dila'nati orang-orang kafir dari Bani Israil dengan lisan Daud dan 'Isa putera Maryam. Yang demikian itu, disebabkan mereka durhaka dan selalu melampaui batas.\n","en":"THOSE of the children of Israel who were bent on denying the truth have [already] been cursed by the tongue of David and of Jesus, the son of Mary? this, because they rebelled [against God] and persisted in transgressing the bounds of what is right."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/747","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/747.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/747.mp3"]}},{"no":79,"arab":"كَانُوا لَا يَتَنَاهَوْنَ عَنْ مُنْكَرٍ فَعَلُوهُ ۚ لَبِئْسَ مَا كَانُوا يَفْعَلُونَ","latin":"kaanuu laa yatanaahawna 'an munkarin fa'aluuhu labi/sa maa kaanuu yaf'aluuna","translate":{"id":"Mereka satu sama lain selalu tidak melarang tindakan munkar yang mereka perbuat. Sesungguhnya amat buruklah apa yang selalu mereka perbuat itu.\n","en":"They would not prevent one another from doing whatever hateful things they did: vile indeed was what they were wont to do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/748","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/748.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/748.mp3"]}},{"no":80,"arab":"تَرَىٰ كَثِيرًا مِنْهُمْ يَتَوَلَّوْنَ الَّذِينَ كَفَرُوا ۚ لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنْفُسُهُمْ أَنْ سَخِطَ اللَّهُ عَلَيْهِمْ وَفِي الْعَذَابِ هُمْ خَالِدُونَ","latin":"taraa katsiiran minhum yatawallawna alladziina kafaruu labi/sa maa qaddamat lahum anfusuhum an sakhitha allaahu 'alayhim wafii al'adzaabi hum khaaliduuna","translate":{"id":"Kamu melihat kebanyakan dari mereka tolong-menolong dengan orang-orang yang kafir (musyrik). Sesungguhnya amat buruklah apa yang mereka sediakan untuk diri mereka, yaitu kemurkaan Allah kepada mereka; dan mereka akan kekal dalam siksaan.\n","en":"[And now] thou canst see many of them allying themselves with those who are bent on denying the truth! [So] vile indeed is what their passions make them do that God has condemned them; and in suffering shall they abide."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/749","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/749.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/749.mp3"]}},{"no":81,"arab":"وَلَوْ كَانُوا يُؤْمِنُونَ بِاللَّهِ وَالنَّبِيِّ وَمَا أُنْزِلَ إِلَيْهِ مَا اتَّخَذُوهُمْ أَوْلِيَاءَ وَلَٰكِنَّ كَثِيرًا مِنْهُمْ فَاسِقُونَ","latin":"walaw kaanuu yu/minuuna biallaahi waalnnabiyyi wamaa unzila ilayhi maa ittakhadzuuhum awliyaa-a walaakinna katsiiran minhum faasiquuna","translate":{"id":"Sekiranya mereka beriman kepada Allah, kepada Nabi (Musa) dan kepada apa yang diturunkan kepadanya (Nabi), niscaya mereka tidak akan mengambil orang-orang musyrikin itu menjadi penolong-penolong, tapi kebanyakan dari mereka adalah orang-orang yang fasik.\n","en":"For, if they [truly] believed in God and their Prophet and all that was bestowed upon him from on high, they would not take those [deniers of the truth] for their allies: but most of them are iniquitous."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/750","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/750.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/750.mp3"]}},{"no":82,"arab":"لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِلَّذِينَ آمَنُوا الْيَهُودَ وَالَّذِينَ أَشْرَكُوا ۖ وَلَتَجِدَنَّ أَقْرَبَهُمْ مَوَدَّةً لِلَّذِينَ آمَنُوا الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ ۚ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ","latin":"latajidanna asyadda alnnaasi 'adaawatan lilladziina aamanuu alyahuuda waalladziina asyrakuu walatajidanna aqrabahum mawaddatan lilladziina aamanuu alladziina qaaluu innaa nashaaraa dzaalika bi-anna minhum qissiisiina waruhbaanan wa-annahum laa yastakbiruuna","translate":{"id":"Sesungguhnya kamu dapati orang-orang yang paling keras permusuhannya terhadap orang-orang yang beriman ialah orang-orang Yahudi dan orang-orang musyrik. Dan sesungguhnya kamu dapati yang paling dekat persahabatannya dengan orang-orang yang beriman ialah orang-orang yang berkata: \"Sesungguhnya kami ini orang Nasrani\". Yang demikian itu disebabkan karena di antara mereka itu (orang-orang Nasrani) terdapat pendeta-pendeta dan rahib-rahib, (juga) karena sesungguhnya mereka tidak menymbongkan diri.\n","en":"Thou wilt surely find that, of all people, the most hostile to those who believe [in this divine writ] are the Jews as well as those who are bent on ascribing divinity to aught beside God; and thou wilt surely find that, of all people, they who say, \"Behold, we are Christians,\" come closest to feeling affection for those who believe [in this divine writ]: this is so because there are priests and monks among them, and because these are not given to arrogance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/751","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/751.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/751.mp3"]}},{"no":83,"arab":"وَإِذَا سَمِعُوا مَا أُنْزِلَ إِلَى الرَّسُولِ تَرَىٰ أَعْيُنَهُمْ تَفِيضُ مِنَ الدَّمْعِ مِمَّا عَرَفُوا مِنَ الْحَقِّ ۖ يَقُولُونَ رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ","latin":"wa-idzaa sami'uu maa unzila ilaa alrrasuuli taraa a'yunahum tafiidhu mina alddam'i mimmaa 'arafuu mina alhaqqi yaquuluuna rabbanaa aamannaa fauktubnaa ma'a alsysyaahidiina","translate":{"id":"Dan apabila mereka mendengarkan apa yang diturunkan kepada Rasul (Muhammad), kamu lihat mata mereka mencucurkan air mata disebabkan kebenaran (Al Qur'an) yang telah mereka ketahui (dari kitab-kitab mereka sendiri); seraya berkata: \"Ya Tuhan kami, kami telah beriman, maka catatlah kami bersama orang-orang yang menjadi saksi (atas kebenaran Al Qur'an dan kenabian Muhammad s.a.w.).\n","en":"For, when they come to understand what has been bestowed from on high upon this Apostle, thou canst see their eyes overflow with tears, because they recognize something of its truth; [and] they say: \"O our Sustainer! We do believe; make us one, then, with all who bear witness to the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/752","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/752.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/752.mp3"]}},{"no":84,"arab":"وَمَا لَنَا لَا نُؤْمِنُ بِاللَّهِ وَمَا جَاءَنَا مِنَ الْحَقِّ وَنَطْمَعُ أَنْ يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصَّالِحِينَ","latin":"wamaa lanaa laa nu/minu biallaahi wamaa jaa-anaa mina alhaqqi wanathma'u an yudkhilanaa rabbunaa ma'a alqawmi alshshaalihiina","translate":{"id":"Mengapa kami tidak akan beriman kepada Allah dan kepada kebenaran yang datang kepada kami, padahal kami sangat ingin agar Tuhan kami memasukkan kami ke dalam golongan orang-orang yang saleh ?\".\n","en":"And how could we fail to believe in God and in whatever truth has come unto us, when we so fervently desire that our Sustainer count us among the righteous?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/753","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/753.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/753.mp3"]}},{"no":85,"arab":"فَأَثَابَهُمُ اللَّهُ بِمَا قَالُوا جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ","latin":"fa-atsaabahumu allaahu bimaa qaaluu jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa wadzaalika jazaau almuhsiniina","translate":{"id":"Maka Allah memberi mereka pahala terhadap perkataan yang mereka ucapkan, (yaitu) surga yang mengalir sungai-sungai di dalamnya, sedang mereka kekal di dalamnya. Dan itulah balasan (bagi) orang-orang yang berbuat kebaikan (yang ikhlas keimanannya).\n","en":"And for this their belief God will reward them with gardens through which running waters flow, therein to abide: for such is the requital of the doers of good;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/754","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/754.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/754.mp3"]}},{"no":86,"arab":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ","latin":"waalladziina kafaruu wakadzdzabuu bi-aayaatinaa ulaa-ika ash-haabu aljahiimi","translate":{"id":"Dan orang-orang kafir serta mendustakan ayat-ayat Kami, mereka itulah penghuni neraka.\n","en":"whereas they who are bent on denying the truth and giving the lie to Our messages - they are destined for the blazing fire."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/755","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/755.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/755.mp3"]}},{"no":87,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلَا تَعْتَدُوا ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ","latin":"yaa ayyuhaa alladziina aamanuu laa tuharrimuu thayyibaati maa ahalla allaahu lakum walaa ta'taduu inna allaaha laa yuhibbu almu'tadiina","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu haramkan apa-apa yang baik yang telah Allah halalkan bagi kamu, dan janganlah kamu melampaui batas. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas.\n","en":"O YOU who have attained to faith! Do not deprive yourselves of the good things of life which God has made lawful to you, but do not transgress the bounds of what is right: verily, God does not love those who transgress the bounds of what is right."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/756","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/756.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/756.mp3"]}},{"no":88,"arab":"وَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا ۚ وَاتَّقُوا اللَّهَ الَّذِي أَنْتُمْ بِهِ مُؤْمِنُونَ","latin":"wakuluu mimmaa razaqakumu allaahu halaalan thayyiban waittaquu allaaha alladzii antum bihi mu/minuuna","translate":{"id":"Dan makanlah makanan yang halal lagi baik dari apa yang Allah telah rezekikan kepadamu, dan bertakwalah kepada Allah yang kamu beriman kepada-Nya.\n","en":"Thus, partake of the lawful, good things which God grants you as sustenance, and be conscious of God, in whom you believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/757","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/757.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/757.mp3"]}},{"no":89,"arab":"لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَٰكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمُ الْأَيْمَانَ ۖ فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ ۖ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ ۚ ذَٰلِكَ كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ ۚ وَاحْفَظُوا أَيْمَانَكُمْ ۚ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَشْكُرُونَ","latin":"laa yu-aakhidzukumu allaahu biallaghwi fii aymaanikum walaakin yu-aakhidzukum bimaa 'aqqadtumu al-aymaana fakaffaaratuhu ith'aamu 'asyarati masaakiina min awsathi maa tuth'imuuna ahliikum aw kiswatuhum aw tahriiru raqabatin faman lam yajid fashiyaamu tsalaatsati ayyaamin dzaalika kaffaaratu aymaanikum idzaa halaftum waihfazhuu aymaanakum kadzaalika yubayyinu allaahu lakum aayaatihi la'allakum tasykuruuna","translate":{"id":"Allah tidak menghukum kamu disebabkan sumpah-sumpahmu yang tidak dimaksud (untuk bersumpah), tetapi Dia menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja, maka kaffarat (melanggar) sumpah itu, ialah memberi makan sepuluh orang miskin, yaitu dari makanan yang biasa kamu berikan kepada keluargamu, atau memberi pakaian kepada mereka atau memerdekakan seorang budak. Barang siapa tidak sanggup melakukan yang demikian, maka kaffaratnya puasa selama tiga hari. Yang demikian itu adalah kaffarat sumpah-sumpahmu bila kamu bersumpah (dan kamu langgar). Dan jagalah sumpahmu. Demikianlah Allah menerangkan kepadamu hukum-hukum-Nya agar kamu bersyukur (kepada-Nya).\n","en":"GOD will not take you to task for oaths which you may have uttered without thought, but He will take you to task for oaths which you have sworn in earnest. Thus, the breaking of an oath must be atoned for by feeding ten needy persons with more or less the same food as you are wont to give to your own families, or by clothing them, or by freeing a human being from bondage; and he who has not the wherewithal shall fast for three days [instead]. This shall be the atonement for your oaths whenever you have sworn [and broken them]. But be mindful of your oaths!' Thus God makes clear unto you His messages, so that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/758","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/758.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/758.mp3"]}},{"no":90,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنْصَابُ وَالْأَزْلَامُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ لَعَلَّكُمْ تُفْلِحُونَ","latin":"yaa ayyuhaa alladziina aamanuu innamaa alkhamru waalmaysiru waal-anshaabu waal-azlaamu rijsun min 'amali alsysyaythaani faijtanibuuhu la'allakum tuflihuuna","translate":{"id":"Hai orang-orang yang beriman, sesungguhnya (meminum) khamar, berjudi, (berkorban untuk) berhala, mengundi nasib dengan panah , adalah termasuk perbuatan syaitan. Maka jauhilah perbuatan-perbuatan itu agar kamu mendapat keberuntungan.\n","en":"O YOU who have attained to faith! Intoxicants, and games of chance, and idolatrous practices, and the divining of the future are but a loathsome evil of Satan's doing:' shun it, then, so that you might attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/759","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/759.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/759.mp3"]}},{"no":91,"arab":"إِنَّمَا يُرِيدُ الشَّيْطَانُ أَنْ يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللَّهِ وَعَنِ الصَّلَاةِ ۖ فَهَلْ أَنْتُمْ مُنْتَهُونَ","latin":"innamaa yuriidu alsysyaythaanu an yuuqi'a baynakumu al'adaawata waalbaghdhaa-a fii alkhamri waalmaysiri wayashuddakum 'an dzikri allaahi wa'ani alshshalaati fahal antum muntahuuna","translate":{"id":"Sesungguhnya syaitan itu bermaksud hendak menimbulkan permusuhan dan kebencian di antara kamu lantaran (meminum) khamar dan berjudi itu, dan menghalangi kamu dari mengingat Allah dan sembahyang; maka berhentilah kamu (dari mengerjakan pekerjaan itu).\n","en":"By means of intoxicants and games of chance Satan seeks only to sow enmity and hatred among you, and to turn you away from the remembrance of God and from prayer. Will you not, then, desist?'"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/760","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/760.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/760.mp3"]}},{"no":92,"arab":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَاحْذَرُوا ۚ فَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ","latin":"wa-athii'uu allaaha wa-athii'uu alrrasuula waihtsaruu fa-in tawallaytum fai'lamuu annamaa 'alaa rasuulinaa albalaaghu almubiinu","translate":{"id":"Dan ta'atlah kamu kepada Allah dan ta'atlah kamu kepada Rasul-(Nya) dan berhati-hatilah. Jika kamu berpaling, maka ketahuilah bahwa sesungguhnya kewajiban Rasul Kami, hanyalah menyampaikan (amanat Allah) dengan terang.\n","en":"Hence, pay heed unto God, and pay heed unto the Apostle, and be ever on your guard [against evil]; and if you turn away, then know that Our Apostle's only duty is a clear delivery of the message [entrusted to him]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/761","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/761.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/761.mp3"]}},{"no":93,"arab":"لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ ثُمَّ اتَّقَوْا وَآمَنُوا ثُمَّ اتَّقَوْا وَأَحْسَنُوا ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ","latin":"laysa 'alaa alladziina aamanuu wa'amiluu alshshaalihaati junaahun fiimaa tha'imuu idzaa maa ittaqaw waaamanuu wa'amiluu alshshaalihaati tsumma ittaqaw waaamanuu tsumma ittaqaw wa-ahsanuu waallaahu yuhibbu almuhsiniina","translate":{"id":"Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan yang saleh karena memakan makanan yang telah mereka makan dahulu, apabila mereka bertakwa serta beriman, dan mengerjakan amalan-amalan yang saleh, kemudian mereka tetap bertakwa dan beriman, kemudian mereka (tetap juga) bertakwa dan berbuat kebajikan. Dan Allah menyukai orang-orang yang berbuat kebajikan.\n","en":"Those who have attained to faith and do righteous deeds incur no sin by partaking of whatever they may, so long as they are conscious of God and [truly] believe and do righteous deeds, and continue to be conscious of God and to believe, and grow ever more conscious of God, and persevere in doing good: for God loves the doers of good."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/762","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/762.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/762.mp3"]}},{"no":94,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ لِيَعْلَمَ اللَّهُ مَنْ يَخَافُهُ بِالْغَيْبِ ۚ فَمَنِ اعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُ عَذَابٌ أَلِيمٌ","latin":"yaa ayyuhaa alladziina aamanuu layabluwannakumu allaahu bisyay-in mina alshshaydi tanaaluhu aydiikum warimaahukum liya'lama allaahu man yakhaafuhu bialghaybi famani i'tadaa ba'da dzaalika falahu 'adzaabun aliimun","translate":{"id":"Hai orang-orang yang beriman, sesungguhnya Allah akan menguji kamu dengan sesuatu dari binatang buruan yang mudah didapat oleh tangan dan tombakmu supaya Allah mengetahui orang yang takut kepada-Nya, biarpun ia tidak dapat melihat-Nya. Barang siapa yang melanggar batas sesudah itu, maka baginya azab yang pedih.\n","en":"O YOU who have attained to faith! Most certainly God will try you by means of the game which may come within the reach of your hands and your weapons [while you are on pilgrimage], so that God might mark out those who fear Him although He is beyond the reach of human perception. And as for him who, after all this, transgresses the bounds of what is right-grievous suffering awaits him!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/763","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/763.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/763.mp3"]}},{"no":95,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنْتُمْ حُرُمٌ ۚ وَمَنْ قَتَلَهُ مِنْكُمْ مُتَعَمِّدًا فَجَزَاءٌ مِثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ طَعَامُ مَسَاكِينَ أَوْ عَدْلُ ذَٰلِكَ صِيَامًا لِيَذُوقَ وَبَالَ أَمْرِهِ ۗ عَفَا اللَّهُ عَمَّا سَلَفَ ۚ وَمَنْ عَادَ فَيَنْتَقِمُ اللَّهُ مِنْهُ ۗ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ","latin":"yaa ayyuhaa alladziina aamanuu laa taqtuluu alshshayda wa-antum hurumun waman qatalahu minkum muta'ammidan fajazaaun mitslu maa qatala mina alnna'ami yahkumu bihi dzawaa 'adlin minkum hadyan baaligha alka'bati aw kaffaaratun tha'aamu masaakiina aw 'adlu dzaalika shiyaaman liyadzuuqa wabaala amrihi 'afaa allaahu 'ammaa salafa waman 'aada fayantaqimu allaahu minhu waallaahu 'aziizun dzuu intiqaamin","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu membunuh binatang buruan , ketika kamu sedang ihram. Barangsiapa di antara kamu membunuhnya dengan sengaja, maka dendanya ialah mengganti dengan binatang ternak seimbang dengan buruan yang dibunuhnya, menurut putusan dua orang yang adil di antara kamu sebagai had-yad yang dibawa sampai ke Ka'bah atau (dendanya) membayar kaffarat dengan memberi makan orang-orang miskin atau berpuasa seimbang dengan makanan yang dikeluarkan itu , supaya dia merasakan akibat buruk dari perbuatannya. Allah telah memaafkan apa yang telah lalu . Dan barangsiapa yang kembali mengerjakannya, niscaya Allah akan menyiksanya. Allah Maha Kuasa lagi mempunyai (kekuasaan untuk) menyiksa.\n","en":"O you who have attained to faith! Kill no game while you are in the state of pilgrimage. And whoever of you kills it intentionally, [shall make] amends in cattle equivalent to what he has killed - with two persons of probity giving their judgment thereon- to be brought as an offering to the Ka`bah; or else he may atone for his sin by feeding the needy, or by the equivalent thereof in fasting: [this,] in order that. he taste the full gravity of his deed, [while] God shall have effaced the past. But whoever does it again, God will inflict His retribution on him: for God is almighty, an avenger of evil."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/764","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/764.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/764.mp3"]}},{"no":96,"arab":"أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهُ مَتَاعًا لَكُمْ وَلِلسَّيَّارَةِ ۖ وَحُرِّمَ عَلَيْكُمْ صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا ۗ وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ","latin":"uhilla lakum shaydu albahri watha'aamuhu mataa'an lakum walilssayyaarati wahurrima 'alaykum shaydu albarri maa dumtum huruman waittaquu allaaha alladzii ilayhi tuhsyaruuna","translate":{"id":"Dihalalkan bagimu binatang buruan laut dan makanan (yang berasal) dari laut sebagai makanan yang lezat bagimu, dan bagi orang-orang yang dalam perjalanan; dan diharamkan atasmu (menangkap) binatang buruan darat, selama kamu dalam ihram. Dan bertakwalah kepada Allah Yang kepada-Nyalah kamu akan dikumpulkan.\n","en":"Lawful to you is all water-game, and what the sea brings forth, as a provision for you [who are settled] as well as for travellers, although you are forbidden to hunt on land while you are in the state of pilgrimage. And be conscious of God, unto whom you shall be gathered."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/765","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/765.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/765.mp3"]}},{"no":97,"arab":"جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيَامًا لِلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلَائِدَ ۚ ذَٰلِكَ لِتَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"ja'ala allaahu alka'bata albayta alharaama qiyaaman lilnnaasi waalsysyahra alharaama waalhadya waalqalaa-ida dzaalika lita'lamuu anna allaaha ya'lamu maa fii alssamaawaati wamaa fii al-ardhi wa-anna allaaha bikulli syay-in 'aliimun","translate":{"id":"Allah telah menjadikan Ka'bah, rumah suci itu sebagai pusat (peribadatan dan urusan dunia) bagi manusia , dan (demikian pula) bulan Haram , had-ya , qalaid . (Allah menjadikan yang) demikian itu agar kamu tahu, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan bahwa sesungguhnya Allah Maha Mengetahui segala sesuatu.\n","en":"God has laid down that the Ka'bah, the Inviolable Temple, shall be a symbol for all mankind; and [so, too] the sacred month [of pilgrimage] and the garlanded offerings [are symbols] meant to make you aware that God is aware of all that is in the heavens and all that is on earth, and that God has full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/766","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/766.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/766.mp3"]}},{"no":98,"arab":"اعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"i'lamuu anna allaaha syadiidu al'iqaabi wa-anna allaaha ghafuurun rahiimun","translate":{"id":"Ketahuilah, bahwa sesungguhnya Allah amat berat siksa-Nya dan bahwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"Know that God is severe in retribution -and that God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/767","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/767.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/767.mp3"]}},{"no":99,"arab":"مَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ ۗ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ","latin":"maa 'alaa alrrasuuli illaa albalaaghu waallaahu ya'lamu maa tubduuna wamaa taktumuuna","translate":{"id":"Kewajiban Rasul tidak lain hanyalah menyampaikan, dan Allah mengetahui apa yang kamu lahirkan dan apa yang kamu sembunyikan.\n","en":"No more is the Apostle bound to do than deliver the message [entrusted to him]: and God knows all that you do openly, and all that you would conceal."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/768","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/768.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/768.mp3"]}},{"no":100,"arab":"قُلْ لَا يَسْتَوِي الْخَبِيثُ وَالطَّيِّبُ وَلَوْ أَعْجَبَكَ كَثْرَةُ الْخَبِيثِ ۚ فَاتَّقُوا اللَّهَ يَا أُولِي الْأَلْبَابِ لَعَلَّكُمْ تُفْلِحُونَ","latin":"qul laa yastawii alkhabiitsu waalththhayyibu walaw a'jabaka katsratu alkhabiitsi faittaquu allaaha yaa ulii al-albaabi la'allakum tuflihuuna","translate":{"id":"Katakanlah: \"Tidak sama yang buruk dengan yang baik, meskipun banyaknya yang buruk itu menarik hatimu, maka bertakwalah kepada Allah hai orang-orang berakal, agar kamu mendapat keberuntungan.\"\n","en":"Say: \"There is no comparison between the bad things and the good things, even though very many of the bad things may please thee greatly. Be, then, conscious of God, O you who are endowed with insight, so that you might attain to a happy state!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/769","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/769.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/769.mp3"]}},{"no":101,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ وَإِنْ تَسْأَلُوا عَنْهَا حِينَ يُنَزَّلُ الْقُرْآنُ تُبْدَ لَكُمْ عَفَا اللَّهُ عَنْهَا ۗ وَاللَّهُ غَفُورٌ حَلِيمٌ","latin":"yaa ayyuhaa alladziina aamanuu laa tas-aluu 'an asyyaa-a in tubda lakum tasu/kum wa-in tas-aluu 'anhaa hiina yunazzalu alqur-aanu tubda lakum 'afaa allaahu 'anhaa waallaahu ghafuurun haliimun","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu menanyakan (kepada Nabimu) hal-hal yang jika diterangkan kepadamu akan menyusahkan kamu dan jika kamu menanyakan di waktu Al Qur'an itu diturunkan, niscaya akan diterangkan kepadamu, Allah mema'afkan (kamu) tentang hal-hal itu. Allah Maha Pengampun lagi Maha Penyantun.\n","en":"O YOU who have attained to faith! Do not ask about matters which, if they were to be made manifest to you [in terms of law], might cause you hardship; for, if you should ask about them while the Qur'an is being revealed, they might [indeed] be made manifest to you [as laws]. God has absolved [you from any obligation] in this respect: for God is much-forgiving, forbearing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/770","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/770.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/770.mp3"]}},{"no":102,"arab":"قَدْ سَأَلَهَا قَوْمٌ مِنْ قَبْلِكُمْ ثُمَّ أَصْبَحُوا بِهَا كَافِرِينَ","latin":"qad sa-alahaa qawmun min qablikum tsumma ashbahuu bihaa kaafiriina","translate":{"id":"Sesungguhnya telah ada segolongsn manusia sebelum kamu menanyakan hal-hal yang serupa itu (kepada Nabi mereka), kemudian mereka tidak percaya kepadanya .\n","en":"People before your time have indeed asked such questions-and in result thereof have come to deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/771","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/771.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/771.mp3"]}},{"no":103,"arab":"مَا جَعَلَ اللَّهُ مِنْ بَحِيرَةٍ وَلَا سَائِبَةٍ وَلَا وَصِيلَةٍ وَلَا حَامٍ ۙ وَلَٰكِنَّ الَّذِينَ كَفَرُوا يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ ۖ وَأَكْثَرُهُمْ لَا يَعْقِلُونَ","latin":"maa ja'ala allaahu min bahiiratin walaa saa-ibatin walaa washiilatin walaa haamin walaakinna alladziina kafaruu yaftaruuna 'alaa allaahi alkadziba wa-aktsaruhum laa ya'qiluuna","translate":{"id":"Allah sekali-kali tidak pernah mensyari'atkan adanya bahiirah , saaibah , washiilah dan haam . Akan tetapi orang-orang kafir membuat-buat kedustaan terhadap Allah, dan kebanyakan mereka tidak mengerti.\n","en":"IT IS NOT of God's ordaining that certain kinds of cattle should be marked out by superstition and set aside from the use of man; yet those who are bent on denying the truth attribute their own lying inventions to God. And most of them never use their reason:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/772","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/772.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/772.mp3"]}},{"no":104,"arab":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا إِلَىٰ مَا أَنْزَلَ اللَّهُ وَإِلَى الرَّسُولِ قَالُوا حَسْبُنَا مَا وَجَدْنَا عَلَيْهِ آبَاءَنَا ۚ أَوَلَوْ كَانَ آبَاؤُهُمْ لَا يَعْلَمُونَ شَيْئًا وَلَا يَهْتَدُونَ","latin":"wa-idzaa qiila lahum ta'aalaw ilaa maa anzala allaahu wa-ilaa alrrasuuli qaaluu hasbunaa maa wajadnaa 'alayhi aabaa-anaa awa law kaana aabaauhum laa ya'lamuuna syay-an walaa yahtaduuna","translate":{"id":"Apabila dikatakan kepada mereka: \"Marilah mengikuti apa yang diturunkan Allah dan mengikuti Rasul\". Mereka menjawab: \"Cukuplah untuk kami apa yang kami dapati bapak-bapak kami mengerjakannya\". Dan apakah mereka itu akan mengikuti nenek moyang mereka walaupun nenek moyang mereka itu tidak mengetahui apa-apa dan tidak (pula) mendapat petunjuk ?.\n","en":"for when they are told, \"Come unto that which God has bestowed from on high, and unto the Apostle\" - they answer, \"Enough for us is that which we found our forefathers believing in and doing.\" Why, even though their forefathers knew nothing, and were devoid of all guidance?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/773","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/773.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/773.mp3"]}},{"no":105,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ ۖ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ ۚ إِلَى اللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"yaa ayyuhaa alladziina aamanuu 'alaykum anfusakum laa yadhurrukum man dhalla idza ihtadaytum ilaa allaahi marji'ukum jamii'an fayunabbi-ukum bimaa kuntum ta'maluuna","translate":{"id":"Hai orang-orang yang beriman, jagalah dirimu; tiadalah orang yang sesat itu akan memberi mudharat kepadamu apabila kamu telah mendapat petunjuk . Hanya kepada Allah kamu kembali semuanya, maka Dia akan menerangkan kepadamu apa yang telah kamu kerjakan.\n","en":"O you who have attained to faith! It is [but] for your own selves that you are responsible: those who go astray can do you no harm if you [yourselves] are on the right path. Unto God you all must return: and then He will make you [truly] understand all that you were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/774","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/774.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/774.mp3"]}},{"no":106,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ حِينَ الْوَصِيَّةِ اثْنَانِ ذَوَا عَدْلٍ مِنْكُمْ أَوْ آخَرَانِ مِنْ غَيْرِكُمْ إِنْ أَنْتُمْ ضَرَبْتُمْ فِي الْأَرْضِ فَأَصَابَتْكُمْ مُصِيبَةُ الْمَوْتِ ۚ تَحْبِسُونَهُمَا مِنْ بَعْدِ الصَّلَاةِ فَيُقْسِمَانِ بِاللَّهِ إِنِ ارْتَبْتُمْ لَا نَشْتَرِي بِهِ ثَمَنًا وَلَوْ كَانَ ذَا قُرْبَىٰ ۙ وَلَا نَكْتُمُ شَهَادَةَ اللَّهِ إِنَّا إِذًا لَمِنَ الْآثِمِينَ","latin":"yaa ayyuhaa alladziina aamanuu syahaadatu baynikum idzaa hadhara ahadakumu almawtu hiina alwashiyyati itsnaani dzawaa 'adlin minkum aw aakharaani min ghayrikum in antum dharabtum fii al-ardhi fa-ashaabatkum mushiibatu almawti tahbisuunahumaa min ba'di alshshalaati fayuqsimaani biallaahi ini irtabtum laa nasytarii bihi tsamanan walaw kaana dzaa qurbaa walaa naktumu syahaadata allaahi innaa idzan lamina al-aatsimiina","translate":{"id":"Hai orang-orang yang beriman, apabila salah seorang kamu menghadapi kematian, sedang dia akan berwasiat, maka hendaklah (wasiat itu) disaksikan oleh dua orang yang adil di antara kamu, atau dua orang yang berlainan agama dengan kamu , jika kamu dalam perjalanan dimuka bumi lalu kamu ditimpa bahaya kematian. Kamu tahan kedua saksi itu sesudah sembahyang (untuk bersumpah), lalu mereka keduanya bersumpah dengan nama Allah, jika kamu ragu-ragu: \"(Demi Allah) kami tidak akan membeli dengan sumpah ini harga yang sedikit (untuk kepentingan seseorang), walaupun dia karib kerabat, dan tidak (pula) kami menyembunyikan persaksian Allah; sesungguhnya kami kalau demikian tentulah termasuk orang-orang yang berdosa\".\n","en":"O YOU who have attained to faith! Let there be witnesses to what you do when death approaches you and you are about to make bequests: two persons of probity from among your own people, or -if the pangs of death come upon you while you are travelling far from home -two other persons from [among people] other than your own. Take hold of the two after having prayed; and if you have any doubt in your mind, let each of them swear by God, \"We shall not sell this [our word] for any price, even though it were [for the sake of] a near kinsman; and neither shall we conceal aught of what we have witnessed before God -or else, may we indeed be counted among the sinful.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/775","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/775.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/775.mp3"]}},{"no":107,"arab":"فَإِنْ عُثِرَ عَلَىٰ أَنَّهُمَا اسْتَحَقَّا إِثْمًا فَآخَرَانِ يَقُومَانِ مَقَامَهُمَا مِنَ الَّذِينَ اسْتَحَقَّ عَلَيْهِمُ الْأَوْلَيَانِ فَيُقْسِمَانِ بِاللَّهِ لَشَهَادَتُنَا أَحَقُّ مِنْ شَهَادَتِهِمَا وَمَا اعْتَدَيْنَا إِنَّا إِذًا لَمِنَ الظَّالِمِينَ","latin":"fa-in 'utsira 'alaa annahumaa istahaqqaa itsman faaakharani yaquumaani maqaamahumaa mina alladziina istahaqqa 'alayhimu al-awlayaani fayuqsimaani biallaahi lasyahaadatunaa ahaqqu min syahaadatihimaa wamaa i'tadaynaa innaa idzan lamina alzhzhaalimiina","translate":{"id":"Jika diketahui bahwa kedua (saksi itu) membuat dosa , maka dua orang yang lain di antara ahli waris yang berhak yang lebih dekat kepada orang yang meninggal (memajukan tuntutan) untuk menggantikannya, lalu keduanya bersumpah dengan nama Allah: \"Sesungguhnya persaksian kami labih layak diterima daripada persaksian kedua saksi itu, dan kami tidak melanggar batas, sesungguhnya kami kalau demikian tentulah termasuk orang yang menganiaya diri sendiri\".\n","en":"But if afterwards it should come to light that the two [witnesses] have become guilty of [this very] sin, then two others - from among those whom the two former have deprived of their right - shall take their place and shall swear by God, \"Our testimony is indeed truer than the testimony of these two, and we have not transgressed the bounds of what is right - or else, may we indeed be counted among the evildoers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/776","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/776.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/776.mp3"]}},{"no":108,"arab":"ذَٰلِكَ أَدْنَىٰ أَنْ يَأْتُوا بِالشَّهَادَةِ عَلَىٰ وَجْهِهَا أَوْ يَخَافُوا أَنْ تُرَدَّ أَيْمَانٌ بَعْدَ أَيْمَانِهِمْ ۗ وَاتَّقُوا اللَّهَ وَاسْمَعُوا ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","latin":"dzaalika adnaa an ya/tuu bialsysyahaadati 'alaa wajhihaa aw yakhaafuu an turadda aymaanun ba'da aymaanihim waittaquu allaaha waisma'uu waallaahu laa yahdii alqawma alfaasiqiina","translate":{"id":"Itu lebih dekat untuk (menjadikan para saksi) mengemukakan persaksiannya menurut apa yang sebenarnya, dan (lebih dekat untuk menjadikan mereka) merasa takut akan dikembalikan sumpahnya (kepada ahli waris) sesudah mereka bersumpah . Dan bertakwalah kepada Allah dan dengarkanlah (perintah-Nya). Allah tidak memberi petunjuk kepada orang-orang yang fasik.\n","en":"Thus it will be more likely that people will offer testimony in accordance with the truth-or else they will [have cause to] fear that their oaths will be refuted by the oaths of others. Be, then, conscious of God, and hearken [unto Him]: for God does not bestow His guidance upon iniquitous folk."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/777","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/777.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/777.mp3"]}},{"no":109,"arab":"يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ مَاذَا أُجِبْتُمْ ۖ قَالُوا لَا عِلْمَ لَنَا ۖ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ","latin":"yawma yajma'u allaahu alrrusula fayaquulu maatsaa ujibtum qaaluu laa 'ilma lanaa innaka anta 'allaamu alghuyuubi","translate":{"id":"(Ingatlah), hari di waktu Allah mengumpulkan para rasul lalu Allah bertanya (kepada mereka): \"Apa jawaban kaummu terhadap (seruan)mu ?\". Para rasul menjawab: \"Tidak ada pengetahuan kami (tentang itu); sesungguhnya Engkau-lah yang mengetahui perkara yang ghaib\".\n","en":"ON THE DAY when God shall assemble all the apostles and shall ask, \"What response did you receive?\" -they will answer, \"We have no knowledge; verily, it is Thou alone who fully knowest all the things that are beyond the reach of a created being's perception.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/778","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/778.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/778.mp3"]}},{"no":110,"arab":"إِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ اذْكُرْ نِعْمَتِي عَلَيْكَ وَعَلَىٰ وَالِدَتِكَ إِذْ أَيَّدْتُكَ بِرُوحِ الْقُدُسِ تُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا ۖ وَإِذْ عَلَّمْتُكَ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنْجِيلَ ۖ وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ بِإِذْنِي فَتَنْفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي ۖ وَتُبْرِئُ الْأَكْمَهَ وَالْأَبْرَصَ بِإِذْنِي ۖ وَإِذْ تُخْرِجُ الْمَوْتَىٰ بِإِذْنِي ۖ وَإِذْ كَفَفْتُ بَنِي إِسْرَائِيلَ عَنْكَ إِذْ جِئْتَهُمْ بِالْبَيِّنَاتِ فَقَالَ الَّذِينَ كَفَرُوا مِنْهُمْ إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ","latin":"idz qaala allaahu yaa 'iisaa ibna maryama udzkur ni'matii 'alayka wa'alaa waalidatika idz ayyadtuka biruuhi alqudusi tukallimu alnnaasa fii almahdi wakahlan wa-idz 'allamtuka alkitaaba waalhikmata waalttawraata waal-injiila wa-idz takhluqu mina alththhiini kahay-ati alththhayri bi-idznii fatanfukhu fiihaa fatakuunu thayran bi-idznii watubri-u al-akmaha waal-abrasha bi-idznii wa-idz tukhriju almawtaa bi-idznii wa-idz kafaftu banii israa-iila 'anka idz ji/tahum bialbayyinaati faqaala alladziina kafaruu minhum in haadzaa illaa sihrun mubiinun","translate":{"id":"(Ingatlah), ketika Allah mengatakan: \"Hai 'Isa putra Maryam, ingatlah ni'mat-Ku kepadamu dan kepada ibumu di waktu Aku menguatkan kamu dengan ruhul qudus. Kamu dapat berbicara dengan manusia di waktu masih dalam buaian dan sesudah dewasa; dan (ingatlah) di waktu Aku mengajar kamu menulis, hikmah, Taurat dan Injil, dan (ingatlah pula) diwaktu kamu membentuk dari tanah (suatu bentuk) yang berupa burung dengan ijin-Ku, kemudian kamu meniup kepadanya, lalu bentuk itu menjadi burung (yang sebenarnya) dengan seizin-Ku. Dan (ingatlah) di waktu kamu menyembuhkan orang yang buta sejak dalam kandungan ibu dan orang yang berpenyakit sopak dengan seizin-Ku, dan (ingatlah) di waktu kamu mengeluarkan orang mati dari kubur (menjadi hidup) dengan seizin-Ku, dan (ingatlah) di waktu Aku menghalangi Bani Israil (dari keinginan mereka membunuh kamu) di kala kamu mengemukakan kepada mereka keterangan-keterangan yang nyata, lalu orang-orang kafir diantara mereka berkata: \"Ini tidak lain melainkan sihir yang nyata\".\n","en":"Lo! God will say: \"O Jesus, son of Mary! Remember the blessings which I bestowed upon thee and thy mother-how I strengthened thee with holy inspiration, so that thou couldst speak unto men in thy cradle, and as a grown man; and how I imparted unto thee revelation and wisdom, including the Torah and the Gospel; and how by My leave thou didst create out of clay, as it were, the shape of [thy followers'] destiny, and then didst breathe into it, so that it might become, by My leave, [their] destiny; and how thou didst heal the blind and the leper by My leave, and how thou didst raise the dead by My leave; and how I prevented the children of Israel from harming thee when thou camest unto them with all evidence of the truth, and [when] those of them who were bent on denying the truth were saying, `This is clearly nothing but deception!\"'"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/779","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/779.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/779.mp3"]}},{"no":111,"arab":"وَإِذْ أَوْحَيْتُ إِلَى الْحَوَارِيِّينَ أَنْ آمِنُوا بِي وَبِرَسُولِي قَالُوا آمَنَّا وَاشْهَدْ بِأَنَّنَا مُسْلِمُونَ","latin":"wa-idz awhaytu ilaa alhawaariyyiina an aaminuu bii wabirasuulii qaaluu aamannaa waisyhad bi-annanaa muslimuuna","translate":{"id":"Dan (ingatlah), ketika Aku ilhamkan kepada pengikut 'Isa yang setia: \"Berimanlah kamu kepada-Ku dan kepada rasul-Ku\". Mereka menjawab: Kami telah beriman dan saksikanlah (wahai rasul) bahwa sesungguhnya kami adalah orang-orang yang patuh (kepada seruanmu)\".\n","en":"AND [remember the time] when I inspired the white-garbed ones: Believe in Me and in My Apostle!\" They answered: \"We believe; and bear Thou witness that we have surrendered ourselves [unto Thee].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/780","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/780.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/780.mp3"]}},{"no":112,"arab":"إِذْ قَالَ الْحَوَارِيُّونَ يَا عِيسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَنْ يُنَزِّلَ عَلَيْنَا مَائِدَةً مِنَ السَّمَاءِ ۖ قَالَ اتَّقُوا اللَّهَ إِنْ كُنْتُمْ مُؤْمِنِينَ","latin":"idz qaala alhawaariyyuuna yaa 'iisaa ibna maryama hal yastathii'u rabbuka an yunazzila 'alaynaa maa-idatan mina alssamaa-i qaala ittaquu allaaha in kuntum mu/miniina","translate":{"id":"(Ingatlah), ketika pengikut-pengikut 'Isa berkata: \"Hai 'Isa putera Maryam, sanggupkah Tuhanmu menurunkan hidangan dari langit kepada kami ?\". 'Isa menjawab: \"Bertakwalah kepada Allah jika kamu betul-betul orang yang beriman\".\n","en":"[And,] lo, the white-garbed ones said: \"O Jesus, son of Mary! Could thy Sustainer send down unto us a repast from heaven?\" [Jesus] answered: \"Be conscious of God, if you are [truly] believers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/781","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/781.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/781.mp3"]}},{"no":113,"arab":"قَالُوا نُرِيدُ أَنْ نَأْكُلَ مِنْهَا وَتَطْمَئِنَّ قُلُوبُنَا وَنَعْلَمَ أَنْ قَدْ صَدَقْتَنَا وَنَكُونَ عَلَيْهَا مِنَ الشَّاهِدِينَ","latin":"qaaluu nuriidu an na/kula minhaa watathma-inna quluubunaa wana'lama an qad shadaqtanaa wanakuuna 'alayhaa mina alsysyaahidiina","translate":{"id":"Mereka berkata: \"Kami ingin memakan hidangan itu dan supaya tenteram hati kami dan supaya kami yakin bahwa kamu telah berkata benar kepada kami, dan kami menjadi orang-orang yang menyaksikan hidangan itu\".\n","en":"Said they: \"We desire to partake thereof, so that our hearts might be set fully at rest, and that we might know that thou hast spoken the truth to us, and that we might be of those who bear witness thereto!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/782","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/782.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/782.mp3"]}},{"no":114,"arab":"قَالَ عِيسَى ابْنُ مَرْيَمَ اللَّهُمَّ رَبَّنَا أَنْزِلْ عَلَيْنَا مَائِدَةً مِنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِأَوَّلِنَا وَآخِرِنَا وَآيَةً مِنْكَ ۖ وَارْزُقْنَا وَأَنْتَ خَيْرُ الرَّازِقِينَ","latin":"qaala 'iisaa ibnu maryama allaahumma rabbanaa anzil 'alaynaa maa-idatan mina alssamaa-i takuunu lanaa 'iidan li-awwalinaa waaakhirinaa waaayatan minka waurzuqnaa wa-anta khayru alrraaziqiina","translate":{"id":"Isa putera Maryam berdo'a: \"Ya Tuhan kami turunkanlah kiranya kepada kami suatu hidangan dari langit (yang hari turunnya) akan menjadi hari raya bagi kami yaitu orang-orang yang bersama kami dan yang datang sesudah kami, dan menjadi tanda bagi kekuasaan Engkau; beri rzekilah kami, dan Engkaulah pemberi rezki Yang Paling Utama\".\n","en":"Said Jesus, the son of Mary: \"O God, our Sustainer! Send down upon us a repast from heaven: it shall be an ever-recurring feast for us - for the first and the last of us -and a sign from Thee. And provide us our sustenance, for Thou art the best of providers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/783","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/783.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/783.mp3"]}},{"no":115,"arab":"قَالَ اللَّهُ إِنِّي مُنَزِّلُهَا عَلَيْكُمْ ۖ فَمَنْ يَكْفُرْ بَعْدُ مِنْكُمْ فَإِنِّي أُعَذِّبُهُ عَذَابًا لَا أُعَذِّبُهُ أَحَدًا مِنَ الْعَالَمِينَ","latin":"qaala allaahu innii munazziluhaa 'alaykum faman yakfur ba'du minkum fa-innii u'adzdzibuhu 'adzaaban laa u'adzdzibuhu ahadan mina al'aalamiina","translate":{"id":"Allah berfirman: \"Sesungguhnya Aku akan menurunkan hidangan itu kepadamu, barangsiapa yang kafir di antaramu sesudah (turun hidangan itu), maka sesungguhnya Aku akan menyiksanya dengan siksaan yang tidak pernah Aku timpakan kepada seorangpun di antara umat manusia\".\n","en":"God answered: \"Verily, I [always] do send it down unto you: and so, if any of you should henceforth deny [this] truth, on him, behold, will I inflict suffering the like of which I have never [yet] inflicted upon anyone in the world!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/784","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/784.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/784.mp3"]}},{"no":116,"arab":"وَإِذْ قَالَ اللَّهُ يَا عِيسَى ابْنَ مَرْيَمَ أَأَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَٰهَيْنِ مِنْ دُونِ اللَّهِ ۖ قَالَ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ لِي بِحَقٍّ ۚ إِنْ كُنْتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ ۚ تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِي نَفْسِكَ ۚ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ","latin":"wa-idz qaala allaahu yaa 'iisaa ibna maryama a-anta qulta lilnnaasi ittakhidzuunii waummiya ilaahayni min duuni allaahi qaala subhaanaka maa yakuunu lii an aquula maa laysa lii bihaqqin in kuntu qultuhu faqad 'alimtahu ta'lamu maa fii nafsii walaa a'lamu maa fii nafsika innaka anta 'allaamu alghuyuubi","translate":{"id":"Dan (ingatlah) ketika Allah berfirman: \"Hai 'Isa putera Maryam, adakah kamu mengatakan kepada manusia: \"Jadikanlah aku dan ibuku dua orang tuhan selain Allah ?\". 'Isa menjawab: \"Maha Suci Engkau, tidaklah patut bagiku mengatakan apa yang bukan hakku (mengatakannya). Jika aku pernah mengatakan maka tentulah Engkau mengetahui apa yang ada pada diriku dan aku tidak mengetahui apa yang ada pada diri Engkau. Sesungguhnya Engkau Maha Mengetahui perkara yang ghaib-ghaib\".\n","en":"AND LO! God said: O Jesus, son of Mary! Didst thou say unto men, `Worship me and my mother as deities beside God'?\" [Jesus] answered: \"Limitless art Thou in Thy glory! It would not have been possible for me to say what I had no right to [say]! Had I said this, Thou wouldst indeed have known it! Thou knowest all that is within myself, whereas I know not what is in Thy Self. Verily, it is Thou alone who fully knowest all the things that are beyond the reach of a created being's perception."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/785","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/785.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/785.mp3"]}},{"no":117,"arab":"مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ أَنِ اعْبُدُوا اللَّهَ رَبِّي وَرَبَّكُمْ ۚ وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ ۖ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ ۚ وَأَنْتَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ","latin":"maa qultu lahum illaa maa amartanii bihi ani u'buduu allaaha rabbii warabbakum wakuntu 'alayhim syahiidan maa dumtu fiihim falammaa tawaffaytanii kunta anta alrraqiiba 'alayhim wa-anta 'alaa kulli syay-in syahiidun","translate":{"id":"Aku tidak pernah mengatakan kepada mereka kecuali apa yang Engkau perintahkan kepadaku (mengatakan)nya yaitu: \"Sembahlah Allah, Tuhanku dan Tuhanmu\", dan adalah aku menjadi saksi terhadap mereka, selama aku berada di antara mereka. Maka setelah Engkau wafatkan aku, Engkau-lah yang mengawasi mereka. Dan Engkau adalah Maha Menyaksikan atas segala sesuatu.\n","en":"Nothing did I tell them beyond what Thou didst bid me [to say]: `Worship God, [who is] my Sustainer as well as your Sustainer.' And I bore witness to what they did as long as I dwelt in their midst; but since Thou hast caused me to die, Thou alone hast been their keeper: for Thou art witness unto everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/786","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/786.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/786.mp3"]}},{"no":118,"arab":"إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ ۖ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ","latin":"in tu'adzdzibhum fa-innahum 'ibaaduka wa-in taghfir lahum fa-innaka anta al'aziizu alhakiimu","translate":{"id":"Jika Engkau menyiksa mereka, maka sesungguhnya mereka adalah hamba-hamba Engkau, dan jika Engkau mengampuni mereka, maka sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"If thou cause them to suffer - verily, they are Thy servants; and if Thou forgive them - verily, Thou alone art almighty, truly wise!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/787","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/787.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/787.mp3"]}},{"no":119,"arab":"قَالَ اللَّهُ هَٰذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ ۚ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","latin":"qaala allaahu haadzaa yawmu yanfa'u alshshaadiqiina shidquhum lahum jannaatun tajrii min tahtihaa al-anhaaru khaalidiina fiihaa abadan radhiya allaahu 'anhum waradhuu 'anhu dzaalika alfawzu al'azhiimu","translate":{"id":"Allah berfirman: \"Ini adalah suatu hari yang bermanfa'at bagi orang-orang yang benar kebenaran mereka. Bagi mereka surga yang dibawahnya mengalir sungai-sungai; mereka kekal di dalamnya selama-lamanya; Allah ridha terhadapNya . Itulah keberuntungan yang paling besar\".\n","en":"[AND on Judgment Day] God will say: \"Today, their truthfulness shall benefit all who have been true to their word: theirs shall be gardens through which running waters flow, therein to abide beyond the count of time; well-pleased is God with them, and well-pleased are they with Him: this is the triumph supreme.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/788","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/788.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/788.mp3"]}},{"no":120,"arab":"لِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا فِيهِنَّ ۚ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"lillaahi mulku alssamaawaati waal-ardhi wamaa fiihinna wahuwa 'alaa kulli syay-in qadiirun","translate":{"id":"Kepunyaan Allah-lah kerajaan langit dan bumi dan apa yang ada di dalamnya; dan Dia Maha Kuasa atas segala sesuatu.\n","en":"God's is the dominion over the heavens and the earth and all that they contain; and He has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/789","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/789.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/789.mp3"]}}]}