{"alquran":{"no":59,"name":"Al-Hashr","arab":"الحشر","start":5126,"count":24,"rukku":3,"type":"medina","description":"Surat Al Hasyr terdiri atas 24 ayat, termasuk golongan surat-surat Madaniyyah, diturunkan sesudah surat Al Bayyinah.<br> \tDinamai surat <i>Al Hasyr</i> (pengusiran) diambil dari perkataan <i>Al-Hasyr</i> yang terdapat pada ayat 2 surat ini. Di dalam surat ini disebutkan  kisah pengusiran suatu suku Yahudi yang bernama Bani Nadhir yang berdiam  di sekitar kota Madinah."},"surah":[{"no":1,"arab":" سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"sabbaha lillaahi maa fii alssamaawaati wamaa fii al-ardhi wahuwa al'aziizu alhakiimu","translate":{"id":"Telah bertasbih kepada Allah apa yang ada di langit dan bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"ALL THAT IS in the heavens and all that is on earth extols God’s limitless glory: for He alone is almighty, truly wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5127","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5127.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5127.mp3"]}},{"no":2,"arab":"هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ","latin":"huwa alladzii akhraja alladziina kafaruu min ahli alkitaabi min diyaarihim li-awwali alhasyri maa zhanantum an yakhrujuu wazhannuu annahum maani'atuhum hushuunuhum mina allaahi fa-ataahumu allaahu min haytsu lam yahtasibuu waqadzafa fii quluubihimu alrru'ba yukhribuuna buyuutahum bi-aydiihim wa-aydii almu/miniina fai'tabiruu yaa ulii al-abshaari","translate":{"id":"Dia-lah yang mengeluarkan orang-orang kafir di antara ahli kitab dari kampung-kampung mereka pada saat pengusiran yang pertama . Kamu tidak menyangka, bahwa mereka akan keluar dan merekapun yakin, bahwa benteng-benteng mereka dapat mempertahankan mereka dari (siksa) Allah; maka Allah mendatangkan kepada mereka (hukuman) dari arah yang tidak mereka sangka-sangka. Dan Allah melemparkan ketakutan dalam hati mereka;\n","en":"He it is who turned out of their homes, at the time of [their] first gathering [for war], such of the followers of earlier revelation as were bent on denying the truth. You did not think [O believers] that they would depart [without resistance] - just as they thought that their strongholds would protect them against God: but God came upon them in a manner which they had not expected, and cast terror into their hearts; [and thus] they destroyed their homes by their own hands as well as the hands of the believers. Learn a lesson, then, O you who are endowed with insight!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5128","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5128.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5128.mp3"]}},{"no":3,"arab":"وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ","latin":"walawlaa an kataba allaahu 'alayhimu aljalaa-a la'adzdzabahum fii alddunyaa walahum fii al-aakhirati 'adzaabu alnnaari","translate":{"id":"Dan jika tidaklah karena Allah telah menetapkan pengusiran terhadap mereka, benar-benar Allah mengazab mereka di dunia. Dan bagi mereka di akhirat azab neraka.\n","en":"And had it not been for God’s having ordained banishment for them, He would indeed have imposed [yet greater] suffering on them in this world: still, in the life to come there awaits them suffering through fire:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5129","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5129.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5129.mp3"]}},{"no":4,"arab":"ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۖ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ","latin":"dzaalika bi-annahum syaaqquu allaaha warasuulahu waman yusyaaqqi allaaha fa-inna allaaha syadiidu al'iqaabi","translate":{"id":"Yang demikian itu adalah karena Sesungguhnya mereka menentang Allah dan Rasul-Nya. Barangsiapa menentang Allah dan Rasul-Nya, Sesungguhnya Allah sangat keras hukuman-Nya.\n","en":"this, because they cut themselves off from God and His Apostle: and as for him who cuts himself off from God and His Apostle - verily, God is severe in retribution!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5130","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5130.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5130.mp3"]}},{"no":5,"arab":"مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ","latin":"maa qatha'tum min liinatin aw taraktumuuhaa qaa-imatan 'alaa ushuulihaa fabi-idzni allaahi waliyukhziya alfaasiqiina","translate":{"id":"Apa saja yang kamu tebang dari pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya , maka (semua itu) adalah dengan izin Allah; dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik.\n","en":"Whatever [of their] palm trees you may have cut down, [O believers,] or left standing on their roots, was [done] by God’s leave, and in order that He might confound the iniquitous."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5131","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5131.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5131.mp3"]}},{"no":6,"arab":"وَمَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَىٰ مَنْ يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"wamaa afaa-a allaahu 'alaa rasuulihi minhum famaa awjaftum 'alayhi min khaylin walaa rikaabin walaakinna allaaha yusallithu rusulahu 'alaa man yasyaau waallaahu 'alaa kulli syay-in qadiiru","translate":{"id":"Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun, tetapi Allah yang memberikan kekuasaan kepada RasulNya terhadap apa saja yang dikehendakiNya. Dan Allah Maha Kuasa atas segala sesuatu.\n","en":"Yet [remember:] whatever [spoils taken] from the enemy God has turned over to His Apostle, you did not have to spur horse or riding-camel for its sake: but God gives His apostles mastery over whomever He wills - for God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5132","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5132.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5132.mp3"]}},{"no":7,"arab":"مَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْ أَهْلِ الْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنْكُمْ ۚ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ","latin":"maa afaa-a allaahu 'alaa rasuulihi min ahli alquraa falillaahi walilrrasuuli walidzii alqurbaa waalyataamaa waalmasaakiini waibni alssabiili kay laa yakuuna duulatan bayna al-aghniyaa-i minkum wamaa aataakumu alrrasuulu fakhudzuuhu wamaa nahaakum 'anhu faintahuu waittaquu allaaha inna allaaha syadiidu al'iqaabi","translate":{"id":"Apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) yang berasal dari penduduk kota-kota maka adalah untuk Allah, untuk Rasul, kaum kerabat, anak-anak yatim, orang-orang miskin dan orang-orang yang dalam perjalanan, supaya harta itu jangan beredar di antara orang-orang kaya saja di antara kamu. Apa yang diberikan Rasul kepadamu, maka terimalah. Dan apa yang dilarangnya bagimu, maka tinggalkanlah. Dan bertakwalah kepada Allah. Sesungguhnya Allah amat keras hukumannya.\n","en":"Whatever [spoils taken] from the people of those villages God has turned over to His Apostle - [all of it] belongs to God and the Apostle, and the near of kin [of deceased believers], and the orphans, and the needy, and the wayfarer, so that it may not be [a benefit] going round and round among such of you as may [already] be rich. Hence, accept [willing­ly] whatever the Apostle* gives you [thereof], and refrain from [demanding] anything that he withholds from you; and remain conscious of God: for, verily, God is severe in retribution."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5133","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5133.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5133.mp3"]}},{"no":8,"arab":"لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ","latin":"lilfuqaraa-i almuhaajiriina alladziina ukhrijuu min diyaarihim wa-amwaalihim yabtaghuuna fadhlan mina allaahi waridhwaanan wayanshuruuna allaaha warasuulahu ulaa-ika humu alshshaadiquuna","translate":{"id":"(Juga) bagi orang fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka (karena) mencari karunia dari Allah dan keridhaan-Nya dan mereka menolong Allah dan RasulNya. Mereka itulah orang-orang yang benar.\n","en":"[Thus, part of such war-gains shall be given] to the poor among those who have forsaken the domain of evil: those who have been driven from their homelands and their possessions, seeking favour with God and [His] goodly acceptance, and who aid [the cause of] God and His Apostle: it is they, they who are true to their word!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5134","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5134.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5134.mp3"]}},{"no":9,"arab":"وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","latin":"waalladziina tabawwauu alddaara waal-iimaana min qablihim yuhibbuuna man haajara ilayhim walaa yajiduuna fii shuduurihim haajatan mimmaa uutuu wayu/tsiruuna 'alaa anfusihim walaw kaana bihim khasasatun waman yuuqa syuhha nafsihi faulaa-ika humu almuflihuuna","translate":{"id":"Dan orang-orang yang telah menempati kota Madinah dan telah beriman (Anshor) sebelum (kedatangan) mereka (Muhajirin), mereka (Anshor) 'mencintai' orang yang berhijrah kepada mereka (Muhajirin). Dan mereka (Anshor) tiada menaruh keinginan dalam hati mereka terhadap apa-apa yang diberikan kepada mereka (Muhajirin); dan mereka mengutamakan (orang-orang Muhajirin), atas diri mereka sendiri, sekalipun mereka dalam kesusahan. Dan siapa yang dipelihara dari kekikiran dirinya, mereka itulah orang orang yang beruntung\n","en":"And [it shall be offered, too, unto the poor from among] those who, before them, had their abode in this realm and in faith - [those] who love all that come to them in search of refuge, and who harbour in their hearts no grudge for whatever the others may have been given, but rather give them preference over themselves, even though poverty be their own lot: for, such as from their own covetousness are saved - it is they, they that shall attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5135","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5135.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5135.mp3"]}},{"no":10,"arab":"وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ","latin":"waalladziina jaauu min ba'dihim yaquuluuna rabbanaa ighfir lanaa wali-ikhwaaninaa alladziina sabaquunaa bial-iimaani walaa taj'al fii quluubinaa ghillan lilladziina aamanuu rabbanaa innaka rauufun rahiimun","translate":{"id":"Dan orang-orang yang datang sesudah mereka (Muhajirin dan Anshor), mereka berdoa: \"Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami, dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman; Ya Rabb kami, Sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang.\"\n","en":"And so, they who come after them pray: “O our Sustainer! Forgive us our sins, as well as those of our brethren who preceded us in faith, and let not our hearts entertain any unworthy thoughts or feelings against [any of] those who have attained to faith. O our Sustainer! Verily, Thou art compassionate, a dispenser of grace!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5136","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5136.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5136.mp3"]}},{"no":11,"arab":"أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ","latin":"alam tara ilaa alladziina naafaquu yaquuluuna li-ikhwaanihimu alladziina kafaruu min ahli alkitaabi la-in ukhrijtum lanakhrujanna ma'akum walaa nuthii'u fiikum ahadan abadan wa-in quutiltum lananshurannakum waallaahu yasyhadu innahum lakaadzibuuna","translate":{"id":"Apakah kamu tidak memperhatikan orang-orang munafik yang berkata kepada saudara-saudara mereka yang kafir di antara ahli kitab: \"Sesungguhnya jika kamu diusir niscaya kamipun akan keluar bersamamu; dan kami selama-lamanya tidak akan patuh kepada siapapun untuk (menyusahkan) kamu, dan jika kamu diperangi pasti kami akan membantu kamu.\" Dan Allah menyaksikan bahwa Sesungguhnya mereka benar-benar pendusta.\n","en":"ART THOU NOT aware of how those who would always dissemble [their real feelings] speak to their truth-denying brethren from among the followers of earlier revelation: “If you are driven away, we shall most certainly go forth with you, and shall never pay heed to anyone against you; and if war is waged against you, we shall most certainly come to your succour.” But God bears witness that they are most flagrantly lying:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5137","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5137.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5137.mp3"]}},{"no":12,"arab":"لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ","latin":"la-in ukhrijuu laa yakhrujuuna ma'ahum wala-in quutiluu laa yanshuruunahum wala-in nasharuuhum layuwallunna al-adbaara tsumma laa yunsharuuna","translate":{"id":"Sesungguhnya jika mereka diusir, orang-orang munafik itu tidak akan keluar bersama mereka, dan sesungguhnya jika mereka diperangi, niscaya mereka tidak akan menolongnya; sesungguhnya jika mereka menolongnya, niscaya mereka akan berpaling lari ke belakang; kemudian mereka tidak akan mendapat pertolongan.\n","en":"[for] if those [to whom they have pledged themselves] are indeed driven away, they will not go forth with them; and if war is waged against them, they will not come to their succour; and even if they [try to] succour them, they will most certainly turn their backs [in flight], and in the end will [themselves] find no succour."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5138","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5138.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5138.mp3"]}},{"no":13,"arab":"لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ","latin":"la-antum asyaddu rahbatan fii shuduurihim mina allaahi dzaalika bi-annahum qawmun laa yafqahuuna","translate":{"id":"Sesungguhnya kamu dalam hati mereka lebih ditakuti daripada Allah. Yang demikian itu karena mereka adalah kaum yang tidak mengerti.\n","en":"Nay, [O believers,] you arouse in their bosoms a fear more intense than [even their fear of] God: this, because they are people who fail to grasp the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5139","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5139.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5139.mp3"]}},{"no":14,"arab":"لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ ۚ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ","latin":"laa yuqaatiluunakum jamii'an illaa fii quran muhashshanatin aw min waraa-i judurin ba/suhum baynahum syadiidun tahsabuhum jamii'an waquluubuhum syattaa dzaalika bi-annahum qawmun laa ya'qiluuna","translate":{"id":"Mereka tidak akan memerangi kamu dalam keadaan bersatu padu, kecuali dalam kampung-kampung yang berbenteng atau di balik tembok. Permusuhan antara sesama mereka adalah sangat hebat. Kamu kira mereka itu bersatu, sedang hati mereka berpecah belah. Yang demikian itu karena sesungguhnya mereka adalah kaum yang tidak mengerti.\n","en":"Never will they fight you, [even] in unison, otherwise than from within fortified strongholds or from behind walls. Severe is their warlike discord among themselves: thou wouldst think that they are united, whereas [in fact] their hearts are at odds [with one another]: this, because they are people who will not use their reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5140","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5140.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5140.mp3"]}},{"no":15,"arab":"كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"kamatsali alladziina min qablihim qariiban dzaaquu wabaala amrihim walahum 'adzaabun aliimun","translate":{"id":"(Mereka adalah) seperti orang-orang Yahudi yang belum lama sebelum mereka telah merasai akibat buruk dari perbuatan mereka , dan bagi mereka azab yang pedih.\n","en":"[To both kinds of your enemies, O believers, is bound to happen] the like of [what happened to] those who, a short while before them, had to taste the evil that came from their own doings, with [yet more] grievous suffering awaiting them [in the life to come]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5141","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5141.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5141.mp3"]}},{"no":16,"arab":"كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ","latin":"kamatsali alsysyaythaani idz qaala lil-insaani ukfur falammaa kafara qaala innii barii-un minka innii akhaafu allaaha rabba al'aalamiina","translate":{"id":"(Bujukan orang-orang munafik itu adalah) seperti (bujukan) shaitan ketika dia berkata kepada manusia: \"Kafirlah kamu\", maka tatkala manusia itu telah kafir, maka ia berkata: \"Sesungguhnya aku berlepas diri dari kamu, karena sesungguhnya aku takut kepada Allah, Rabb semesta Alam\".\n","en":"the like of [what happens] when Satan says unto man, “Deny the truth!” - but as soon as [man] has denied the truth, [Satan] says, “Behold, I am not responsible for thee: behold, I fear God, the Sustainer of all the worlds!”"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5142","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5142.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5142.mp3"]}},{"no":17,"arab":"فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ","latin":"fakaana 'aaqibatahumaa annahumaa fii alnnaari khaalidayni fiihaa wadzaalika jazaau alzhzhaalimiina","translate":{"id":"Maka adalah kesudahan keduanya, bahwa sesungguhnya keduanya (masuk) ke dalam neraka, mereka kekal di dalamnya. Demikianlah balasan orang-orang yang zalim.\n","en":"Thus, in the end, both [the deniers of the truth and the hypocrites] will find themselves in the fire, therein to abide: for such is the recompense of evil­doers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5143","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5143.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5143.mp3"]}},{"no":18,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ","latin":"yaa ayyuhaa alladziina aamanuu ittaquu allaaha waltanzhur nafsun maa qaddamat lighadin waittaquu allaaha inna allaaha khabiirun bimaa ta'maluuna","translate":{"id":"Hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat); dan bertakwalah kepada Allah, sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"O YOU who have attained to faith! Remain conscious of God; and let every human being look to what he sends ahead for the morrow! And [once again]: Remain conscious of God, for God is fully aware of all that you do;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5144","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5144.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5144.mp3"]}},{"no":19,"arab":"وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ","latin":"walaa takuunuu kaalladziina nasuu allaaha fa-ansaahum anfusahum ulaa-ika humu alfaasiquuna","translate":{"id":"Dan janganlah kamu seperti orang-orang yang lupa kepada Allah, lalu Allah menjadikan mereka lupa kepada mereka sendiri. Mereka itulah orang-orang yang fasik.\n","en":"and be not like those who are oblivious of God, and whom He therefore causes to be oblivious of [what is good for] their own selves: [for] it is they, they who are truly depraved!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5145","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5145.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5145.mp3"]}},{"no":20,"arab":"لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ","latin":"laa yastawii ash-haabu alnnaari wa-ash-haabu aljannati ash-haabu aljannati humu alfaa-izuuna","translate":{"id":"Tidaklah sama penghuni-penghuni neraka dengan penghuni-penghuni jannah; penghuni-penghuni jannah itulah orang-orang yang beruntung.\n","en":"Not equal are those who are destined for the fire and those who are destined for paradise: those who are destined for paradise - it is they, they [alone] who shall triumph [on Judgment Day]!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5146","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5146.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5146.mp3"]}},{"no":21,"arab":"لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ","latin":"law anzalnaa haadzaa alqur-aana 'alaa jabalin lara-aytahu khaasyi'an mutashaddi'an min khasyyati allaahi watilka al-amtsaalu nadhribuhaa lilnnaasi la'allahum yatafakkaruuna","translate":{"id":"Kalau sekiranya Kami turunkan Al-Quraan ini kepada sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan ketakutannya kepada Allah. Dan perumpamaan-perumpamaan itu Kami buat untuk manusia supaya mereka berfikir.\n","en":"HAD WE bestowed this Qur’an from on high upon a mountain, thou wouldst indeed see it humbling itself, breaking asunder for awe of God. And [all] such parables We propound unto men, so that they might [learn to] think."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5147","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5147.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5147.mp3"]}},{"no":22,"arab":"هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ","latin":"huwa allaahu alladzii laa ilaaha illaa huwa 'aalimu alghaybi waalsysyahaadati huwa alrrahmaanu alrrahiimu","translate":{"id":"Dialah Allah Yang tiada Tuhan selain Dia, Yang Mengetahui yang ghaib dan yang nyata, Dia-lah Yang Maha Pemurah lagi Maha Penyayang.\n","en":"GOD IS HE save whom there is no deity: the One who knows all that is beyond the reach of a created being’s perception, as well as all that can be wit­nessed by a creature’s senses or mind: He, the Most Gracious, the Dispenser of Grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5148","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5148.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5148.mp3"]}},{"no":23,"arab":"هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ","latin":"huwa allaahu alladzii laa ilaaha illaa huwa almaliku alqudduusu alssalaamu almu/minu almuhayminu al'aziizu aljabbaaru almutakabbiru subhaana allaahi 'ammaa yusyrikuuna","translate":{"id":"Dialah Allah Yang tiada Tuhan selain Dia, Raja, Yang Maha Suci, Yang Maha Sejahtera, Yang Mengaruniakan Keamanan, Yang Maha Memelihara, Yang Maha Perkasa, Yang Maha Kuasa, Yang Memiliki segala Keagungan, Maha Suci Allah dari apa yang mereka persekutukan.\n","en":"God is He save whom there is no deity: the Sovereign Supreme, the Holy, the One with whom all salvation rests, the Giver of Faith, the One who determines what is true and false, the Almighty, the One who subdues wrong and restores right, the One to whom all greatness belongs! Utterly remote is God, in His limitless glory, from anything to which men may ascribe a share in His divinity!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5149","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5149.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5149.mp3"]}},{"no":24,"arab":"هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"huwa allaahu alkhaaliqu albaari-u almushawwiru lahu al-asmaau alhusnaa yusabbihu lahu maa fii alssamaawaati waal-ardhi wahuwa al'aziizu alhakiimu","translate":{"id":"Dialah Allah Yang Menciptakan, Yang Mengadakan, Yang Membentuk Rupa, Yang Mempunyai Asmaaul Husna. Bertasbih kepadaNya apa yang di langit dan bumi. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"He is God, the Creator, the Maker who shapes all forms and appearances! His [alone] are the attributes of perfection. All that is in the heavens and on earth extols His limitless glory: for He alone is almighty, truly wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5150","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5150.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5150.mp3"]}}]}