{"alquran":{"no":6,"name":"Al-An'aam","arab":"الأنعام","start":789,"count":165,"rukku":20,"type":"mecca","description":"Surat Al An'aam (binatang ternak: unta, sapi, biri-biri dan kambing) yang terdiri atas 165 ayat, termasuk golongan surat Makkiyah, karena hampur seluruh ayat-ayat-Nya diturunkan di Mekah dekat sebelum hijrah. Dinamakan <i>Al An'aam</i> karena di dalamnya disebut kata <i>An'aam</i> dalam hubungan dengan adat-istiadat kaum musyrikin, yang menurut mereka binatang-binatang ternak itu dapat dipergunakan untuk mendekatkan diri kepada tuhan mereka. Juga dalam surat ini disebutkan hukum-hukum yang berkenaan dengan binatang ternak itu."},"surah":[{"no":1,"arab":" الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَ ۖ ثُمَّ الَّذِينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ","latin":"alhamdu lillaahi alladzii khalaqa alssamaawaati waal-ardha waja'ala alzhzhulumaati waalnnuura tsumma alladziina kafaruu birabbihim ya'diluuna","translate":{"id":"Segala puji bagi Allah Yang telah menciptakan langit dan bumi dan mengadakan gelap dan terang, namun orang-orang yang kafir mempersekutukan (sesuatu) dengan Tuhan mereka.\n","en":"ALL PRAISE is due to God, who has created the heavens and the earth, and brought into being deep darkness as well as light: and yet, those who are bent on denying the truth regard other powers as their Sustainer's equals!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/790","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/790.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/790.mp3"]}},{"no":2,"arab":"هُوَ الَّذِي خَلَقَكُمْ مِنْ طِينٍ ثُمَّ قَضَىٰ أَجَلًا ۖ وَأَجَلٌ مُسَمًّى عِنْدَهُ ۖ ثُمَّ أَنْتُمْ تَمْتَرُونَ","latin":"huwa alladzii khalaqakum min thiinin tsumma qadaa ajalan wa-ajalun musamman 'indahu tsumma antum tamtaruuna","translate":{"id":"Dialah Yang menciptakan kamu dari tanah, sesudah itu ditentukannya ajal (kematianmu), dan ada lagi suatu ajal yang ada pada sisi-Nya (yang Dia sendirilah mengetahuinya), kemudian kamu masih ragu-ragu (tentang berbangkit itu).\n","en":"He it is who has created you out of clay, and then has decreed a term [for you] - a term known [only] to him. And yet you doubt –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/791","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/791.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/791.mp3"]}},{"no":3,"arab":"وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ ۖ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ","latin":"wahuwa allaahu fii alssamaawaati wafii al-ardhi ya'lamu sirrakum wajahrakum waya'lamu maa taksibuuna","translate":{"id":"Dan Dialah Allah (yang disembah), baik di langit maupun di bumi; Dia mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan dan mengetahui (pula) apa yang kamu usahakan.\n","en":"although He is God in the heavens and on earth, knowing all that you keep secret as well as all that you do openly, and knowing what you deserve."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/792","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/792.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/792.mp3"]}},{"no":4,"arab":"وَمَا تَأْتِيهِمْ مِنْ آيَةٍ مِنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ","latin":"wamaa ta/tiihim min aayatin min aayaati rabbihim illaa kaanuu 'anhaa mu'ridhiina","translate":{"id":"Dan tidak ada suatu ayatpun dari ayat-ayat Tuhan sampai kepada mereka, melainkan mereka selalu berpaling dari padanya (mendustakannya).\n","en":"Yet whenever any of their Sustainer's messages comes unto them, they [who are bent on denying the truth] turn their backs upon it:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/793","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/793.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/793.mp3"]}},{"no":5,"arab":"فَقَدْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ ۖ فَسَوْفَ يَأْتِيهِمْ أَنْبَاءُ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"faqad kadzdzabuu bialhaqqi lammaa jaa-ahum fasawfa ya/tiihim anbaau maa kaanuu bihi yastahzi-uuna","translate":{"id":"Sesungguhnya mereka telah mendustakan yang haq (Al-Quraan) tatkala sampai kepada mereka, maka kelak akan sampai kepada mereka (kenyataan dari) berita-berita yang selalu mereka perolok-olokkan.\n","en":"and so they give the lie to this truth now that it has come unto them. In time, however, they will come to understand what it was that they were wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/794","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/794.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/794.mp3"]}},{"no":6,"arab":"أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ مَكَّنَّاهُمْ فِي الْأَرْضِ مَا لَمْ نُمَكِّنْ لَكُمْ وَأَرْسَلْنَا السَّمَاءَ عَلَيْهِمْ مِدْرَارًا وَجَعَلْنَا الْأَنْهَارَ تَجْرِي مِنْ تَحْتِهِمْ فَأَهْلَكْنَاهُمْ بِذُنُوبِهِمْ وَأَنْشَأْنَا مِنْ بَعْدِهِمْ قَرْنًا آخَرِينَ","latin":"alam yaraw kam ahlaknaa min qablihim min qarnin makkannaahum fii al-ardhi maa lam numakkin lakum wa-arsalnaa alssamaa-a 'alayhim midraaran waja'alnaa al-anhaara tajrii min tahtihim fa-ahlaknaahum bidzunuubihim wa-ansya/naa min ba'dihim qarnan aakhariina","translate":{"id":"Apakah mereka tidak memperhatikan berapa banyak generasi yang telah Kami binasakan sebelum mereka, padahal (generasi itu) telah Kami teguhkan kedudukan mereka di muka bumi, yaitu keteguhan yang belum pernah Kami berikan kepadamu, dan Kami curahkan hujan yang lebat atas mereka dan Kami jadikan sungai-sungai mengalir di bawah mereka, kemudian Kami binasakan mereka karena dosa mereka sendiri, dan Kami ciptakan sesudah mereka generasi yang lain.\n","en":"Do they not see how many a generation We have destroyed before their time - [people] whom We had given a [bountiful] place on earth, the like of which We never gave unto you, and upon whom We showered heavenly blessings abundant, and at whose feet We made running waters flow? And yet we destroyed them for their sins, and gave rise to other people in their stead."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/795","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/795.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/795.mp3"]}},{"no":7,"arab":"وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ لَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ","latin":"walaw nazzalnaa 'alayka kitaaban fii qirthaasin falamasuuhu bi-aydiihim laqaala alladziina kafaruu in haadzaa illaa sihrun mubiinun","translate":{"id":"Dan kalau Kami turunkan kepadamu tulisan di atas kertas, lalu mereka dapat menyentuhnya dengan tangan mereka sendiri, tentulah orang-orang kafir itu berkata: \"Ini tidak lain hanyalah sihir yang nyata.\"\n","en":"But even if we had sent down unto thee [O Prophet] a writing on paper, and they had touched it with their own hands - those who are bent on denying the truth would indeed have said, \"This is clearly nothing but a deception!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/796","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/796.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/796.mp3"]}},{"no":8,"arab":"وَقَالُوا لَوْلَا أُنْزِلَ عَلَيْهِ مَلَكٌ ۖ وَلَوْ أَنْزَلْنَا مَلَكًا لَقُضِيَ الْأَمْرُ ثُمَّ لَا يُنْظَرُونَ","latin":"waqaaluu lawlaa unzila 'alayhi malakun walaw anzalnaa malakan laqudhiya al-amru tsumma laa yunzharuuna","translate":{"id":"Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) malaikat ?\" dan kalau Kami turunkan (kepadanya) malaikat, tentulah selesai urusan itu , kemudian mereka tidak diberi tangguh (sedikitpun).\n","en":"They are saying, too, \"Why has not an angel (visibly] been sent down unto him?\" But had we sent down an angel, all would indeed have been decided, and they would have been allowed no further respite [for repentance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/797","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/797.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/797.mp3"]}},{"no":9,"arab":"وَلَوْ جَعَلْنَاهُ مَلَكًا لَجَعَلْنَاهُ رَجُلًا وَلَلَبَسْنَا عَلَيْهِمْ مَا يَلْبِسُونَ","latin":"walaw ja'alnaahu malakan laja'alnaahu rajulan walalabasnaa 'alayhim maa yalbisuuna","translate":{"id":"Dan kalau Kami jadikan rasul itu malaikat, tentulah Kami jadikan dia seorang laki-laki dan (kalau Kami jadikan ia seorang laki-laki), tentulah Kami meragu-ragukan atas mereka apa yang mereka ragu-ragukan atas diri mereka sendiri .\n","en":"And (even] if We had appointed an angel as Our message-bearer, We would certainly have made him [appear as] a man - and thus We would only have confused them in the same way as they are now confusing themselves."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/798","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/798.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/798.mp3"]}},{"no":10,"arab":"وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِنْ قَبْلِكَ فَحَاقَ بِالَّذِينَ سَخِرُوا مِنْهُمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ","latin":"walaqadi istuhzi-a birusulin min qablika fahaaqa bialladziina sakhiruu minhum maa kaanuu bihi yastahzi-uuna","translate":{"id":"Dan sungguh telah diperolok-olokkan beberapa rasul sebelum kamu, maka turunlah kepada orang-orang yang mencemoohkan di antara mereka balasan (azab) olok-olokan mereka.\n","en":"And, indeed, [even] before thy time have apostles been derided - but those who scoffed at them were [in the end] overwhelmed by the very thing which they were wont to deride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/799","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/799.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/799.mp3"]}},{"no":11,"arab":"قُلْ سِيرُوا فِي الْأَرْضِ ثُمَّ انْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ","latin":"qul siiruu fii al-ardhi tsumma unzhuruu kayfa kaana 'aaqibatu almukadzdzibiina","translate":{"id":"Katakanlah: \"Berjalanlah di muka bumi, kemudian perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu.\"\n","en":"Say: \"Go all over the earth, and behold what happened in the end to those who gave the lie to the truth!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/800","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/800.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/800.mp3"]}},{"no":12,"arab":"قُلْ لِمَنْ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ قُلْ لِلَّهِ ۚ كَتَبَ عَلَىٰ نَفْسِهِ الرَّحْمَةَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ ۚ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ فَهُمْ لَا يُؤْمِنُونَ","latin":"qul liman maa fii alssamaawaati waal-ardhi qul lillaahi kataba 'alaa nafsihi alrrahmata layajma'annakum ilaa yawmi alqiyaamati laa rayba fiihi alladziina khasiruu anfusahum fahum laa yu/minuuna","translate":{"id":"Katakanlah: \"Kepunyaan siapakah apa yang ada di langit dan di bumi.\" Katakanlah: \"Kepunyaan Allah.\" Dia telah menetapkan atas Diri-Nya kasih sayang . Dia sungguh akan menghimpun kamu pada hari kiamat yang tidak ada keraguan padanya. Orang-orang yang meragukan dirinya mereka itu tidak beriman .\n","en":"Say: \"Unto whom belongs all that is in the heavens and on earth?\" Say: \"Unto God, who has willed upon Himself the law of grace and mercy. He will assuredly gather you all together on the Day of Resurrection, [the coming of] which is beyond all doubt: yet those who have squandered their own selves-it is they who refuse to believe [in Him],"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/801","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/801.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/801.mp3"]}},{"no":13,"arab":"وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","latin":"walahu maa sakana fii allayli waalnnahaari wahuwa alssamii'u al'aliimu","translate":{"id":"Dan kepunyaan Allah-lah segala yang ada pada malam dan siang. Dan Dialah Yang Maha Mendengar lagi Maha Mengetahui.\n","en":"although His is all that dwells in the night and the day, and He alone is all-hearing, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/802","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/802.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/802.mp3"]}},{"no":14,"arab":"قُلْ أَغَيْرَ اللَّهِ أَتَّخِذُ وَلِيًّا فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ يُطْعِمُ وَلَا يُطْعَمُ ۗ قُلْ إِنِّي أُمِرْتُ أَنْ أَكُونَ أَوَّلَ مَنْ أَسْلَمَ ۖ وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ","latin":"qul aghayra allaahi attakhidzu waliyyan faathiri alssamaawaati waal-ardhi wahuwa yuth'imu walaa yuth'amu qul innii umirtu an akuuna awwala man aslama walaa takuunanna mina almusyrikiina","translate":{"id":"Katakanlah: \"Apakah akan aku jadikan pelindung selain dari Allah yang menjadikan langit dan bumi, padahal Dia memberi makan dan tidak memberi makan?\" Katakanlah: \"Sesungguhnya aku diperintah supaya aku menjadi orang yang pertama kali menyerah diri (kepada Allah), dan jangan sekali-kali kamu masuk golongan orang musyrik.\"\n","en":"Say: \"Am I to take for my master anyone but God, the Originator of the heavens and the earth, when it is He who gives nourishment and Himself needs none?” Say: \"I am bidden to be foremost among those who surrender themselves unto God, and not to be among those who ascribe divinity to aught beside Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/803","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/803.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/803.mp3"]}},{"no":15,"arab":"قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ","latin":"qul innii akhaafu in 'ashaytu rabbii 'adzaaba yawmin 'azhiimin","translate":{"id":"Katakanlah: \"Sesungguhnya aku takut akan azab hari yang besar (hari kiamat), jika aku mendurhakai Tuhanku.\"\n","en":"Say: \"Behold, I would dread, were I [thus] to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/804","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/804.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/804.mp3"]}},{"no":16,"arab":"مَنْ يُصْرَفْ عَنْهُ يَوْمَئِذٍ فَقَدْ رَحِمَهُ ۚ وَذَٰلِكَ الْفَوْزُ الْمُبِينُ","latin":"man yushraf 'anhu yawma-idzin faqad rahimahu wadzaalika alfawzu almubiinu","translate":{"id":"Barang siapa yang dijauhkan azab dari padanya pada hari itu, maka sungguh Allah telah memberikan rahmat kepadanya. Dan itulah keberuntungan yang nyata.\n","en":"Upon him who shall be spared on that Day, He will indeed have bestowed His grace: and this will be a manifest triumph."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/805","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/805.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/805.mp3"]}},{"no":17,"arab":"وَإِنْ يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ ۖ وَإِنْ يَمْسَسْكَ بِخَيْرٍ فَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"wa-in yamsaska allaahu bidhurrin falaa kaasyifa lahu illaa huwa wa-in yamsaska bikhayrin fahuwa 'alaa kulli syay-in qadiirun","translate":{"id":"Dan jika Allah menimpakan sesuatu kemudharatan kepadamu, maka tidak ada yang menghilangkannya melainkan Dia sendiri. Dan jika Dia mendatangkan kebaikan kepadamu, maka Dia Maha Kuasa atas tiap-tiap sesuatu.\n","en":"And if God should touch thee with misfortune, there is none who could remove it but He; and if He should touch thee with good fortune -it is He who has the power to will anything:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/806","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/806.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/806.mp3"]}},{"no":18,"arab":"وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ ۚ وَهُوَ الْحَكِيمُ الْخَبِيرُ","latin":"wahuwa alqaahiru fawqa 'ibaadihi wahuwa alhakiimu alkhabiiru","translate":{"id":"Dan Dialah yang berkuasa atas sekalian hamba-hamba-Nya. Dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui.\n","en":"for He alone holds sway over His creatures, and He alone is truly wise, all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/807","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/807.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/807.mp3"]}},{"no":19,"arab":"قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادَةً ۖ قُلِ اللَّهُ ۖ شَهِيدٌ بَيْنِي وَبَيْنَكُمْ ۚ وَأُوحِيَ إِلَيَّ هَٰذَا الْقُرْآنُ لِأُنْذِرَكُمْ بِهِ وَمَنْ بَلَغَ ۚ أَئِنَّكُمْ لَتَشْهَدُونَ أَنَّ مَعَ اللَّهِ آلِهَةً أُخْرَىٰ ۚ قُلْ لَا أَشْهَدُ ۚ قُلْ إِنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ وَإِنَّنِي بَرِيءٌ مِمَّا تُشْرِكُونَ","latin":"qul ayyu syay-in akbaru syahaadatan quli allaahu syahiidun baynii wabaynakum wauuhiya ilayya haadzaa alqur-aanu li-undzirakum bihi waman balagha a-innakum latasyhaduuna anna ma'a allaahi aalihatan ukhraa qul laa asyhadu qul innamaa huwa ilaahun waahidun wa-innanii barii-un mimmaa tusyrikuuna","translate":{"id":"Katakanlah: \"Siapakah yang lebih kuat persaksiannya?\" Katakanlah: \"Allah\". Dia menjadi saksi antara aku dan kamu. Dan Al Quraan ini diwahyukan kepadaku supaya dengan dia aku memberi peringatan kepadamu dan kepada orang-orang yang sampai Al-Quraan (kepadanya). Apakah sesungguhnya kamu mengakui bahwa ada tuhan-tuhan lain di samping Allah?\" Katakanlah: \"Aku tidak mengakui.\" Katakanlah: \"Sesungguhnya Dia adalah Tuhan Yang Maha Esa dan sesungguhnya aku berlepas diri dari apa yang kamu persekutukan (dengan Allah)\".\n","en":"Say: \"What could most weightily bear witness to the truth?\" Say: \"God is witness between me and you; and this Qur’an has been revealed unto me so that on the strength thereof I might warn you and all whom it may reach.\" Could you in truth bear witness that there are other deities side by side with God? Say: \"I bear no [such] witness!\" Say: \"He is the One God; and, behold, far be it from me to ascribe divinity, as, you do, to aught beside Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/808","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/808.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/808.mp3"]}},{"no":20,"arab":"الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمُ ۘ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ فَهُمْ لَا يُؤْمِنُونَ","latin":"alladziina aataynaahumu alkitaaba ya'rifuunahu kamaa ya'rifuuna abnaa-ahum alladziina khasiruu anfusahum fahum laa yu/minuuna","translate":{"id":"Orang-orang yang telah Kami berikan kitab kepadanya, mereka mengenalnya (Muhammad) seperti mereka mengenal anak-anaknya sendiri. Orang-orang yang merugikan dirinya, mereka itu tidak beriman (kepada Allah).\n","en":"They unto whom we have vouchsafed revelation aforetime know this as they know their own children; yet those [of them] who have squandered their own selves -it is they who refuse to believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/809","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/809.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/809.mp3"]}},{"no":21,"arab":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۗ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ","latin":"waman azhlamu mimmani iftaraa 'alaa allaahi kadziban aw kadzdzaba bi-aayaatihi innahu laa yuflihu alzhzhaalimuuna","translate":{"id":"Dan siapakah yang lebih aniaya daripada orang yang membuat-buat suatu kedustaan terhadap Allah, atau mendustakan ayat-ayat-Nya? Sesungguhnya orang-orang yang aniaya itu tidak mendapat keberuntungan.\n","en":"And who could be more wicked than he who attributes his own lying inventions to God or gives the lie to His messages? Verily, such evildoers will never attain to a happy state:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/810","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/810.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/810.mp3"]}},{"no":22,"arab":"وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُوا أَيْنَ شُرَكَاؤُكُمُ الَّذِينَ كُنْتُمْ تَزْعُمُونَ","latin":"wayawma nahsyuruhum jamii'an tsumma naquulu lilladziina asyrakuu ayna syurakaaukumu alladziina kuntum taz'umuuna","translate":{"id":"Dan (ingatlah), hari yang di waktu itu Kami menghimpun mereka semuanya kemudian Kami berkata kepada orang-orang musyrik: \"Di manakah sembahan-sembahan kamu yang dulu kamu katakan (sekutu-sekutu) Kami?\".\n","en":"for one Day We shall gather them all together, and then We shall say unto those who ascribed divinity to aught beside God: \"Where, now, are those beings whom you imagined to have a share in God's divinity?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/811","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/811.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/811.mp3"]}},{"no":23,"arab":"ثُمَّ لَمْ تَكُنْ فِتْنَتُهُمْ إِلَّا أَنْ قَالُوا وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ","latin":"tsumma lam takun fitnatuhum illaa an qaaluu waallaahi rabbinaa maa kunnaa musyrikiina","translate":{"id":"Kemudian tiadalah fitnah mereka, kecuali mengatakan: \"Demi Allah, Tuhan kami, tiadalah kami mempersekutukan Allah\".\n","en":"Whereupon, in their utter confusion, they will only [be able to] say: \"By God, our Sustainer, we did not [mean to] ascribe divinity to aught beside Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/812","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/812.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/812.mp3"]}},{"no":24,"arab":"انْظُرْ كَيْفَ كَذَبُوا عَلَىٰ أَنْفُسِهِمْ ۚ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ","latin":"tsumma lam takun fitnatuhum illaa an qaaluu waallaahi rabbinaa maa kunnaa musyrikiina","translate":{"id":"Lihatlah bagaimana mereka telah berdusta kepada diri mereka sendiri dan hilanglah daripada mereka sembahan-sembahan yang dahulu mereka ada-adakan.\n","en":"Behold how they have lied to themselves -and [how] their false imagery has forsaken them!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/813","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/813.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/813.mp3"]}},{"no":25,"arab":"وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ ۖ وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۚ وَإِنْ يَرَوْا كُلَّ آيَةٍ لَا يُؤْمِنُوا بِهَا ۚ حَتَّىٰ إِذَا جَاءُوكَ يُجَادِلُونَكَ يَقُولُ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","latin":"waminhum man yastami'u ilayka waja'alnaa 'alaa quluubihim akinnatan an yafqahuuhu wafii aatsaanihim waqran wa-in yaraw kulla aayatin laa yu/minuu bihaa hattaa idzaa jaauuka yujaadiluunaka yaquulu alladziina kafaruu in haadzaa illaa asaathiiru al-awwaliina","translate":{"id":"Dan di antara mereka ada orang yang mendengarkani (bacaan)mu, padahal Kami telah meletakkan tutupan di atas hati mereka (sehingga mereka tidak) memahaminya dan (Kami letakkan) sumbatan di telinganya. Dan jikapun mereka melihat segala tanda (kebenaran), mereka tetap tidak mau beriman kepadanya. Sehingga apabila mereka datang kepadamu untuk membantahmu, orang-orang kafir itu berkata: \"Al-Quraan ini tidak lain hanyalah dongengan orang-orang dahulu.\"\n","en":"And there are among them such as [seem to] listen to thee [O Prophet]: but over their hearts We have laid veils which prevent them from grasping the truth, and into their ears, deafness. And were they to see every sign [of the truth], they would still not believe in it-so much so that when they come unto thee to contend with thee, those who are bent on denying the truth say, \"This is nothing but fables of ancient times!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/814","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/814.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/814.mp3"]}},{"no":26,"arab":"وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ ۖ وَإِنْ يُهْلِكُونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ","latin":"wahum yanhawna 'anhu wayan-awna 'anhu wa-in yuhlikuuna illaa anfusahum wamaa yasy'uruuna","translate":{"id":"Dan mereka melarang (orang lain) mendengarkan Al-Quraan dan mereka sendiri menjauhkan diri daripadanya, dan mereka hanyalah membinasakan diri mereka sendiri, sedang mereka tidak menyadari.\n","en":"And they bar others therefrom. and go far away from it: but they destroy none but themselves, and perceive it not."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/815","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/815.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/815.mp3"]}},{"no":27,"arab":"وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَى النَّارِ فَقَالُوا يَا لَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِآيَاتِ رَبِّنَا وَنَكُونَ مِنَ الْمُؤْمِنِينَ","latin":"walaw taraa idz wuqifuu 'alaa alnnaari faqaaluu yaa laytanaa nuraddu walaa nukadzdziba bi-aayaati rabbinaa wanakuuna mina almu/miniina","translate":{"id":"Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka, lalu mereka berkata: \"Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman\", (tentulah kamu melihat suatu peristiwa yang mengharukan).\n","en":"If thou couldst but see [them] when they will be made to stand before the fire and will say, \"Oh, would that we were brought back [to life]: then we would not give the lie to our Sustainer's messages, but would be among the believers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/816","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/816.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/816.mp3"]}},{"no":28,"arab":"بَلْ بَدَا لَهُمْ مَا كَانُوا يُخْفُونَ مِنْ قَبْلُ ۖ وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ وَإِنَّهُمْ لَكَاذِبُونَ","latin":"bal badaa lahum maa kaanuu yukhfuuna min qablu walaw rudduu la'aaduu limaa nuhuu 'anhu wa-innahum lakaadzibuuna","translate":{"id":"Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya . Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta belaka.\n","en":"But nay -[they will say this only because] the truth which they used to conceal [from themselves] in the past will have become obvious to them; and if they were brought back [to life], they would return to the very thing which was forbidden to them: for behold, they are indeed liars!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/817","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/817.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/817.mp3"]}},{"no":29,"arab":"وَقَالُوا إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ","latin":"waqaaluu in hiya illaa hayaatunaa alddunyaa wamaa nahnu bimab'uutsiina","translate":{"id":"Dan tentu mereka akan mengatakan (pula): \"Hidup hanyalah kehidupan kita di dunia ini saja, dan kita sekali-sekali tidak akan dibangkitkan\" .\n","en":"And some [of the unbelievers] say, \"There is nothing beyond our life in this world, for We shall not be raised from the dead.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/818","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/818.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/818.mp3"]}},{"no":30,"arab":"وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَىٰ رَبِّهِمْ ۚ قَالَ أَلَيْسَ هَٰذَا بِالْحَقِّ ۚ قَالُوا بَلَىٰ وَرَبِّنَا ۚ قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ","latin":"walaw taraa idz wuqifuu 'alaa rabbihim qaala alaysa haadzaa bialhaqqi qaaluu balaa warabbinaa qaala fadzuuquu al'adzaaba bimaa kuntum takfuruuna","translate":{"id":"Dan seandainya kamu melihat ketika mereka dihadapkan kepada Tuhannya (tentulah kamu melihat peristiwa yang mengharukan). Berfirman Allah: \"Bukankah (kebangkitan ini benar?\" Mereka menjawab: \"Sungguh benar, demi Tuhan kami\". Berfirman Allah: \"Karena itu rasakanlah azab ini, disebabkan kamu mengingkari(nya)\".\n","en":"If thou couldst but see [them] when they shall be made to stand before their Sustainer [and] He will say, \"Is not this the truth?\" They will answer: \"Yea, indeed, by our Sustainer!\" [Whereupon] He will say: \"Taste, then, the suffering that comes from your having refused to acknowledge the truth!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/819","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/819.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/819.mp3"]}},{"no":31,"arab":"قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ ۖ حَتَّىٰ إِذَا جَاءَتْهُمُ السَّاعَةُ بَغْتَةً قَالُوا يَا حَسْرَتَنَا عَلَىٰ مَا فَرَّطْنَا فِيهَا وَهُمْ يَحْمِلُونَ أَوْزَارَهُمْ عَلَىٰ ظُهُورِهِمْ ۚ أَلَا سَاءَ مَا يَزِرُونَ","latin":"qad khasira alladziina kadzdzabuu biliqaa-i allaahi hattaa idzaa jaa-at-humu alssaa'atu baghtatan qaaluu yaa hasratanaa 'alaa maa farrathnaa fiihaa wahum yahmiluuna awzaarahum 'alaa zhuhuurihim alaa saa-a maa yaziruuna","translate":{"id":"Sungguh telah rugilah orang-orang yang mendustakan pertemuan mereka dengan Tuhan; sehingga apabila kiamat datang kepada mereka dengan tiba-tiba, mereka berkata: \"Alangkah besarnya penyesalan kami, terhadap kelalaian kami tentang kiamat itu !\", sambil mereka memikul dosa-dosa di atas punggungnya. Ingatlah, amat buruklah apa yang mereka pikul itu.\n","en":"Lost indeed are they who consider it a lie that they will have to meet God -till the Last Hour suddenly comes upon them, [and] they cry, \"Alas for us, that we disregarded it!\" - for they shall bear on their backs the burden of their sins: oh, how evil the load with which they shall be burdened!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/820","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/820.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/820.mp3"]}},{"no":32,"arab":"وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا لَعِبٌ وَلَهْوٌ ۖ وَلَلدَّارُ الْآخِرَةُ خَيْرٌ لِلَّذِينَ يَتَّقُونَ ۗ أَفَلَا تَعْقِلُونَ","latin":"wamaa alhayaatu alddunyaa illaa la'ibun walahwun walalddaaru al-aakhirati khayrun lilladziina yattaquuna afalaa ta'qiluuna","translate":{"id":"Dan tiadalah kehidupan dunia ini, selain dari main-main dan senda gurau belaka . Dan sungguh kampung akhirat itu lebih baik bagi orang-orang yang bertaqwa. Maka tidakkah kamu memahaminya?\n","en":"And nothing is the life of this world but a play and a passing delight; and the life in the hereafter is by far the better for all who are conscious of God. Will you not, then, use your reason?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/821","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/821.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/821.mp3"]}},{"no":33,"arab":"قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ ۖ فَإِنَّهُمْ لَا يُكَذِّبُونَكَ وَلَٰكِنَّ الظَّالِمِينَ بِآيَاتِ اللَّهِ يَجْحَدُونَ","latin":"qad na'lamu innahu layahzunuka alladzii yaquuluuna fa-innahum laa yukadzdzibuunaka walaakinna alzhzhaalimiina bi-aayaati allaahi yajhaduuna","translate":{"id":"Sesungguhnya Kami mengetahui bahwasanya apa yang mereka katakan itu menyedihkan hatimu, (janganlah kamu bersedih hati), karena mereka sebenarnya bukan mendustakan kamu, akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah .\n","en":"Well do We know that what such people say grieves thee indeed: yet, behold, it is not thee to whom they give the lie, but God's messages do these evildoers deny."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/822","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/822.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/822.mp3"]}},{"no":34,"arab":"وَلَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ فَصَبَرُوا عَلَىٰ مَا كُذِّبُوا وَأُوذُوا حَتَّىٰ أَتَاهُمْ نَصْرُنَا ۚ وَلَا مُبَدِّلَ لِكَلِمَاتِ اللَّهِ ۚ وَلَقَدْ جَاءَكَ مِنْ نَبَإِ الْمُرْسَلِينَ","latin":"walaqad kudzdzibat rusulun min qablika fashabaruu 'alaa maa kudzdzibuu wauudzuu hattaa ataahum nashrunaa walaa mubaddila likalimaati allaahi walaqad jaa-aka min naba-i almursaliina","translate":{"id":"Dan sesungguhnya telah didustakan (pula) rasul-rasul sebelum kamu, akan tetapi mereka sabar terhadap pendustaan dan penganiayaan (yang dilakukan) terhadap mereka, sampai datang pertolongan Allah kepada mereka. Tak ada seorangpun yang dapat merobah kalimat-kalimat (janji-janji) Allah. Dan sesungguhnya telah datang kepadamu sebahagian dari berita rasul-rasul itu.\n","en":"And, indeed, [even] before thy time have apostles been given the lie, and they endured with patience all those charges of falsehood, and all the hurt done to them, till succour came unto them from Us: for there is no power that could alter [the outcome of] God's promises. And some of the histories of those apostles have already come within thy ken."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/823","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/823.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/823.mp3"]}},{"no":35,"arab":"وَإِنْ كَانَ كَبُرَ عَلَيْكَ إِعْرَاضُهُمْ فَإِنِ اسْتَطَعْتَ أَنْ تَبْتَغِيَ نَفَقًا فِي الْأَرْضِ أَوْ سُلَّمًا فِي السَّمَاءِ فَتَأْتِيَهُمْ بِآيَةٍ ۚ وَلَوْ شَاءَ اللَّهُ لَجَمَعَهُمْ عَلَى الْهُدَىٰ ۚ فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ","latin":"wa-in kaana kabura 'alayka i'raaduhum fa-ini istatha'ta an tabtaghiya nafaqan fii al-ardhi aw sullaman fii alssamaa-i fata/tiyahum bi-aayatin walaw syaa-a allaahu lajama'ahum 'alaa alhudaa falaa takuunanna mina aljaahiliina","translate":{"id":"Dan jika perpalingan mereka (darimu) terasa amat berat bagimu, maka jika kamu dapat membuat lobang di bumi atau tangga ke langit lalu kamu dapat mendatangkan mu'jizat kepada mereka (maka buatlah) . Kalau Allah menghendaki, tentu saja Allah menjadikan mereka semua dalam petunjuk sebab itu janganlah sekali-kali kamu termasuk orang-orang yang jahil.\n","en":"And if it distress thee that those who deny the truth turn their backs on thee - why, then, if thou art able to go down deep into the earth or to ascend a ladder unto heaven in order to bring them a [yet more convincing] message, [do so;] but [remember that] had God so willed, He would indeed have gathered them all unto [His] guidance. Do not, therefore, allow thyself to ignore [God's ways]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/824","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/824.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/824.mp3"]}},{"no":36,"arab":"إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ ۘ وَالْمَوْتَىٰ يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ","latin":"innamaa yastajiibu alladziina yasma'uuna waalmawtaa yab'atsuhumu allaahu tsumma ilayhi yurja'uuna","translate":{"id":"Hanya mereka yang mendengar sajalah yang mematuhi (seruan Allah), dan orang-orang yang mati (hatinya) , akan dibangkitkan oleh Allah, kemudian kepadaNyalah mereka dikembalikan.\n","en":"Only they who listen [with their hearts] can respond to a call; and as for the dead [of heart], God [alone] can raise them from the dead, whereupon unto Him they shall return."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/825","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/825.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/825.mp3"]}},{"no":37,"arab":"وَقَالُوا لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۚ قُلْ إِنَّ اللَّهَ قَادِرٌ عَلَىٰ أَنْ يُنَزِّلَ آيَةً وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","latin":"waqaaluu lawlaa nuzzila 'alayhi aayatun min rabbihi qul inna allaaha qaadirun 'alaa an yunazzila aayatan walaakinna aktsarahum laa ya'lamuuna","translate":{"id":"Dan mereka (orang-orang musyrik Mekah) berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) suatu mu'jizat dari Tuhannya?\" Katakanlah: \"Sesungguhnya Allah kuasa menurunkan suatu mu'jizat, tetapi kebanyakan mereka tidak mengetahui.\"\n","en":"And they say, \"Why has no miraculous sign been bestowed on him from on high by his Sustainer?\" Say: \"Behold, God has the power to bestow any sign from on high.\" Yet most human beings are unaware of this"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/826","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/826.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/826.mp3"]}},{"no":38,"arab":"وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ ۚ مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ ۚ ثُمَّ إِلَىٰ رَبِّهِمْ يُحْشَرُونَ","latin":"wamaa min daabbatin fii al-ardhi walaa thaa-irin yathiiru bijanaahayhi illaa umamun amtsaalukum maa farrathnaa fii alkitaabi min syay-in tsumma ilaa rabbihim yuhsyaruuna","translate":{"id":"Dan tiadalah binatang-binatang yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan umat (juga) seperti kamu. Tiadalah Kami alpakan sesuatupun dalam Al-Kitab , kemudian kepada Tuhanlah mereka dihimpunkan.\n","en":"although there is no beast that walks on earth and no bird that flies on its two wings which is not [God's] creature like yourselves: no single thing have We neglected in Our decree. And once again: Unto their Sustainer shall they [all] be gathered."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/827","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/827.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/827.mp3"]}},{"no":39,"arab":"وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا صُمٌّ وَبُكْمٌ فِي الظُّلُمَاتِ ۗ مَنْ يَشَإِ اللَّهُ يُضْلِلْهُ وَمَنْ يَشَأْ يَجْعَلْهُ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"waalladziina kadzdzabuu bi-aayaatinaa shummun wabukmun fii alzhzhulumaati man yasya-i allaahu yudhlilhu waman yasya/ yaj'alhu 'alaa shiraathin mustaqiimin","translate":{"id":"Dan orang-orang yang mendustakan ayat-ayat Kami adalah pekak, bisu dan berada dalam gelap gulita. Barangsiapa yang dikehendaki Allah (kesesatannya), niscaya disesatkan-Nya . Dan barangsiapa yang dikehendaki Allah (untuk diberi-Nya petunjuk), niscaya Dia menjadikan-Nya berada di atas jalan yang lurus.\n","en":"And they who give the lie to Our messages are deaf and dumb, in darkness deep. Whomever God wills, He lets go astray; and whomever He wills, He places upon a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/828","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/828.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/828.mp3"]}},{"no":40,"arab":"قُلْ أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ أَوْ أَتَتْكُمُ السَّاعَةُ أَغَيْرَ اللَّهِ تَدْعُونَ إِنْ كُنْتُمْ صَادِقِينَ","latin":"qul ara-aytakum in ataakum 'adzaabu allaahi aw atatkumu alssaa'atu aghayra allaahi tad'uuna in kuntum shaadiqiina","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku jika datang siksaan Allah kepadamu, atau datang kepadamu hari kiamat, apakah kamu menyeru (tuhan) selain Allah; jika kamu orang-orang yang benar!\"\n","en":"Say: \"Can you see yourselves invoking any but God when God's chastisement befalls you [in this world], or the Last Hour comes upon you? [Tell me this,] if you are men of truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/829","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/829.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/829.mp3"]}},{"no":41,"arab":"بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ مَا تَدْعُونَ إِلَيْهِ إِنْ شَاءَ وَتَنْسَوْنَ مَا تُشْرِكُونَ","latin":"bal iyyaahu tad'uuna fayaksyifu maa tad'uuna ilayhi in syaa-a watansawna maa tusyrikuuna","translate":{"id":"(Tidak), tetapi hanya Dialah yang kamu seru, maka Dia menghilangkan bahaya yang karenanya kamu berdo'a kepadaNya, jika Dia menghendaki, dan kamu tinggalkan sembahan-sembahan yang kamu sekutukan (dengan Allah).\n","en":"Nay, but it is Him alone that you will invoke - whereupon He may, if He so wills, remove that [ill] which caused you to call unto Him; and you will have forgotten all that. to which you [now] ascribe divinity side by side with Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/830","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/830.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/830.mp3"]}},{"no":42,"arab":"وَلَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِنْ قَبْلِكَ فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ","latin":"walaqad arsalnaa ilaa umamin min qablika fa-akhadznaahum bialba/saa-i waaldhdharraa-i la'allahum yatadharra'uuna","translate":{"id":"Dan sesungguhnya Kami telah mengutus (rasul-rasul) kepada umat-umat yang sebelum kamu, kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan dan kemelaratan, supaya mereka memohon (kepada Allah) dengan tunduk merendahkan diri.\n","en":"And, indeed, We sent Our messages unto people before thy time, [O Prophet,] and visited them with misfortune and hardship so that they might humble themselves:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/831","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/831.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/831.mp3"]}},{"no":43,"arab":"فَلَوْلَا إِذْ جَاءَهُمْ بَأْسُنَا تَضَرَّعُوا وَلَٰكِنْ قَسَتْ قُلُوبُهُمْ وَزَيَّنَ لَهُمُ الشَّيْطَانُ مَا كَانُوا يَعْمَلُونَ","latin":"falawlaa idz jaa-ahum ba/sunaa tadharra'uu walaakin qasat quluubuhum wazayyana lahumu alsysyaythaanu maa kaanuu ya'maluuna","translate":{"id":"Maka mengapa mereka tidak memohon (kepada Allah) dengan tunduk merendahkan diri ketika datang siksaan Kami kepada mereka, bahkan hati mereka telah menjadi keras, dan syaitanpun menampakkan kepada mereka kebagusan apa yang selalu mereka kerjakan.\n","en":"yet when the misfortune decreed by Us befell them, they did not humble themselves, but rather their hearts grew hard, for Satan had made all their doings seem goodly to them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/832","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/832.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/832.mp3"]}},{"no":44,"arab":"فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ","latin":"falammaa nasuu maa dzukkiruu bihi fatahnaa 'alayhim abwaaba kulli syay-in hattaa idzaa farihuu bimaa uutuu akhadznaahum baghtatan fa-idzaa hum mublisuuna","translate":{"id":"Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa.\n","en":"Then, when they had forgotten all that they had been told to take to heart, We threw open to them the gates of all [good] things until -even as they were rejoicing in what they had been granted - We suddenly took them to task: and lo! they were broken in spirit;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/833","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/833.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/833.mp3"]}},{"no":45,"arab":"فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا ۚ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"faquthi'a daabiru alqawmi alladziina zhalamuu waalhamdu lillaahi rabbi al'aalamiina","translate":{"id":"Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya. Segala puji bagi Allah, Tuhan semesta alam.\n","en":"and [in the end,] the last remnant of those folk who had been bent on evildoing was wiped out. For all praise is due to God, the Sustainer of all the worlds."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/834","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/834.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/834.mp3"]}},{"no":46,"arab":"قُلْ أَرَأَيْتُمْ إِنْ أَخَذَ اللَّهُ سَمْعَكُمْ وَأَبْصَارَكُمْ وَخَتَمَ عَلَىٰ قُلُوبِكُمْ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِهِ ۗ انْظُرْ كَيْفَ نُصَرِّفُ الْآيَاتِ ثُمَّ هُمْ يَصْدِفُونَ","latin":"qul ara-aytum in akhadza allaahu sam'akum wa-abshaarakum wakhatama 'alaa quluubikum man ilaahun ghayru allaahi ya/tiikum bihi unzhur kayfa nusharrifu al-aayaati tsumma hum yashdifuuna","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku jika Allah mencabut pendengaran dan penglihatan serta menutup hatimu, siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu?\" Perhatikanlah bagaimana Kami berkali-kali memperlihatkan tanda-tanda kebesaran (Kami), kemudian mereka tetap berpaling (juga).\n","en":"Say: \"What do you think? If God should take away your hearing and your sight and seal your hearts - what deity but God is there that could bring it all back to you?\" Behold how many facets we give to our messages-and yet they turn away in disdain!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/835","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/835.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/835.mp3"]}},{"no":47,"arab":"قُلْ أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ بَغْتَةً أَوْ جَهْرَةً هَلْ يُهْلَكُ إِلَّا الْقَوْمُ الظَّالِمُونَ","latin":"qul ara-aytakum in ataakum 'adzaabu allaahi baghtatan aw jahratan hal yuhlaku illaa alqawmu alzhzhaalimuuna","translate":{"id":"Katakanlah: \"Terangkanlah kepadaku jika datang siksaan Allah kepadamu dengan sekonyong-konyong, atau terang-terangan, maka adakah yang dibinasakan (Allah) selain dari orang yang zalim?\"\n","en":"Say: \"Can you imagine what your condition will be if God's chastisement befalls you, either suddenly or in a [gradually] perceptible manner? [But then-] will any but evildoing folk [ever] be destroyed?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/836","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/836.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/836.mp3"]}},{"no":48,"arab":"وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنْذِرِينَ ۖ فَمَنْ آمَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ","latin":"wamaa nursilu almursaliina illaa mubasysyiriina wamundziriina faman aamana wa-ashlaha falaa khawfun 'alayhim walaa hum yahzanuuna","translate":{"id":"Dan tidaklah Kami mengutus para rasul itu melainkan untuk memberikan kabar gembira dan memberi peringatan. Barangsiapa yang beriman dan mengadakan perbaikan , maka tak ada kekhawatiran terhadap mereka dan tidak pula mereka bersedih hati.\n","en":"And We send [Our] message-bearers only as heralds of glad tidings and as warners: hence, all who believe and live righteously -no fear need they have, and neither shall they grieve;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/837","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/837.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/837.mp3"]}},{"no":49,"arab":"وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا يَمَسُّهُمُ الْعَذَابُ بِمَا كَانُوا يَفْسُقُونَ","latin":"waalladziina kadzdzabuu bi-aayaatinaa yamassuhumu al'adzaabu bimaa kaanuu yafsuquuna","translate":{"id":"Dan orang-orang yang mendustakan ayat-ayat Kami, mereka akan ditimpa siksa disebabkan mereka selalu berbuat fasik.\n","en":"whereas those who give the lie to Our messages - suffering will afflict them in result of all their sinful doings."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/838","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/838.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/838.mp3"]}},{"no":50,"arab":"قُلْ لَا أَقُولُ لَكُمْ عِنْدِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ لَكُمْ إِنِّي مَلَكٌ ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ ۚ أَفَلَا تَتَفَكَّرُونَ","latin":"qul laa aquulu lakum 'indii khazaa-inu allaahi walaa a'lamu alghayba walaa aquulu lakum innii malakun in attabi'u illaa maa yuuhaa ilayya qul hal yastawii al-a'maa waalbashiiru afalaa tatafakkaruuna","translate":{"id":"Katakanlah: Aku tidak mengatakan kepadamu, bahwa perbendaharaan Allah ada padaku, dan tidak (pula) aku mengetahui yang ghaib dan tidak (pula) aku mengatakan kepadamu bahwa aku seorang malaikat. Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku. Katakanlah: \"Apakah sama orang yang buta dengan yang melihat?\" Maka apakah kamu tidak memikirkan(nya)?\"\n","en":"Say [O Prophet]: \"I do not say unto you, 'God's treasures are with me,'; nor [do I say], 'I know the things that are beyond the reach of human perception'; nor do I say unto you, 'Behold, I am an angel': I but follow what is revealed to me.\" Say: \"Can the blind and the seeing be deemed equal? Will you not, then, take thought?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/839","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/839.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/839.mp3"]}},{"no":51,"arab":"وَأَنْذِرْ بِهِ الَّذِينَ يَخَافُونَ أَنْ يُحْشَرُوا إِلَىٰ رَبِّهِمْ ۙ لَيْسَ لَهُمْ مِنْ دُونِهِ وَلِيٌّ وَلَا شَفِيعٌ لَعَلَّهُمْ يَتَّقُونَ","latin":"wa-andzir bihi alladziina yakhaafuuna an yuhsyaruu ilaa rabbihim laysa lahum min duunihi waliyyun walaa syafii'un la'allahum yattaquuna","translate":{"id":"Dan berilah peringatan dengan apa yang diwahyukan itu kepada orang-orang yang takut akan dihimpunkan kepada Tuhannya (pada hari kiamat), sedang bagi mereka tidak ada seorang pelindung dan pemberi syafa'atpun selain daripada Allah, agar mereka bertakwa.\n","en":"And warn hereby those who fear lest they be gathered unto their Sustainer with none to protect them from Him or to intercede with Him, so that they might become [fully] conscious of Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/840","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/840.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/840.mp3"]}},{"no":52,"arab":"وَلَا تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ ۖ مَا عَلَيْكَ مِنْ حِسَابِهِمْ مِنْ شَيْءٍ وَمَا مِنْ حِسَابِكَ عَلَيْهِمْ مِنْ شَيْءٍ فَتَطْرُدَهُمْ فَتَكُونَ مِنَ الظَّالِمِينَ","latin":"walaa tathrudi alladziina yad'uuna rabbahum bialghadaati waal'asyiyyi yuriiduuna wajhahu maa 'alayka min hisaabihim min syay-in wamaa min hisaabika 'alayhim min syay-in fatathrudahum fatakuuna mina alzhzhaalimiina","translate":{"id":"Dan janganlah kamu mengusir orang-orang yang menyeru Tuhannya di pagi dan petang hari, sedang mereka menghendaki keridhaanNya. Kamu tidak memikul tanggung jawab sedikitpun terhadap perbuatan mereka dan merekapun tidak memikul tanggung jawab sedikitpun terhadap perbuatanmu, yang menyebabkan kamu (berhak) mengusir mereka, (sehingga kamu termasuk orang-orang yang zalim) .\n","en":"Hence, repulse not [any of] those who at morn and evening invoke their Sustainer, seeking His countenance. Thou art in no wise accountable for them-just as they are in no wise accountable for thee -and thou hast therefore no right to repulse them: for then thou wouldst be among the evildoers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/841","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/841.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/841.mp3"]}},{"no":53,"arab":"وَكَذَٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِيَقُولُوا أَهَٰؤُلَاءِ مَنَّ اللَّهُ عَلَيْهِمْ مِنْ بَيْنِنَا ۗ أَلَيْسَ اللَّهُ بِأَعْلَمَ بِالشَّاكِرِينَ","latin":"wakadzaalika fatannaa ba'dhahum biba'dhin liyaquuluu ahaaulaa-i manna allaahu 'alayhim min bayninaa alaysa allaahu bi-a'lama bialsysyaakiriina","translate":{"id":"Dan demikianlah telah Kami uji sebahagian mereka (orang-orang kaya) dengan sebahagian mereka (orang-orang miskin), supaya (orang-orang yang kaya itu) berkata: \"Orang-orang semacam inikah di antara kita yang diberi anugerah Allah kepada mereka?\" (Allah berfirman): \"Tidakkah Allah lebih mengetahui tentang orang-orang yang bersyukur (kepadaNya) ?\"\n","en":"For it is in this way that We try men through one another - to the end that they might ask, \"Has God, then, bestowed His favour upon those others in preference to us?\" Does not God know best as to who is grateful [to Him]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/842","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/842.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/842.mp3"]}},{"no":54,"arab":"وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ ۖ أَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَحِيمٌ","latin":"wa-idzaa jaa-aka alladziina yu/minuuna bi-aayaatinaa faqul salaamun 'alaykum kataba rabbukum 'alaa nafsihi alrrahmata annahu man 'amila minkum suu-an bijahaalatin tsumma taaba min ba'dihi wa-ashlaha fa-annahu ghafuurun rahiimun","translate":{"id":"Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu, maka katakanlah: \"Salaamun alaikum . Tuhanmu telah menetapkan atas diri-Nya kasih sayang , (yaitu) bahwasanya barang siapa yang berbuat kejahatan di antara kamu lantaran kejahilan , kemudian ia bertaubat setelah mengerjakannya dan mengadakan perbaikan, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"And when those who believe in Our messages come unto thee, say: \"Peace be upon you. Your Sustainer has willed upon Himself the law of grace and mercy - so that if any of you does a bad deed out of ignorance, and thereafter repents and lives righteously, He shall be [found] much-forgiving, a dispenser of grace.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/843","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/843.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/843.mp3"]}},{"no":55,"arab":"وَكَذَٰلِكَ نُفَصِّلُ الْآيَاتِ وَلِتَسْتَبِينَ سَبِيلُ الْمُجْرِمِينَ","latin":"wakadzaalika nufashshilu al-aayaati walitastabiina sabiilu almujrimiina","translate":{"id":"Dan demikianlah Kami terangkan ayat-ayat Al-Quraan (supaya jelas jalan orang-orang yang saleh, dan supaya jelas (pula) jalan orang-orang yang berdosa.\n","en":"And thus clearly do We spell out Our messages: and [We do it] so that the path of those who are lost in sin might be distinct [from that of the righteous]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/844","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/844.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/844.mp3"]}},{"no":56,"arab":"قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ ۚ قُلْ لَا أَتَّبِعُ أَهْوَاءَكُمْ ۙ قَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنَ الْمُهْتَدِينَ","latin":"qul innii nuhiitu an a'buda alladziina tad'uuna min duuni allaahi qul laa attabi'u ahwaa-akum qad dhalaltu idzan wamaa anaa mina almuhtadiina","translate":{"id":"Katakanlah: \"Sesungguhnya aku dilarang menyembah tuhan-tuhan yang kamu sembah selain Allah\". Katakanlah: \"Aku tidak akan mengikuti hawa nafsumu, sungguh tersesatlah aku jika berbuat demikian dan tidaklah (pula) aku termasuk orang-orang yang mendapat petunjuk\".\n","en":"SAY [to the deniers of the truth]: \"Behold, I have been forbidden to worship those [beings] whom you invoke instead of God.\" Say: \"I do not follow your errant views -or else I should have gone astray, and should not be among those who have found the right path.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/845","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/845.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/845.mp3"]}},{"no":57,"arab":"قُلْ إِنِّي عَلَىٰ بَيِّنَةٍ مِنْ رَبِّي وَكَذَّبْتُمْ بِهِ ۚ مَا عِنْدِي مَا تَسْتَعْجِلُونَ بِهِ ۚ إِنِ الْحُكْمُ إِلَّا لِلَّهِ ۖ يَقُصُّ الْحَقَّ ۖ وَهُوَ خَيْرُ الْفَاصِلِينَ","latin":"qul innii 'alaa bayyinatin min rabbii wakadzdzabtum bihi maa 'indii maa tasta'jiluuna bihi ini alhukmu illaa lillaahi yaqushshu alhaqqa wahuwa khayru alfaasiliina","translate":{"id":"Katakanlah: \"Sesungguhnya aku berada di atas hujjah yang nyata (Al Quraan) dari Tuhanku , sedang kamu mendustakannya. Tidak ada padaku apa (azab) yang kamu minta supaya disegerakan kedatangannya. Menetapkan hukum itu hanyalah hak Allah. Dia menerangkan yang sebenarnya dan Dia Pemberi keputusan yang paling baik\".\n","en":"Say: \"Behold, I take my stand on a clear evidence from my Sustainer-and [so] it is to Him that you are giving the lie! Not in my power is that which [in your ignorance] you so hastily demand: judgment rests with none but God. He shall declare the truth, since it is He who is the best judge between truth and falsehood.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/846","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/846.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/846.mp3"]}},{"no":58,"arab":"قُلْ لَوْ أَنَّ عِنْدِي مَا تَسْتَعْجِلُونَ بِهِ لَقُضِيَ الْأَمْرُ بَيْنِي وَبَيْنَكُمْ ۗ وَاللَّهُ أَعْلَمُ بِالظَّالِمِينَ","latin":"qul law anna 'indii maa tasta'jiluuna bihi laqudhiya al-amru baynii wabaynakum waallaahu a'lamu bialzhzhaalimiina","translate":{"id":"Katakanlah: \"Kalau sekiranya ada padaku apa (azab) yang kamu minta supaya disegerakan, tentu telah diselesaikan Allah urusan yang ada antara aku dan kamu . Dan Allah lebih mengetahui tentang orang-orang yang zalim.\n","en":"Say: \"If that which you so hastily demand were in my power, everything would indeed have been decided between me and you. But God knows best as to who is doing wrong.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/847","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/847.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/847.mp3"]}},{"no":59,"arab":"وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ ۚ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ ۚ وَمَا تَسْقُطُ مِنْ وَرَقَةٍ إِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِي ظُلُمَاتِ الْأَرْضِ وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ مُبِينٍ","latin":"wa'indahu mafaatihu alghaybi laa ya'lamuhaa illaa huwa waya'lamu maa fii albarri waalbahri wamaa tasquthu min waraqatin illaa ya'lamuhaa walaa habbatin fii zhulumaati al-ardhi walaa rathbin walaa yaabisin illaa fii kitaabin mubiinin","translate":{"id":"Dan pada sisi Allah-lah kunci-kunci semua yang ghaib; tidak ada yang mengetahuinya kecuali Dia sendiri, dan Dia mengetahui apa yang di daratan dan di lautan, dan tiada sehelai daun pun yang gugur melainkan Dia mengetahuinya (pula), dan tidak jatuh sebutir biji-pun dalam kegelapan bumi, dan tidak sesuatu yang basah atau yang kering, melainkan tertulis dalam kitab yang nyata (Lauh Mahfudz)\"\n","en":"For, with Him are the keys to the things that are beyond the reach of a created being's perception: none knows them but He. And He knows all that is on land and in the sea; and not a leaf falls but He knows it; and neither is there a grain in the earth's deep darkness, nor anything: living or dead, but is recorded in [His] clear decree."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/848","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/848.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/848.mp3"]}},{"no":60,"arab":"وَهُوَ الَّذِي يَتَوَفَّاكُمْ بِاللَّيْلِ وَيَعْلَمُ مَا جَرَحْتُمْ بِالنَّهَارِ ثُمَّ يَبْعَثُكُمْ فِيهِ لِيُقْضَىٰ أَجَلٌ مُسَمًّى ۖ ثُمَّ إِلَيْهِ مَرْجِعُكُمْ ثُمَّ يُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"wahuwa alladzii yatawaffaakum biallayli waya'lamu maa jarahtum bialnnahaari tsumma yab'atsukum fiihi liyuqdaa ajalun musamman tsumma ilayhi marji'ukum tsumma yunabbi-ukum bimaa kuntum ta'maluuna","translate":{"id":"Dan Dialah yang menidurkan kamu di malam hari dan Dia mengetahui apa yang kamu kerjakan di siang hari, kemudian Dia membangunkan kamu pada siang hari untuk disempurnakan umur(mu) yang telah ditentukan , kemudian kepada Allah-lah kamu kembali, lalu Dia memberitahukan kepadamu apa yang dahulu kamu kerjakan.\n","en":"And He it is who causes you to be [like] dead at night, and knows what you work in daytime; and He brings you back to life each days in order that a term set [by Him] be fulfilled. In the end, unto Him you must return: and then He will make you understand all that you were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/849","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/849.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/849.mp3"]}},{"no":61,"arab":"وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ ۖ وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً حَتَّىٰ إِذَا جَاءَ أَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا وَهُمْ لَا يُفَرِّطُونَ","latin":"wahuwa alqaahiru fawqa 'ibaadihi wayursilu 'alaykum hafazhatan hattaa idzaa jaa-a ahadakumu almawtu tawaffat-hu rusulunaa wahum laa yufarrithuuna","translate":{"id":"Dan Dialah yang mempunyai kekuasaan tertinggi di atas semua hamba-Nya, dan diutus-Nya kepadamu malaikat-malaikat penjaga, sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan oleh malaikat-malaikat Kami, dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya.\n","en":"And He alone holds sway over His servants. And He sends forth heavenly forces to watch over you until, when death approaches any of you, Our messengers cause him to die: and they do not overlook [anyone]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/850","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/850.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/850.mp3"]}},{"no":62,"arab":"ثُمَّ رُدُّوا إِلَى اللَّهِ مَوْلَاهُمُ الْحَقِّ ۚ أَلَا لَهُ الْحُكْمُ وَهُوَ أَسْرَعُ الْحَاسِبِينَ","latin":"tsumma rudduu ilaa allaahi mawlaahumu alhaqqi alaa lahu alhukmu wahuwa asra'u alhaasibiina","translate":{"id":"Kemudian mereka (hamba Allah) dikembalikan kepada Allah, Penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum (pada hari itu) kepunyaanNya. Dan Dialah Pembuat Perhitungan yang paling cepat.\n","en":"And they [who have died] are thereupon brought before God, their true Lord Supreme. Oh, verily, His alone is all judgment: and He is the swiftest of all reckoners!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/851","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/851.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/851.mp3"]}},{"no":63,"arab":"قُلْ مَنْ يُنَجِّيكُمْ مِنْ ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ تَدْعُونَهُ تَضَرُّعًا وَخُفْيَةً لَئِنْ أَنْجَانَا مِنْ هَٰذِهِ لَنَكُونَنَّ مِنَ الشَّاكِرِينَ","latin":"qul man yunajjiikum min zhulumaati albarri waalbahri tad'uunahu tadharru'an wakhufyatan la-in anjaanaa min haadzihi lanakuunanna mina alsysyaakiriina","translate":{"id":"Katakanlah: \"Siapakah yang dapat menyelamatkan kamu dari bencana di darat dan di laut, yang kamu berdoa kepada-Nya dengan rendah diri dengan suara yang lembut (dengan mengatakan: \"Sesungguhnya jika Dia menyelamatkan kami dari (bencana) ini, tentulah kami menjadi orang-orang yang bersyukur\"\".\n","en":"Say: \"Who is it that saves you from the dark dangers of land and sea [when] you call unto Him humbly, and in the secrecy of your hearts, `If He will but save us from this [distress], we shall most certainly be among the grateful'?\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/852","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/852.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/852.mp3"]}},{"no":64,"arab":"قُلِ اللَّهُ يُنَجِّيكُمْ مِنْهَا وَمِنْ كُلِّ كَرْبٍ ثُمَّ أَنْتُمْ تُشْرِكُونَ","latin":"quli allaahu yunajjiikum minhaa wamin kulli karbin tsumma antum tusyrikuuna","translate":{"id":"Katakanlah: \"Allah menyelamatkan kamu dari bencana itu dan dari segala macam kesusahan, kemudian kamu kembali mempersekutukan-Nya.\"\n","en":"Say: \"God [alone] can save you from this and from every distress - and still you ascribe divinity to other powers beside Him!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/853","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/853.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/853.mp3"]}},{"no":65,"arab":"قُلْ هُوَ الْقَادِرُ عَلَىٰ أَنْ يَبْعَثَ عَلَيْكُمْ عَذَابًا مِنْ فَوْقِكُمْ أَوْ مِنْ تَحْتِ أَرْجُلِكُمْ أَوْ يَلْبِسَكُمْ شِيَعًا وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ ۗ انْظُرْ كَيْفَ نُصَرِّفُ الْآيَاتِ لَعَلَّهُمْ يَفْقَهُونَ","latin":"qul huwa alqaadiru 'alaa an yab'atsa 'alaykum 'adzaaban min fawqikum aw min tahti arjulikum aw yalbisakum syiya'an wayudziiqa ba'dhakum ba/sa ba'dhin unzhur kayfa nusharrifu al-aayaati la'allahum yafqahuuna","translate":{"id":"Katakanlah: \" Dialah yang berkuasa untuk mengirimkan azab kepadamu, dari atas kamu atau dari bawah kakimu atau Dia mencampurkan kamu dalam golongan-golongan (yang saling bertentangan) dan merasakan kepada sebahagian kamu keganasan sebahagian yang lain. Perhatikanlah, betapa Kami mendatangkan tanda-tanda kebesaran Kami silih berganti agar mereka memahami(nya)\".\n","en":"Say: \"It is He alone who has the power to let loose upon you suffering from above you or from beneath your feet, or to confound you with mutual discord and let you taste the fear of one another.\" Behold how many facets we give to these messages, so that they might understand the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/854","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/854.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/854.mp3"]}},{"no":66,"arab":"وَكَذَّبَ بِهِ قَوْمُكَ وَهُوَ الْحَقُّ ۚ قُلْ لَسْتُ عَلَيْكُمْ بِوَكِيلٍ","latin":"wakadzdzaba bihi qawmuka wahuwa alhaqqu qul lastu 'alaykum biwakiilin","translate":{"id":"Dan kaummu mendustakannya (azab) padahal azab itu benar adanya. Katakanlah: \"Aku ini bukanlah orang yang diserahi mengurus urusanmu\".\n","en":"and yet, to all this thy peoples have given the lie, although it is the truth. Say [then]: \"I am not responsible for your conduct."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/855","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/855.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/855.mp3"]}},{"no":67,"arab":"لِكُلِّ نَبَإٍ مُسْتَقَرٌّ ۚ وَسَوْفَ تَعْلَمُونَ","latin":"likulli naba-in mustaqarrun wasawfa ta'lamuuna","translate":{"id":"Untuk setiap berita (yang dibawa oleh rasul-rasul) ada (waktu) terjadinya dan kelak kamu akan mengetahui.\n","en":"Every tiding [from God] has a term set for its fulfilment: and in time you will come to know [the truth].\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/856","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/856.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/856.mp3"]}},{"no":68,"arab":"وَإِذَا رَأَيْتَ الَّذِينَ يَخُوضُونَ فِي آيَاتِنَا فَأَعْرِضْ عَنْهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ وَإِمَّا يُنْسِيَنَّكَ الشَّيْطَانُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرَىٰ مَعَ الْقَوْمِ الظَّالِمِينَ","latin":"wa-idzaa ra-ayta alladziina yakhuudhuuna fii aayaatinaa fa-a'ridh 'anhum hattaa yakhuudhuu fii hadiitsin ghayrihi wa-immaa yunsiyannaka alsysyaythaanu falaa taq'ud ba'da aldzdzikraa ma'a alqawmi alzhzhaalimiina","translate":{"id":"Dan apabila kamu melihat orang-orang memperolok-olokkan ayat-ayat Kami, maka tinggalkanlah mereka sehingga mereka membicarakan pembicaraan yang lain. Dan jika syaitan menjadikan kamu lupa (akan larangan ini), maka janganlah kamu duduk bersama orang-orang yang zalim itu sesudah teringat (akan larangan itu).\n","en":"NOW, whenever thou meet such as indulge in [blasphemous] talk about Our messages, turn thy back upon them until they begin to talk of other things and if Satan should ever cause thee to forget [thyself], remain not, after recollection, in the company of such evildoing folk,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/857","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/857.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/857.mp3"]}},{"no":69,"arab":"وَمَا عَلَى الَّذِينَ يَتَّقُونَ مِنْ حِسَابِهِمْ مِنْ شَيْءٍ وَلَٰكِنْ ذِكْرَىٰ لَعَلَّهُمْ يَتَّقُونَ","latin":"wamaa 'alaa alladziina yattaquuna min hisaabihim min syay-in walaakin dzikraa la'allahum yattaquuna","translate":{"id":"Dan tidak ada pertanggungjawaban sedikitpun atas orang-orang yang bertakwa terhadap dosa mereka; akan tetapi (kewajiban mereka ialah) mengingatkan agar mereka bertakwa.\n","en":"for whom those who are conscious of God are in no wise accountable. Theirs, however, is the duty to admonish [the sinners], so that they might become conscious of God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/858","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/858.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/858.mp3"]}},{"no":70,"arab":"وَذَرِ الَّذِينَ اتَّخَذُوا دِينَهُمْ لَعِبًا وَلَهْوًا وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا ۚ وَذَكِّرْ بِهِ أَنْ تُبْسَلَ نَفْسٌ بِمَا كَسَبَتْ لَيْسَ لَهَا مِنْ دُونِ اللَّهِ وَلِيٌّ وَلَا شَفِيعٌ وَإِنْ تَعْدِلْ كُلَّ عَدْلٍ لَا يُؤْخَذْ مِنْهَا ۗ أُولَٰئِكَ الَّذِينَ أُبْسِلُوا بِمَا كَسَبُوا ۖ لَهُمْ شَرَابٌ مِنْ حَمِيمٍ وَعَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْفُرُونَ","latin":"wadzari alladziina ittakhadzuu diinahum la'iban walahwan wagharrat-humu alhayaatu alddunyaa wadzakkir bihi an tubsala nafsun bimaa kasabat laysa lahaa min duuni allaahi waliyyun walaa syafii'un wa-in ta'dil kulla 'adlin laa yu/khadz minhaa ulaa-ika alladziina ubsiluu bimaa kasabuu lahum syaraabun min hamiimin wa'adzaabun aliimun bimaa kaanuu yakfuruuna","translate":{"id":"Dan tinggalkan lah orang-orang yang menjadikan agama mereka sebagai main-main dan senda gurau , dan mereka telah ditipu oleh kehidupan dunia. Peringatkanlah (mereka) dengan Al-Quraan itu agar masing-masing diri tidak dijerumuskan ke dalam neraka, karena perbuatannya sendiri. Tidak akan ada baginya pelindung dan tidak pula pemberi syafa'at selain daripada Allah. Dan jika ia menebus dengan segala macam tebusanpun, niscaya tidak akan diterima itu daripadanya. Mereka itulah orang-orang yang dijerumuskan ke dalam neraka. Bagi mereka (disediakan) minuman dari air yang sedang mendidih dan azab yang pedih disebabkan kekafiran mereka dahulu.\n","en":"And leave to themselves all those who, beguiled by the life of this world, have made play and passing delights their religion; but remind [them] herewith that [in the life to come] every human being shall be held in pledge for whatever wrong he has done, and shall have none to protect him from God, and none to intercede for him; and though he offer any conceivable ransom, it shall not be accepted from him. It is [people such as] these that shall be held in pledge for the wrong they have done; for them there is [in the life to come] a draught of burning despair and grievous suffering awaits them because of their persistent refusal to acknowledge the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/859","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/859.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/859.mp3"]}},{"no":71,"arab":"قُلْ أَنَدْعُو مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُنَا وَلَا يَضُرُّنَا وَنُرَدُّ عَلَىٰ أَعْقَابِنَا بَعْدَ إِذْ هَدَانَا اللَّهُ كَالَّذِي اسْتَهْوَتْهُ الشَّيَاطِينُ فِي الْأَرْضِ حَيْرَانَ لَهُ أَصْحَابٌ يَدْعُونَهُ إِلَى الْهُدَى ائْتِنَا ۗ قُلْ إِنَّ هُدَى اللَّهِ هُوَ الْهُدَىٰ ۖ وَأُمِرْنَا لِنُسْلِمَ لِرَبِّ الْعَالَمِينَ","latin":"qul anad'uu min duuni allaahi maa laa yanfa'unaa walaa yadhurrunaa wanuraddu 'alaa a'qaabinaa ba'da idz hadaanaa allaahu kaalladzii istahwat-hu alsysyayaathiinu fii al-ardhi hayraana lahu ash-haabun yad'uunahu ilaa alhudaa i/tinaa qul inna hudaa allaahi huwa alhudaa waumirnaa linuslima lirabbi al'aalamiina","translate":{"id":"Katakanlah: \"Apakah kita akan menyeru selain daripada Allah, sesuatu yang tidak dapat mendatangkan kemanfaatan kepada kita dan tidak (pula) mendatangkan kemudharatan kepada kita dan (apakah) kita akan kembali ke belakang , sesudah Allah memberi petunjuk kepada kita, seperti orang yang telah disesatkan oleh syaitan di pesawangan yang menakutkan; dalam keadaan bingung, dia mempunyai kawan-kawan yang memanggilnya kepada jalan yang lurus (dengan mengatakan): \"Marilah ikuti kami\". Katakanlah:\"Sesungguhnya petunjuk Allah itulah (yang sebenarnya) petunjuk; dan kita disuruh agar menyerahkan diri kepada Tuhan semesta alam,\n","en":"SAY: \"Shall we invoke, instead of God, something that can neither benefit us nor harm us, and [thus] turn around on our heels after God has guided us aright? -like one whom the satans have enticed into blundering after earthly lusts, the while his companions, trying to guide him, call out unto him [from afar], `Come thou to us!\"' Say: \"Verily, God's guidance is the only guidance: and so we have been bidden to surrender ourselves unto the Sustainer of all the worlds,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/860","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/860.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/860.mp3"]}},{"no":72,"arab":"وَأَنْ أَقِيمُوا الصَّلَاةَ وَاتَّقُوهُ ۚ وَهُوَ الَّذِي إِلَيْهِ تُحْشَرُونَ","latin":"wa-an aqiimuu alshshalaata waittaquuhu wahuwa alladzii ilayhi tuhsyaruuna","translate":{"id":"dan agar mendirikan sembahyang serta bertakwa kepadaNya\". Dan Dialah Tuhan yang kepadaNyalah kamu akan dihimpunkan.\n","en":"and to be constant in prayer and conscious of Him: for it is He unto whom you all shall be gathered.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/861","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/861.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/861.mp3"]}},{"no":73,"arab":"وَهُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ وَيَوْمَ يَقُولُ كُنْ فَيَكُونُ ۚ قَوْلُهُ الْحَقُّ ۚ وَلَهُ الْمُلْكُ يَوْمَ يُنْفَخُ فِي الصُّورِ ۚ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۚ وَهُوَ الْحَكِيمُ الْخَبِيرُ","latin":"wahuwa alladzii khalaqa alssamaawaati waal-ardha bialhaqqi wayawma yaquulu kun fayakuunu qawluhu alhaqqu walahu almulku yawma yunfakhu fii alshshuuri 'aalimu alghaybi waalsysyahaadati wahuwa alhakiimu alkhabiiru","translate":{"id":"Dan Dialah yang menciptakan langit dan bumi dengan benar. Dan benarlah perkataan-Nya di waktu Dia mengatakan: \"Jadilah, lalu terjadilah\", dan di tangan-Nyalah segala kekuasaan di waktu sangkakala ditiup. Dia mengetahui yang ghaib dan yang nampak. Dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui.\n","en":"And He it is who has created the heavens and the earth in accordance with [an inner] truth - and whenever He says, \"Be,\" His word comes true; and His will be the dominion on the Day when the trumpet [of resurrection] is blown. He knows all that is beyond the reach of a created being's perception, as well as all that can be witnessed by a creature's senses or mind: for He alone is truly wise, all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/862","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/862.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/862.mp3"]}},{"no":74,"arab":"وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ آزَرَ أَتَتَّخِذُ أَصْنَامًا آلِهَةً ۖ إِنِّي أَرَاكَ وَقَوْمَكَ فِي ضَلَالٍ مُبِينٍ","latin":"wa-idz qaala ibraahiimu li-abiihi aazara atattakhidzu ashnaaman aalihatan innii araaka waqawmaka fii dhalaalin mubiinin","translate":{"id":"Dan (ingatlah) di waktu Ibrahim berkata kepada bapaknya, Aazar , \"Pantaskah kamu menjadikan berhala-berhala sebagai tuhan-tuhan? Sesungguhnya aku melihat kamu dan kaummu dalam kesesatan yang nyata.\"\n","en":"AND, LO, [thus] spoke Abraham unto his father Azar: \"Takest thou idols for gods? Verily, I see that thou and thy people have obviously gone astray!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/863","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/863.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/863.mp3"]}},{"no":75,"arab":"وَكَذَٰلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَاوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ","latin":"wakadzaalika nurii ibraahiima malakuuta alssamaawaati waal-ardhi waliyakuuna mina almuuqiniina","translate":{"id":"Dan demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin.\n","en":"And thus We gave Abraham [his first] insight into [God's] mighty dominion over the heavens and the earth - and [this] to the end that he might become one of those who are inwardly sure."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/864","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/864.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/864.mp3"]}},{"no":76,"arab":"فَلَمَّا جَنَّ عَلَيْهِ اللَّيْلُ رَأَىٰ كَوْكَبًا ۖ قَالَ هَٰذَا رَبِّي ۖ فَلَمَّا أَفَلَ قَالَ لَا أُحِبُّ الْآفِلِينَ","latin":"falammaa janna 'alayhi allaylu raaa kawkaban qaala haadzaa rabbii falammaa afala qaala laa uhibbu al-aafiliina","translate":{"id":"Ketika malam telah gelap, dia melihat sebuah bintang (lalu) dia berkata: \"Inilah Tuhanku\", tetapi tatkala bintang itu tenggelam dia berkata: \"Saya tidak suka kepada yang tenggelam.\"\n","en":"Then, when the night overshadowed him with its darkness, he beheld a star;., [and] he exclaimed, \"This is my Sustainer!\" -but when it went down, he said, \"I love not the things that go down.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/865","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/865.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/865.mp3"]}},{"no":77,"arab":"فَلَمَّا رَأَى الْقَمَرَ بَازِغًا قَالَ هَٰذَا رَبِّي ۖ فَلَمَّا أَفَلَ قَالَ لَئِنْ لَمْ يَهْدِنِي رَبِّي لَأَكُونَنَّ مِنَ الْقَوْمِ الضَّالِّينَ","latin":"falammaa raaa alqamara baazighan qaala haadzaa rabbii falammaa afala qaala la-in lam yahdinii rabbii la-akuunanna mina alqawmi aldhdhaalliina","translate":{"id":"Kemudian tatkala dia melihat bulan terbit dia berkata: \"Inilah Tuhanku\". Tetapi setelah bulan itu terbenam, dia berkata: \"Sesungguhnya jika Tuhanku tidak memberi petunjuk kepadaku, pastilah aku termasuk orang yang sesat.\"\n","en":"Then, when he beheld the moon rising, he said, \"This is my Sustainer!\"-but when it went down, he said, \"Indeed, if my Sustainer guide me not. I will most certainly become one of the people who go astray!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/866","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/866.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/866.mp3"]}},{"no":78,"arab":"فَلَمَّا رَأَى الشَّمْسَ بَازِغَةً قَالَ هَٰذَا رَبِّي هَٰذَا أَكْبَرُ ۖ فَلَمَّا أَفَلَتْ قَالَ يَا قَوْمِ إِنِّي بَرِيءٌ مِمَّا تُشْرِكُونَ","latin":"falammaa raaa alsysyamsa baazighatan qaala haadzaa rabbii haadzaa akbaru falammaa afalat qaala yaa qawmi innii barii-un mimmaa tusyrikuuna","translate":{"id":"Kemudian tatkala ia melihat matahari terbit, dia berkata: \"Inilah Tuhanku, ini yang lebih besar\". Maka tatkala matahari itu terbenam, dia berkata: \"Hai kaumku, sesungguhnya aku berlepas diri dari apa yang kamu persekutukan.\n","en":"Then, when he beheld the sun rising, he said, \"This is my Sustainer! This one is the greatest [of all]!\" - but when it [too] went down, he exclaimed: \"O my people! Behold, far be it from me to ascribe divinity, as you do, to aught beside God!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/867","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/867.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/867.mp3"]}},{"no":79,"arab":"إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا ۖ وَمَا أَنَا مِنَ الْمُشْرِكِينَ","latin":"innii wajjahtu wajhiya lilladzii fathara alssamaawaati waal-ardha haniifan wamaa anaa mina almusyrikiina","translate":{"id":"Sesungguhnya aku menghadapkan diriku kepada Rabb yang menciptakan langit dan bumi, dengan cenderung kepada agama yang benar, dan aku bukanlah termasuk orang-orang yang mempersekutukan Tuhan.\n","en":"Behold, unto Him who brought into being the heavens and the earth have I turned my face, having turned away from all that is false; and I am not of those who ascribe divinity to aught beside Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/868","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/868.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/868.mp3"]}},{"no":80,"arab":"وَحَاجَّهُ قَوْمُهُ ۚ قَالَ أَتُحَاجُّونِّي فِي اللَّهِ وَقَدْ هَدَانِ ۚ وَلَا أَخَافُ مَا تُشْرِكُونَ بِهِ إِلَّا أَنْ يَشَاءَ رَبِّي شَيْئًا ۗ وَسِعَ رَبِّي كُلَّ شَيْءٍ عِلْمًا ۗ أَفَلَا تَتَذَكَّرُونَ","latin":"wahaajjahu qawmuhu qaala atuhaajjuunnii fii allaahi waqad hadaani walaa akhaafu maa tusyrikuuna bihi illaa an yasyaa-a rabbii syay-an wasi'a rabbii kulla syay-in 'ilman afalaa tatadzakkaruuna","translate":{"id":"Dan dia dibantah oleh kaumnya. Dia berkata: \"Apakah kamu hendak membantah tentang Allah, padahal sesungguhnya Allah telah memberi petunjuk kepadaku\". Dan aku tidak takut kepada (malapetaka dari) sembahan-sembahan yang kamu persekutukan dengan Allah, kecuali di kala Tuhanku menghendaki sesuatu (dari malapetaka) itu. Pengetahuan Tuhanku meliputi segala sesuatu. Maka apakah kamu tidak dapat mengambil pelajaran (daripadanya) ?\"\n","en":"And his people argued with him. He said: \"Do you argue with me about God, when it is He who has guided me? But I do not fear anything to which you ascribe divinity side by side with Him, [for no evil can befall me] unless my Sustainer so wills. All things does my Sustainer embrace within His knowledge; will you not, then, keep this in mind?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/869","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/869.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/869.mp3"]}},{"no":81,"arab":"وَكَيْفَ أَخَافُ مَا أَشْرَكْتُمْ وَلَا تَخَافُونَ أَنَّكُمْ أَشْرَكْتُمْ بِاللَّهِ مَا لَمْ يُنَزِّلْ بِهِ عَلَيْكُمْ سُلْطَانًا ۚ فَأَيُّ الْفَرِيقَيْنِ أَحَقُّ بِالْأَمْنِ ۖ إِنْ كُنْتُمْ تَعْلَمُونَ","latin":"wakayfa akhaafu maa asyraktum walaa takhaafuuna annakum asyraktum biallaahi maa lam yunazzil bihi 'alaykum sulthaanan fa-ayyu alfariiqayni ahaqqu bial-amni in kuntum ta'lamuuna","translate":{"id":"Bagaimana aku takut kepada sembahan-sembahan yang kamu persekutukan (dengan Allah), padahal kamu tidak mempersekutukan Allah dengan sembahan-sembahan yang Allah sendiri tidak menurunkan hujjah kepadamu untuk mempersekutukanNya. Maka manakah di antara dua golongan itu yang lebih berhak memperoleh keamanan (dari malapetaka), jika kamu mengetahui? .\n","en":"And why should I fear anything that you worship side by side with Him, seeing that you are not afraid of ascribing divinity to other powers beside God without His ever having bestowed upon you from on high any warrant therefor? [Tell me,] then, which of the two parties has a better right to feel secure -if you happen to know [the answer]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/870","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/870.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/870.mp3"]}},{"no":82,"arab":"الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ أُولَٰئِكَ لَهُمُ الْأَمْنُ وَهُمْ مُهْتَدُونَ","latin":"alladziina aamanuu walam yalbisuu iimaanahum bizhulmin ulaa-ika lahumu al-amnu wahum muhtaduuna","translate":{"id":"Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman (syirik), mereka itulah yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk.\n","en":"Those who have attained to faith, and who have not obscured their faith by wrongdoing-it is they who shall be secure, since it is they who have found the right path!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/871","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/871.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/871.mp3"]}},{"no":83,"arab":"وَتِلْكَ حُجَّتُنَا آتَيْنَاهَا إِبْرَاهِيمَ عَلَىٰ قَوْمِهِ ۚ نَرْفَعُ دَرَجَاتٍ مَنْ نَشَاءُ ۗ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٌ","latin":"watilka hujjatunaa aataynaahaa ibraahiima 'alaa qawmihi narfa'u darajaatin man nasyaau inna rabbaka hakiimun 'aliimun","translate":{"id":"Dan itulah hujjah Kami yang Kami berikan kepada Ibrahim untuk menghadapi kaumnya. Kami tinggikan siapa yang Kami kehendaki beberapa derajat. Sesungguhnya Tuhanmu Maha Bijaksana lagi Maha Mengetahui.\n","en":"And this was Our argument which We vouchsafed unto Abraham against his people: [for] We do raise by degrees whom We will. Verily, thy Sustainer is wise, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/872","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/872.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/872.mp3"]}},{"no":84,"arab":"وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا ۚ وَنُوحًا هَدَيْنَا مِنْ قَبْلُ ۖ وَمِنْ ذُرِّيَّتِهِ دَاوُودَ وَسُلَيْمَانَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَارُونَ ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ","latin":"wawahabnaa lahu ishaaqa waya'quuba kullan hadaynaa wanuuhan hadaynaa min qablu wamin dzurriyyatihi daawuuda wasulaymaana wa-ayyuuba wayuusufa wamuusaa wahaaruuna wakadzaalika najzii almuhsiniina","translate":{"id":"Dan Kami telah menganugerahkan Ishak dan Yaqub kepadanya. Kepada keduanya masing-masing telah Kami beri petunjuk; dan kepada Nuh sebelum itu (juga) telah Kami beri petunjuk, dan kepada sebahagian dari keturunannya (Nuh) yaitu Daud, Sulaiman, Ayyub, Yusuf, Musa dan Harun. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.\n","en":"And We bestowed upon him Isaac and Jacob; and We guided each of them as We had guided Noah aforetime. And out of his offspring, [We bestowed prophethood upon] David, and Solomon, and Job, and Joseph, and Moses, and Aaron: for thus do We reward the doers of good;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/873","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/873.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/873.mp3"]}},{"no":85,"arab":"وَزَكَرِيَّا وَيَحْيَىٰ وَعِيسَىٰ وَإِلْيَاسَ ۖ كُلٌّ مِنَ الصَّالِحِينَ","latin":"wazakariyyaa wayahyaa wa'iisaa wailyaasa kullun mina alshshaalihiina","translate":{"id":"dan Zakaria, Yahya, 'Isa dan Ilyas. Semuanya termasuk orang-orang yang shaleh.\n","en":"and [upon] Zachariah, and John, and Jesus, and Elijah: every one of them was of the righteous;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/874","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/874.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/874.mp3"]}},{"no":86,"arab":"وَإِسْمَاعِيلَ وَالْيَسَعَ وَيُونُسَ وَلُوطًا ۚ وَكُلًّا فَضَّلْنَا عَلَى الْعَالَمِينَ","latin":"wa-ismaa'iila wailyasa'a wayuunusa waluuthan wakullan fadhdhalnaa 'alaa al'aalamiina","translate":{"id":"dan Ismail, Alyasa', Yunus dan Luth. Masing-masing Kami lebihkan derajatnya di atas umat (di masanya),\n","en":"and [upon] Ishmael, and Elisha, and Jonah, and Lot. And every one of them did We favour above other people;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/875","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/875.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/875.mp3"]}},{"no":87,"arab":"وَمِنْ آبَائِهِمْ وَذُرِّيَّاتِهِمْ وَإِخْوَانِهِمْ ۖ وَاجْتَبَيْنَاهُمْ وَهَدَيْنَاهُمْ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","latin":"wamin aabaa-ihim wadzurriyyaatihim wa-ikhwaanihim waijtabaynaahum wahadaynaahum ilaa shiraathin mustaqiimin","translate":{"id":"Dan Kami lebihkan (pula) derajat sebahagian dari bapak-bapak mereka, keturunan dan saudara-saudara mereka. Dan Kami telah memilih mereka (untuk menjadi nabi-nabi dan rasul-rasul) dan Kami menunjuki mereka ke jalan yang lurus.\n","en":"and [We exalted likewise] some of their forefathers and-their offspring and their brethren: We elected them [all], and guided them onto a straight way."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/876","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/876.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/876.mp3"]}},{"no":88,"arab":"ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۚ وَلَوْ أَشْرَكُوا لَحَبِطَ عَنْهُمْ مَا كَانُوا يَعْمَلُونَ","latin":"dzaalika hudaa allaahi yahdii bihi man yasyaau min 'ibaadihi walaw asyrakuu lahabitha 'anhum maa kaanuu ya'maluuna","translate":{"id":"Itulah petunjuk Allah, yang dengannya Dia memberi petunjuk kepada siapa yang dikehendakiNya di antara hamba-hambaNya. Seandainya mereka mempersekutukan Allah, niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan.\n","en":"Such is God's guidance: He guides therewith whomever He wills of His servants. And had they ascribed divinity to aught beside Him-in vain, indeed, would have been all [the good] that they ever did:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/877","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/877.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/877.mp3"]}},{"no":89,"arab":"أُولَٰئِكَ الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ ۚ فَإِنْ يَكْفُرْ بِهَا هَٰؤُلَاءِ فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَيْسُوا بِهَا بِكَافِرِينَ","latin":"ulaa-ika alladziina aataynaahumu alkitaaba waalhukma waalnnubuwwata fa-in yakfur bihaa haaulaa-i faqad wakkalnaa bihaa qawman laysuu bihaa bikaafiriina","translate":{"id":"Mereka itulah orang-orang yang telah Kami berikan kitab, hikmat dan kenabian Jika orang-orang (Quraisy) itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya.\n","en":"[but] it was to them that We vouchsafed revelation, and sound judgment, and prophethood. And now, although the unbelievers may choose to deny these truths, [know that] We have entrusted them to people who will never refuse to acknowledge them-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/878","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/878.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/878.mp3"]}},{"no":90,"arab":"أُولَٰئِكَ الَّذِينَ هَدَى اللَّهُ ۖ فَبِهُدَاهُمُ اقْتَدِهْ ۗ قُلْ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا ۖ إِنْ هُوَ إِلَّا ذِكْرَىٰ لِلْعَالَمِينَ","latin":"ulaa-ika alladziina hadaa allaahu fabihudaahumu iqtadih qul laa as-alukum 'alayhi ajran in huwa illaa dzikraa lil'aalamiina","translate":{"id":"Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka. Katakanlah: \"Aku tidak meminta upah kepadamu dalam menyampaikan (Al-Quraan).\" Al-Quraan itu tidak lain hanyalah peringatan untuk seluruh ummat.\n","en":"to those whom God has guided. Follow, then, their guidance, [and] say: \"No reward do I ask of you for this [truth]: behold, it is but an admonition unto all mankind!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/879","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/879.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/879.mp3"]}},{"no":91,"arab":"وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ إِذْ قَالُوا مَا أَنْزَلَ اللَّهُ عَلَىٰ بَشَرٍ مِنْ شَيْءٍ ۗ قُلْ مَنْ أَنْزَلَ الْكِتَابَ الَّذِي جَاءَ بِهِ مُوسَىٰ نُورًا وَهُدًى لِلنَّاسِ ۖ تَجْعَلُونَهُ قَرَاطِيسَ تُبْدُونَهَا وَتُخْفُونَ كَثِيرًا ۖ وَعُلِّمْتُمْ مَا لَمْ تَعْلَمُوا أَنْتُمْ وَلَا آبَاؤُكُمْ ۖ قُلِ اللَّهُ ۖ ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ","latin":"wamaa qadaruu allaaha haqqa qadrihi idz qaaluu maa anzala allaahu 'alaa basyarin min syay-in qul man anzala alkitaaba alladzii jaa-a bihi muusaa nuuran wahudan lilnnaasi taj'aluunahu qaraathiisa tubduunahaa watukhfuuna katsiiran wa'ullimtum maa lam ta'lamuu antum walaa aabaaukum quli allaahu tsumma dzarhum fii khawdhihim yal'abuuna","translate":{"id":"Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya, di kala mereka berkata: \"Allah tidak menurunkan sesuatupun kepada manusia\". Katakanlah: \"Siapakah yang menurunkan kitab (Taurat) yang dibawa oleh Musa sebagai cahaya dan petunjuk bagi manusia, kamu jadikan kitab itu lembaran-lembaran kertas yang bercerai-berai, kamu perlihatkan (sebahagiannya) dan kamu sembunyikan sebahagian besarnya, padahal telah diajarkan kepadamu apa yang kamu dan bapak-bapak kamu tidak mengetahui(nya) ?\" Katakanlah: \"Allah-lah (yang menurunkannya)\", kemudian (sesudah kamu menyampaikan Al Quraan kepada mereka), biarkanlah mereka bermain-main dalam kesesatannya .\n","en":"For, no true understanding of God have they when they say, \"Never has God revealed anything unto man.\" Say: \"Who has bestowed from on high the divine writ which Moses brought unto men as a light and a guidance, [and] which you treat as [mere] leaves of paper, making a show of them the while you conceal [so] much - although you have been taught [by it] what neither you nor your forefathers had ever known?\" Say: \"God [has revealed that divine writ]!\" - and then leave them to play at their vain talk."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/880","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/880.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/880.mp3"]}},{"no":92,"arab":"وَهَٰذَا كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ مُصَدِّقُ الَّذِي بَيْنَ يَدَيْهِ وَلِتُنْذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا ۚ وَالَّذِينَ يُؤْمِنُونَ بِالْآخِرَةِ يُؤْمِنُونَ بِهِ ۖ وَهُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ","latin":"wahaadzaa kitaabun anzalnaahu mubaarakun mushaddiqu alladzii bayna yadayhi walitundzira umma alquraa waman hawlahaa waalladziina yu/minuuna bial-aakhirati yu/minuuna bihi wahum 'alaa shalaatihim yuhaafizhuuna","translate":{"id":"Dan ini (Al Quraan) adalah kitab yang telah Kami turunkan yang diberkahi; membenarkan kitab-kitab yang (diturunkan) sebelumnya dan agar kamu memberi peringatan kepada (penduduk) Ummul Qura (Mekah) dan orang-orang yang di luar lingkungannya. Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya (Al Quraan) dan mereka selalu memelihara sembahyangnya.\n","en":"And this, too, is a divine writ which We have bestowed from on high - blessed, confirming the truth of whatever there still remains [of earlier revelations] -and [this] in order that thou mayest warn the foremost of all cities and all who dwell around it. And those who believe in the life to come do believe in this [warning]; and it is they who are ever-mindful of their prayers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/881","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/881.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/881.mp3"]}},{"no":93,"arab":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ قَالَ أُوحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ وَمَنْ قَالَ سَأُنْزِلُ مِثْلَ مَا أَنْزَلَ اللَّهُ ۗ وَلَوْ تَرَىٰ إِذِ الظَّالِمُونَ فِي غَمَرَاتِ الْمَوْتِ وَالْمَلَائِكَةُ بَاسِطُو أَيْدِيهِمْ أَخْرِجُوا أَنْفُسَكُمُ ۖ الْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنْتُمْ تَقُولُونَ عَلَى اللَّهِ غَيْرَ الْحَقِّ وَكُنْتُمْ عَنْ آيَاتِهِ تَسْتَكْبِرُونَ","latin":"waman azhlamu mimmani iftaraa 'alaa allaahi kadziban aw qaala uuhiya ilayya walam yuuha ilayhi syay-un waman qaala saunzilu mitsla maa anzala allaahu walaw taraa idzi alzhzhaalimuuna fii ghamaraati almawti waalmalaa-ikatu baasithuu aydiihim akhrijuu anfusakumu alyawma tujzawna 'adzaaba alhuuni bimaa kuntum taquuluuna 'alaa allaahi ghayra alhaqqi wakuntum 'an aayaatihi tastakbiruuna","translate":{"id":"Dan siapakah yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah atau yang berkata: \"Telah diwahyukan kepada saya\", padahal tidak ada diwahyukan sesuatupun kepadanya, dan orang yang berkata: \"Saya akan menurunkan seperti apa yang diturunkan Allah.\" Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim berada dalam tekanan sakratul maut, sedang para malaikat memukul dengan tangannya, (sambil berkata): \"Keluarkanlah nyawamu\" Di hari ini kamu dibalas dengan siksa yang sangat menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayatNya.\n","en":"And who could be more wicked than he who invents a lie about God, or says, \"This has been revealed unto me,\" the while nothing has been revealed to him? - or he who says, \"I, too, can bestow from on high the like of what God has bestowed\"? If thou couldst but see [how it will be] when these evildoers find themselves in the agonies of death, and the angels stretch forth their hands [and call]: \"Give up your souls! Today you shall be requited with the suffering of humiliation for having attributed to God something that is not true, and for having persistently scorned His messages in your arrogance!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/882","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/882.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/882.mp3"]}},{"no":94,"arab":"وَلَقَدْ جِئْتُمُونَا فُرَادَىٰ كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُمْ مَا خَوَّلْنَاكُمْ وَرَاءَ ظُهُورِكُمْ ۖ وَمَا نَرَىٰ مَعَكُمْ شُفَعَاءَكُمُ الَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَاءُ ۚ لَقَدْ تَقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنْكُمْ مَا كُنْتُمْ تَزْعُمُونَ","latin":"walaqad ji/tumuunaa furaadaa kamaa khalaqnaakum awwala marratin wataraktum maa khawwalnaakum waraa-a zhuhuurikum wamaa naraa ma'akum syufa'aa-akumu alladziina za'amtum annahum fiikum syurakaau laqad taqaththha'a baynakum wadhalla 'ankum maa kuntum taz'umuuna","translate":{"id":"Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri sebagaimana kamu Kami ciptakan pada mulanya, dan kamu tinggalkan di belakangmu (di dunia) apa yang telah Kami karuniakan kepadamu; dan Kami tiada melihat besertamu pemberi syafa'at yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu. Sungguh telah terputuslah (pertalian) antara kamu dan telah lenyap daripada kamu apa yang dahulu kamu anggap (sebagai sekutu Allah).\n","en":"[And God shall say:] \"And now, indeed, you have come unto Us in a lonely state, even as We created you in the first instance; and you have left behind you all that We bestowed on you [in your lifetime]. And We do not see with you those intercessors of yours whom you supposed to have a share in God's divinity with regard to yourselves! Indeed, all the bonds between you [and your earthly life] are now severed, and all your former fancies have forsaken you!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/883","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/883.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/883.mp3"]}},{"no":95,"arab":"إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ ۖ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ ۚ ذَٰلِكُمُ اللَّهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ","latin":"inna allaaha faaliqu alhabbi waalnnawaa yukhriju alhayya mina almayyiti wamukhriju almayyiti mina alhayyi dzaalikumu allaahu fa-annaa tu/fakuuna","translate":{"id":"Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan. Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. (Yang memiliki sifat-sifat) demikian ialah Allah, maka mengapa kamu masih berpaling?\n","en":"VERILY, God is the One who cleaves the grain and the fruit-kernel asunder, bringing forth the living out of that which is dead, and He is the One who brings forth the dead out of that which is alive. This, then, is God: and yet, how perverted are your minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/884","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/884.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/884.mp3"]}},{"no":96,"arab":"فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا وَالشَّمْسَ وَالْقَمَرَ حُسْبَانًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ","latin":"faaliqu al-ishbaahi waja'ala allayla sakanan waalsysyamsa waalqamara husbaanan dzaalika taqdiiru al'aziizi al'aliimi","translate":{"id":"Dia menyingsingkan pagi dan menjadikan malam untuk beristirahat, dan (menjadikan) matahari dan bulan untuk perhitungan. Itulah ketentuan Allah Yang Maha Perkasa lagi Maha Mengetahui.\n","en":"[He is] the One who causes the dawn to break; and He has made the night to be [a source of] stillness, and the sun and the moon to run their appointed courses: [all] this is laid down by the will of the Almighty, the All-Knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/885","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/885.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/885.mp3"]}},{"no":97,"arab":"وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ","latin":"wahuwa alladzii ja'ala lakumu alnnujuuma litahtaduu bihaa fii zhulumaati albarri waalbahri qad fashshalnaa al-aayaati liqawmin ya'lamuuna","translate":{"id":"Dan Dialah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannya petunjuk dalam kegelapan di darat dan di laut. Sesungguhnya Kami telah menjelaskan tanda-tanda kebesaran (Kami) kepada orang-orang yang mengetahui.\n","en":"And He it is who has set up for you the stars so that you might be guided by them in the midst of the deep darkness of land and sea: clearly, indeed, have We spelled out these messages unto people of [innate] knowledge!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/886","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/886.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/886.mp3"]}},{"no":98,"arab":"وَهُوَ الَّذِي أَنْشَأَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ فَمُسْتَقَرٌّ وَمُسْتَوْدَعٌ ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَفْقَهُونَ","latin":"wahuwa alladzii ansya-akum min nafsin waahidatin famustaqarrun wamustawda'un qad fashshalnaa al-aayaati liqawmin yafqahuuna","translate":{"id":"Dan Dialah yang menciptakan kamu dari seorang diri , maka (bagimu) ada tempat tetap dan tempat simpanan . Sesungguhnya telah Kami jelaskan tanda-tanda kebesaran Kami kepada orang-orang yang mengetahui.\n","en":"And He it is who has brought you [all] into being out of one living entity, and [has appointed for each of you] a time-limit [on earth] and a resting-place [after death]: clearly, indeed, have We spelled out these messages unto people who can grasp the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/887","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/887.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/887.mp3"]}},{"no":99,"arab":"وَهُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ نَبَاتَ كُلِّ شَيْءٍ فَأَخْرَجْنَا مِنْهُ خَضِرًا نُخْرِجُ مِنْهُ حَبًّا مُتَرَاكِبًا وَمِنَ النَّخْلِ مِنْ طَلْعِهَا قِنْوَانٌ دَانِيَةٌ وَجَنَّاتٍ مِنْ أَعْنَابٍ وَالزَّيْتُونَ وَالرُّمَّانَ مُشْتَبِهًا وَغَيْرَ مُتَشَابِهٍ ۗ انْظُرُوا إِلَىٰ ثَمَرِهِ إِذَا أَثْمَرَ وَيَنْعِهِ ۚ إِنَّ فِي ذَٰلِكُمْ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ","latin":"wahuwa alladzii anzala mina alssamaa-i maa-an fa-akhrajnaa bihi nabaata kulli syay-in fa-akhrajnaa minhu khadhiran nukhriju minhu habban mutaraakiban wamina alnnakhli min thal'ihaa qinwaanun daaniyatun wajannaatin min a'naabin waalzzaytuuna waalrrummaana musytabihan waghayra mutasyaabihin unzhuruu ilaa tsamarihi idzaa atsmara wayan'ihi inna fii dzaalikum laaayaatin liqawmin yu/minuuna","translate":{"id":"Dan Dialah yang menurunkan air hujan dari langit, lalu Kami tumbuhkan dengan air itu segala macam tumbuh-tumbuhan maka Kami keluarkan dari tumbuh-tumbuhan itu tanaman yang menghijau. Kami keluarkan dari tanaman yang menghijau itu butir yang banyak; dan dari mayang korma mengurai tangkai-tangkai yang menjulai, dan kebun-kebun anggur, dan (Kami keluarkan pula) zaitun dan delima yang serupa dan yang tidak serupa. Perhatikanlah buahnya di waktu pohonnya berbuah dan (perhatikan pulalah) kematangannya. Sesungguhnya pada yang demikian itu ada tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman.\n","en":"And He it is who has caused waters to come down from the sky; and by this means have We brought forth all living growth, and out of this have We brought forth verdure. Out of this do We bring forth close-growing grain; and out of the spathe of the palm tree, dates in thick clusters; and gardens of vines, and the olive tree, and the pomegranate: [all] so alike, and yet so different! Behold their fruit when it comes to fruition and ripens! Verily, in all this there are messages indeed for people who will believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/888","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/888.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/888.mp3"]}},{"no":100,"arab":"وَجَعَلُوا لِلَّهِ شُرَكَاءَ الْجِنَّ وَخَلَقَهُمْ ۖ وَخَرَقُوا لَهُ بَنِينَ وَبَنَاتٍ بِغَيْرِ عِلْمٍ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يَصِفُونَ","latin":"waja'aluu lillaahi syurakaa-a aljinna wakhalaqahum wakharaquu lahu baniina wabanaatin bighayri 'ilmin subhaanahu wata'aalaa 'ammaa yashifuuna","translate":{"id":"Dan mereka (orang-orang musyrik) menjadikan jin itu sekutu bagi Allah, padahal Allah-lah yang menciptakan jin-jin itu, dan mereka membohong (dengan mengatakan): \"Bahwasanya Allah mempunyai anak laki-laki dan perempuan\", tanpa (berdasar) ilmu pengetahuan . Maha Suci Allah dan Maha Tinggi dari sifat-sifat yang mereka berikan.\n","en":"And yet, some [people] have come to attribute to all manner of invisible beings a place side by side with God - although it is He who has created them [all]; and in their ignorance they have invented for Him sons and daughters! Limitless is He is His glory, and sublimely exalted above anything that men may devise by way of definition:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/889","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/889.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/889.mp3"]}},{"no":101,"arab":"بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ أَنَّىٰ يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُنْ لَهُ صَاحِبَةٌ ۖ وَخَلَقَ كُلَّ شَيْءٍ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"badii'u alssamaawaati waal-ardhi annaa yakuunu lahu waladun walam takun lahu shaahibatun wakhalaqa kulla syay-in wahuwa bikulli syay-in 'aliimun","translate":{"id":"Dia Pencipta langit dan bumi. Bagaimana Dia mempunyai anak padahal Dia tidak mempunyai isteri. Dia menciptakan segala sesuatu; dan Dia mengetahui segala sesuatu.\n","en":"the Originator of the heavens and the earth! How could it be that He should have a child without there ever having been a mate for Him - since it is He who has created everything, and He alone knows everything?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/890","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/890.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/890.mp3"]}},{"no":102,"arab":"ذَٰلِكُمُ اللَّهُ رَبُّكُمْ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ خَالِقُ كُلِّ شَيْءٍ فَاعْبُدُوهُ ۚ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ","latin":"dzaalikumu allaahu rabbukum laa ilaaha illaa huwa khaaliqu kulli syay-in fau'buduuhu wahuwa 'alaa kulli syay-in wakiilun","translate":{"id":"(Yang memiliki sifat-sifat yang) demikian itu ialah Allah Tuhan kamu; tidak ada Tuhan selain Dia; Pencipta segala sesuatu, maka sembahlah Dia; dan Dia adalah Pemelihara segala sesuatu.\n","en":"Such is God, your Sustainer: there is no deity save Him, the Creator of everything: worship, then, Him alone -for it is He who has everything in His care."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/891","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/891.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/891.mp3"]}},{"no":103,"arab":"لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ ۖ وَهُوَ اللَّطِيفُ الْخَبِيرُ","latin":"laa tudrikuhu al-abshaaru wahuwa yudriku al-abshaara wahuwa allathiifu alkhabiiru","translate":{"id":"Dia tidak dapat dicapai oleh penglihatan mata, sedang Dia dapat melihat segala yang kelihatan; dan Dialah Yang Maha Halus lagi Maha Mengetahui.\n","en":"No human vision can encompass Him, whereas He encompasses all human vision: for He alone is unfathomable, all-aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/892","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/892.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/892.mp3"]}},{"no":104,"arab":"قَدْ جَاءَكُمْ بَصَائِرُ مِنْ رَبِّكُمْ ۖ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ ۖ وَمَنْ عَمِيَ فَعَلَيْهَا ۚ وَمَا أَنَا عَلَيْكُمْ بِحَفِيظٍ","latin":"qad jaa-akum bashaa-iru min rabbikum faman abshara falinafsihi waman 'amiya fa'alayhaa wamaa anaa 'alaykum bihafiizhin","translate":{"id":"Sesungguhnya telah datang dari Tuhanmu bukti-bukti yang terang; maka barangsiapa melihat (kebenaran itu) , maka (manfa'atnya) bagi dirinya sendiri; dan barangsiapa buta (tidak melihat kebenaran itu), maka kemudharatannya kembali kepadanya. Dan aku (Muhammad) sekali-kali bukanlah pemelihara(mu).\n","en":"Means of insight have now come unto you from your Sustainer [through this divine writ]. Whoever, therefore, chooses to see, does so for his own good; and whoever chooses to remain blind, does so to his own hurt. And [say unto the blind of heart]: \"I am not your keeper.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/893","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/893.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/893.mp3"]}},{"no":105,"arab":"وَكَذَٰلِكَ نُصَرِّفُ الْآيَاتِ وَلِيَقُولُوا دَرَسْتَ وَلِنُبَيِّنَهُ لِقَوْمٍ يَعْلَمُونَ","latin":"wakadzaalika nusharrifu al-aayaati waliyaquuluu darasta walinubayyinahu liqawmin ya'lamuuna","translate":{"id":"Demikianlah Kami mengulang-ulangi ayat-ayat Kami supaya (orang-orang yang beriman mendapat petunjuk) dan supaya orang-orang musyrik mengatakan: \"Kamu telah mempelajari ayat-ayat itu (dari Ahli Kitab)\", dan supaya Kami menjelaskan Al Quraan itu kepada orang-orang yang mengetahui.\n","en":"And thus do We give many facets to Our messages. And to the end that they might say, \"Thou hast taken [all this] well to heart,\" and that We might make it clear unto people of [innate] knowledge,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/894","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/894.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/894.mp3"]}},{"no":106,"arab":"اتَّبِعْ مَا أُوحِيَ إِلَيْكَ مِنْ رَبِّكَ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ","latin":"ittabi' maa uuhiya ilayka min rabbika laa ilaaha illaa huwa wa-a'ridh 'ani almusyrikiina","translate":{"id":"Ikutilah apa yang telah diwahyukan kepadamu dari Tuhanmu; tidak ada Tuhan selain Dia; dan berpalinglah dari orang-orang musyrik.\n","en":"follow thou what has been revealed unto thee by thy Sustainer - save whom there is no deity - and turn thy back upon all who ascribe divinity to aught beside Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/895","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/895.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/895.mp3"]}},{"no":107,"arab":"وَلَوْ شَاءَ اللَّهُ مَا أَشْرَكُوا ۗ وَمَا جَعَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ","latin":"walaw syaa-a allaahu maa asyrakuu wamaa ja'alnaaka 'alayhim hafiizhan wamaa anta 'alayhim biwakiilin","translate":{"id":"Dan kalau Allah menghendaki, niscaya mereka tidak memperkutukan(Nya). Dan Kami tidak menjadikan kamu pemelihara bagi mereka; dan kamu sekali-kali bukanlah pemelihara bagi mereka.\n","en":"Yet if God had so willed, they would not have ascribed divinity to aught beside Him; hence, We have not made thee their keeper, and neither art thou responsible for their conduct."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/896","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/896.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/896.mp3"]}},{"no":108,"arab":"وَلَا تَسُبُّوا الَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ عِلْمٍ ۗ كَذَٰلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ ثُمَّ إِلَىٰ رَبِّهِمْ مَرْجِعُهُمْ فَيُنَبِّئُهُمْ بِمَا كَانُوا يَعْمَلُونَ","latin":"walaa tasubbuu alladziina yad'uuna min duuni allaahi fayasubbuu allaaha 'adwan bighayri 'ilmin kadzaalika zayyannaa likulli ummatin 'amalahum tsumma ilaa rabbihim marji'uhum fayunabbi-uhum bimaa kaanuu ya'maluuna","translate":{"id":"Dan janganlah kamu memaki sembahan-sembahan yang mereka sembah selain Allah, karena mereka nanti akan memaki Allah dengan melampaui batas tanpa pengetahuan. Demikianlah Kami jadikan setiap umat menganggap baik pekerjaan mereka. Kemudian kepada Tuhan merekalah kembali mereka, lalu Dia memberitakan kepada mereka apa yang dahulu mereka kerjakan.\n","en":"But do not revile those [beings] whom they invoke instead of God, lest they revile God out of spite, and in ignorance: for, goodly indeed have We made their own doings appear unto every community In time, [however,] unto their Sustainer they must return: and then He will make them [truly] understand all that they were doing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/897","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/897.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/897.mp3"]}},{"no":109,"arab":"وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ جَاءَتْهُمْ آيَةٌ لَيُؤْمِنُنَّ بِهَا ۚ قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ ۖ وَمَا يُشْعِرُكُمْ أَنَّهَا إِذَا جَاءَتْ لَا يُؤْمِنُونَ","latin":"wa-aqsamuu biallaahi jahda aymaanihim la-in jaa-at-hum aayatun layu/minunna bihaa qul innamaa al-aayaatu 'inda allaahi wamaa yusy'irukum annahaa idzaa jaa-at laa yu/minuuna","translate":{"id":"Mereka bersumpah dengan nama Allah dengan segala kesungguhan, bahwa sungguh jika datang kepada mereka sesuatu mu jizat, pastilah mereka beriman kepada-Nya. Katakanlah: \"Sesungguhnya mu'jizat-mu'jizat itu hanya berada di sisi Allah\". Dan apakah yang memberitahukan kepadamu bahwa apabila mu'jizat datang mereka tidak akan beriman .\n","en":"Now they swear by God with their most solemn oaths that if a miracle were shown to them, they would indeed believe in this [divine writ]. Say: \"Miracles are in the power of God alone.\" And for all you know, even if one should be shown to them, they would not believe"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/898","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/898.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/898.mp3"]}},{"no":110,"arab":"وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ","latin":"wanuqallibu af-idatahum wa-abshaarahum kamaa lam yu/minuu bihi awwala marratin wanadzaruhum fii thughyaanihim ya'mahuuna","translate":{"id":"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quraan) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\n","en":"so long as We keep their hearts and their eyes turned [away from the truth], even as they did not believe in it in the first instance: and [so] We shall leave them in their overweening arrogance, blindly stumbling to and fro."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/899","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/899.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/899.mp3"]}},{"no":111,"arab":"وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلَائِكَةَ وَكَلَّمَهُمُ الْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلًا مَا كَانُوا لِيُؤْمِنُوا إِلَّا أَنْ يَشَاءَ اللَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ","latin":"walaw annanaa nazzalnaa ilayhimu almalaa-ikata wakallamahumu almawtaa wahasyarnaa 'alayhim kulla syay-in qubulan maa kaanuu liyu/minuu illaa an yasyaa-a allaahu walaakinna aktsarahum yajhaluuna","translate":{"id":"Kalau sekiranya Kami turunkan malaikat kepada mereka, dan orang-orang yang telah mati berbicara dengan mereka dan Kami kumpulkan (pula) segala sesuatu ke hadapan mereka , niscaya mereka tidak (juga) akan beriman, kecuali jika Allah menghendaki, tetapi kebanyakan mereka tidak mengetahui.\n","en":"And even if We were to send down angels unto them, and if the dead were to speak unto them and [even if] We were to assemble before them, face to face, all the things [that can prove the truth], they would still not believe unless God so willed But [of this] most of them are entirely unaware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/900","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/900.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/900.mp3"]}},{"no":112,"arab":"وَكَذَٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيَاطِينَ الْإِنْسِ وَالْجِنِّ يُوحِي بَعْضُهُمْ إِلَىٰ بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُورًا ۚ وَلَوْ شَاءَ رَبُّكَ مَا فَعَلُوهُ ۖ فَذَرْهُمْ وَمَا يَفْتَرُونَ","latin":"wakadzaalika ja'alnaa likulli nabiyyin 'aduwwan syayaathiina al-insi waaljinni yuuhii ba'dhuhum ilaa ba'dhin zukhrufa alqawli ghuruuran walaw syaa-a rabbuka maa fa'aluuhu fadzarhum wamaa yaftaruuna","translate":{"id":"Dan demikianlah Kami jadikan bagi tiap-tiap nabi itu musuh, yaitu syaitan-syaitan (dari jenis) manusia dan (dan jenis) jin, sebahagian mereka membisikkan kepada sebahagian yang lain perkataan-perkataan yang indah-indah untuk menipu (manusia) . Jikalau Tuhanmu menghendaki, niscaya mereka tidak mengerjakannya, maka tinggalkanlah mereka dan apa yang mereka ada-adakan.\n","en":"AND THUS it is that against every prophet We have set up as enemies the evil forces from among humans as well as from among invisible beings that whisper unto one another glittering half-truths meant to delude the mind But they could not do this unless thy Sustainer had so willed: stand, therefore, aloof from them and from all their false imagery!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/901","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/901.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/901.mp3"]}},{"no":113,"arab":"وَلِتَصْغَىٰ إِلَيْهِ أَفْئِدَةُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَلِيَرْضَوْهُ وَلِيَقْتَرِفُوا مَا هُمْ مُقْتَرِفُونَ","latin":"walitashghaa ilayhi af-idatu alladziina laa yu/minuuna bial-aakhirati waliyardhawhu waliyaqtarifuu maa hum muqtarifuuna","translate":{"id":"Dan (juga) agar hati kecil orang-orang yang tidak beriman kepada kehidupan akhirat cenderung kepada bisikan itu, mereka merasa senang kepadanya dan supaya mereka mengerjakan apa yang mereka (syaitan) kerjakan.\n","en":"Yet, to the end that the hearts of those who do not believe in the life to come might incline towards Him, and that in Him they might find contentment, and that they might earn whatever they can earn [of merit] -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/902","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/902.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/902.mp3"]}},{"no":114,"arab":"أَفَغَيْرَ اللَّهِ أَبْتَغِي حَكَمًا وَهُوَ الَّذِي أَنْزَلَ إِلَيْكُمُ الْكِتَابَ مُفَصَّلًا ۚ وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْلَمُونَ أَنَّهُ مُنَزَّلٌ مِنْ رَبِّكَ بِالْحَقِّ ۖ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ","latin":"afaghayra allaahi abtaghii hakaman wahuwa alladzii anzala ilaykumu alkitaaba mufashshalan waalladziina aataynaahumu alkitaaba ya'lamuuna annahu munazzalun min rabbika bialhaqqi falaa takuunanna mina almumtariina","translate":{"id":"Maka patutkah aku mencari hakim selain daripada Allah, padahal Dialah yang telah menurunkan kitab (Al Quraan) kepadamu dengan terperinci? Orang-orang yang telah Kami datangkan kitab kepada mereka, mereka mengetahui bahwa Al Quraan itu diturunkan dari Tuhanmu dengan sebenarnya. Maka janganlah kamu sekali-kali termasuk orang yang ragu-ragu.\n","en":"[say thou:] \"Am I, then, to look unto anyone but God for judgment [as to what is right and wrong], when it is He who has bestowed upon you from on high this divine writ, clearly spelling out the truth?\" And those unto whom We have vouchsafed revelation aforetime know that this one, too, has been bestowed from on high, step by step, by thy Sustainer. Be not, then, among the doubters-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/903","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/903.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/903.mp3"]}},{"no":115,"arab":"وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَعَدْلًا ۚ لَا مُبَدِّلَ لِكَلِمَاتِهِ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","latin":"watammat kalimatu rabbika shidqan wa'adlan laa mubaddila likalimaatihi wahuwa alssamii'u al'aliimu","translate":{"id":"Telah sempurnalah kalimat Tuhanmu (Al-Quraan) sebagai kalimat yang benar dan adil. Tidak ada yang dapat merobah robah kalimat-kalimat-Nya dan Dia lah yang Maha Mendenyar lagi Maha Mengetahui.\n","en":"for, truly and justly has thy Sustainer's promise been fulfilled. There is no power that could alter [the fulfilment of] His promises: and He alone is all-hearing, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/904","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/904.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/904.mp3"]}},{"no":116,"arab":"وَإِنْ تُطِعْ أَكْثَرَ مَنْ فِي الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ اللَّهِ ۚ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ هُمْ إِلَّا يَخْرُصُونَ","latin":"wa-in tuthi' aktsara man fii al-ardhi yudhilluuka 'an sabiili allaahi in yattabi'uuna illaa alzhzhanna wa-in hum illaa yakhrushuuna","translate":{"id":"Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah. Mereka tidak lain hanyalah mengikuti persangkaan belaka, dan mereka tidak lain hanyalah berdusta (terhadap Allah) .\n","en":"Now if thou pay heed unto the majority of those [who live] on earth, they will but lead thee astray from the path of God: they follow but [other people's] conjectures, and they themselves do nothing but guess."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/905","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/905.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/905.mp3"]}},{"no":117,"arab":"إِنَّ رَبَّكَ هُوَ أَعْلَمُ مَنْ يَضِلُّ عَنْ سَبِيلِهِ ۖ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ","latin":"inna rabbaka huwa a'lamu man yadhillu 'an sabiilihi wahuwa a'lamu bialmuhtadiina","translate":{"id":"Sesungguhnya Tuhanmu, Dia-lah yang lebih mengetahui tentang orang yang tersesat dari jalan-Nya dan Dia lebih mengetahui tentang orang orang yang mendapat petunjuk.\n","en":"Verily, thy Sustainer knows best as to who strays from His path, and best knows He as to who are the right-guided."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/906","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/906.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/906.mp3"]}},{"no":118,"arab":"فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ إِنْ كُنْتُمْ بِآيَاتِهِ مُؤْمِنِينَ","latin":"fakuluu mimmaa dzukira ismu allaahi 'alayhi in kuntum bi-aayaatihi mu/miniina","translate":{"id":"Maka makanlah binatang-binatang (yang halal) yang disebut nama Allah ketika menyembelihnya, jika kamu beriman kepada ayat-ayatNya.\n","en":"EAT, then, of that over which God's name has been pronounced, if you truly believe in His messages."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/907","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/907.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/907.mp3"]}},{"no":119,"arab":"وَمَا لَكُمْ أَلَّا تَأْكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَقَدْ فَصَّلَ لَكُمْ مَا حَرَّمَ عَلَيْكُمْ إِلَّا مَا اضْطُرِرْتُمْ إِلَيْهِ ۗ وَإِنَّ كَثِيرًا لَيُضِلُّونَ بِأَهْوَائِهِمْ بِغَيْرِ عِلْمٍ ۗ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِالْمُعْتَدِينَ","latin":"wamaa lakum allaa ta/kuluu mimmaa dzukira ismu allaahi 'alayhi waqad fashshala lakum maa harrama 'alaykum illaa maa idthurirtum ilayhi wa-inna katsiiran layudhilluuna bi-ahwaa-ihim bighayri 'ilmin inna rabbaka huwa a'lamu bialmu'tadiina","translate":{"id":"Mengapa kamu tidak mau memakan (binatang-binatang yang halal) yang disebut nama Allah ketika menyembelihnya, padahal sesungguhnya Allah telah menjelaskan kepada kamu apa yang diharamkan-Nya atasmu, kecuali apa yang terpaksa kamu memakannya. Dan sesungguhnya kebanyakan (dari manusia) benar benar hendak menyesatkan (orang lain) dengan hawa nafsu mereka tanpa pengetahuan. Sesungguhnya Tuhanmu, Dia-lah yang lebih mengetahui orang-orang yang melampaui batas.\n","en":"And why should you not eat of that over which God's name has been pronounced, seeing that He has so clearly spelled out to you what He has forbidden you [to eat] unless you are compelled [to do so]? But, behold, [it is precisely in such matters that] many people lead others astray by their own errant views, without [having any real] knowledge. Verily, thy Sustainer is fully aware of those who transgress the bounds of what is right."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/908","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/908.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/908.mp3"]}},{"no":120,"arab":"وَذَرُوا ظَاهِرَ الْإِثْمِ وَبَاطِنَهُ ۚ إِنَّ الَّذِينَ يَكْسِبُونَ الْإِثْمَ سَيُجْزَوْنَ بِمَا كَانُوا يَقْتَرِفُونَ","latin":"wadzaruu zhaahira al-itsmi wabaathinahu inna alladziina yaksibuuna al-itsma sayujzawna bimaa kaanuu yaqtarifuuna","translate":{"id":"Dan tinggalkanlah dosa yang nampak dan yang tersembunyi. Sesungguhnya orang yang mengerjakan dosa, kelak akan diberi pembalasan (pada hari kiamat), disebabkan apa yang mereka telah kerjakan.\n","en":"But abstain from sinning, be it open or secret-for, behold, those who commit sins shall be requited for all that they have earned."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/909","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/909.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/909.mp3"]}},{"no":121,"arab":"وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ وَإِنَّهُ لَفِسْقٌ ۗ وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَىٰ أَوْلِيَائِهِمْ لِيُجَادِلُوكُمْ ۖ وَإِنْ أَطَعْتُمُوهُمْ إِنَّكُمْ لَمُشْرِكُونَ","latin":"walaa ta/kuluu mimmaa lam yudzkari ismu allaahi 'alayhi wa-innahu lafisqun wa-inna alsysyayaathiina layuuhuuna ilaa awliyaa-ihim liyujaadiluukum wa-in atha'tumuuhum innakum lamusyrikuuna","translate":{"id":"Dan janganlah kamu memakan binatang-binatang yang tidak disebut nama Allah ketika menyembelihnya . Sesungguhnya perbuatan yang semacam itu adalah suatu kefasikan. Sesungguhnya syaitan itu membisikkan kepada kawan-kawannya agar mereka membantah kamu; dan jika kamu menuruti mereka, sesungguhnya kamu tentulah menjadi orang-orang yang musyrik.\n","en":"Hence, eat not of that over which God's name has not been pronounced: for this would be sinful conduct indeed. And, verily, the evil impulses [within men's hearts] whisper unto those who have made them their own that they should involve you in argument [as to what is and what is not a sin]; and if you pay heed unto them, lo! you will become [like] those who ascribe divinity to other beings or forces beside God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/910","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/910.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/910.mp3"]}},{"no":122,"arab":"أَوَمَنْ كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا يَمْشِي بِهِ فِي النَّاسِ كَمَنْ مَثَلُهُ فِي الظُّلُمَاتِ لَيْسَ بِخَارِجٍ مِنْهَا ۚ كَذَٰلِكَ زُيِّنَ لِلْكَافِرِينَ مَا كَانُوا يَعْمَلُونَ","latin":"awa man kaana maytan fa-ahyaynaahu waja'alnaa lahu nuuran yamsyii bihi fii alnnaasi kaman matsaluhu fii alzhzhulumaati laysa bikhaarijin minhaa kadzaalika zuyyina lilkaafiriina maa kaanuu ya'maluuna","translate":{"id":"Dan apakah orang yang sudah mati kemudian dia Kami hidupkan dan Kami berikan kepadanya cahaya yang terang, yang dengan cahaya itu dia dapat berjalan di tengah-tengah masyarakat manusia, serupa dengan orang yang keadaannya berada dalam gelap gulita yang sekali-kali tidak dapat keluar dari padanya? Demikianlah Kami jadikan orang yang kafir itu memandang baik apa yang telah mereka kerjakan.\n","en":"IS THEN -HE who was dead [in spirit] and whom We thereupon gave life, and for whom We set up a light whereby he might see his way among men - [is then he] like one [who is lost] in darkness deep, out of which he cannot emerge? [But] thus it is: goodly seem all their own doings to those who deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/911","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/911.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/911.mp3"]}},{"no":123,"arab":"وَكَذَٰلِكَ جَعَلْنَا فِي كُلِّ قَرْيَةٍ أَكَابِرَ مُجْرِمِيهَا لِيَمْكُرُوا فِيهَا ۖ وَمَا يَمْكُرُونَ إِلَّا بِأَنْفُسِهِمْ وَمَا يَشْعُرُونَ","latin":"wakadzaalika ja'alnaa fii kulli qaryatin akaabira mujrimiihaa liyamkuruu fiihaa wamaa yamkuruuna illaa bi-anfusihim wamaa yasy'uruuna","translate":{"id":"Dan demikianlah Kami adakan pada tiap-tiap negeri penjahat-penjahat yang terbesar agar mereka melakukan tipu daya dalam negeri itu. Dan mereka tidak memperdayakan melainkan dirinya sendiri, sedang mereka tidak menyadarinya.\n","en":"And it is in this way that We cause the great ones in every land to become its [greatest] evildoers, there to weave their schemes: yet it is only against themselves that they scheme -and they perceive it not."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/912","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/912.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/912.mp3"]}},{"no":124,"arab":"وَإِذَا جَاءَتْهُمْ آيَةٌ قَالُوا لَنْ نُؤْمِنَ حَتَّىٰ نُؤْتَىٰ مِثْلَ مَا أُوتِيَ رُسُلُ اللَّهِ ۘ اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ ۗ سَيُصِيبُ الَّذِينَ أَجْرَمُوا صَغَارٌ عِنْدَ اللَّهِ وَعَذَابٌ شَدِيدٌ بِمَا كَانُوا يَمْكُرُونَ","latin":"wa-idzaa jaa-at-hum aayatun qaaluu lan nu/mina hattaa nu/taa mitsla maa uutiya rusulu allaahi allaahu a'lamu haytsu yaj'alu risaalatahu sayushiibu alladziina ajramuu shaghaarun 'inda allaahi wa'adzaabun syadiidun bimaa kaanuu yamkuruuna","translate":{"id":"Apabila datang sesuatu ayat kepada mereka, mereka berkata: \"Kami tidak akan beriman sehingga diberikan kepada kami yang serupa dengan apa yang telah diberikan kepada utusan-utusan Allah\". Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan. Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah dan siksa yang keras disebabkan mereka selalu membuat tipu daya.\n","en":"And whenever. a [divine] message comes to them, they say, \"We shall not believe unless we are given the like of what God's apostles were given!\" [But] God knows best upon whom to bestow His message. Abasement in the sight of God will befall those who have become guilty of evildoing, and suffering severe for all the schemes which they were wont to weave."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/913","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/913.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/913.mp3"]}},{"no":125,"arab":"فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ ۖ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ ۚ كَذَٰلِكَ يَجْعَلُ اللَّهُ الرِّجْسَ عَلَى الَّذِينَ لَا يُؤْمِنُونَ","latin":"faman yuridi allaahu an yahdiyahu yasyrah shadrahu lil-islaami waman yurid an yudhillahu yaj'al shadrahu dhayyiqan harajan ka-annamaa yashsha''adu fii alssamaa-i kadzaalika yaj'alu allaahu alrrijsa 'alaa alladziina laa yu/minuuna","translate":{"id":"Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam. Dan barangsiapa yang dikehendaki Allah kesesatannya , niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit. Begitulah Allah menimpakan siksa kepada orang-orang yang tidak beriman.\n","en":"And whomsoever God wills to guide, his bosom He opens wide with willingness towards self-surrender [unto Him]; and whomsoever He wills to let go astray, his bosom He causes to be tight and constricted, as if he were climbing unto the skies: it is thus that God inflicts horror upon those who will not believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/914","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/914.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/914.mp3"]}},{"no":126,"arab":"وَهَٰذَا صِرَاطُ رَبِّكَ مُسْتَقِيمًا ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَذَّكَّرُونَ","latin":"wahaadzaa shiraathu rabbika mustaqiiman qad fashshalnaa al-aayaati liqawmin yadzdzakkaruuna","translate":{"id":"Dan inilah jalan Tuhanmu; (jalan) yang lurus. Sesungguhnya Kami telah menjelaskan ayat-ayat (Kami) kepada orang-orang yang mengambil pelajaran.\n","en":"And undeviating is this thy Sustainer's way. Clearly, indeed, have We spelled out these messages unto people who [are willing to] take them to heart!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/915","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/915.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/915.mp3"]}},{"no":127,"arab":"لَهُمْ دَارُ السَّلَامِ عِنْدَ رَبِّهِمْ ۖ وَهُوَ وَلِيُّهُمْ بِمَا كَانُوا يَعْمَلُونَ","latin":"lahum daaru alssalaami 'inda rabbihim wahuwa waliyyuhum bimaa kaanuu ya'maluuna","translate":{"id":"Bagi mereka (disediakan) darussalam (syurga) pada sisi Tuhannya dan Dialah Pelindung mereka disebabkan amal-amal saleh yang selalu mereka kerjakan.\n","en":"Theirs shall be an abode of peace with their Sustainer; and He shall be near unto them in result of what they have been doing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/916","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/916.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/916.mp3"]}},{"no":128,"arab":"وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا يَا مَعْشَرَ الْجِنِّ قَدِ اسْتَكْثَرْتُمْ مِنَ الْإِنْسِ ۖ وَقَالَ أَوْلِيَاؤُهُمْ مِنَ الْإِنْسِ رَبَّنَا اسْتَمْتَعَ بَعْضُنَا بِبَعْضٍ وَبَلَغْنَا أَجَلَنَا الَّذِي أَجَّلْتَ لَنَا ۚ قَالَ النَّارُ مَثْوَاكُمْ خَالِدِينَ فِيهَا إِلَّا مَا شَاءَ اللَّهُ ۗ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٌ","latin":"wayawma yahsyuruhum jamii'an yaa ma'syara aljinni qadi istaktsartum mina al-insi waqaala awliyaauhum mina al-insi rabbanaa istamta'a ba'dhunaa biba'dhin wabalaghnaa ajalanaa alladzii ajjalta lanaa qaala alnnaaru matswaakum khaalidiina fiihaa illaa maa syaa-a allaahu inna rabbaka hakiimun 'aliimun","translate":{"id":"Dan (ingatlah) hari diwaktu Allah menghimpunkan mereka semuanya (dan Allah berfirman): \"Hai golongan jin, sesungguhnya kamu telah banyak menyesatkan manusia\", lalu berkatalah kawan-kawan meraka dari golongan manusia: \"Ya Tuhan kami, sesungguhnya sebahagian daripada kami telah dapat kesenangan dari sebahagian (yang lain) dan kami telah sampai kepada waktu yang telah Engkau tentukan bagi kami\". Allah berfirman: \"Neraka itulah tempat diam kamu, sedang kamu kekal di dalamnya, kecuali kalau Allah menghendaki (yang lain)\". Sesungguhnya Tuhanmu Maha Bijaksana lagi Maha Mengetahui.\n","en":"AND ON THE DAY when He shall gather them [all] together, [He will say:] \"O you who have lived in close communion with [evil] invisible beings! A great many [other] human beings have you ensnared! And those of the humans who were close to them will say: \"O our Sustainer! We did enjoy one another's fellowship [in life]; but (now that] we have reached the end of our term-the term which Thou hast laid down for us - (we see the error of our ways]!\" [But] He will say: \"The fire shall be your abode, therein to abide-unless God wills it otherwise.\" Verily, thy Sustainer is wise, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/917","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/917.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/917.mp3"]}},{"no":129,"arab":"وَكَذَٰلِكَ نُوَلِّي بَعْضَ الظَّالِمِينَ بَعْضًا بِمَا كَانُوا يَكْسِبُونَ","latin":"wakadzaalika nuwallii ba'dha alzhzhaalimiina ba'dhan bimaa kaanuu yaksibuuna","translate":{"id":"Dan demikianlah Kami jadikan sebahagian orang-orang yang zalim itu menjadi teman bagi sebahagian yang lain disebabkan apa yang mereka usahakan.\n","en":"And in this manner do We cause evildoers to seduce one another by means of their (evil] doings."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/918","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/918.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/918.mp3"]}},{"no":130,"arab":"يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَقُصُّونَ عَلَيْكُمْ آيَاتِي وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا شَهِدْنَا عَلَىٰ أَنْفُسِنَا ۖ وَغَرَّتْهُمُ الْحَيَاةُ الدُّنْيَا وَشَهِدُوا عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُوا كَافِرِينَ","latin":"yaa ma'syara aljinni waal-insi alam ya/tikum rusulun minkum yaqushshuuna 'alaykum aayaatii wayundziruunakum liqaa-a yawmikum haadzaa qaaluu syahidnaa 'alaa anfusinaa wagharrat-humu alhayaatu alddunyaa wasyahiduu 'alaa anfusihim annahum kaanuu kaafiriina","translate":{"id":"Hai golongan jin dan manusia, apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri, yang menyampaikan kepadamu ayat-ayatKu dan memberi peringatan kepadamu terhadap pertemuanmu dengan hari ini? Mereka berkata: \"Kami menjadi saksi atas diri kami sendiri\", kehidupan dunia telah menipu mereka, dan mereka menjadi saksi atas diri mereka sendiri, bahwa mereka adalah orang-orang yang kafir.\n","en":"[And thus will God continue:] \"O you who have lived in close communion with [evil] invisible beings and [like-minded] humans! Have there not come unto you apostles from among yourselves, who conveyed unto you My messages and warned you of the coming of this your Day [of Judgment]?\" They will answer: \"We do bear witness against ourselves!\"-for the life of this world had beguiled them: and so they will bear witness against themselves that they had been denying the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/919","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/919.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/919.mp3"]}},{"no":131,"arab":"ذَٰلِكَ أَنْ لَمْ يَكُنْ رَبُّكَ مُهْلِكَ الْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا غَافِلُونَ","latin":"dzaalika an lam yakun rabbuka muhlika alquraa bizhulmin wa-ahluhaa ghaafiluuna","translate":{"id":"Yang demikian itu adalah karena Tuhanmu tidaklah membinasakan kota-kota secara aniaya, sedang penduduknya dalam keadaan lengah .\n","en":"And so it is that thy Sustainer would never destroy a community for its wrongdoing so long as its people are still unaware [of the meaning of right and wrong]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/920","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/920.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/920.mp3"]}},{"no":132,"arab":"وَلِكُلٍّ دَرَجَاتٌ مِمَّا عَمِلُوا ۚ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا يَعْمَلُونَ","latin":"walikullin darajaatun mimmaa 'amiluu wamaa rabbuka bighaafilin 'ammaa ya'maluuna","translate":{"id":"Dan masing-masing orang memperoleh derajat-derajat (seimbang) dengan apa yang dikerjakannya. Dan Tuhanmu tidak lengah dari apa yang mereka kerjakan.\n","en":"for all shall be judged according to their [conscious] deeds - and thy Sustainer is not unaware of what they do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/921","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/921.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/921.mp3"]}},{"no":133,"arab":"وَرَبُّكَ الْغَنِيُّ ذُو الرَّحْمَةِ ۚ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَسْتَخْلِفْ مِنْ بَعْدِكُمْ مَا يَشَاءُ كَمَا أَنْشَأَكُمْ مِنْ ذُرِّيَّةِ قَوْمٍ آخَرِينَ","latin":"warabbuka alghaniyyu dzuu alrrahmati in yasya/ yudzhibkum wayastakhlif min ba'dikum maa yasyaau kamaa ansya-akum min dzurriyyati qawmin aakhariina","translate":{"id":"Dan Tuhanmu Maha Kaya lagi mempunyai rahmat. Jika Dia menghendaki niscaya Dia memusnahkan kamu dan menggantimu dengan siapa yang dikehendaki-Nya setelah kamu (musnah), sebagaimana Dia telah menjadikan kamu dari keturunan orang-orang lain.\n","en":"And thy Sustainer alone is self-sufficient, limitless in His grace. If He so wills, He may put an end to you and thereafter cause whom He wills to succeed you - even as He has brought you into being out of other people's seed."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/922","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/922.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/922.mp3"]}},{"no":134,"arab":"إِنَّ مَا تُوعَدُونَ لَآتٍ ۖ وَمَا أَنْتُمْ بِمُعْجِزِينَ","latin":"inna maa tuu'aduuna laaatin wamaa antum bimu'jiziina","translate":{"id":"Sesungguhnya apa yang dijanjikan kepadamu pasti datang, dan kamu sekali-kali tidak sanggup menolaknya.\n","en":"Verily, that [reckoning] which you are promised is bound to come, and you cannot elude it!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/923","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/923.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/923.mp3"]}},{"no":135,"arab":"قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ مَنْ تَكُونُ لَهُ عَاقِبَةُ الدَّارِ ۗ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ","latin":"qul yaa qawmi i'maluu 'alaa makaanatikum innii 'aamilun fasawfa ta'lamuuna man takuunu lahu 'aaqibatu alddaari innahu laa yuflihu alzhzhaalimuuna","translate":{"id":"Katakanlah: \"Hai kaumku, berbuatlah sepenuh kemampuanmu , sesungguhnya akupun berbuat (pula). Kelak kamu akan mengetahui, siapakah (di antara kita) yang akan memperoleh hasil yang baik di dunia ini . Sesungguhnya orang-orang yang zalim itu tidak akan mendapatkan keberuntungan.\n","en":"Say: \"O my [unbelieving] people! Do yet all that may be within your power, [while] I, behold, shall labour [in God's way]; and in time you will come to know to whom the future belongs. Verily, never will evildoers attain to a happy state!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/924","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/924.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/924.mp3"]}},{"no":136,"arab":"وَجَعَلُوا لِلَّهِ مِمَّا ذَرَأَ مِنَ الْحَرْثِ وَالْأَنْعَامِ نَصِيبًا فَقَالُوا هَٰذَا لِلَّهِ بِزَعْمِهِمْ وَهَٰذَا لِشُرَكَائِنَا ۖ فَمَا كَانَ لِشُرَكَائِهِمْ فَلَا يَصِلُ إِلَى اللَّهِ ۖ وَمَا كَانَ لِلَّهِ فَهُوَ يَصِلُ إِلَىٰ شُرَكَائِهِمْ ۗ سَاءَ مَا يَحْكُمُونَ","latin":"waja'aluu lillaahi mimmaa dzara-a mina alhartsi waal-an'aami nashiiban faqaaluu haadzaa lillaahi biza'mihim wahaadzaa lisyurakaa-inaa famaa kaana lisyurakaa-ihim falaa yashilu ilaa allaahi wamaa kaana lillaahi fahuwa yashilu ilaa syurakaa-ihim saa-a maa yahkumuuna","translate":{"id":"Dan mereka memperuntukkan bagi Allah satu bagian dari tanaman dan ternak yang telah diciptakan Allah, lalu mereka berkata sesuai dengan persangkaan mereka: \"Ini untuk Allah dan ini untuk berhala-berhala kami\". Maka saji-sajian yang diperuntukkan bagi berhala-berhala mereka tidak sampai kepada Allah; dan saji-sajian yang diperuntukkan bagi Allah, maka sajian itu sampai kepada berhala-berhala mereka . Amat buruklah ketetapan mereka itu.\n","en":"AND OUT OF whatever He has created of the fruits of the field and the cattle, they assign unto God a portion, saying, \"This belongs to God\"-or so they [falsely] claim - \"and this is for those beings who, we are convinced, have a share in God's divinity.\" But that which is assigned to the beings associated in their minds with God does not bring [them] closer to God - whereas that which is assigned to God brings [them but] closer to those beings to whom they ascribe a share in His divinity. Bad, indeed, is their judgment!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/925","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/925.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/925.mp3"]}},{"no":137,"arab":"وَكَذَٰلِكَ زَيَّنَ لِكَثِيرٍ مِنَ الْمُشْرِكِينَ قَتْلَ أَوْلَادِهِمْ شُرَكَاؤُهُمْ لِيُرْدُوهُمْ وَلِيَلْبِسُوا عَلَيْهِمْ دِينَهُمْ ۖ وَلَوْ شَاءَ اللَّهُ مَا فَعَلُوهُ ۖ فَذَرْهُمْ وَمَا يَفْتَرُونَ","latin":"wakadzaalika zayyana likatsiirin mina almusyrikiina qatla awlaadihim syurakaauhum liyurduuhum waliyalbisuu 'alayhim diinahum walaw syaa-a allaahu maa fa'aluuhu fadzarhum wamaa yaftaruuna","translate":{"id":"Dan demikianlah pemimpin-pemimpin mereka telah menjadikan kebanyakan dari orang-orang musyrik itu memandang baik membunuh anak-anak mereka untuk membinasakan mereka dan untuk mengaburkan bagi mereka agama-Nya . Dan kalau Allah menghendaki, niscaya mereka tidak mengerjakannya, maka tinggallah mereka dan apa yang mereka ada-adakan.\n","en":"And, likewise, their belief in beings or powers that are supposed to have a share in God's divinity makes [even] the slaying of their children seem goodly to many of those who ascribe divinity to aught beside God, thus bringing them to ruin and confusing them in their faith. Yet, unless God had so willed, they would not be doing all this: stand, therefore, aloof from them and all their false imagery!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/926","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/926.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/926.mp3"]}},{"no":138,"arab":"وَقَالُوا هَٰذِهِ أَنْعَامٌ وَحَرْثٌ حِجْرٌ لَا يَطْعَمُهَا إِلَّا مَنْ نَشَاءُ بِزَعْمِهِمْ وَأَنْعَامٌ حُرِّمَتْ ظُهُورُهَا وَأَنْعَامٌ لَا يَذْكُرُونَ اسْمَ اللَّهِ عَلَيْهَا افْتِرَاءً عَلَيْهِ ۚ سَيَجْزِيهِمْ بِمَا كَانُوا يَفْتَرُونَ","latin":"waqaaluu haadzihi an'aamun wahartsun hijrun laa yath'amuhaa illaa man nasyaau biza'mihim wa-an'aamun hurrimat zhuhuuruhaa wa-an'aamun laa yadzkuruuna isma allaahi 'alayhaa iftiraa-an","translate":{"id":"Dan mereka mengatakan : \"Inilah hewan ternak dan tanaman yang dilarang; tidak boleh memakannya, kecuali orang yang kami kehendaki\", menurut anggapan mereka, dan ada binatang ternak yang diharamkan menungganginya dan ada binatang ternak yang mereka tidak menyebut nama Allah waktu menyembelihnya , semata-mata membuat-buat kedustaan terhadap Allah. Kelak Allah akan membalas mereka terhadap apa yang selalu mereka ada-adakan.\n","en":"And they say, \"Such-and-such cattle and fruits of the field are sacred; none may eat thereof save those whom we will [to do so]\" -so they [falsely] claim; and [they declare that] it is forbidden to burden the backs of certain kinds of cattle; and there are cattle over which they do not pronounce God's name - falsely attributing [the origin of these customs] to Him. [But] He will requite them for all their false imagery."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/927","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/927.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/927.mp3"]}},{"no":139,"arab":"وَقَالُوا مَا فِي بُطُونِ هَٰذِهِ الْأَنْعَامِ خَالِصَةٌ لِذُكُورِنَا وَمُحَرَّمٌ عَلَىٰ أَزْوَاجِنَا ۖ وَإِنْ يَكُنْ مَيْتَةً فَهُمْ فِيهِ شُرَكَاءُ ۚ سَيَجْزِيهِمْ وَصْفَهُمْ ۚ إِنَّهُ حَكِيمٌ عَلِيمٌ","latin":"waqaaluu maa fii buthuuni haadzihi al-an'aami khaalishatun lidzukuurinaa wamuharramun 'alaa azwaajinaa wa-in yakun maytatan fahum fiihi syurakaau sayajziihim washfahum innahu hakiimun 'aliimun","translate":{"id":"Dan mereka mengatakan: \"Apa yang ada dalam perut binatang ternak ini adalah khusus untuk pria kami dan diharamkan atas wanita kami,\" dan jika yang dalam perut itu dilahirkan mati, maka pria dan wanita sama-sama boleh memakannya. Kelak Allah akan membalas mereka terhadap ketetapan mereka. Sesungguhnya Allah Maha Bijaksana lagi Maha Mengetahui.\n","en":"And they say, \"All that is in the wombs of such-and-such cattle is reserved for our males and forbidden to our women; but if it be stillborn, then both may have their share thereof.\" [God] will requite them for all that they [falsely] attribute [to Him]: behold, He is wise, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/928","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/928.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/928.mp3"]}},{"no":140,"arab":"قَدْ خَسِرَ الَّذِينَ قَتَلُوا أَوْلَادَهُمْ سَفَهًا بِغَيْرِ عِلْمٍ وَحَرَّمُوا مَا رَزَقَهُمُ اللَّهُ افْتِرَاءً عَلَى اللَّهِ ۚ قَدْ ضَلُّوا وَمَا كَانُوا مُهْتَدِينَ","latin":"qad khasira alladziina qataluu awlaadahum safahan bighayri 'ilmin waharramuu maa razaqahumu allaahu iftiraa-an 'alaa allaahi qad dhalluu wamaa kaanuu muhtadiina","translate":{"id":"Sesungguhnya rugilah orang yang membunuh anak-anak mereka, karena kebodohan lagi tidak mengetahui dan mereka mengharamkan apa yang Allah telah rezki-kan pada mereka dengan semata-mata mengada-adakan terhadap Allah. Sesungguhnya mereka telah sesat dan tidaklah mereka mendapat petunjuk.\n","en":"Lost, indeed, are they who, in their weak-minded ignorance, slay their children and declare as forbidden that which God has provided for them as sustenance, falsely ascribing [such prohibitions] to God: they have gone astray and have not found the right path."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/929","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/929.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/929.mp3"]}},{"no":141,"arab":"وَهُوَ الَّذِي أَنْشَأَ جَنَّاتٍ مَعْرُوشَاتٍ وَغَيْرَ مَعْرُوشَاتٍ وَالنَّخْلَ وَالزَّرْعَ مُخْتَلِفًا أُكُلُهُ وَالزَّيْتُونَ وَالرُّمَّانَ مُتَشَابِهًا وَغَيْرَ مُتَشَابِهٍ ۚ كُلُوا مِنْ ثَمَرِهِ إِذَا أَثْمَرَ وَآتُوا حَقَّهُ يَوْمَ حَصَادِهِ ۖ وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ","latin":"wahuwa alladzii ansya-a jannaatin ma'ruusyaatin waghayra ma'ruusyaatin waalnnakhla waalzzar'a mukhtalifan ukuluhu waalzzaytuuna waalrrummaana mutasyaabihan waghayra mutasyaabihin kuluu min tsamarihi idzaa atsmara waaatuu haqqahu yawma hashaadihi walaa tusrifuu innahu laa yuhibbu almusrifiina","translate":{"id":"Dan Dialah yang menjadikan kebun-kebun yang berjunjung dan yang tidak berjunjung, pohon korma, tanam-tanaman yang bermacam-macam buahnya, zaitun dan delima yang serupa (bentuk dan warnanya) dan tidak sama (rasanya). Makanlah dari buahnya (yang bermacam-macam itu) bila dia berbuah, dan tunaikanlah haknya di hari memetik hasilnya (dengan disedekahkan kepada fakir miskin); dan janganlah kamu berlebih-lebihan. Sesungguhnya Allah tidak menyukai orang yang berlebih-lebihan.\n","en":"For it is He who has brought into being gardens-[both] the cultivated ones and those growing wild -and the date-palm, and fields bearing multiform produce, and the olive tree, and the pomegranate: [all] resembling one another and yet so different! Eat of their fruit when it comes to fruition, and give [unto the poor] their due on harvest day. And do not waste [God's bounties]: verily, He does not love the wasteful!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/930","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/930.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/930.mp3"]}},{"no":142,"arab":"وَمِنَ الْأَنْعَامِ حَمُولَةً وَفَرْشًا ۚ كُلُوا مِمَّا رَزَقَكُمُ اللَّهُ وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ","latin":"wamina al-an'aami hamuulatan wafarsyan kuluu mimmaa razaqakumu allaahu walaa tattabi'uu khuthuwaati alsysyaythaani innahu lakum 'aduwwun mubiinun","translate":{"id":"Dan di antara hewan ternak itu ada yang dijadikan untuk pengangkutan dan ada yang untuk disembelih. Makanlah dari rezki yang telah diberikan Allah kepadamu, dan janganlah kamu mengikuti langkah-langkah syaitan. Sesungguhnya syaitan itu musuh yang nyata bagimu.\n","en":"And of the cattle reared for work and for the sake of their flesh, eat whatever God has provided for you as sustenance, and follow not Satan's foot-steps: behold, he is your open foe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/931","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/931.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/931.mp3"]}},{"no":143,"arab":"ثَمَانِيَةَ أَزْوَاجٍ ۖ مِنَ الضَّأْنِ اثْنَيْنِ وَمِنَ الْمَعْزِ اثْنَيْنِ ۗ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنْثَيَيْنِ أَمَّا اشْتَمَلَتْ عَلَيْهِ أَرْحَامُ الْأُنْثَيَيْنِ ۖ نَبِّئُونِي بِعِلْمٍ إِنْ كُنْتُمْ صَادِقِينَ","latin":"tsamaaniyata azwaajin mina aldhdha/ni itsnayni wamina alma'zi itsnayni qul aaldzdzakarayni harrama ami aluntsayayni ammaa isytamalat 'alayhi arhaamu aluntsayayni nabbi-uunii bi'ilmin in kuntum shaadiqiina","translate":{"id":"(yaitu) delapan binatang yang berpasangan , sepasang domba , sepasang dari kambing . Katakanlah: \"Apakah dua yang jantan yang diharamkan Allah ataukah dua yang betina, ataukah yang ada dalam kandungan dua betinanya?\" Terangkanlah kepadaku dengan berdasar pengetahuan jika kamu memang orang-orang yang benar,\n","en":"[His followers would have it that, in certain cases, any of these] four kinds of cattle of either sex [is unlawful to man]: either of the two sexes of sheep and of goats. Ask [them]: \"Is it the two males that He has forbidden, or the two females, or that which the wombs of the two females may contain? Tell me what you know in this respect, if what you say is true.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/932","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/932.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/932.mp3"]}},{"no":144,"arab":"وَمِنَ الْإِبِلِ اثْنَيْنِ وَمِنَ الْبَقَرِ اثْنَيْنِ ۗ قُلْ آلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنْثَيَيْنِ أَمَّا اشْتَمَلَتْ عَلَيْهِ أَرْحَامُ الْأُنْثَيَيْنِ ۖ أَمْ كُنْتُمْ شُهَدَاءَ إِذْ وَصَّاكُمُ اللَّهُ بِهَٰذَا ۚ فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا لِيُضِلَّ النَّاسَ بِغَيْرِ عِلْمٍ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","latin":"wamina al-ibili itsnayni wamina albaqari itsnayni qul aaldzdzakarayni harrama ami aluntsayayni ammaa isytamalat 'alayhi arhaamu aluntsayayni am kuntum syuhadaa-a idz washshaakumu allaahu bihaadzaa faman azhlamu mimmani iftaraa 'alaa allaahi kadziban liyudhilla alnnaasa bighayri 'ilmin inna allaaha laa yahdii alqawma alzhzhaalimiina","translate":{"id":"dan sepasang dari unta dan sepasang dari lembu. Katakanlah: \"Apakah dua yang jantan yang diharamkan ataukah dua yang betina, ataukah yang ada dalam kandungan dua betinanya? Apakah kamu menyaksikan di waktu Allah menetapkan ini bagimu? Maka siapakah yang lebih zalim daripada orang-orang yang membuat-buat dusta terhadap Allah untuk menyesatkan manusia tanpa pengetahuan ?\" Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim.\n","en":"And [likewise they declare as unlawful] either of the two sexes of camels and of bovine cattle. Ask [them]: \"Is it the two males that He has forbidden, or the two females, or that which the wombs of the two females may contain? Is it, perchance, that you [yourselves] were witnesses when God enjoined [all] this upon you?\" And who could be more wicked than he who, without any [real] knowledge, attributes his own lying inventions to God, and thus leads people astray'? Behold, God does not grace [such] evildoing folk with His guidance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/933","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/933.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/933.mp3"]}},{"no":145,"arab":"قُلْ لَا أَجِدُ فِي مَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَىٰ طَاعِمٍ يَطْعَمُهُ إِلَّا أَنْ يَكُونَ مَيْتَةً أَوْ دَمًا مَسْفُوحًا أَوْ لَحْمَ خِنْزِيرٍ فَإِنَّهُ رِجْسٌ أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ ۚ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَإِنَّ رَبَّكَ غَفُورٌ رَحِيمٌ","latin":"qul laa ajidu fiimaa uuhiya ilayya muharraman 'alaa thaa'imin yath'amuhu illaa an yakuuna maytatan aw daman masfuuhan aw lahma khinziirin fa-innahu rijsun aw fisqan uhilla lighayri allaahi bihi famani idthurra ghayra baaghin walaa 'aadin fa-inna rabbaka ghafuurun rahiimun","translate":{"id":"Katakanlah: \"Tiadalah aku peroleh dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan bagi orang yang hendak memakannya, kecuali kalau makanan itu bangkai, atau darah yang mengalir atau daging babi karena sesungguhnya semua itu kotor atau binatang yang disembelih atas nama selain Allah. Barangsiapa yang dalam keadaan terpaksa, sedang dia tidak menginginkannya dan tidak (pula) melampaui batas, maka sesungguhnya Tuhanmu Maha Pengampun lagi Maha Penyayang\".\n","en":"Say [O Prophet]: \"In all that has been revealed unto me, I do not find anything forbidden to eat, if one wants to eat thereof, unless it be carrion, or blood poured forth, or the flesh of swine-for that, behold, is loathsome-or a sinful offering over which any name other than God's has been invoked. But if one is driven by necessity - neither coveting it nor exceeding his immediate need -then [know that], behold, thy Sustainer is much-forgiving, a dispenser of grace.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/934","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/934.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/934.mp3"]}},{"no":146,"arab":"وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ ۖ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَا إِلَّا مَا حَمَلَتْ ظُهُورُهُمَا أَوِ الْحَوَايَا أَوْ مَا اخْتَلَطَ بِعَظْمٍ ۚ ذَٰلِكَ جَزَيْنَاهُمْ بِبَغْيِهِمْ ۖ وَإِنَّا لَصَادِقُونَ","latin":"wa'alaa alladziina haaduu harramnaa kulla dzii zhufurin wamina albaqari waalghanami harramnaa 'alayhim syuhuumahumaa illaa maa hamalat zhuhuuruhumaa awi alhawaayaa aw maa ikhtalatha bi'azhmin dzaalika jazaynaahum bibaghyihim wa-innaa lashaadiquuna","translate":{"id":"Dan kepada orang-orang Yahudi, Kami haramkan segala binatang yang berkuku dan dari sapi dan domba, Kami haramkan atas mereka lemak dari kedua binatang itu, selain lemak yang melekat di punggung keduanya atau yang di perut besar dan usus atau yang bercampur dengan tulang. Demikianlah Kami hukum mereka disebabkan kedurhakaan mereka; dan sesungguhnya Kami adalah Maha Benar.\n","en":"And [only] unto those who followed the Jewish faith did We forbid all beasts that have claws; and We forbade unto them the fat of both oxen and sheep, excepting that which is in their backs or entrails or that which is within the bone: thus did We requite them for their evildoing-for, behold, We are true to Our word!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/935","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/935.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/935.mp3"]}},{"no":147,"arab":"فَإِنْ كَذَّبُوكَ فَقُلْ رَبُّكُمْ ذُو رَحْمَةٍ وَاسِعَةٍ وَلَا يُرَدُّ بَأْسُهُ عَنِ الْقَوْمِ الْمُجْرِمِينَ","latin":"fa-in kadzdzabuuka faqul rabbukum dzuu rahmatin waasi'atin walaa yuraddu ba/suhu 'ani alqawmi almujrimiina","translate":{"id":"Maka jika mereka mendustakan kamu, katakanlah: \"Tuhanmu mempunyai rahmat yang luas; dan siksa-Nya tidak dapat ditolak dari kaum yang berdosa\".\n","en":"And if they give thee the lie, say: \"Limitless is your Sustainer in His grace; but His punishment shall not be averted from people who are lost in sin.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/936","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/936.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/936.mp3"]}},{"no":148,"arab":"سَيَقُولُ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا أَشْرَكْنَا وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ شَيْءٍ ۚ كَذَٰلِكَ كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ حَتَّىٰ ذَاقُوا بَأْسَنَا ۗ قُلْ هَلْ عِنْدَكُمْ مِنْ عِلْمٍ فَتُخْرِجُوهُ لَنَا ۖ إِنْ تَتَّبِعُونَ إِلَّا الظَّنَّ وَإِنْ أَنْتُمْ إِلَّا تَخْرُصُونَ","latin":"sayaquulu alladziina asyrakuu law syaa-a allaahu maa asyraknaa walaa aabaaunaa walaa harramnaa min syay-in kadzaalika kadzdzaba alladziina min qablihim hattaa dzaaquu ba/sanaa qul hal 'indakum min 'ilmin fatukhrijuuhu lanaa in tattabi'uuna illaa alzhzhanna wa-in antum illaa takhrushuuna","translate":{"id":"Orang-orang yang mempersekutukan Tuhan, akan mengatakan: \"Jika Allah menghendaki, niscaya kami dan bapak-bapak kami tidak mempersekutukan-Nya dan tidak (pula) kami mengharamkan barang sesuatu apapun.\" Demikian pulalah orang-orang sebelum mereka telah mendustakan (para rasul) sampai mereka merasakan siksaan Kami. Katakanlah: \"Adakah kamu mempunyai sesuatu pengetahuan sehingga dapat kamu mengemukakannya kepada Kami?\" Kamu tidak mengikuti kecuali persangkaan belaka, dan kamu tidak lain hanyalah berdusta.\n","en":"THOSE who are bent on ascribing divinity to aught beside God will say, \"Had God so willed, we would not have ascribed divinity to aught but Him, nor would our forefathers [have done so]; and neither would we have declared as forbidden anything [that He has allowed].\" Even so did those who lived before them give the lie to the truth -until they came to taste Our punishment! Say: \"Have you any [certain] knowledge which you could proffer to us? You follow but [other people's] conjectures, and you yourselves do nothing but guess.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/937","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/937.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/937.mp3"]}},{"no":149,"arab":"قُلْ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ ۖ فَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ","latin":"qul falillaahi alhujjatu albaalighatu falaw syaa-a lahadaakum ajma'iina","translate":{"id":"Katakanlah: \"Allah mempunyai hujjah yang jelas lagi kuat; maka jika Dia menghendaki, pasti Dia memberi petunjuk kepada kamu semuanya\".\n","en":"Say: \"[Know,] then, that the final evidence [of all truth] rests with God alone; and had He so willed, He would have guided you all aright."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/938","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/938.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/938.mp3"]}},{"no":150,"arab":"قُلْ هَلُمَّ شُهَدَاءَكُمُ الَّذِينَ يَشْهَدُونَ أَنَّ اللَّهَ حَرَّمَ هَٰذَا ۖ فَإِنْ شَهِدُوا فَلَا تَشْهَدْ مَعَهُمْ ۚ وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَالَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَهُمْ بِرَبِّهِمْ يَعْدِلُونَ","latin":"qul halumma syuhadaa-akumu alladziina yasyhaduuna anna allaaha harrama haadzaa fa-in syahiduu falaa tasyhad ma'ahum walaa tattabi' ahwaa-a alladziina kadzdzabuu bi-aayaatinaa waalladziina laa yu/minuuna bial-aakhirati wahum birabbihim ya'diluuna","translate":{"id":"Katakanlah: \"Bawalah kemari saksi-saksi kamu yang dapat mempersaksikan bahwasanya Allah telah mengharamkan (makanan yang kamu) haramkan ini\" Jika mereka mempersaksikan, maka janganlah kamu ikut pula menjadi saksi bersama mereka; dan janganlah kamu mengikuti hawa nafsu orang-orang yang mendustakan ayat-ayat Kami, dan orang-orang yang tidak beriman kepada kehidupan akhirat, sedang mereka mempersekutukan Tuhan mereka.\n","en":"Say: \"Bring forward your witnesses who could bear witness that God has forbidden [all] this!\" -and if they bear witness [falsely], do not bear witness with them; and do not follow the errant views of those who have given the lie to Our messages, nor of those who believe not in the life to come, and who regard other powers as their Sustainer's equals!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/939","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/939.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/939.mp3"]}},{"no":151,"arab":"قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ وَلَا تَقْتُلُوا أَوْلَادَكُمْ مِنْ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ","latin":"qul ta'aalaw atlu maa harrama rabbukum 'alaykum allaa tusyrikuu bihi syay-an wabialwaalidayni ihsaanan walaa taqtuluu awlaadakum min imlaaqin nahnu narzuqukum wa-iyyaahum walaa taqrabuu alfawaahisya maa zhahara minhaa wamaa bathana walaa taqtuluu alnnafsa allatii harrama allaahu illaa bialhaqqi dzaalikum washshaakum bihi la'allakum ta'qiluuna","translate":{"id":"Katakanlah: \"Marilah kubacakan apa yang diharamkan atas kamu oleh Tuhanmu yaitu: janganlah kamu mempersekutukan sesuatu dengan Dia, berbuat baiklah terhadap kedua orang ibu bapa, dan janganlah kamu membunuh anak-anak kamu karena takut kemiskinan, Kami akan memberi rezki kepadamu dan kepada mereka, dan janganlah kamu mendekati perbuatan-perbuatan yang keji, baik yang nampak di antaranya maupun yang tersembunyi, dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan sesuatu (sebab) yang benar \". Demikian itu yang diperintahkan kepadamu supaya kamu memahami(nya).\n","en":"Say: \"Come, let me convey unto you what God has [really] forbidden to you: \"Do not ascribe divinity, in any way, to aught beside Him; and [do not offend against but, rather,] do good unto your parents; and do not kill your children for fear of poverty - [for] it is We who shall provide sustenance for you as well as for them; and do not commit any shameful deeds, be they open or secret; and do not take any human being's life-[the life] which God has declared to be sacred -otherwise than in [the pursuit of] justice: this has He enjoined upon you so that you might use your reason;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/940","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/940.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/940.mp3"]}},{"no":152,"arab":"وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُ ۖ وَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ بِالْقِسْطِ ۖ لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا ۖ وَإِذَا قُلْتُمْ فَاعْدِلُوا وَلَوْ كَانَ ذَا قُرْبَىٰ ۖ وَبِعَهْدِ اللَّهِ أَوْفُوا ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَذَكَّرُونَ","latin":"walaa taqrabuu maala alyatiimi illaa biallatii hiya ahsanu hattaa yablugha asyuddahu wa-awfuu alkayla waalmiizaana bialqisthi laa nukallifu nafsan illaa wus'ahaa wa-idzaa qultum fai'diluu walaw kaana dzaa qurbaa wabi'ahdi allaahi awfuu dzaalikum washshaakum bihi la'allakum tadzakkaruuna","translate":{"id":"Dan janganlah kamu dekati harta anak yatim, kecuali dengan cara yang lebih bermanfaat, hingga sampai ia dewasa. Dan sempurnakanlah takaran dan timbangan dengan adil. Kami tidak memikulkan beban kepada sesorang melainkan sekedar kesanggupannya. Dan apabila kamu berkata, maka hendaklah kamu berlaku adil, kendatipun ia adalah kerabat(mu) , dan penuhilah janji Allah . Yang demikian itu diperintahkan Allah kepadamu agar kamu ingat.\n","en":"and do not touch the substance of an orphan - save to improve it-before he comes of age.\" And [in all your dealings] give full measure and weight, with equity: [however,] We do not burden any human being with more than he is well able to bear; and when you voice an opinion, be just, even though it be [against] one near of kin. And [always] observe your bond with God: this has He enjoined upon you, so that you might keep it in mind."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/941","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/941.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/941.mp3"]}},{"no":153,"arab":"وَأَنَّ هَٰذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ ۖ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَتَّقُونَ","latin":"wa-anna haadzaa shiraathii mustaqiiman faittabi'uuhu walaa tattabi'uu alssubula fatafarraqa bikum 'an sabiilihi dzaalikum washshaakum bihi la'allakum tattaquuna","translate":{"id":"dan bahwa (yang Kami perintahkan ini) adalah jalanKu yang lurus, maka ikutilah dia, dan janganlah kamu mengikuti jalan-jalan (yang lain) , karena jalan-jalan itu mencerai beraikan kamu dari jalanNya. Yang demikian itu diperintahkan Allah agar kamu bertakwa.\n","en":"And [know] that this is the way leading straight unto Me: follow it, then, and follow not other ways, lest they cause you to deviate from His way. [All] this has He enjoined upon you, so that you might remain conscious of Him."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/942","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/942.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/942.mp3"]}},{"no":154,"arab":"ثُمَّ آتَيْنَا مُوسَى الْكِتَابَ تَمَامًا عَلَى الَّذِي أَحْسَنَ وَتَفْصِيلًا لِكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً لَعَلَّهُمْ بِلِقَاءِ رَبِّهِمْ يُؤْمِنُونَ","latin":"tsumma aataynaa muusaa alkitaaba tamaaman 'alaa alladzii ahsana watafshiilan likulli syay-in wahudan warahmatan la'allahum biliqaa-i rabbihim yu/minuuna","translate":{"id":"Kemudian Kami telah memberikan Al Kitab (Taurat) kepada Musa untuk menyempurnakan (nikmat Kami) kepada orang yang berbuat kebaikan, dan untuk menjelaskan segala sesuatu dan sebagai petunjuk dan rahmat, agar mereka beriman (bahwa) mereka akan menemui Tuhan mereka.\n","en":"AND ONCE AGAIN: We vouchsafed the divine writ unto Moses in fulfilment [of Our favour] upon those who persevered in doing good, clearly spelling out everything, and [thus providing] guidance and grace, so that they might have faith in the [final] meeting with their Sustainer."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/943","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/943.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/943.mp3"]}},{"no":155,"arab":"وَهَٰذَا كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ فَاتَّبِعُوهُ وَاتَّقُوا لَعَلَّكُمْ تُرْحَمُونَ","latin":"wahaadzaa kitaabun anzalnaahu mubaarakun faittabi'uuhu waittaquu la'allakum turhamuuna","translate":{"id":"Dan Al-Quraan itu adalah kitab yang Kami turunkan yang diberkati, maka ikutilah dia dan bertakwalah agar kamu diberi rahmat.\n","en":"And this, too, is a divine writ which We have bestowed from on high, a blessed one: follow it, then, and be conscious of God, so that you might be graced with His mercy."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/944","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/944.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/944.mp3"]}},{"no":156,"arab":"أَنْ تَقُولُوا إِنَّمَا أُنْزِلَ الْكِتَابُ عَلَىٰ طَائِفَتَيْنِ مِنْ قَبْلِنَا وَإِنْ كُنَّا عَنْ دِرَاسَتِهِمْ لَغَافِلِينَ","latin":"an taquuluu innamaa unzila alkitaabu 'alaa thaa-ifatayni min qablinaa wa-in kunnaa 'an diraasatihim laghaafiliina","translate":{"id":"(Kami turunkan al-Quraan itu) agar kamu (tidak) mengatakan: \"Bahwa kitab itu hanya diturunkan kepada dua golongan saja sebelum kami, dan sesungguhnya kami tidak memperhatikan apa yang mereka baca .\n","en":"It has been given to you] lest you say, \"Only unto two groups of people, [both of them] before our time, has a divine writ been bestowed from on high and we were indeed unaware of their teachings\";"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/945","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/945.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/945.mp3"]}},{"no":157,"arab":"أَوْ تَقُولُوا لَوْ أَنَّا أُنْزِلَ عَلَيْنَا الْكِتَابُ لَكُنَّا أَهْدَىٰ مِنْهُمْ ۚ فَقَدْ جَاءَكُمْ بَيِّنَةٌ مِنْ رَبِّكُمْ وَهُدًى وَرَحْمَةٌ ۚ فَمَنْ أَظْلَمُ مِمَّنْ كَذَّبَ بِآيَاتِ اللَّهِ وَصَدَفَ عَنْهَا ۗ سَنَجْزِي الَّذِينَ يَصْدِفُونَ عَنْ آيَاتِنَا سُوءَ الْعَذَابِ بِمَا كَانُوا يَصْدِفُونَ","latin":"aw taquuluu law annaa unzila 'alaynaa alkitaabu lakunnaa ahdaa minhum faqad jaa-akum bayyinatun min rabbikum wahudan warahmatun faman azhlamu mimman kadzdzaba bi-aayaati allaahi washadafa 'anhaa sanajzii alladziina yashdifuuna 'an aayaatinaa suu-a al'adzaabi bimaa kaanuu yashdifuuna","translate":{"id":"Atau agar kamu (tidak) mengatakan: \"Sesungguhnya jikalau kitab ini diturunkan kepada kami, tentulah kami lebih mendapat petunjuk dari mereka.\" Sesungguhnya telah datang kepada kamu keterangan yang nyata dari Tuhanmu, petunjuk dan rahmat. Maka siapakah yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling daripadanya? Kelak Kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat Kami dengan siksa yang buruk, disebabkan mereka selalu berpaling.\n","en":"or lest you say, \"If a divine writ had been bestowed from on high upon us, we would surely have followed its guidance better than they did.\" And so, a clear evidence of the truth has now come unto you from your Sustainer, and guidance, and grace. Who, then, could be more wicked than he who gives the lie to God's messages, and turns away from them in disdain? We shall requite those who turn away from Our messages in disdain with evil suffering for having thus turned away!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/946","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/946.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/946.mp3"]}},{"no":158,"arab":"هَلْ يَنْظُرُونَ إِلَّا أَنْ تَأْتِيَهُمُ الْمَلَائِكَةُ أَوْ يَأْتِيَ رَبُّكَ أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ ۗ يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا ۗ قُلِ انْتَظِرُوا إِنَّا مُنْتَظِرُونَ","latin":"hal yanzhuruuna illaa an ta/tiyahumu almalaa-ikatu aw ya/tiya rabbuka aw ya/tiya ba'dhu aayaati rabbika yawma ya/tii ba'dhu aayaati rabbika laa yanfa'u nafsan iimaanuhaa lam takun aamanat min qablu aw kasabat fii iimaanihaa khayran quli intazhiruu innaa muntazhiruuna","translate":{"id":"Yang mereka nanti-nanti tidak lain hanyalah kedatangan malaikat kepada mereka (untuk mencabut nyawa mereka) atau kedatangan (siksa) Tuhanmu atau kedatangan beberapa ayat Tuhanmu . Pada hari datangnya ayat dari Tuhanmu, tidaklah bermanfaat lagi iman seseorang kepada dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya. Katakanlah: \"Tunggulah olehmu sesungguhnya Kamipun menunggu (pula)\".\n","en":"Do they, perchance, wait for the angels to appear unto them, or for thy Sustainer [Himself] to appear, or for some of thy Sustainer's [final] portents to appear? [But] on the Day when thy Sustainer's [final] portents do appear, believing will be of no avail to any human being who did not believe before, or who, while believing, did no good works. Say: \"Wait, [then, for the Last Day, O unbelievers:] behold, we [believers] are waiting, too!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/947","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/947.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/947.mp3"]}},{"no":159,"arab":"إِنَّ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا لَسْتَ مِنْهُمْ فِي شَيْءٍ ۚ إِنَّمَا أَمْرُهُمْ إِلَى اللَّهِ ثُمَّ يُنَبِّئُهُمْ بِمَا كَانُوا يَفْعَلُونَ","latin":"inna alladziina farraquu diinahum wakaanuu syiya'an lasta minhum fii syay-in innamaa amruhum ilaa allaahi tsumma yunabbi-uhum bimaa kaanuu yaf'aluuna","translate":{"id":"Sesungguhnya orang-orang yang memecah belah agama-Nya dan mereka menjadi bergolongan , tidak ada sedikitpun tanggung jawabmu kepada mereka. Sesungguhnya urusan mereka hanyalah terserah kepada Allah, kemudian Allah akan memberitahukan kepada mereka apa yang telah mereka perbuat.\n","en":"VERILY, as for those who have broken the unity of their faith and have become sects - thou hast nothing to do with them. Behold, their case rests with God: and in time He will make them understand what they were doing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/948","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/948.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/948.mp3"]}},{"no":160,"arab":"مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُونَ","latin":"man jaa-a bialhasanati falahu 'asyru amtsaalihaa waman jaa-a bialssayyi-aati falaa yujzaa illaa mitslahaa wahum laa yuzhlamuuna","translate":{"id":"Barangsiapa membawa amal yang baik, maka baginya (pahala) sepuluh kali lipat amalnya; dan barangsiapa yang membawa perbuatan jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, sedang mereka sedikitpun tidak dianiaya (dirugikan).\n","en":"Whoever shall come [before God] with a good deed will gain ten times the like thereof; but whoever shall come with an evil deed will be requited with no more than the like thereof; and none shall be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/949","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/949.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/949.mp3"]}},{"no":161,"arab":"قُلْ إِنَّنِي هَدَانِي رَبِّي إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ دِينًا قِيَمًا مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۚ وَمَا كَانَ مِنَ الْمُشْرِكِينَ","latin":"qul innanii hadaanii rabbii ilaa shiraathin mustaqiimin diinan qiyaman millata ibraahiima haniifan wamaa kaana mina almusyrikiina","translate":{"id":"Katakanlah: \"Sesungguhnya aku telah ditunjuki oleh Tuhanku kepada jalan yang lurus, (yaitu) agama yang benar, agama Ibrahim yang lurus, dan Ibrahim itu bukanlah termasuk orang-orang musyrik\".\n","en":"SAY: \"Behold, my Sustainer has guided me onto a straight way through an ever-true faith-the way of Abraham, who turned away from all that is false, and wa,. not of those who ascribe divinity to aught beside Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/950","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/950.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/950.mp3"]}},{"no":162,"arab":"قُلْ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ","latin":"qul inna shalaatii wanusukii wamahyaaya wamamaatii lillaahi rabbi al'aalamiina","translate":{"id":"Katakanlah: sesungguhnya sembahyangku, ibadatku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam.\n","en":"Say: \"Behold, my prayer, and (all] my acts of worship, and my living and my dying are for God [alone], the Sustainer of all the worlds,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/951","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/951.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/951.mp3"]}},{"no":163,"arab":"لَا شَرِيكَ لَهُ ۖ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ","latin":"laa syariika lahu wabidzaalika umirtu wa-anaa awwalu almuslimiina","translate":{"id":"Tiada sekutu bagiNya; dan demikian itulah yang diperintahkan kepadaku dan aku adalah orang yang pertama-tama menyerahkan diri (kepada Allah)\".\n","en":"in whose divinity none has a share: for thus have I been bidden-and I shall [always] be foremost among those who surrender themselves unto Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/952","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/952.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/952.mp3"]}},{"no":164,"arab":"قُلْ أَغَيْرَ اللَّهِ أَبْغِي رَبًّا وَهُوَ رَبُّ كُلِّ شَيْءٍ ۚ وَلَا تَكْسِبُ كُلُّ نَفْسٍ إِلَّا عَلَيْهَا ۚ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ ثُمَّ إِلَىٰ رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ","latin":"qul aghayra allaahi abghii rabban wahuwa rabbu kulli syay-in walaa taksibu kullu nafsin illaa 'alayhaa walaa taziru waaziratun wizra ukhraa tsumma ilaa rabbikum marji'ukum fayunabbi-ukum bimaa kuntum fiihi takhtalifuuna","translate":{"id":"Katakanlah: \"Apakah aku akan mencari Tuhan selain Allah, padahal Dia adalah Tuhan bagi segala sesuatu. Dan tidaklah seorang membuat dosa melainkan kemudharatannya kembali kepada dirinya sendiri; dan seorang yang berdosa tidak akan memikul dosa orang lain . Kemudian kepada Tuhanmulah kamu kembali, dan akan diberitakan-Nya kepadamu apa yang kamu perselisihkan.\"\n","en":"Say: \"Am I, then, to seek a sustainer other than God, when He is the Sustainer of all things?\" And whatever [wrong] any human being commits rests upon himself alone; and no bearer of burdens shall be made to bear another's burden. And, in time, unto your Sustainer you all must return: and then He will make you. [truly] understand all that on which you were wont to differ."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/953","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/953.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/953.mp3"]}},{"no":165,"arab":"وَهُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ الْأَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَبْلُوَكُمْ فِي مَا آتَاكُمْ ۗ إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ وَإِنَّهُ لَغَفُورٌ رَحِيمٌ","latin":"wahuwa alladzii ja'alakum khalaa-ifa al-ardhi warafa'a ba'dhakum fawqa ba'dhin darajaatin liyabluwakum fii maa aataakum inna rabbaka sarii'u al'iqaabi wa-innahu laghafuurun rahiimun","translate":{"id":"Dan Dia lah yang menjadikan kamu penguasa-penguasa di bumi dan Dia meninggikan sebahagian kamu atas sebahagian (yang lain) beberapa derajat, untuk mengujimu tentang apa yang diberikan-Nya kepadamu. Sesungguhnya Tuhanmu amat cepat siksaan-Nya dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang.\n","en":"For, He it is who has made you inherit the earth, and has raised some of you by degrees above others, so that He might try you by means of what He has bestowed upon you. Verily, thy Sustainer is swift in retribution: yet, behold, He is indeed much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/954","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/954.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/954.mp3"]}}]}