{"alquran":{"no":61,"name":"As-Saff","arab":"الصف","start":5163,"count":14,"rukku":2,"type":"medina","description":"Surat Ash Shaff terdiri atas 14 ayat termasuk golongan surat-surat Madaniyyah. Dinamai dengan <i>Ash Shaff</i>, karena pada ayat 4 surat ini terdapat kata <i>Shaffan</i> yang berarti <i>satu barisan</i>. Ayat ini menerangkan apa yang diridhai Allah sesudah menerangkan apa yang dimurkai-Nya. Pada ayat 3 diterangkan bahwa Allah murka kepada orang yang hanya pandai berkata saja tetapi tidak melaksanakan apa yang diucapkannya. Dan pada ayat 4 diterangkan bahwa Allah menyukai orang yang mempraktekkan apa yang diucapkannya yaitu orang-orang yang berperang pada jalan Allah dalam satu barisan."},"surah":[{"no":1,"arab":" سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"sabbaha lillaahi maa fii alssamaawaati wamaa fii al-ardhi wahuwa al'aziizu alhakiimu","translate":{"id":"Telah bertasbih kepada Allah apa saja yang ada di langit dan apa saja yang ada di bumi; dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: for He alone is almighty, truly wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5164","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5164.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5164.mp3"]}},{"no":2,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ","latin":"yaa ayyuhaa alladziina aamanuu lima taquuluuna maa laa taf'aluuna","translate":{"id":"Wahai orang-orang yang beriman, kenapakah kamu mengatakan sesuatu yang tidak kamu kerjakan?\n","en":"O YOU who have attained to faith! Why do you say one thing and do another?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5165","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5165.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5165.mp3"]}},{"no":3,"arab":"كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ","latin":"kabura maqtan 'inda allaahi an taquuluu maa laa taf'aluuna","translate":{"id":"Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tidak kamu kerjakan.\n","en":"Most loathsome is it in the sight of God that you say what you do not do!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5166","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5166.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5166.mp3"]}},{"no":4,"arab":"إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ","latin":"inna allaaha yuhibbu alladziina yuqaatiluuna fii sabiilihi shaffan ka-annahum bunyaanun marshuushun","translate":{"id":"Sesungguhnya Allah menyukai orang yang berperang dijalan-Nya dalam barisan yang teratur seakan-akan mereka seperti suatu bangunan yang tersusun kokoh.\n","en":"Verily, God loves [only] those who fight in His cause in [solid] ranks, as though they were a building firm and compact."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5167","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5167.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5167.mp3"]}},{"no":5,"arab":"وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَدْ تَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","latin":"wa-idz qaala muusaa liqawmihi yaa qawmi lima tu/dzuunanii waqad ta'lamuuna annii rasuulu allaahi ilaykum falammaa zaaghuu azaagha allaahu quluubahum waallaahu laa yahdii alqawma alfaasiqiina","translate":{"id":"Dan (ingatlah) ketika Musa berkata kepada kaumnya: \"Hai kaumku, mengapa kamu menyakitiku, sedangkan kamu mengetahui bahwa sesungguhnya aku adalah utusan Allah kepadamu?\" Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka ; dan Allah tidak memberi petunjuk kepada kaum yang fasik.\n","en":"Now when Moses spoke to his people, [it was this same truth that he had in mind:] \"O my people! Why do you cause me grief, the while you know that I am an apostle of God sent unto you?\" And so, when they swerved from the right way, God let their hearts swerve from the truth: for God does not bestow His guidance upon iniquitous folk."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5168","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5168.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5168.mp3"]}},{"no":6,"arab":"وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَٰذَا سِحْرٌ مُبِينٌ","latin":"wa-idz qaala 'iisaa ibnu maryama yaa banii israa-iila innii rasuulu allaahi ilaykum mushaddiqan limaa bayna yadayya mina alttawraati wamubasysyiran birasuulin ya/tii min ba'dii ismuhu ahmadu falammaa jaa-ahum bialbayyinaati qaaluu haadzaa sihrun mubiinun","translate":{"id":"Dan (ingatlah) ketika 'Isa ibnu Maryam berkata: \"Hai Bani Israil, sesungguhnya aku adalah utusan Allah kepadamu, membenarkan kitab sebelumku, yaitu Taurat, dan memberi khabar gembira dengan (datangnya) seorang Rasul yang akan datang sesudahku, yang namanya Ahmad (Muhammad).\" Maka tatkala rasul itu datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka berkata: \"Ini adalah sihir yang nyata.\"\n","en":"And [this happened, too,] when Jesus, the son of Mary, said: \"O children of Israel! Behold, I am an apostle of God unto you, [sent] to confirm the truth of whatever there still remains of the Torah, and to give [you] the glad tiding of an apostle who shall come after me, whose name shall be Ahmad.\" But when he [whose coming Jesus had foretold] came unto them with all evidence of the truth, they said: \"This [alleged message of his] is [nothing but] spellbinding eloquence!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5169","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5169.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5169.mp3"]}},{"no":7,"arab":"وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","latin":"waman azhlamu mimmani iftaraa 'alaa allaahi alkadziba wahuwa yud'aa ilaa al-islaami waallaahu laa yahdii alqawma alzhzhaalimiina","translate":{"id":"Dan siapakah yang lebih zalim daripada orang yang mengada-adakan dusta terhadap Allah sedang dia diajak kepada Islam? Dan Allah tidak memberi petunjuk kepada orang-orang zalim.\n","en":"And who could be more wicked than one who invents [such] a lie about [a message from] God, seeing that he is [but] being called to self-surrender unto Him? But God does not bestow His guidance upon evil-doing folk."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5170","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5170.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5170.mp3"]}},{"no":8,"arab":"يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ","latin":"yuriiduuna liyuthfi-uu nuura allaahi bi-afwaahihim waallaahu mutimmu nuurihi walaw kariha alkaafiruuna","translate":{"id":"Mereka ingin memadamkan cahaya Allah dengan mulut (tipu daya) mereka, tetapi Allah (justru) menyempurnakan cahaya-Nya, walau orang-orang kafir membencinya\".\n","en":"They aim to extinguish God's light with their utterances: but God has willed to spread His light in all its fullness, however hateful this may be to all who deny the truth"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5171","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5171.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5171.mp3"]}},{"no":9,"arab":"هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ","latin":"huwa alladzii arsala rasuulahu bialhudaa wadiini alhaqqi liyuzhhirahu 'alaa alddiini kullihi walaw kariha almusyrikuuna","translate":{"id":"Dia-lah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar agar Dia memenangkannya di atas segala agama-agama meskipun orang musyrik membenci.\n","en":"He it is who has sent forth His Apostle with [the task of] spreading guidance and the religion of truth, to the end that He make it prevail over all [false] religion, however hateful this may be to those who ascribe divinity to aught but God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5172","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5172.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5172.mp3"]}},{"no":10,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ","latin":"yaa ayyuhaa alladziina aamanuu hal adullukum 'alaa tijaaratin tunjiikum min 'adzaabin aliimin","translate":{"id":"Hai orang-orang yang beriman, sukakah kamu aku tunjukkan suatu perniagaan yang dapat menyelamatkanmu dari azab yang pedih?\n","en":"O YOU who have attained to faith! Shall I point out to you a bargain that will save you from grievous suffering [in this world and in the life to come]?"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5173","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5173.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5173.mp3"]}},{"no":11,"arab":"تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","latin":"tu/minuuna biallaahi warasuulihi watujaahiduuna fii sabiili allaahi bi-amwaalikum wa-anfusikum dzaalikum khayrun lakum in kuntum ta'lamuuna","translate":{"id":"(yaitu) kamu beriman kepada Allah dan RasulNya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagimu, jika kamu mengetahui.\n","en":"You are to believe in God and His Apostle, and to strive hard in God's cause with your possessions and your lives: this is for your own good - if you but knew it!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5174","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5174.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5174.mp3"]}},{"no":12,"arab":"يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","latin":"yaghfir lakum dzunuubakum wayudkhilkum jannaatin tajrii min tahtihaa al-anhaaru wamasaakina thayyibatan fii jannaati 'adnin dzaalika alfawzu al'azhiimu","translate":{"id":"Niscaya Allah akan mengampuni dosa-dosamu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai; dan (memasukkan kamu) ke tempat tinggal yang baik di dalam jannah 'Adn. Itulah keberuntungan yang besar.\n","en":"[If you do so,] He will forgive you your sins, and [in the life to come] will admit you into gardens through which running waters flow, and into goodly mansions in [those] gardens of perpetual bliss: that [will be] the triumph supreme!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5175","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5175.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5175.mp3"]}},{"no":13,"arab":"وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ","latin":"waukhraa tuhibbuunahaa nashrun mina allaahi wafathun qarriibun wabasysyiri almu/miniina","translate":{"id":"Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya). Dan sampaikanlah berita gembira kepada orang-orang yang beriman.\n","en":"And [withal, He will grant you] yet another thing that you dearly love: succour from God [in this world], and a victory soon to come: and [thereof, O Prophet,] give thou a glad tiding to all who believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5176","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5176.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5176.mp3"]}},{"no":14,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنْصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنْصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ ۖ فَآمَنَتْ طَائِفَةٌ مِنْ بَنِي إِسْرَائِيلَ وَكَفَرَتْ طَائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ","latin":"yaa ayyuhaa alladziina aamanuu kuunuu anshaara allaahi kamaa qaala 'iisaa ibnu maryama lilhawaariyyiina man anshaarii ilaa allaahi qaala alhawaariyyuuna nahnu anshaaru allaahi faaamanat thaa-ifatun min banii israa-iila wakafarat thaa-ifatun fa-ayyadnaa alladziina aamanuu 'alaa 'aduwwihim fa-ashbahuu zhaahiriina","translate":{"id":"Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah sebagaimana 'Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: \"Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?\" Pengikut-pengikut yang setia itu berkata: \"Kamilah penolong-penolong agama Allah\", lalu segolongan dari Bani Israil beriman dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang.\n","en":"O YOU who have attained to faith! Be helpers [in the cause of God - even as Jesus, the son of Mary, said unto the white-garbed ones, \"Who will be my helpers in God's cause?\" - whereupon the white-garbed [disciples] replied, \"We shall be [thy] helpers [in the cause] of God!\" And so [it happened that] some of the children of Israel came to believe [in the apostleship of Jesus], whereas others denied the truth. But [now] We have given strength against their foes unto those who have [truly] attained to faith: and they have become the ones that shall prevail."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5177","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5177.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5177.mp3"]}}]}