{"alquran":{"no":62,"name":"Al-Jumu'a","arab":"الجمعة","start":5177,"count":11,"rukku":2,"type":"medina","description":"Surat Al Jumu'ah ini terdiri atas 11 ayat, termasuk golongan-golongan surat-surat Madaniyyah dan diturunkan sesudah surat Ash Shaf. Nama surat Al Jumu'ah diambil dari kata <i>Al Jumu'ah</i> yang terdapat pada ayat 9 surat ini yang artinya: <i>hari Jum'at</i>."},"surah":[{"no":1,"arab":" يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ","latin":"yusabbihu lillaahi maa fii alssamaawaati wamaa fii al-ardhi almaliki alqudduusi al'aziizi alhakiimi","translate":{"id":"Senantiasa bertasbih kepada Allah apa yang ada di langit dan apa yang ada di bumi. Raja, Yang Maha Suci, Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"ALL THAT IS in the heavens and all that is on earth extols the limitless glory of God, the Sovereign Supreme, the Holy, the Almighty, the Wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5178","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5178.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5178.mp3"]}},{"no":2,"arab":"هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ","latin":"huwa alladzii ba'atsa fii al-ummiyyiina rasuulan minhum yatluu 'alayhim aayaatihi wayuzakkiihim wayu'allimuhumu alkitaaba waalhikmata wa-in kaanuu min qablu lafii dhalaalin mubiinin","translate":{"id":"Dia-lah yang mengutus kepada kaum yang buta huruf seorang Rasul di antara mereka, yang membacakan ayat-ayat-Nya kepada mereka, mensucikan mereka dan mengajarkan mereka Kitab dan Hikmah (As Sunnah). Dan sesungguhnya mereka sebelumnya benar-benar dalam kesesatan yang nyata,\n","en":"He it is who has sent unto the unlettered people an apostle from among themselves, to convey unto them His messages, and to cause them to grow in purity, and to impart unto them the divine writ as well as wisdom - whereas before that they were indeed, most obviously, lost in error"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5179","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5179.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5179.mp3"]}},{"no":3,"arab":"وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ","latin":"waaakhariina minhum lammaa yalhaquu bihim wahuwa al'aziizu alhakiimu","translate":{"id":"dan (juga) kepada kaum yang lain dari mereka yang belum berhubungan dengan mereka. Dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"and [to cause this message to spread] from them unto other people as soon as they come into contact with them: for He alone is almighty, truly wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5180","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5180.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5180.mp3"]}},{"no":4,"arab":"ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","latin":"dzaalika fadhlu allaahi yu/tiihi man yasyaau waallaahu dzuu alfadhli al'azhiimi","translate":{"id":"Demikianlah karunia Allah, diberikan-Nya kepada siapa yang dikehendaki-Nya; dan Allah mempunyai karunia yang besar.\n","en":"Such is God's bounty: He grants it to anyone who is willing [to receive it]: for God is limitless in His great bounty."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5181","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5181.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5181.mp3"]}},{"no":5,"arab":"مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا ۚ بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","latin":"matsalu alladziina hummiluu alttawraata tsumma lam yahmiluuhaa kamatsali alhimaari yahmilu asfaaran bi/sa matsalu alqawmi alladziina kadzdzabuu bi-aayaati allaahi waallaahu laa yahdii alqawma alzhzhaalimiina","translate":{"id":"Perumpamaan orang-orang yang dipikulkan kepadanya Taurat, kemudian mereka tiada memikulnya adalah seperti keledai yang membawa kitab-kitab yang tebal. Amatlah buruknya perumpamaan kaum yang mendustakan ayat-ayat Allah itu. Dan Allah tiada memberi petunjuk kepada kaum yang zalim.\n","en":"THE PARABLE of those who were graced with the burden of the Torah, and thereafter failed to bear this burden, is that of an ass that carries a load of books [but cannot benefit from them]. Calamitous is the parable of people who are bent on giving the lie to God's messages - for God does not bestow His guidance upon such evildoing folk!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5182","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5182.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5182.mp3"]}},{"no":6,"arab":"قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِنْ زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاءُ لِلَّهِ مِنْ دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِنْ كُنْتُمْ صَادِقِينَ","latin":"qul yaa ayyuhaa alladziina haaduu in za'amtum annakum awliyaau lillaahi min duuni alnnaasi fatamannawuu almawta in kuntum shaadiqiina","translate":{"id":"Katakanlah: \"Hai orang-orang yang menganut agama Yahudi, jika kamu mendakwakan bahwa sesungguhnya kamu sajalah kekasih Allah bukan manusia-manusia yang lain, maka harapkanlah kematianmu, jika kamu adalah orang-orang yang benar\".\n","en":"Say: \"O you who follow the Jewish faith! If you claim that you [alone] are close to God, to the exclusion of all other people, then you should be longing for death - if what you say is true!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5183","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5183.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5183.mp3"]}},{"no":7,"arab":"وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۚ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ","latin":"walaa yatamannawnahu abadan bimaa qaddamat aydiihim waallaahu 'aliimun bialzhzhaalimiina","translate":{"id":"Mereka tiada akan mengharapkan kematian itu selama-lamanya disebabkan kejahatan yang telah mereka perbuat dengan tangan mereka sendiri. Dan Allah Maha Mengetahui akan orang-orang yang zalim.\n","en":"But never will they long for it, because [they are aware] of what their hands have wrought in this world; and God has full knowledge of evildoers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5184","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5184.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5184.mp3"]}},{"no":8,"arab":"قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ۖ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ","latin":"qul inna almawta alladzii tafirruuna minhu fa-innahu mulaaqiikum tsumma turadduuna ilaa 'aalimi alghaybi waalsysyahaadati fayunabbi-ukum bimaa kuntum ta'maluuna","translate":{"id":"Katakanlah: \"Sesungguhnya kematian yang kamu lari daripadanya, maka sesungguhnya kematian itu akan menemui kamu, kemudian kamu akan dikembalikan kepada (Allah), yang mengetahui yang ghaib dan yang nyata, lalu Dia beritakan kepadamu apa yang telah kamu kerjakan\".\n","en":"Say: \"Behold, the death from which you are fleeing is bound to overtake you - and then you will be brought back unto Him who knows all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind, whereupon He will make you truly understand all that you were doing [in life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5185","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5185.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5185.mp3"]}},{"no":9,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَىٰ ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ","latin":"yaa ayyuhaa alladziina aamanuu idzaa nuudiya lilshshalaati min yawmi aljumu'ati fais'aw ilaa dzikri allaahi wadzaruu albay'a dzaalikum khayrun lakum in kuntum ta'lamuuna","translate":{"id":"Hai orang-orang beriman, apabila diseru untuk menunaikan shalat Jum'at, maka bersegeralah kamu kepada mengingat Allah dan tinggalkanlah jual beli . Yang demikian itu lebih baik bagimu jika kamu mengetahui.\n","en":"O YOU who have attained to faith! When the call to prayer is sounded on the day of congregation, hasten to the remembrance of God, and leave all worldly commerce: this is for your own good, if you but knew it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5186","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5186.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5186.mp3"]}},{"no":10,"arab":"فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ","latin":"fa-idzaa qudhiyati alshshalaatu faintasyiruu fii al-ardhi waibtaghuu min fadhli allaahi waudzkuruu allaaha katsiiran la'allakum tuflihuuna ","translate":{"id":"Apabila telah ditunaikan shalat, maka bertebaranlah kamu di muka bumi; dan carilah karunia Allah dan ingatlah Allah banyak-banyak supaya kamu beruntung.\n","en":"And when the prayer is ended, disperse freely on earth and seek to obtain [something] of God's bounty; but remember God often, so that you might attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5187","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5187.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5187.mp3"]}},{"no":11,"arab":"وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا ۚ قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ ۚ وَاللَّهُ خَيْرُ الرَّازِقِينَ","latin":"wa-idzaa ra-aw tijaaratan aw lahwan infadhdhuu ilayhaa watarakuuka qaa-iman qul maa 'inda allaahi khayrun mina allahwi wamina alttijaarati waallaahu khayru alrraaziqiina","translate":{"id":"Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhotbah). Katakanlah: \"Apa yang di sisi Allah lebih baik daripada permainan dan perniagaan\", dan Allah Sebaik-baik Pemberi rezki.\n","en":"Yet [it does happen that] when people become aware of [an occasion for] worldly gain or a passing delight, they rush headlong towards it, and leave thee standing [and preaching]. Say: \"That which is with God is far better than all passing delight and all gain! And God is the best of providers!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5188","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5188.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5188.mp3"]}}]}