{"alquran":{"no":63,"name":"Al-Munaafiqoon","arab":"المنافقون","start":5188,"count":11,"rukku":2,"type":"medina","description":"Surat ini terdiri atas 11 ayat, termasuk golongan surat-surat Madaniyyah, diturunkan sesudah surat Al Hajj. Surat ini dinamai <i>Al-Munaafiquun</i>  yang artinya orang-orang munafik, karena surat ini mengungkapkan  sifat-sifat orang-orang munafik."},"surah":[{"no":1,"arab":" إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ ۗ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ","latin":"idzaa jaa-aka almunaafiquuna qaaluu nasyhadu innaka larasuulu allaahi waallaahu ya'lamu innaka larasuuluhu waallaahu yasyhadu inna almunaafiqiina lakaadzibuuna","translate":{"id":"Apabila orang-orang munafik datang kepadamu, mereka berkata: \"Kami mengakui, bahwa sesungguhnya kamu benar-benar Rasul Allah\". Dan Allah mengetahui bahwa sesungguhnya kamu benar-benar Rasul-Nya; dan Allah mengetahui bahwa sesungguhnya orang-orang munafik itu benar-benar orang pendusta.\n","en":"WHEN THE HYPOCRITES come unto thee, they say, \"We bear witness that thou art indeed God's Apostle!\" But God knows that thou art truly His Apostle; and He bears witness that the hypocrites are indeed false [in their declaration of faith]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5189","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5189.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5189.mp3"]}},{"no":2,"arab":"اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ","latin":"ittakhadzuu aymaanahum junnatan fashadduu 'an sabiili allaahi innahum saa-a maa kaanuu ya'maluuna","translate":{"id":"Mereka itu menjadikan sumpah mereka sebagai perisai , lalu mereka menghalangi (manusia) dari jalan Allah. Sesungguhnya amat buruklah apa yang telah mereka kerjakan.\n","en":"They have made their oaths a cover [for their falseness], and thus they turn others away from the Path of God. Evil indeed is all that they are wont to do:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5190","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5190.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5190.mp3"]}},{"no":3,"arab":"ذَٰلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ","latin":"dzaalika bi-annahum aamanuu tsumma kafaruu fathubi'a 'alaa quluubihim fahum laa yafqahuuna","translate":{"id":"Yang demikian itu adalah karena bahwa sesungguhnya mereka telah beriman, kemudian menjadi kafir (lagi) lalu hati mereka dikunci mati; karena itu mereka tidak dapat mengerti.\n","en":"this, because [they profess that] they have attained to faith, whereas [inwardly] they deny the truth - and so, a seal has been set on their hearts so that they can no longer understand [what is true and what false]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5191","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5191.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5191.mp3"]}},{"no":4,"arab":"وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ ۖ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ ۖ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۚ قَاتَلَهُمُ اللَّهُ ۖ أَنَّىٰ يُؤْفَكُونَ","latin":"wa-idzaa ra-aytahum tu'jibuka ajsaamuhum wa-in yaquuluu tasma' liqawlihim ka-annahum khusyubun musannadatun yahsabuuna kulla shayhatin 'alayhim humu al'aduwwu faihtsarhum qaatalahumu allaahu annaa yu/fakuuna","translate":{"id":"Dan apabila kamu melihat mereka, tubuh-tubuh mereka menjadikan kamu kagum. Dan jika mereka berkata kamu mendengarkan perkataan mereka. Mereka adalah seakan-akan kayu yang tersandar . Mereka mengira bahwa tiap-tiap teriakan yang keras ditujukan kepada mereka. Mereka itulah musuh (yang sebenarnya) maka waspadalah terhadap mereka; semoga Allah membinasakan mereka. Bagaimanakah mereka sampai dipalingkan (dari kebenaran)?\n","en":"Now when thou seest them, their outward appearance may please thee; and when they speak, thou art inclined to lend ear to what they say. [But though they may seem as sure of themselves] as if they were timbers [firmly] propped up, they think that every shout is [directed] against them. They are the [real] enemies [of all faith], so beware of them. [They deserve the imprecation,] \"May God destroy them!\" How perverted are their minds!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5192","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5192.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5192.mp3"]}},{"no":5,"arab":"وَإِذَا قِيلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ لَوَّوْا رُءُوسَهُمْ وَرَأَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ","latin":"wa-idzaa qiila lahum ta'aalaw yastaghfir lakum rasuulu allaahi lawwaw ruuusahum wara-aytahum yashudduuna wahum mustakbiruuna","translate":{"id":"Dan apabila dikatakan kepada mereka: Marilah (beriman), agar Rasulullah memintakan ampunan bagimu, mereka membuang muka mereka dan kamu lihat mereka berpaling sedang mereka menyombongkan diri.\n","en":"for, when they are told, \"Come, the Apostle of God will pray [unto God] that you be forgiven\", they turn their heads away, and thou canst see how they draw back in their false pride."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5193","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5193.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5193.mp3"]}},{"no":6,"arab":"سَوَاءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ اللَّهُ لَهُمْ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ","latin":"sawaaun 'alayhim astaghfarta lahum am lam tastaghfir lahum lan yaghfira allaahu lahum inna allaaha laa yahdii alqawma alfaasiqiina","translate":{"id":"Sama saja bagi mereka, kamu mintakan ampunan atau tidak kamu mintakan ampunan bagi mereka. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang fasik.\n","en":"As for them it is all the same whether thou dost pray that they be forgiven or dost not pray for them: God will nor forgive them - for, behold, God does not bestow His guidance upon such iniquitous folk."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5194","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5194.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5194.mp3"]}},{"no":7,"arab":"هُمُ الَّذِينَ يَقُولُونَ لَا تُنْفِقُوا عَلَىٰ مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّىٰ يَنْفَضُّوا ۗ وَلِلَّهِ خَزَائِنُ السَّمَاوَاتِ وَالْأَرْضِ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَفْقَهُونَ","latin":"humu alladziina yaquuluuna laa tunfiquu 'alaa man 'inda rasuuli allaahi hattaa yanfadhdhuu walillaahi khazaa-inu alssamaawaati waal-ardhi walaakinna almunaafiqiina laa yafqahuuna","translate":{"id":"Mereka orang-orang yang mengatakan (kepada orang-orang Anshar): \"Janganlah kamu memberikan perbelanjaan kepada orang-orang (Muhajirin) yang ada disisi Rasulullah supaya mereka bubar (meninggalkan Rasulullah).\" Padahal kepunyaan Allah-lah perbendaharaan langit dan bumi, tetapi orang-orang munafik itu tidak memahami.\n","en":"It is they who say [to their compatriots], \"Do not spend anything on those who are with God's Apostle, so that they [may be forced to] leave.\" However, unto God belong the treasures of the heavens and the earth: but this truth the hypocrites cannot grasp."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5195","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5195.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5195.mp3"]}},{"no":8,"arab":"يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ ۚ وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ","latin":"yaquuluuna la-in raja'naa ilaa almadiinati layukhrijanna al-a'azzu minhaa al-adzalla walillaahi al'izzatu walirasuulihi walilmu/miniina walaakinna almunaafiqiina laa ya'lamuuna","translate":{"id":"Mereka berkata: \"Sesungguhnya jika kita telah kembali ke Madinah , benar-benar orang yang kuat akan mengusir orang-orang yang lemah dari padanya.\" Padahal kekuatan itu hanyalah bagi Allah, bagi Rasul-Nya dan bagi orang-orang mu'min, tetapi orang-orang munafik itu tiada mengetahui.\n","en":"[And] they say, \"Indeed, when we return to the City [we,] the ones most worthy of honour will surely drive out therefrom those most contemptible ones!\" However, all honour belongs to God, and [thus] to His Apostle and those who believe [in God]: but of this the hypocrites are not aware."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5196","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5196.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5196.mp3"]}},{"no":9,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَنْ ذِكْرِ اللَّهِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْخَاسِرُونَ","latin":"yaa ayyuhaa alladziina aamanuu laa tulhikum amwaalukum walaa awlaadukum 'an dzikri allaahi waman yaf'al dzaalika faulaa-ika humu alkhaasiruuna","translate":{"id":"Hai orang-orang beriman, janganlah hartamu dan anak-anakmu melalaikan kamu dari mengingat Allah. Barangsiapa yang berbuat demikian maka mereka itulah orang-orang yang merugi.\n","en":"O YOU who have attained to faith! Let not your worldly goods or your children make you oblivious of the remembrance of God: for If any behave thus - it is they, they who are the losers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5197","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5197.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5197.mp3"]}},{"no":10,"arab":"وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلَا أَخَّرْتَنِي إِلَىٰ أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُنْ مِنَ الصَّالِحِينَ","latin":"wa-anfiquu min maa razaqnaakum min qabli an ya/tiya ahadakumu almawtu fayaquula rabbi lawlaa akhkhartanii ilaa ajalin qariibin fa-ashshaddaqa wa-akun mina alshshaalihiina","translate":{"id":"Dan belanjakanlah sebagian dari apa yang telah Kami berikan kepadamu sebelum datang kematian kepada salah seorang di antara kamu; lalu ia berkata: \"Ya Rabb-ku, mengapa Engkau tidak menangguhkan (kematian)ku sampai waktu yang dekat, yang menyebabkan aku dapat bersedekah dan aku termasuk orang-orang yang saleh?\"\n","en":"And spend on others out of what We have provided for you as sustenance, ere there come a time when death approaches any of you, and he then says, \"O my Sustainer! If only Thou wouldst grant me a delay for a short while, so that I could give in charity and be among the righteous!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5198","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5198.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5198.mp3"]}},{"no":11,"arab":"وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","latin":"walan yu-akhkhira allaahu nafsan idzaa jaa-a ajaluhaa waallaahu khabiirun bimaa ta'maluuna","translate":{"id":"Dan Allah sekali-kali tidak akan menangguhkan (kematian) seseorang apabila telah datang waktu kematiannya. Dan Allah Maha Mengenal apa yang kamu kerjakan.\n","en":"But never does God grant a delay to a human being when his term has come; and God is fully aware of all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5199","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5199.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5199.mp3"]}}]}