{"alquran":{"no":64,"name":"At-Taghaabun","arab":"التغابن","start":5199,"count":18,"rukku":2,"type":"medina","description":"Surat ini terdiri atas 18 ayat, termasuk golongan surat-surat Madaniyyah dan diturunkan sesudah surat At Tahrim. Nama <i>At Taghaabun</i> diambil dari kata <i>At Taghaabun</i> yang terdapat pada ayat ke 9 yang artinya <i>hari dinampakkan kesalahan-kesalahan</i>."},"surah":[{"no":1,"arab":" يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"yusabbihu lillaahi maa fii alssamaawaati wamaa fii al-ardhi lahu almulku walahu alhamdu wahuwa 'alaa kulli syay-in qadiirun","translate":{"id":"Bertasbih kepada Allah apa yang ada di langit dan apa yang ada di bumi; hanya Allah lah yang mempunyai semua kerajaan dan semua pujian, dan Dia Maha Kuasa atas segala sesuatu.\n","en":"ALL THAT IS in the heavens and all that is on earth extols God's limitless glory: His is all dominion, and to Him all praise is due; and He has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5200","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5200.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5200.mp3"]}},{"no":2,"arab":"هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","latin":"huwa alladzii khalaqakum faminkum kaafirun waminkum mu/minun waallaahu bimaa ta'maluuna bashiirun","translate":{"id":"Dia-lah yang menciptakan kamu maka di antara kamu ada yang kafir dan di antaramu ada yang mu'min. Dan Allah Maha Melihat apa yang kamu kerjakan.\n","en":"He it is who has created you: and among you are such as deny this truth, and among you are such as believe [in it]. And God sees all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5201","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5201.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5201.mp3"]}},{"no":3,"arab":"خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ الْمَصِيرُ","latin":"khalaqa alssamaawaati waal-ardha bialhaqqi washawwarakum fa-ahsana shuwarakum wa-ilayhi almashiiru","translate":{"id":"Dia menciptakan langit dan bumi dengan haq. Dia membentuk rupamu dan dibaguskanNya rupamu itu dan hanya kepada Allah-lah kembali(mu).\n","en":"He has created the heavens and the earth in accordance with [an inner] truth, and has formed you - and formed you so well; and with Him is your journey's end."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5202","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5202.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5202.mp3"]}},{"no":4,"arab":"يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"ya'lamu maa fii alssamaawaati waal-ardhi waya'lamu maa tusirruuna wamaa tu'linuuna waallaahu 'aliimun bidzaati alshshuduuri","translate":{"id":"Dia mengetahui apa yang ada di langit dan di bumi dan mengetahui apa yang kamu rahasiakan dan yang kamu nyatakan. Dan Allah Maha Mengetahui segala isi hati.\n","en":"He knows all that is in the heavens and on earth; and He knows all that you keep secret as well as all that you bring into the open: for God has full knowledge of what is in the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5203","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5203.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5203.mp3"]}},{"no":5,"arab":"أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ","latin":"alam ya/tikum nabau alladziina kafaruu min qablu fadzaaquu wabaala amrihim walahum 'adzaabun aliimun","translate":{"id":"Apakah belum datang kepadamu (hai orang-orang kafir) berita orang-orang kafir terdahulu. Maka mereka telah merasakan akibat yang buruk dari perbuatan mereka dan mereka memperoleh azab yang pedih.\n","en":"HAVE THE STORIES of those who, in earlier times, refused to acknowledge the truth never yet come within your ken? [They denied it -] and so they had to taste the evil outcome of their own doings, with [more] grievous suffering awaiting them [in the life to come]:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5204","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5204.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5204.mp3"]}},{"no":6,"arab":"ذَٰلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا ۚ وَاسْتَغْنَى اللَّهُ ۚ وَاللَّهُ غَنِيٌّ حَمِيدٌ","latin":"dzaalika bi-annahu kaanat ta/tiihim rusuluhum bialbayyinaati faqaaluu abasyarun yahduunanaa fakafaruu watawallaw waistaghnaa allaahu waallaahu ghaniyyun hamiidun","translate":{"id":"Yang demikian itu adalah karena sesungguhnya telah datang kepada mereka Rasul-Rasul mereka membawa keterangan-keterangan lalu mereka berkata: \"Apakah manusia yang akan memberi petunjuk kepada kami?\" lalu mereka ingkar dan berpaling; dan Allah tidak memerlukan (mereka). Dan Allah Maha Kaya lagi Maha Terpuji.\n","en":"this, because time and again there came unto them their apostles with all evidence of the truth, but they [always] replied, \"Shall mere mortal men be our guides?\" And so they. denied the truth and turned away. But God was not in need [of them]: for God is self-sufficient, ever to be praised."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5205","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5205.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5205.mp3"]}},{"no":7,"arab":"زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا ۚ قُلْ بَلَىٰ وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ","latin":"za'ama alladziina kafaruu an lan yub'atsuu qul balaa warabbii latub'atsunna tsumma latunabbaunna bimaa 'amiltum wadzaalika 'alaa allaahi yasiirun","translate":{"id":"Orang-orang yang kafir mengatakan bahwa mereka sekali-kali tidak akan dibangkitkan. Katakanlah: \"Memang, demi Tuhanku, benar-benar kamu akan dibangkitkan, kemudian akan diberitakan kepadamu apa yang telah kamu kerjakan.\" Yang demikian itu adalah mudah bagi Allah.\n","en":"They who are bent on denying the truth claim that they will never be raised from the dead! Say: \"Yea, by my Sustainer! Most surely will you be raised from the dead, and then, most surely, will you be made to understand what you did [in life]! For, easy is this for God!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5206","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5206.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5206.mp3"]}},{"no":8,"arab":"فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ","latin":"faaaminuu biallaahi warasuulihi waalnnuuri alladzii anzalnaa waallaahu bimaa ta'maluuna khabiirun","translate":{"id":"Maka berimanlah kamu kepada Allah dan Rasul-Nya dan kepada cahaya (Al-Quraan) yang telah Kami turunkan. Dan Allah Maha Mengetahui apa yang kamu kerjakan.\n","en":"Believe then, [O men,] in God and His Apostle, and in the light [of revelation] which We have bestowed [on you] from on high! And God is fully aware of all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5207","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5207.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5207.mp3"]}},{"no":9,"arab":"يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ذَٰلِكَ يَوْمُ التَّغَابُنِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ","latin":"yawma yajma'ukum liyawmi aljam'i dzaalika yawmu alttaghaabuni waman yu/min biallaahi waya'mal shaalihan yukaffir 'anhu sayyi-aatihi wayudkhilhu jannaatin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa abadan dzaalika alfawzu al'azhiimu","translate":{"id":"(Ingatlah) hari (dimana) Allah mengumpulkan kamu pada hari pengumpulan, itulah hari dinampakkan kesalahan-kesalahan. Dan barangsiapa yang beriman kepada Allah dan beramal saleh, niscaya Allah akan menutupi kesalahan-kesalahannya dan memasukkannya ke dalam jannah yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah keberuntungan yang besar.\n","en":"[Think of] the time when He shall gather you all together unto the Day of the [Last] Gathering - that Day of Loss and Gain! For, as for him who shall have believed in God and done what is just and right, He will [on that Day] efface his bad deeds, and will admit him into gardens through which running waters flow, therein to abide beyond the count of time: that will be a triumph supreme!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5208","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5208.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5208.mp3"]}},{"no":10,"arab":"وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا ۖ وَبِئْسَ الْمَصِيرُ","latin":"waalladziina kafaruu wakadzdzabuu bi-aayaatinaa ulaa-ika ash-haabu alnnaari khaalidiina fiihaa wabi/sa almashiiru","translate":{"id":"Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itulah penghuni-penghuni neraka, mereka kekal di dalmnya. Dan itulah seburuk-buruk tempat kembali.\n","en":"But as for those who are bent on denying the truth and on giving the lie to Our messages - they are destined for the fire, therein to abide: and how vile a journey’s end!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5209","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5209.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5209.mp3"]}},{"no":11,"arab":"مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"maa ashaaba min mushiibatin illaa bi-idzni allaahi waman yu/min biallaahi yahdi qalbahu waallaahu bikulli syay-in 'aliimun","translate":{"id":"Tidak ada suatu musibah pun yang menimpa seseorang kecuali dengan ijin Allah; dan barangsiapa yang beriman kepada Allah niscaya Dia akan memberi petunjuk kepada hatinya. Dan Allah Maha Mengetahui segala sesuatu.\n","en":"NO CALAMITY can ever befall [man] unless it be by God's leave: hence, whoever believes in God guides his [own] heart [towards this truth]; and God has full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5210","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5210.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5210.mp3"]}},{"no":12,"arab":"وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۚ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ","latin":"wa-athii'uu allaaha wa-athii'uu alrrasuula fa-in tawallaytum fa-innamaa 'alaa rasuulinaa albalaaghu almubiinu","translate":{"id":"Dan ta'atlah kepada Allah dan ta'atlah kepada Rasul-Nya, jika kamu berpaling sesungguhnya kewajiban Rasul Kami hanyalah menyampaikan (amanat Allah) dengan terang.\n","en":"Pay heed, then, unto God, and pay heed unto the Apostle; and if you turn away, [know that] Our Apostle's only duty is a clear delivery of this message:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5211","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5211.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5211.mp3"]}},{"no":13,"arab":"اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ","latin":"allaahu laa ilaaha illaa huwa wa'alaa allaahi falyatawakkali almu/minuuna","translate":{"id":"(Dia-lah) Allah tidak ada Tuhan selain Dia. Dan hendaklah orang-orang mu'min bertawakkal kepada Allah saja.\n","en":"God - there is no deity save Him! In God then let the believers place their trust."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5212","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5212.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5212.mp3"]}},{"no":14,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ ۚ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"yaa ayyuhaa alladziina aamanuu inna min azwaajikum wa-awlaadikum 'aduwwan lakum faihtsaruuhum wa-in ta'fuu watashfahuu wataghfiruu fa-inna allaaha ghafuurun rahiimun","translate":{"id":"Hai orang-orang mu'min, sesungguhnya di antara isteri-isterimu dan anak-anakmu ada yang menjadi musuh bagimu maka berhati-hatilah kamu terhadap mereka dan jika kamu memaafkan dan tidak memarahi serta mengampuni (mereka) maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"O YOU who have attained to faith! Behold, some of your spouses and your children are enemies unto you: so beware of them! But if you pardon [their faults] and forbear, and forgive-then, behold, God will be much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5213","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5213.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5213.mp3"]}},{"no":15,"arab":"إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ","latin":"innamaa amwaalukum wa-awlaadukum fitnatun waallaahu 'indahu ajrun 'azhiimun","translate":{"id":"Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah-lah pahala yang besar.\n","en":"Your worldly goods and your children are but a trial and a temptation, whereas with God there is a tremendous reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5214","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5214.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5214.mp3"]}},{"no":16,"arab":"فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ ۗ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ","latin":"faittaquu allaaha maa istatha'tum waisma'uu wa-athii'uu wa-anfiquu khayran li-anfusikum waman yuuqa syuhha nafsihi faulaa-ika humu almuflihuuna","translate":{"id":"Maka bertakwalah kamu kepada Allah menurut kesanggupanmu dan dengarlah serta ta'atlah dan nafkahkanlah nafkah yang baik untuk dirimu . Dan barangsiapa yang dipelihara dari kekikiran dirinya, maka mereka itulah orang-orang yang beruntung.\n","en":"Remain, then, conscious of God as best you can, and listen [to Him], and pay heed. And spend in charity for the good of your own selves: for, such as from their own covetousness are saved – it is they, they that shall attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5215","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5215.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5215.mp3"]}},{"no":17,"arab":"إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ شَكُورٌ حَلِيمٌ","latin":"in tuqridhuu allaaha qardhan hasanan yudaa'ifhu lakum wayaghfir lakum waallaahu syakuurun haliimun","translate":{"id":"Jika kamu meminjamkan kepada Allah pinjaman yang baik, niscaya Allah melipat gandakan balasannya kepadamu dan mengampuni kamu. Dan Allah Maha Pembalas Jasa lagi Maha Penyantun.\n","en":"If you offer up to God a goodly loan, He will amply repay you for it, and will forgive you your sins: for God is ever responsive to gratitude, forbearing,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5216","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5216.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5216.mp3"]}},{"no":18,"arab":"عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ","latin":"'aalimu alghaybi waalsysyahaadati al'aziizu alhakiimu","translate":{"id":"Yang mengetahui yang ghaib dan yang nyata. Yang Maha Perkasa lagi Maha Bijaksana.\n","en":"knowing all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind - the Almighty, the Wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5217","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5217.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5217.mp3"]}}]}