{"alquran":{"no":72,"name":"Al-Jinn","arab":"الجن","start":5447,"count":28,"rukku":2,"type":"mecca","description":"Surat Al Jin terdiri atas 28 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Al A'raaf. Dinamai <i>Al Jin</i> diambil dari perkataan <i>Al Jin</i> yang terdapat  pada ayat pertama surat ini. Pada ayat tersebut dan ayat-ayat berikutnya  diterangkan bahwa Jin sebagai makhluk halus telah mendengar pembacaan  Al Quran dan mereka mengikuti ajaran Al Quran tersebut."},"surah":[{"no":1,"arab":" قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا","latin":"qul uuhiya ilayya annahu istama'a nafarun mina aljinni faqaaluu innaa sami'naa qur-aanan 'ajabaan","translate":{"id":"Katakanlah (hai Muhammad): \"Telah diwahyukan kepadamu bahwasanya: telah mendengarkan sekumpulan jin (akan Al Qur'an), lalu mereka berkata: Sesungguhnya kami telah mendengarkan Al Qur'an yang mena'jubkan,\n","en":"SAY: \"It has been revealed to me that some of the unseen beings gave ear [to this divine writ], and thereupon said [unto their fellow-beings]: \"'Verily, we have heard a wondrous discourse,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5448","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5448.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5448.mp3"]}},{"no":2,"arab":"يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ ۖ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا","latin":"yahdii ilaa alrrusydi faaamannaa bihi walan nusyrika birabbinaa ahadaan","translate":{"id":"(yang) memberi petunjuk kapada jalan yang benar, lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan seseorangpun dengan Tuhan kami,\n","en":"guiding towards consciousness of what is right; and so We have come to believe in it. And we shall never ascribe divinity to anyone beside our Sustainer,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5449","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5449.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5449.mp3"]}},{"no":3,"arab":"وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا","latin":"wa-annahu ta'aalaa jaddu rabbinaa maa ittakhadza shaahibatan walaa waladaan","translate":{"id":"dan bahwasanya Maha Tinggi kebesaran Tuhan kami, Dia tidak beristeri dan tidak (pula) beranak.\n","en":"for [we know] that sublimely exalted is our Sustainer's majesty: no consort has He ever taken unto Himself, nor a son!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5450","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5450.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5450.mp3"]}},{"no":4,"arab":"وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا","latin":"wa-annahu kaana yaquulu safiihunaa 'alaa allaahi syathathaan","translate":{"id":"Dan bahwasanya: orang yang kurang akal daripada kami selalu mengatakan (perkataan) yang melampaui batas terhadap Allah ,\n","en":"\"'And [now we know] that the foolish among us were wont to say outrageous things about God,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5451","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5451.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5451.mp3"]}},{"no":5,"arab":"وَأَنَّا ظَنَنَّا أَنْ لَنْ تَقُولَ الْإِنْسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا","latin":"wa-annaa zhanannaa an lan taquula al-insu waaljinnu 'alaa allaahi kadzibaan","translate":{"id":"dan sesungguhnya kami mengira, bahwa manusia dan jin sekali-kali tidak akan mengatakan perkataan yang dusta terhadap Allah.\n","en":"and that [we were mistaken when] we thought that neither man nor [any of] the invisible forces would ever tell a lie about God."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5452","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5452.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5452.mp3"]}},{"no":6,"arab":"وَأَنَّهُ كَانَ رِجَالٌ مِنَ الْإِنْسِ يَعُوذُونَ بِرِجَالٍ مِنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا","latin":"wa-annahu kaana rijaalun mina al-insi ya'uudzuuna birijaalin mina aljinni fazaaduuhum rahaqaan","translate":{"id":"Dan bahwasanya ada beberapa orang laki-laki di antara manusia meminta perlindungan kepada beberapa laki-laki di antara jin, maka jin-jin itu menambah bagi mereka dosa dan kesalahan.\n","en":"Yet [it has always happened] that certain kinds of humans would seek refuge with certain kinds of [such] invisible forces: but these only increased their confusion –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5453","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5453.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5453.mp3"]}},{"no":7,"arab":"وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنْتُمْ أَنْ لَنْ يَبْعَثَ اللَّهُ أَحَدًا","latin":"wa-annahum zhannuu kamaa zhanantum an lan yab'atsa allaahu ahadaan","translate":{"id":"Dan sesungguhnya mereka (jin) menyangka sebagaimana persangkaan kamu (orang-orang kafir Mekah), bahwa Allah sekali-kali tidak akan membangkitkan seorang (rasul)pun,\n","en":"so much so that they came to think, as you [once] thought, that God would never [again] send forth anyone [as His apostle]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5454","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5454.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5454.mp3"]}},{"no":8,"arab":"وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا","latin":"wa-annaa lamasnaa alssamaa-a fawajadnaahaa muli-at harasan syadiidan wasyuhubaan","translate":{"id":"dan sesungguhnya kami telah mencoba mengetahui (rahasia) langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api,\n","en":"\"'And [so it happened] that we reached out towards heaven: but we found it filled with mighty guards and flames,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5455","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5455.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5455.mp3"]}},{"no":9,"arab":"وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ ۖ فَمَنْ يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَصَدًا","latin":"wa-annaa kunnaa naq'udu minhaa maqaa'ida lilssam'i faman yastami'i al-aana yajid lahu syihaaban rashadaan","translate":{"id":"dan sesungguhnya kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya). Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu) tentu akan menjumpai panah api yang mengintai (untuk membakarnya).\n","en":"notwithstanding that we were established in positions [which we had thought well-suited] to listening to [whatever secrets might be in] it: and anyone who now [or ever] tries to listen will [likewise] find a flame lying in wait for him!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5456","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5456.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5456.mp3"]}},{"no":10,"arab":"وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا","latin":"wa-annaa laa nadrii asyarrun uriida biman fii al-ardhi am araada bihim rabbuhum rasyadaan","translate":{"id":"Dan sesungguhnya kami tidak mengetahui (dengan adanya penjagaan itu) apakah keburukan yang dikehendaki bagi orang yang di bumi ataukah Tuhan mereka menghendaki kebaikan bagi mereka.\n","en":"\"'And [now we have become aware] that we [created beings] may not know whether evil fortune is intended for [any of] those who live on earth, or whether it is their Sustainer’s will to endow them with consciousness of what is right:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5457","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5457.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5457.mp3"]}},{"no":11,"arab":"وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَٰلِكَ ۖ كُنَّا طَرَائِقَ قِدَدًا","latin":"wa-annaa minnaa alshshaalihuuna waminnaa duuna dzaalika kunnaa tharaa-iqa qidadaan","translate":{"id":"Dan sesungguhnya di antara kami ada orang-orang yang saleh dan di antara kami ada (pula) yang tidak demikian halnya. Adalah kami menempuh jalan yang berbeda-beda.\n","en":"Just as [we do not know how it happens] that some from among us are righteous, while some of us are [far] below that: we have always followed widely divergent paths."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5458","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5458.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5458.mp3"]}},{"no":12,"arab":"وَأَنَّا ظَنَنَّا أَنْ لَنْ نُعْجِزَ اللَّهَ فِي الْأَرْضِ وَلَنْ نُعْجِزَهُ هَرَبًا","latin":"wannaa zhanannaa an lan nu'jiza allaaha fii al-ardhi walan nu'jizahu harabaan","translate":{"id":"Dan sesungguhnya kami mengetahui bahwa kami sekali-kali tidak akan dapat melepaskan diri (dari kekuasaan) Allah di muka bumi dan sekali-kali tidak (pula) dapat melepaskan diri (daripada)Nya dengan lari.\n","en":"\"'And, withal, we have come to know that we can never elude God [while we live] on earth, and that we can never elude Him by escaping [from life]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5459","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5459.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5459.mp3"]}},{"no":13,"arab":"وَأَنَّا لَمَّا سَمِعْنَا الْهُدَىٰ آمَنَّا بِهِ ۖ فَمَنْ يُؤْمِنْ بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا","latin":"wa-annaa lammaa sami'naa alhudaa aamannaa bihi faman yu/min birabbihi falaa yakhaafu bakhsan walaa rahaqaan","translate":{"id":"Dan sesungguhnya kami tatkala mendengar petunjuk (Al Qur'an), kami beriman kepadanya. Barangsiapa beriman kepada Tuhannya, maka ia tidak takut akan pengurangan pahala dan tidak (takut pula) akan penambahan dosa dan kesalahan.\n","en":"Hence, as soon as we heard this [call to His] guidance, we came to believe in it: and he who believes in his Sustainer need never have fear of loss or injustice."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5460","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5460.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5460.mp3"]}},{"no":14,"arab":"وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ ۖ فَمَنْ أَسْلَمَ فَأُولَٰئِكَ تَحَرَّوْا رَشَدًا","latin":"wa-annaa minnaa almuslimuuna waminnaa alqaasithuuna faman aslama faulaa-ika taharraw rasyadaan","translate":{"id":"Dan sesungguhnya di antara kami ada orang-orang yang ta'at dan ada (pula) orang-orang yang menyimpang dari kebenaran. Barangsiapa yang yang ta'at, maka mereka itu benar-benar telah memilih jalan yang lurus.\n","en":"\"'Yet [it is true] that among us are such as have surrendered themselves to God - just as there are among us such as have abandoned themselves to wrongdoing. Now as for those who surrender themselves to Him - it is they that have attained to consciousness of what is right;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5461","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5461.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5461.mp3"]}},{"no":15,"arab":"وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا","latin":"wa-amaa alqaasithuuna fakaanuu lijahannama hathabaan","translate":{"id":"Adapun orang-orang yang menyimpang dari kebenaran, maka mereka menjadi kayu api bagi neraka Jahannam.\n","en":"but as for those who abandon themselves to wrongdoing - they are indeed but fuel for [the fires of] hell!’\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5462","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5462.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5462.mp3"]}},{"no":16,"arab":"وَأَنْ لَوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُمْ مَاءً غَدَقًا","latin":"wa-allawi istaqaamuu 'alaa alththhariiqati la-asqaynaahum maa-an ghadaqaan","translate":{"id":"Dan bahwasanya: jikalau mereka tetap berjalan lurus di atas jalan itu (agama Islam), benar-benar Kami akan memberi minum kepada mereka air yang segar (rezki yang banyak).\n","en":"[KNOW,] THEN, that if they [who have heard Our call] keep firmly to the [right] path, We shall certainly shower them with blessings abundant,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5463","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5463.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5463.mp3"]}},{"no":17,"arab":"لِنَفْتِنَهُمْ فِيهِ ۚ وَمَنْ يُعْرِضْ عَنْ ذِكْرِ رَبِّهِ يَسْلُكْهُ عَذَابًا صَعَدًا","latin":"linaftinahum fiihi waman yu'ridh 'an dzikri rabbihi yasluk-hu 'adzaaban sha'adaan","translate":{"id":"Untuk Kami beri cobaan kepada mereka padanya. Dan barangsiapa yang berpaling dari peringatan Tuhannya, niscaya akan dimasukkan-Nya ke dalam azab yang amat berat.\n","en":"so as to test them by this means: for he who shall turn away from the remembrance of his Sustainer, him will He cause to undergo suffering most grievous."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5464","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5464.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5464.mp3"]}},{"no":18,"arab":"وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلَا تَدْعُوا مَعَ اللَّهِ أَحَدًا","latin":"wa-anna almasaajida lillaahi falaa tad'uu ma'a allaahi ahadaan","translate":{"id":"Dan sesungguhnya mesjid-mesjid itu adalah kepunyaan Allah. Maka janganlah kamu menyembah seseorangpun di dalamnya di samping (menyembah) Allah.\n","en":"And [know] that all worship is due to God [alone]: hence, do not invoke anyone side by side with God!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5465","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5465.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5465.mp3"]}},{"no":19,"arab":"وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا","latin":"wa-annahu lammaa qaama 'abdu allaahi yad'uuhu kaaduu yakuunuuna 'alayhi libadaan","translate":{"id":"Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembah-Nya (mengerjakan ibadat), hampir saja jin-jin itu desak mendesak mengerumuninya.\n","en":"Yet [thus it is] that whenever a servant of God stands up in prayer to Him, they [who are bent on denying the truth] would gladly overwhelm him with their crowds."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5466","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5466.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5466.mp3"]}},{"no":20,"arab":"قُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا","latin":"qul innamaa ad'uu rabbii walaa usyriku bihi ahadaan","translate":{"id":"Katakanlah: \"Sesungguhnya aku hanya menyembah Tuhanku dan aku tidak mempersekutukan sesuatupun dengan-Nya\".\n","en":"Say: \"I invoke my Sustainer alone, for I do not ascribe divinity to anyone beside Him.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5467","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5467.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5467.mp3"]}},{"no":21,"arab":"قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا","latin":"qul innii laa amliku lakum dharran walaa rasyadaan","translate":{"id":"Katakanlah: \"Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudharatanpun kepadamu dan tidak (pula) suatu kemanfa'atan\".\n","en":"Say: \"Verily, it is not in my power to cause you harm or to endow you with consciousness of what is right.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5468","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5468.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5468.mp3"]}},{"no":22,"arab":"قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَدًا","latin":"qul innii lan yujiiranii mina allaahi ahadun walan ajida min duunihi multahadaan","translate":{"id":"Katakanlah: \"Sesungguhnya aku sekali-kali tiada seorangpun dapat melindungiku dari (azab) Allah dan sekali-kali aku tiada akan memperoleh tempat berlindung selain daripada-Nya\".\n","en":"Say: \"Verily, no one could ever protect me from God, nor could I ever find a place to hide from Him"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5469","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5469.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5469.mp3"]}},{"no":23,"arab":"إِلَّا بَلَاغًا مِنَ اللَّهِ وَرِسَالَاتِهِ ۚ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا","latin":"illaa balaaghan mina allaahi warisaalaatihi waman ya'shi allaaha warasuulahu fa-inna lahu naara jahannama khaalidiina fiihaa abadaan","translate":{"id":"Akan tetapi (aku hanya) menyampaikan (peringatan) dari Allah dan risalah-Nya. Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya maka sesungguhnya baginyalah neraka Jahannam, mereka kekal di dalamnya selama-lamanya.\n","en":"if I should fail to convey [to the world whatever illumination comes to me] from God and His messages.\" Now as for him who rebels against God and His Apostle - verily, the fire of hell awaits him, therein to abide beyond the count of time."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5470","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5470.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5470.mp3"]}},{"no":24,"arab":"حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا وَأَقَلُّ عَدَدًا","latin":"hattaa idzaa ra-aw maa yuu'aduuna fasaya'lamuuna man adh'afu naasiran wa-aqallu 'adadaan","translate":{"id":"Sehingga apabila mereka melihat azab yang diancamkan kepada mereka, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit bilangannya.\n","en":"[Let them, then, wait] until the time when they behold that [doom] of which they were forewarned: for then they will come to understand which [kind of man] is more helpless and counts for less!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5471","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5471.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5471.mp3"]}},{"no":25,"arab":"قُلْ إِنْ أَدْرِي أَقَرِيبٌ مَا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّي أَمَدًا","latin":"qul in adrii aqariibun maa tuu'aduuna am yaj'alu lahu rabbii amadaan","translate":{"id":"Katakanlah: \"Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu dekat ataukah Tuhanku menjadikan bagi (kedatangan) azab itu masa yang panjang?\".\n","en":"Say: \"I do not know whether that [doom] of which you were forewarned is near, or whether my Sustainer has set for it a distant term.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5472","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5472.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5472.mp3"]}},{"no":26,"arab":"عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَدًا","latin":"'aalimu alghaybi falaa yuzhhiru 'alaa ghaybihi ahadaan","translate":{"id":"(Dia adalah Tuhan) Yang Mengetahui yang ghaib, maka Dia tidak memperlihatkan kepada seorangpun tentang yang ghaib itu.\n","en":"He [alone] knows that which is beyond the reach of a created being's perception, and to none does He disclose aught of the mysteries of His Own unfathomable knowledge,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5473","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5473.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5473.mp3"]}},{"no":27,"arab":"إِلَّا مَنِ ارْتَضَىٰ مِنْ رَسُولٍ فَإِنَّهُ يَسْلُكُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا","latin":"illaa mani irtadaa min rasuulin fa-innahu yasluku min bayni yadayhi wamin khalfihi rashadaan","translate":{"id":"Kecuali kepada rasul yang diridhai-Nya, maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di muka dan di belakangnya.\n","en":"unless it be to an apostle whom He has been pleased to elect [there for]: and then He sends forth [the forces of heaven] to watch over him in whatever lies open before him and in what is beyond his ken –"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5474","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5474.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5474.mp3"]}},{"no":28,"arab":"لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا","latin":"liya'lama an qad ablaghuu risaalaati rabbihim wa-ahatha bimaa ladayhim wa-ahsaa kulla syay-in 'adadaan","translate":{"id":"Supaya Dia mengetahui, bahwa sesungguhnya rasul-rasul itu telah menyampaikan risalah-risalah Tuhannya, sedang (sebenarnya) ilmu-Nya meliputi apa yang ada pada mereka, dan Dia menghitung segala sesuatu satu persatu.\n","en":"so as to make manifest that it is indeed [but] their Sustainer's messages that these [apostles] deliver: for it is He who encompasses [with His knowledge] all that they have [to say], just as He takes count, one by one, of everything [that exists]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/5475","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/5475.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/5475.mp3"]}}]}