{"alquran":{"no":8,"name":"Al-Anfaal","arab":"الأنفال","start":1160,"count":75,"rukku":10,"type":"medina","description":"Surat Al Anfaal terdiri atas 75 ayat dan termasuk golongan surat-surat Madaniyyah, karena seluruh ayat-ayatnya diturunkan di Madinah. Surat ini dinamakan <i>Al Anfaal</i> yang berarti harta rampasan perang berhubung kata <i>Al Anfaal</i> terdapat pada permulaan surat ini dan juga persoalan yang menonjol dalam surat ini ialah tentang harta rampasan perang, hukum perang dan hal-hal yang berhubungan dengan peperangan pada umumnya. Menurut riwayat Ibnu Abbas r.a. surat ini diturunkan berkenaan dengan perang Badar Kubra yang terjadi pada tahun kedua hijrah. Peperangan ini sangat penting artinya, karena dialah yang menentukan jalan sejarah Perkembangan Islam. Pada waktu itu umat Islam dengan berkekuatan kecil untuk pertama kali dapat mengalahkan kaum musyrikin yang berjumlah besar, dan berperlengkapan yang cukup, dan mereka dalam peperangan ini memperoleh harta rampasan perang yang tidak sedikit. Oleh sebab itu timbullah masalah bagaimana membagi harta-harta rampasan perang itu, maka kemudian Allah menurunkan ayat pertama dari surat ini."},"surah":[{"no":1,"arab":" يَسْأَلُونَكَ عَنِ الْأَنْفَالِ ۖ قُلِ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ ۖ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ","latin":"yas-aluunaka 'ani al-anfaali quli al-anfaalu lillaahi waalrrasuuli faittaquu allaaha wa-ashlihuu dzaata baynikum wa-athii'uu allaaha warasuulahu in kuntum mu/miniina","translate":{"id":"Mereka menanyakan kepadamu tentang (pembagian) harta rampasan perang. Katakanlah: \"Harta rampasan perang kepunyaan Allah dan Rasul , oleh sebab itu bertakwalah kepada Allah dan perbaikilah perhubungan di antara sesamamu; dan ta'atlah kepada Allah dan Rasul-Nya jika kamu adalah orang-orang yang beriman.\"\n","en":"HEY WILL ASK thee about the spoils of war. Say: \"All spoils of war belong to God and the Apostle.\" Remain, then, conscious of God, and keep alive the bonds of brotherhood among yourselves, and pay heed unto God and His Apostle, if you are [truly] believers!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1161","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1161.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1161.mp3"]}},{"no":2,"arab":"إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ","latin":"innamaa almu/minuuna alladziina idzaa dzukira allaahu wajilat quluubuhum wa-idzaa tuliyat 'alayhim aayaatuhu zaadat-hum iimaanan wa'alaa rabbihim yatawakkaluuna","translate":{"id":"Sesungguhnya orang-orang yang beriman ialah mereka yang bila disebut nama Allah gemetarlah hati mereka, dan apabila dibacakan ayat-ayatNya bertambahlah iman mereka (karenanya), dan hanya kepada Tuhanlah mereka bertawakkal.\n","en":"Believers are only they whose hearts tremble with awe whenever God is mentioned, and whose faith is strengthened whenever His messages are conveyed unto them, and who in their Sustainer place their trust -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1162","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1162.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1162.mp3"]}},{"no":3,"arab":"الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ","latin":"alladziina yuqiimuuna alshshalaata wamimmaa razaqnaahum yunfiquuna","translate":{"id":"(yaitu) orang-orang yang mendirikan shalat dan yang menafkahkan sebagian dari rezki yang Kami berikan kepada mereka.\n","en":"those who are constant in prayer and spend on others out of what We provide for them as sustenance:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1163","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1163.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1163.mp3"]}},{"no":4,"arab":"أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَهُمْ دَرَجَاتٌ عِنْدَ رَبِّهِمْ وَمَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","latin":"ulaa-ika humu almu/minuuna haqqan lahum darajaatun 'inda rabbihim wamaghfiratun warizqun kariimun","translate":{"id":"Itulah orang-orang yang beriman dengan sebenar-benarnya. Mereka akan memperoleh beberapa derajat ketinggian di sisi Tuhannya dan ampunan serta rezki (ni'mat) yang mulia.\n","en":"it is they, they who are truly believers! Theirs shall be great dignity in their Sustainer's sight, and forgiveness of sins, and a most excellent sustenance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1164","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1164.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1164.mp3"]}},{"no":5,"arab":"كَمَا أَخْرَجَكَ رَبُّكَ مِنْ بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِنَ الْمُؤْمِنِينَ لَكَارِهُونَ","latin":"kamaa akhrajaka rabbuka min baytika bialhaqqi wa-inna fariiqan mina almu/miniina lakaarihuuna","translate":{"id":"Sebagaimana Tuhanmu menyuruhmu pergi dan rumahmu dengan kebenaran , padahal sesungguhnya sebagian dari orang-orang yang beriman itu tidak menyukainya,\n","en":"EVEN AS thy Sustainer brought thee forth from thy home [to fight] in the cause of the truth, although some of the believers were averse to it,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1165","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1165.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1165.mp3"]}},{"no":6,"arab":"يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنْظُرُونَ","latin":"yujaadiluunaka fii alhaqqi ba'da maa tabayyana ka-annamaa yusaaquuna ilaa almawti wahum yanzhuruuna","translate":{"id":"mereka membantahmu tentang kebenaran sesudah nyata (bahwa mereka pasti menang), seolah-olah mereka dihalau kepada kematian, sedang mereka melihat (sebab-sebab kematian itu).\n","en":"[so, too,] they would argue with thee about the truth [itself] after it had become manifest - just as if they were being driven towards death and beheld it with their very eyes."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1166","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1166.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1166.mp3"]}},{"no":7,"arab":"وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَنْ يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ","latin":"wa-idz ya'idukumu allaahu ihdaa alththaa-ifatayni annahaa lakum watawadduuna anna ghayra dzaati alsysyawkati takuunu lakum wayuriidu allaahu an yuhiqqa alhaqqa bikalimaatihi wayaqtha'a daabira alkaafiriina","translate":{"id":"Dan (ingatlah), ketika Allah menjanjikan kepadamu bahwa salah satu dari dua golongan (yang kamu hadapi) adalah untukmu, sedang kamu menginginkan bahwa yang tidak mempunyai kekekuatan senjatalah yang untukmu, dan Allah menghendaki untuk membenarkan yang benar dengan ayat-ayat-Nya dan memusnahkan orang-orang kafir,\n","en":"And, lo, God gave you the promise that one of the two [enemy] hosts would fall to you: and you would have liked to seize the less powerful one, whereas it was God's will to prove the truth to be true in accordance with His words, and to wipe out the last remnant of those who denied the truth -"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1167","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1167.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1167.mp3"]}},{"no":8,"arab":"لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ","latin":"liyuhiqqa alhaqqa wayubthila albaathila walaw kariha almujrimuuna","translate":{"id":"agar Allah menetapkan yang hak (Islam) dan membatalkan yang batil (syirik) walaupun orang-orang yang berdosa (musyrik) itu tidak menyukainya.\n","en":"so that He might prove the truth to be true and the false to be false, however hateful this might be to those who were lost in sin."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1168","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1168.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1168.mp3"]}},{"no":9,"arab":"إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنَ الْمَلَائِكَةِ مُرْدِفِينَ","latin":"idz tastaghiitsuuna rabbakum faistajaaba lakum annii mumiddukum bi-alfin mina almalaa-ikati murdifiina","translate":{"id":"(Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu, lalu diperkenankan-Nya bagimu: \"Sesungguhnya Aku akan mendatangkan bala bantuan kepada kamu dengan seribu malaikat yang datang berturut-turut\".\n","en":"Lo! You were praying unto your Sustainer for aid, whereupon He thus responded to you: \"I shall, verily, aid you with a thousand angels following one upon' another!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1169","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1169.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1169.mp3"]}},{"no":10,"arab":"وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ ۚ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ ۚ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","latin":"wamaa ja'alahu allaahu illaa busyraa walitathma-inna bihi quluubukum wamaa alnnashru illaa min 'indi allaahi inna allaaha 'aziizun hakiimun","translate":{"id":"Dan Allah tidak menjadikannya (mengirim bala bantuan itu), melainkan sebagai kabar gembira dan agar hatimu menjadi tenteram karenanya. Dan kemenangan itu hanyalah dari sisi Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"And God ordained this only as a glad tiding, and that your hearts should thereby be set at rest-since no succour can come from any save God: verily, God is almighty, wise!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1170","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1170.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1170.mp3"]}},{"no":11,"arab":"إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ وَيُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الْأَقْدَامَ","latin":"idz yughasysyiikumu alnnu'aasa amanatan minhu wayunazzilu 'alaykum mina alssamaa-i maa-an liyuthahhirakum bihi wayudzhiba 'ankum rijza alsysyaythaani waliyarbitha 'alaa quluubikum wayutsabbita bihi al-aqdaama","translate":{"id":"(Ingatlah), ketika Allah menjadikan kamu mengantuk sebagai suatu penenteraman daripada-Nya, dan Allah menurunkan kepadamu hujan dari langit untuk mensucikan kamu dengan hujan itu dan menghilangkan dari kamu gangguan-gangguan syaitan dan untuk menguatkan hatimu dan mesmperteguh dengannya telapak kaki(mu) .\n","en":"[Remember how it was] when He caused inner calm to enfold you, as an assurance from Him, and sent down upon you water from the skies, so that He might purify you thereby and free you from Satan's unclean whisperings and strengthen your hearts and thus make firm your steps."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1171","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1171.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1171.mp3"]}},{"no":12,"arab":"إِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ","latin":"idz yuuhii rabbuka ilaa almalaa-ikati annii ma'akum fatsabbituu alladziina aamanuu saulqii fii quluubi alladziina kafaruu alrru'ba faidhribuu fawqa al-a'naaqi waidhribuu minhum kulla banaanin","translate":{"id":"(Ingatlah), ketika Tuhanmu mewahyukan kepada para malaikat : \"Sesungguhnya Aku bersama kamu, maka teguhkan (pendirian) orang-orang yang telah beriman\". Kelak akan Aku jatuhkan rasa ketakutan ke dalam hati orang-orang kafir, maka penggallah kepala mereka dan pancunglah tiap-tiap ujung jari mereka .\n","en":"Lo! Thy Sustainer inspired the angels [to convey this His message to the believers]: \"I am with you!\" [And He commanded the angels:] \"And, give firmness unto those who have attained to faith [with these words from Me]: `I shall cast terror into the hearts of those who are bent on denying the truth; strike, then, their necks, [O believers,] and strike off every one of their finger-tips!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1172","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1172.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1172.mp3"]}},{"no":13,"arab":"ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۚ وَمَنْ يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ","latin":"dzaalika bi-annahum syaaqquu allaaha warasuulahu waman yusyaaqiqi allaaha warasuulahu fa-inna allaaha syadiidu al'iqaabi","translate":{"id":"(Ketentuan) yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan Rasul-Nya; dan barangsiapa menentang Allah dan Rasul-Nya, maka sesungguhnya Allah amat keras siksaan-Nya.\n","en":"This, because they have cut themselves off from God and His Apostle: and as for him who cuts himself off from God and His Apostle - verily, God is severe in retribution."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1173","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1173.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1173.mp3"]}},{"no":14,"arab":"ذَٰلِكُمْ فَذُوقُوهُ وَأَنَّ لِلْكَافِرِينَ عَذَابَ النَّارِ","latin":"dzaalikum fadzuuquuhu wa-anna lilkaafiriina 'adzaaba alnnaari","translate":{"id":"Itulah (hukum dunia yang ditimpakan atasmu), maka rasakanlah hukuman itu. Sesungguhnya bagi orang-orang yang kafir itu ada (lagi) azab neraka.\n","en":"This [for you, O enemies of God]! Taste it, then, [and know] that suffering through fire awaits those who deny the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1174","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1174.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1174.mp3"]}},{"no":15,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا زَحْفًا فَلَا تُوَلُّوهُمُ الْأَدْبَارَ","latin":"yaa ayyuhaa alladziina aamanuu idzaa laqiitumu alladziina kafaruu zahfan falaa tuwalluuhumu al-adbaara","translate":{"id":"Hai orang-orang yang beriman, apabila kamu bertemu dengan orang-orang yang kafir yang sedang menyerangmu, maka janganlah kamu membelakangi mereka (mundur).\n","en":"O YOU who have attained to faith! When you meet in battle those who are bent on denying the truth, advancing in great force, do not turn your backs on them:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1175","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1175.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1175.mp3"]}},{"no":16,"arab":"وَمَنْ يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُ إِلَّا مُتَحَرِّفًا لِقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ فَقَدْ بَاءَ بِغَضَبٍ مِنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ","latin":"waman yuwallihim yawma-idzin duburahu illaa mutaharrifan liqitaalin aw mutahayyizan ilaa fi-atin faqad baa-a bighadhabin mina allaahi wama/waahu jahannamu wabi/sa almashiiru","translate":{"id":"Barangsiapa yang membelakangi mereka (mundur) di waktu itu, kecuali berbelok untuk (sisat) perang atau hendak menggabungkan diri dengan pasukan yang lain, maka sesungguhnya orang itu kembali dengan membawa kemurkaan dari Allah, dan tempatnya ialah neraka Jahannam. Dan amat buruklah tempat kembalinya.\n","en":"for, whoever on that day turns his back on them-unless it be in a battle manoeuvre or in an endeavour to join another troop [of the believers] - shall indeed have earned the burden of God's condemnation, and his goal shall be hell: and how vile a journey's end!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1176","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1176.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1176.mp3"]}},{"no":17,"arab":"فَلَمْ تَقْتُلُوهُمْ وَلَٰكِنَّ اللَّهَ قَتَلَهُمْ ۚ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَٰكِنَّ اللَّهَ رَمَىٰ ۚ وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلَاءً حَسَنًا ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","latin":"falam taqtuluuhum walaakinna allaaha qatalahum wamaa ramayta idz ramayta walaakinna allaaha ramaa waliyubliya almu/miniina minhu balaa-an hasanan inna allaaha samii'un 'aliimun","translate":{"id":"Maka (yang sebenarnya) bukan kamu yang membunuh mereka, akan tetapi Allahlah yang membunuh mereka, dan bukan kamu yang melempar ketika kamu melempar, tetapi Allah-lah yang melempar. (Allah berbuat demikian untuk membinasakan mereka) dan untuk memberi kemenangan kepada orang-orang mu'min, dengan kemenangan yang baik. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui.\n","en":"And yet, [O believers,] it was not you who slew the enemy, but it was God who slew them; and it was not thou who cast [terror into them, O Prophet], when thou didst cast it, but it was God who cast it: and [He did all this] in order that He might test the believers by a goodly test of His Own or daining. Verily, God is all-hearing, all-knowing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1177","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1177.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1177.mp3"]}},{"no":18,"arab":"ذَٰلِكُمْ وَأَنَّ اللَّهَ مُوهِنُ كَيْدِ الْكَافِرِينَ","latin":"dzaalikum wa-anna allaaha muuhinu kaydi alkaafiriina","translate":{"id":"Itulah (karunia Allah yang dilimpahkan kepadamu), dan sesungguhnya Allah melemahkan tipu daya orang-orang yang kafir.\n","en":"This [was God's purpose] -and also [to show] that God renders vain the artful schemes of those who deny the truth."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1178","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1178.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1178.mp3"]}},{"no":19,"arab":"إِنْ تَسْتَفْتِحُوا فَقَدْ جَاءَكُمُ الْفَتْحُ ۖ وَإِنْ تَنْتَهُوا فَهُوَ خَيْرٌ لَكُمْ ۖ وَإِنْ تَعُودُوا نَعُدْ وَلَنْ تُغْنِيَ عَنْكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ","latin":"in tastaftihuu faqad jaa-akumu alfathu wa-in tantahuu fahuwa khayrun lakum wa-in ta'uuduu na'ud walan tughniya 'ankum fi-atukum syay-an walaw katsurat wa-anna allaaha ma'a almu/miniina","translate":{"id":"Jika kamu (orang-orang musyrikin) mencari keputusan, maka telah datang keputusan kepadamu; dan jika kamu berhenti ; maka itulah yang lehih baik bagimu; dan jika kamu kembali , niscaya Kami kembali (pula) ; dan angkatan perangmu sekali-kali tidak akan dapat menolak dari kamu sesuatu bahayapun, biarpun dia banyak dan sesungguhnya Allah beserta orang-orang yang beriman.\n","en":"If you have been praying for victory, [O believers] - victory has now indeed come unto you. And if you abstain [from sinning], it will be for your own good; but if you revert to it, We shall revoke [Our promise of aid] - and never will your community be of any avail to you, however great its numbers: for, behold, God is [only] with those who believe!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1179","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1179.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1179.mp3"]}},{"no":20,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَوَلَّوْا عَنْهُ وَأَنْتُمْ تَسْمَعُونَ","latin":"yaa ayyuhaa alladziina aamanuu athii'uu allaaha warasuulahu walaa tawallaw 'anhu wa-antum tasma'uuna","translate":{"id":"Hai orang-orang yang beriman, ta'atlah kepada Allah dan Rasul-Nya, dan janganlah kamu berpaling dari pada-Nya, sedang kamu mendengar (perintah-perintah-Nya),\n","en":"[Hence,] O you who have attained to faith, pay heed unto God and His Apostle, and do not turn away from Him now that you hear [His message];"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1180","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1180.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1180.mp3"]}},{"no":21,"arab":"وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ","latin":"walaa takuunuu kaalladziina qaaluu sami'naa wahum laa yasma'uuna","translate":{"id":"dan janganlah kamu menjadi seperti orang-orang (munafik) vang berkata \"Kami mendengarkan , padahal mereka tidak mendengarkan.\n","en":"and be not like those who say, \"We have heard\", the while they do not hearken."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1181","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1181.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1181.mp3"]}},{"no":22,"arab":"إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ","latin":"inna syarra alddawaabbi 'inda allaahi alshshummu albukmu alladziina laa ya'qiluuna","translate":{"id":"Sesungguhnya binatang (makhluk) yang seburuk-buruknya pada sisi Allah ialah; orang-orang yang pekak dan tuli yang tidak mengerti apa-apapun.\n","en":"Verily, the vilest of all creatures in the sight of God are those deaf, those dumb ones who do not use their reason."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1182","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1182.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1182.mp3"]}},{"no":23,"arab":"وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ ۖ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَهُمْ مُعْرِضُونَ","latin":"walaw 'alima allaahu fiihim khayran la-asma'ahum walaw asma'ahum latawallaw wahum mu'ridhuuna","translate":{"id":"Kalau sekiranya Allah mengetahui kebaikan ada pada mereka, tentulah Allah menjadikan mereka dapat mendengar. Dan jikalau Allah menjadikan mereka dapat mendengar, niscaya mereka pasti berpaling juga, sedang mereka memalingkan diri (dari apa yang mereka dengar itu).\n","en":"For, if God had seen any good in them, He would certainly have made them hear: but [as it is,] even if He had made them hear, they would surely have turned away in their obstinacy."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1183","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1183.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1183.mp3"]}},{"no":24,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ","latin":"yaa ayyuhaa alladziina aamanuu istajiibuu lillaahi walilrrasuuli idzaa da'aakum limaa yuhyiikum wai'lamuu anna allaaha yahuulu bayna almar-i waqalbihi wa-annahu ilayhi tuhsyaruuna","translate":{"id":"Hai orang-orang yang beriman, penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu , ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya dan sesungguhnya kepada-Nyalah kamu akan dikumpulkan.\n","en":"O you who have attained to faith! Respond to the call of God and the Apostle whenever he calls you unto that which will give you life; and know that God intervenes between man and [the desires of] his heart, and that unto Him you shall be gathered."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1184","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1184.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1184.mp3"]}},{"no":25,"arab":"وَاتَّقُوا فِتْنَةً لَا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنْكُمْ خَاصَّةً ۖ وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ","latin":"waittaquu fitnatan laa tushiibanna alladziina zhalamuu minkum khaassatan wai'lamuu anna allaaha syadiidu al'iqaabi","translate":{"id":"Dan peliharalah dirimu dari pada siksaan yang tidak khusus menimpa orang-orang yang zalim saja di antara kamu. Dan ketahuilah bahwa Allah amat keras siksaan-Nya.\n","en":"And beware of that temptation to evil which does not befall only those among you who are bent on denying the truth, to the exclusion of others; and know that God is severe in retribution."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1185","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1185.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1185.mp3"]}},{"no":26,"arab":"وَاذْكُرُوا إِذْ أَنْتُمْ قَلِيلٌ مُسْتَضْعَفُونَ فِي الْأَرْضِ تَخَافُونَ أَنْ يَتَخَطَّفَكُمُ النَّاسُ فَآوَاكُمْ وَأَيَّدَكُمْ بِنَصْرِهِ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ","latin":"waudzkuruu idz antum qaliilun mustadh'afuuna fii al-ardhi takhaafuuna an yatakhaththhafakumu alnnaasu faaawaakum wa-ayyadakum binashrihi warazaqakum mina alththhayyibaati la'allakum tasykuruuna","translate":{"id":"Dan ingatlah (hai para muhajirin) ketika kamu masih berjumlah sedikit, lagi tertindas di muka bumi (Mekah), kamu takut orang-orang (Mekah) akan menculik kamu, maka Allah memberi kamu tempat menetap (Madinah) dan dijadikan-Nya kamu kuat dengan pertolongan-Nya dan diberi-Nya karnu rezki dari yang baik-baik agar kamu bersyukur.\n","en":"And remember the time when you were few [and] helpless on earth, fearful lest people do away with you - whereupon He sheltered you, and strengthened you with His succour, and provided for you sustenance out of the good things of life, so that you might have cause to be grateful."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1186","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1186.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1186.mp3"]}},{"no":27,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَخُونُوا اللَّهَ وَالرَّسُولَ وَتَخُونُوا أَمَانَاتِكُمْ وَأَنْتُمْ تَعْلَمُونَ","latin":"yaa ayyuhaa alladziina aamanuu laa takhuunuu allaaha waalrrasuula watakhuunuu amaanaatikum wa-antum ta'lamuuna","translate":{"id":"Hai orang-orang yang beriman, janganlah kamu mengkhianati Allah dan Rasul (Muhammad) dan (juga) janganlah kamu mengkhianati amanat-amanat yang dipercayakan kepadamu, sedang kamu mengetahui.\n","en":"[Hence,] O you who have attained to faith, do not be false to God and the Apostle, and do not knowingly be false to the trust that has been reposed in you;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1187","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1187.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1187.mp3"]}},{"no":28,"arab":"وَاعْلَمُوا أَنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَأَنَّ اللَّهَ عِنْدَهُ أَجْرٌ عَظِيمٌ","latin":"wai'lamuu annamaa amwaalukum wa-awlaadukum fitnatun wa-anna allaaha 'indahu ajrun 'azhiimun","translate":{"id":"Dan ketahuilah, bahwa hartamu dan anak-anakmu itu hanyalah sebagai cobaan dan sesungguhnya di sisi Allah-lah pahala yang besar.\n","en":"and know that your worldly goods and your children are but a trial and a temptation, and that with God there is a tremendous reward."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1188","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1188.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1188.mp3"]}},{"no":29,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا وَيُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ","latin":"yaa ayyuhaa alladziina aamaanuu in tattaquu allaaha yaj'al lakum furqaanan wayukaffir 'ankum sayyi-aatikum wayaghfir lakum waallaahu dzuu alfadhli al'azhiimi","translate":{"id":"Hai orang-orang beriman, jika kamu bertaqwa kepada ALlah, Kami akan memberikan kepadamu Furqaan . Dan kami akan jauhkan dirimu dari kesalahan-kesalahanmu, dan mengampuni (dosa-dosa)mu. Dan Allah mempunyai karunia yang besar.\n","en":"O you who have attained to faith! If you remain conscious of God. He will endow you with a standard by which to discern the true from the false, and will efface your bad deeds, and will forgive you your sins: for God is limitless in His great bounty."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1189","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1189.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1189.mp3"]}},{"no":30,"arab":"وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ","latin":"wa-idz yamkuru bika alladziina kafaruu liyutsbituuka aw yaqtuluuka aw yukhrijuuka wayamkuruuna wayamkuru allaahu waallaahu khayru almaakiriina","translate":{"id":"Dan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan daya upaya terhadapmu untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu. Mereka memikirkan tipu daya dan Allah menggagalkan tipu daya itu. Dan Allah sebaik-baik Pembalas tipu daya.\n","en":"AND [remember, O Prophet,] how those who were bent on denying the truth were scheming against thee, in order to restrain thee [from preaching], or to slay thee, or to drive thee away: thus have they [always] schemed: but God brought their scheming to nought-for God is above all schemers."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1190","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1190.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1190.mp3"]}},{"no":31,"arab":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا قَالُوا قَدْ سَمِعْنَا لَوْ نَشَاءُ لَقُلْنَا مِثْلَ هَٰذَا ۙ إِنْ هَٰذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ","latin":"wa-idzaa tutlaa 'alayhim aayaatunaa qaaluu qad sami'naa law nasyaau laqulnaa mitsla haadzaa in haadzaa illaa asaathiiru al-awwaliina","translate":{"id":"Dan apabila dibacakan kepada mereka ayat-ayat Kami, mereka berkata: \"Sesungguhnya kami telah mendengar (ayat-ayat yang seperti ini), kalau kami menhendaki niscaya kami dapat membacakan yang seperti ini, (Al Qur'an) ini tidak lain hanyalah dongeng-dongengan orang-orang purbakala\".\n","en":"And whenever Our messages were conveyed to them, they would say, \"We have heard [all this] before; if we wanted, we could certainly compose sayings like these [ourselves]: they are nothing but fables of ancient times!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1191","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1191.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1191.mp3"]}},{"no":32,"arab":"وَإِذْ قَالُوا اللَّهُمَّ إِنْ كَانَ هَٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ","latin":"wa-idz qaaluu allaahumma in kaana haadzaa huwa alhaqqa min 'indika fa-amthir 'alaynaa hijaaratan mina alssamaa-i awi i/tinaa bi'adzaabin aliimin","translate":{"id":"Dan (ingatlah), ketika mereka (orang-orang musyrik) berkata : \"Ya Allah, jika betul (Al Qur'an) ini, dialah yang benar dari sisi Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih\".\n","en":"And, lo, they would say, \"O God! If this. be indeed the truth from Thee, then rain down upon us stones from the skies, or inflict [some other] grievous suffering on us!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1192","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1192.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1192.mp3"]}},{"no":33,"arab":"وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ","latin":"wamaa kaana allaahu liyu'adzdzibahum wa-anta fiihim wamaa kaana allaahu mu'adzdzibahum wahum yastaghfiruuna","translate":{"id":"Dan Allah sekali-kali tidak akan mengazab mereka, sedang kamu berada di antara mereka. Dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun ","en":"But God did not choose thus to chastise them whip thou [O Prophet] wert still among them, nor would God chastise them when they [might yet] ask for forgiveness."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1193","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1193.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1193.mp3"]}},{"no":34,"arab":"وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ وَمَا كَانُوا أَوْلِيَاءَهُ ۚ إِنْ أَوْلِيَاؤُهُ إِلَّا الْمُتَّقُونَ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","latin":"wamaa lahum allaa yu'adzdzibahumu allaahu wahum yashudduuna 'ani almasjidi alharaami wamaa kaanuu awliyaa-ahu in awliyaauhu illaa almuttaquuna walaakinna aktsarahum laa ya'lamuuna","translate":{"id":"Kenapa Allah tidak mengazab mereka padahal mereka menghalangi orang untuk (mendatangi) Masjidilharam, dan mereka bukanlah orang-orang yang berhak menguasainya? Orang-orang yang berhak menguasai(nya) hanyalah orang-orang yang bertakwa. Tetapi kebanyakan mereka tidak mengetahui.\n","en":"But what have they [now] in their favour that God should not chastise them-seeing that they bar [the believers] from the Inviolable House of Worship, although they are not its [rightful] guardians? None but the God-conscious can be its guardians: but of this most of these [evildoers] are unaware;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1194","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1194.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1194.mp3"]}},{"no":35,"arab":"وَمَا كَانَ صَلَاتُهُمْ عِنْدَ الْبَيْتِ إِلَّا مُكَاءً وَتَصْدِيَةً ۚ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ","latin":"wamaa kaana shalaatuhum 'inda albayti illaa mukaa-an watashdiyatan fadzuuquu al'adzaaba bimaa kuntum takfuruuna","translate":{"id":"Sembahyang mereka di sekitar Baitullah itu, lain tidak hanyalah siulan dan tepukan tangan. Maka rasakanlah azab disebabkan kekafiranmu itu.\n","en":"and their prayers before the Temple are nothing but whistling and clapping of hands. Taste then, [O unbelievers,] this chastisement as an outcome of your persistent denial of the truth!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1195","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1195.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1195.mp3"]}},{"no":36,"arab":"إِنَّ الَّذِينَ كَفَرُوا يُنْفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَنْ سَبِيلِ اللَّهِ ۚ فَسَيُنْفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ ۗ وَالَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ يُحْشَرُونَ","latin":"inna alladziina kafaruu yunfiquuna amwaalahum liyashudduu 'an sabiili allaahi fasayunfiquunahaa tsumma takuunu 'alayhim hasratan tsumma yughlabuuna waalladziina kafaruu ilaa jahannama yuhsyaruuna","translate":{"id":"Sesungguhnya orang-orang yang kafir menafkahkan harta mereka untuk menghalangi (orang) dari jalan Allah. Mereka akan menafkahkan harta itu, kemudian menjadi sesalan bagi mereka, dan mereka akan dikalahkan. Dan ke dalam Jahannamlah orang-orang yang kafir itu dikumpulkan,\n","en":"Behold, those who are bent on denying the truth are spending their riches in order to turn others away from the path of God; and they will go on spending them until they become [a source of] intense regret for them; and then they will be overcome! And those who [until their death] have denied the truth shall be gathered unto hell,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1196","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1196.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1196.mp3"]}},{"no":37,"arab":"لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَىٰ بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ ۚ أُولَٰئِكَ هُمُ الْخَاسِرُونَ","latin":"liyamiiza allaahu alkhabiitsa mina alththhayyibi wayaj'ala alkhabiitsa ba'dhahu 'alaa ba'dhin fayarkumahu jamii'an fayaj'alahu fii jahannama ulaa-ika humu alkhaasiruuna","translate":{"id":"supaya Allah memisahkan (golongan) yang buruk dari yang baik dan menjadikan (golongan) yang buruk itu sebagiannya di atas sebagian yang lain, lalu kesemuanya ditumpukkan-Nya, dan dimasukkan-Nya ke dalam neraka Jahannam. Mereka itulah orang-orang yang merugi.\n","en":"so that God might separate the bad from the good, and join the bad with one another, and link them all together [within His condemnation], and then place them in hell. They, they are the lost!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1197","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1197.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1197.mp3"]}},{"no":38,"arab":"قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ وَإِنْ يَعُودُوا فَقَدْ مَضَتْ سُنَّتُ الْأَوَّلِينَ","latin":"qul lilladziina kafaruu in yantahuu yughfar lahum maa qad salafa wa-in ya'uuduu faqad madhat sunnatu al-awwaliina","translate":{"id":"Katakanlah kepada orang-orang yang kafir itu : \"Jika mereka berhenti (dari kekafirannya), niscaya Allah akan mengampuni mereka tentang dosa-dosa mereka yang sudah lalu; dan jika mereka kembali lagi sesungguhnya akan berlaku (kepada mereka) sunnah (Allah tenhadap) orang-orang dahulu \".\n","en":"Tell those who are bent on denying the truth that if they desist, all that is past shall be forgiven them; but if they revert [to their wrongdoing], let them remember what happened to the like of them in times gone by."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1198","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1198.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1198.mp3"]}},{"no":39,"arab":"وَقَاتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّهِ ۚ فَإِنِ انْتَهَوْا فَإِنَّ اللَّهَ بِمَا يَعْمَلُونَ بَصِيرٌ","latin":"waqaatiluuhum hattaa laa takuuna fitnatun wayakuuna alddiinu kulluhu lillaahi fa-ini intahaw fa-inna allaaha bimaa ya'maluuna bashiirun","translate":{"id":"Dan perangilah mereka, supaya jangan ada fitnah dan supaya agama itu semata-mata untuk Allah . Jika mereka berhenti (dari kekafiran), maka sesungguhnya Allah Maha Melihat apa yang mereka kerjakan.\n","en":"And fight against them until there is no more oppression and all worship is devoted to God alone. And if they desist-behold, God sees all that they do;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1199","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1199.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1199.mp3"]}},{"no":40,"arab":"وَإِنْ تَوَلَّوْا فَاعْلَمُوا أَنَّ اللَّهَ مَوْلَاكُمْ ۚ نِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ","latin":"wa-in tawallaw fai'lamuu anna allaaha mawlaakum ni'ma almawlaa wani'ma alnnashiiru","translate":{"id":"Dan jika mereka berpaling, maka ketahuilah bahwasanya Allah Pelindungmu. Dia adalah sebaik-baik Pelindung dan sebaik-baik Penolong.\n","en":"and if they turn away [from righteousness], know that God is your Lord Supreme: [and] how excellent is this Lord Supreme, and how excellent this Giver of Succour!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1200","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1200.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1200.mp3"]}},{"no":41,"arab":"وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَمَا أَنْزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","latin":"wai'lamuu annamaa ghanimtum min syay-in fa-anna lillaahi khumusahu walilrrasuuli walidzii alqurbaa waalyataamaa waalmasaakiini waibni alssabiili in kuntum aamantum biallaahi wamaa anzalnaa 'alaa 'abdinaa yawma alfurqaani yawma iltaqaa aljam'aani waallaahu 'alaa kulli syay-in qadiirun","translate":{"id":"Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang , maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil , jika kamu beriman kepada Allah dan kepada apa yang kami turunkan kepada hamba Kami (Muhammad) di hari Furqaan , yaitu di hari bertemunya dua pasukan. Dan Allah Maha Kuasa atas segala sesuatu.\n","en":"AND KNOW that whatever booty you acquire [in war], one-fifth thereof belongs to God and the Apostle, and the near of kin, and the orphans, and the needy, and the wayfarer. [This you must observe] if you believe in God and in what We bestowed from on high upon Our servant on the day when the true was distinguished from the false - the day when the two hosts met in battle. And God has the power to will anything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1201","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1201.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1201.mp3"]}},{"no":42,"arab":"إِذْ أَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا وَهُمْ بِالْعُدْوَةِ الْقُصْوَىٰ وَالرَّكْبُ أَسْفَلَ مِنْكُمْ ۚ وَلَوْ تَوَاعَدْتُمْ لَاخْتَلَفْتُمْ فِي الْمِيعَادِ ۙ وَلَٰكِنْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا لِيَهْلِكَ مَنْ هَلَكَ عَنْ بَيِّنَةٍ وَيَحْيَىٰ مَنْ حَيَّ عَنْ بَيِّنَةٍ ۗ وَإِنَّ اللَّهَ لَسَمِيعٌ عَلِيمٌ","latin":"idz antum bial'udwati alddunyaa wahum bial'udwati alqushwaa waalrrakbu asfala minkum walaw tawaa'adtum laikhtalaftum fii almii'aadi walaakin liyaqdhiya allaahu amran kaana maf'uulan liyahlika man halaka 'an bayyinatin wayahyaa man hayya 'an bayyinatin wa-inna allaaha lasamii'un 'aliimun","translate":{"id":"(Yaitu di hari) ketika kamu berada di pinggir lembah yang dekat dan mereka berada di pinggir lembah yang jauh sedang kafilah itu berada di bawah kamu . Sekiranya kamu mengadakan persetujuan (untuk menentukan hari pertempuran), pastilah kamu tidak sependapat dalam menentukan hari pertempuran itu, akan tetapi (Allah mempertemukan dua pasukan itu) agar Dia melakukan suatu urusan yang mesti dilaksanakan , yaitu agar orang yang binasa itu binasanya dengan keterangan yang nyata dan agar orang yang hidup itu hidupnya dengan keterangan yang nyata (pula) . Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui,\n","en":"[Remember that day] when you were at the near end of the valley [of Badr], and they were at its farthest end, while the caravan was below you. And if you had known that a battle was to take place, you would indeed have refused to accept the challenge: but [the battle was brought about none the less,] so that God might accomplish a thing [which He willed] to be done, [and] that he who would perish might perish in clear evidence of the truth, and that he who would remain alive might live in clear evidence of the truth. And, behold, God is indeed all-hearing, all-knowing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1202","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1202.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1202.mp3"]}},{"no":43,"arab":"إِذْ يُرِيكَهُمُ اللَّهُ فِي مَنَامِكَ قَلِيلًا ۖ وَلَوْ أَرَاكَهُمْ كَثِيرًا لَفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِي الْأَمْرِ وَلَٰكِنَّ اللَّهَ سَلَّمَ ۗ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ","latin":"idz yuriikahumu allaahu fii manaamika qaliilan walaw araakahum katsiiran lafasyiltum walatanaaza'tum fii al-amri walaakinna allaaha sallama innahu 'aliimun bidzaati alshshuduuri","translate":{"id":"(yaitu) ketika Allah menampakkan mereka kepadamu di dalam mimpimu (berjumlah) sedikit. Dan sekiranya Allah memperlihatkan mereka kepada kamu (berjumlah) banyak tentu saja kamu menjadi gentar dan tentu saja kamu akan berbantah-bantahan dalam urusan itu, akan tetapi Allah telah menyelamatkan kamu. Sesungguhnya Allah Maha Mengetahui segala isi hati.\n","en":"Lo! God showed them to thee in a dream as few: for, had He shown them to you as many, you would surely have lost heart, and would surely have disagreed with one another about what to do. But God saved [you from this]: verily, He has full knowledge of what is the hearts [of men]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1203","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1203.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1203.mp3"]}},{"no":44,"arab":"وَإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ فِي أَعْيُنِكُمْ قَلِيلًا وَيُقَلِّلُكُمْ فِي أَعْيُنِهِمْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولًا ۗ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ","latin":"wa-idz yuriikumuuhum idzi iltaqaytum fii a'yunikum qaliilan wayuqallilukum fii a'yunihim liyaqdhiya allaahu amran kaana maf'uulan wa-ilaa allaahi turja'u al-umuuru","translate":{"id":"Dan ketika Allah menampakkan mereka kepada kamu sekalian, ketika kamu berjumpa dengan mereka berjumlah sedikit pada penglihatan matamu dan kamu ditampakkan-Nya berjumlah sedikit pada penglihatan mata mereka, karena Allah hendak melakukan suatu urusan yang mesti dilaksanakan. Dan hanyalah kepada Allahlah dikembalikan segala urusan.\n","en":"And so, when you met in battle, He made them appear as few in your eyes -just as He made you appear as of little account in their eyes - so that God might accomplish a thing [which He willed] to be done: for all things go back to God [as their source]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1204","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1204.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1204.mp3"]}},{"no":45,"arab":"يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُوا وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ","latin":"yaa ayyuhaa alladziina aamanuu idzaa laqiitum fi-atan fautsbutuu waudzkuruu allaaha katsiiran la'allakum tuflihuuna","translate":{"id":"Hai orang-orang yang beriman. apabila kamu memerangi pasukan (musuh), maka berteguh hatilah kamu dan sebutlah (nama) Allah sebanyak-banyaknya agar kamu beruntung.\n","en":"[Hence,] O you who have attained to faith, when you meet a host in battle, be firm, and remember God often; so that you might attain to a happy state!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1205","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1205.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1205.mp3"]}},{"no":46,"arab":"وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ","latin":"wa-athii'uu allaaha warasuulahu walaa tanaaza'uu fatafsyaluu watadzhaba riihukum waishbiruu inna allaaha ma'a alshshaabiriina","translate":{"id":"Dan ta'atlah kepada Allah dan Rasul-Nya dan janganlah kamu berbantah-bantahan, yang menyebabkan kamu menjadi gentar dan hilang kekuatanmu dan bersabarlah. Sesungguhnya Allah beserta orang-orang yang sabar.\n","en":"And pay heed unto God and His Apostle, and do not [allow yourselves to] be at variance with one another, lest you lose heart and your moral strength desert you. And be patient in adversity: for, verily, God is with those who are patient in adversity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1206","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1206.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1206.mp3"]}},{"no":47,"arab":"وَلَا تَكُونُوا كَالَّذِينَ خَرَجُوا مِنْ دِيَارِهِمْ بَطَرًا وَرِئَاءَ النَّاسِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ ۚ وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ","latin":"walaa takuunuu kaalladziina kharajuu min diyaarihim batharan wari-aa-a alnnaasi wayashudduuna 'an sabiili allaahi waallaahu bimaa ya'maluuna muhiithun","translate":{"id":"Dan janganlah kamu menjadi seperti orang-orang yang keluar dari kampungnya dengan rasa angkuh dan dengan maksud riya' kepada manusia serta menghalangi (orang) dari jalan Allah. Dan (ilmu) Allah meliputi apa yang mereka kerjakan.\n","en":"And be not like those [unbelievers] who went forth from their homelands full of self-conceit and a desire to be seen and praised by men for they were trying to turn others away from the path of God -the while God encompassed all their doings [with His might]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1207","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1207.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1207.mp3"]}},{"no":48,"arab":"وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَكُمْ ۖ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِنِّي بَرِيءٌ مِنْكُمْ إِنِّي أَرَىٰ مَا لَا تَرَوْنَ إِنِّي أَخَافُ اللَّهَ ۚ وَاللَّهُ شَدِيدُ الْعِقَابِ","latin":"wa-idz zayyana lahumu alsysyaythaanu a'maalahum waqaala laa ghaaliba lakumu alyawma mina alnnaasi wa-innii jaarun lakum falammaa taraa-ati alfi-ataani nakasha 'alaa 'aqibayhi waqaala innii barii-un minkum innii araa maa laa tarawna innii akhaafu allaaha waallaahu syadiidu al'iqaabi","translate":{"id":"Dan ketika syaitan menjadikan mereka memandang baik pekerjaan mereka dan mengatakan: \"Tidak ada seorang manusiapun yang dapat menang terhadapmu pada hari ini, dan sesungguhnya saya ini adalah pelindungmu\". Maka tatkala kedua pasukan itu telah dapat saling lihat melihat (berhadapan), syaitan itu balik ke belakang seraya berkata: \"Sesungguhnya saya berlepas diri daripada kamu, sesungguhnya saya dapat melihat apa yang kamu sekalian tidak dapat melihat; sesungguhnya saya takut kepada Allah\". Dan Allah sangat keras siksa-Nya.\n","en":"And, lo, Satan made all their doings seem goodly to them, and said, \"No one can overcome you this day, for, behold, I shall be your protector!\" but as soon as the two hosts came within sight of one another, he turned on his heels and said, \"Behold, I am not responsible for you: behold, I see something that you do not see: behold, I fear God-for God is severe in retribution!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1208","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1208.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1208.mp3"]}},{"no":49,"arab":"إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ غَرَّ هَٰؤُلَاءِ دِينُهُمْ ۗ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ","latin":"idz yaquulu almunaafiquuna waalladziina fii quluubihim maradhun gharra haaulaa-i diinuhum waman yatawakkal 'alaa allaahi fa-inna allaaha 'aziizun hakiimun","translate":{"id":"(Ingatlah), ketika orang-orang munafik dan orang-orang yang ada penyakit di dalam hatinya berkata: \"Mereka itu (orang-orang mu'min) ditipu oleh agamanya\". (Allah berfirman): \"Barang-siapa yang bertawakkal kepada Allah, maka sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana\".\n","en":"At the same time, the hypocrites and those in whose hearts was disease were saying, \"Their faith has deluded these [believers]!\" But he who places his trust in God [knows that], verily, God is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1209","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1209.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1209.mp3"]}},{"no":50,"arab":"وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا ۙ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُوا عَذَابَ الْحَرِيقِ","latin":"walaw taraa idz yatawaffaa alladziina kafaruu almalaa-ikatu yadhribuuna wujuuhahum wa-adbaarahum wadzuuquu 'adzaaba alhariiqi","translate":{"id":"Kalau kamu melihat ketika para malaikat mencabut jiwa orang-orang yang kafir seraya memukul muka dan belakang mereka (dan berkata) : \"Rasakanlah olehmu siksa neraka yang membakar\", (tentulah kamu akan merasa ngeri).\n","en":"AND IF thou couldst but see [how it will be] when He causes those who are bent on denying the truth to die: the angels will strike their faces: and their backs, and [will say]: \"Taste suffering through fire"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1210","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1210.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1210.mp3"]}},{"no":51,"arab":"ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ","latin":"dzaalika bimaa qaddamat aydiikum wa-anna allaaha laysa bizhallaamin lil'abiidi","translate":{"id":"Demikian itu disebabkan oleh perbuatan tanganmu sendiri. Sesungguhnya Allah sekali-kali tidak menganiaya hamba-Nya,\n","en":"in return for what your own hands have wrought - for, never does God do the least wrong to His creatures!\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1211","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1211.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1211.mp3"]}},{"no":52,"arab":"كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ","latin":"kada/bi aali fir'awna waalladziina min qablihim kafaruu bi-aayaati allaahi fa-akhadzahumu allaahu bidzunuubihim inna allaaha qawiyyun syadiidu al'iqaabi","translate":{"id":"(keadaan mereka) serupa dengan keadaan Fir'aun dan pengikut-pengikutnya serta orang-orang yang sebelumnya. Mereka mengingkari ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Sesungguhnya Allah Maha Kuat lagi amat keras siksaan-Nya.\n","en":"[To them shall happen.] the like of what happened to Pharaoh's people and those who lived before them: they denied the truth of God's messagesand so God took them to task for their sins. Verily, God is powerful, severe in retribution!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1212","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1212.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1212.mp3"]}},{"no":53,"arab":"ذَٰلِكَ بِأَنَّ اللَّهَ لَمْ يَكُ مُغَيِّرًا نِعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۙ وَأَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","latin":"dzaalika bi-anna allaaha lam yaku mughayyiran ni'matan an'amahaa 'alaa qawmin hattaa yughayyiruu maa bi-anfusihim wa-anna allaaha samii'un 'aliimun","translate":{"id":"(Siksaan) yang demikian itu adalah karena sesungguhnya Allah sekali-kali tidak akan merubah sesuatu ni'mat yang telah dianugerahkan-Nya kepada suatu kaum, hingga kaum itu merubah apa-apa yang ada pada diri mereka sendiri , dan sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui.\n","en":"This, because God would never change the blessings with which He has graced a people unless they change their inner selves: and [know] that God is all-hearing, all-seeing."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1213","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1213.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1213.mp3"]}},{"no":54,"arab":"كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَذَّبُوا بِآيَاتِ رَبِّهِمْ فَأَهْلَكْنَاهُمْ بِذُنُوبِهِمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ ۚ وَكُلٌّ كَانُوا ظَالِمِينَ","latin":"kada/bi aali fir'awna waalladziina min qablihim kadzdzabuu bi-aayaati rabbihim fa-ahlaknaahum bidzunuubihim wa-aghraqnaa aala fir'awna wakullun kaanuu zhaalimiina","translate":{"id":"(keadaan mereka) serupa dengan keadaan Fir'aun dan pengikut-pengikutnya serta orang-orang yang sebelumnya. Mereka mendustakan ayat-ayat Tuhannya maka Kami membinasakan mereka disebabkan dosa-dosanya dan Kami tenggelamkan Fir'aun dan pengikut-pengikutnya; dan kesemuanya adalah orang-orang yang zalim.\n","en":"[To those sinners shall happen] the like of what happened to Pharaoh's people and those who lived before them: they gave the lie to their Sustainer's messages - and so We destroyed them in return for their sins, and caused Pharaoh's people to drown: for they were evildoers all."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1214","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1214.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1214.mp3"]}},{"no":55,"arab":"إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الَّذِينَ كَفَرُوا فَهُمْ لَا يُؤْمِنُونَ","latin":"inna syarra alddawaabbi 'inda allaahi alladziina kafaruu fahum laa yu/minuuna","translate":{"id":"Sesungguhnya binatang (makhluk) yang paling buruk di sisi Allah ialah orang-orang yang kafir, karena mereka itu tidak beriman.\n","en":"Verily, the vilest creatures in the sight of God are those who are bent on denying the truth and therefore do not believe."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1215","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1215.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1215.mp3"]}},{"no":56,"arab":"الَّذِينَ عَاهَدْتَ مِنْهُمْ ثُمَّ يَنْقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لَا يَتَّقُونَ","latin":"alladziina 'aahadta minhum tsumma yanqudhuuna 'ahdahum fii kulli marratin wahum laa yattaquuna","translate":{"id":"(Yaitu) orang-orang yang kamu telah mengambil perjanjian dari mereka, sesudah itu mereka mengkhianati janjinya pada setiap kalinya, dan mereka tidak takut (akibat-akibatnya).\n","en":"AS FOR THOSE with whom thou hast made a covenant, and who thereupon break their covenant on every occasion, not being conscious of God-"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1216","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1216.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1216.mp3"]}},{"no":57,"arab":"فَإِمَّا تَثْقَفَنَّهُمْ فِي الْحَرْبِ فَشَرِّدْ بِهِمْ مَنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّرُونَ","latin":"fa-immaa tatsqafannahum fii alharbi fasyarrid bihim man khalfahum la'allahum yadzdzakkaruuna","translate":{"id":"Jika kamu menemui mereka dalam peperangan, maka cerai beraikanlah orang-orang yang di belakang mereka dengan (menumpas) mereka, supaya mereka mengambil pelajaran.\n","en":"if thou find them at war [with you], make of them a fearsome example for those who follow them, so that they might take it to heart;"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1217","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1217.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1217.mp3"]}},{"no":58,"arab":"وَإِمَّا تَخَافَنَّ مِنْ قَوْمٍ خِيَانَةً فَانْبِذْ إِلَيْهِمْ عَلَىٰ سَوَاءٍ ۚ إِنَّ اللَّهَ لَا يُحِبُّ الْخَائِنِينَ","latin":"wa-immaa takhaafanna min qawmin khiyaanatan fainbidz ilayhim 'alaa sawa-in inna allaaha laa yuhibbu alkhaa-iniina","translate":{"id":"Dan jika kamu khawatir akan (terjadinya) pengkhianatan dari suatu golongan, maka kembalikanlah perjanjian itu kepada mereka dengan cara yang jujur. Sesungguhnya Allah tidak menyukai orang-orang yang berkhianat.\n","en":"or, if thou hast reason to fear treachery from people [with whom thou hast made a covenant], cast it back at them in an equitable manner: for, verily, God does not love the treacherous!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1218","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1218.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1218.mp3"]}},{"no":59,"arab":"وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا سَبَقُوا ۚ إِنَّهُمْ لَا يُعْجِزُونَ","latin":"walaa yahsabanna alladziina kafaruu sabaquu innahum laa yu'jizuuna","translate":{"id":"Dan janganlah orang-orang yang kafir itu mengira, bahwa mereka akan dapat lolos (dari kekuasaan Allah). Sesungguhnya mereka tidak dapat melemahkan (Allah).\n","en":"And let them not think - those who are bent on denying the truth -that they shall escapee [God]: behold, they can never frustrate [His purpose]."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1219","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1219.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1219.mp3"]}},{"no":60,"arab":"وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ وَآخَرِينَ مِنْ دُونِهِمْ لَا تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ ۚ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنْتُمْ لَا تُظْلَمُونَ","latin":"wa-a'idduu lahum maa istatha'tum min quwwatin wamin ribaathi alkhayli turhibuuna bihi 'aduwwa allaahi wa'aduwwakum waaakhariina min duunihim laa ta'lamuunahumu allaahu ya'lamuhum wamaa tunfiquu min syay-in fii sabiili allaahi yuwaffa ilaykum wa-antum laa tuzhlamuuna","translate":{"id":"Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi dan dari kuda-kuda yang ditambat untuk berperang (yang dengan persiapan itu) kamu menggentarkan musuh Allah dan musuhmu dan orang orang selain mereka yang kamu tidak mengetahuinya; sedang Allah mengetahuinya. Apa saja yang kamu nafkahkan pada jalan Allah niscaya akan dibalasi dengan cukup kepadamu dan kamu tidak akan dianiaya (dirugikan).\n","en":"Hence, make ready against them whatever force and war mounts you are able to muster, so that you might deter thereby the enemies of God, who are your enemies as well, and others besides them of whom you may be unaware, [but] of whom God is aware; and whatever you may expend in God's cause shall be repaid to you in full, and you shall not be wronged."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1220","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1220.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1220.mp3"]}},{"no":61,"arab":"وَإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","latin":"wa-in janahuu lilssalmi faijnah lahaa watawakkal 'alaa allaahi innahu huwa alssamii'u al'aliimu","translate":{"id":"Dan jika mereka condong kepada perdamaian, maka condonglah kepadanya dan bertawakkallah kepada Allah. Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui.\n","en":"But if they incline to peace, incline thou to it as well, and place thy trust in God: verily, He alone is all-hearing, all-knowing!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1221","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1221.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1221.mp3"]}},{"no":62,"arab":"وَإِنْ يُرِيدُوا أَنْ يَخْدَعُوكَ فَإِنَّ حَسْبَكَ اللَّهُ ۚ هُوَ الَّذِي أَيَّدَكَ بِنَصْرِهِ وَبِالْمُؤْمِنِينَ","latin":"wa-in yuriiduu an yakhda'uuka fa-inna hasbaka allaahu huwa alladzii ayyadaka binashrihi wabialmu/miniina","translate":{"id":"Dan jika mereka bermaksud menipumu, maka sesungguhnya cukuplah Allah (menjadi pelindungmu). Dialah yang memperkuatmu dengan pertolongan-Nya dan dengan para mu'min,\n","en":"And should they seek but to deceive thee [by their show of peace] - behold, God is enough for thee! He it is who has strengthened thee with His succour, and by giving thee believing followers"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1222","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1222.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1222.mp3"]}},{"no":63,"arab":"وَأَلَّفَ بَيْنَ قُلُوبِهِمْ ۚ لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ وَلَٰكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ ۚ إِنَّهُ عَزِيزٌ حَكِيمٌ","latin":"wa-allafa bayna quluubihim law anfaqta maa fii al-ardhi jamii'an maa allafta bayna quluubihim walaakinna allaaha allafa baynahum innahu 'aziizun hakiimun","translate":{"id":"dan Yang mempersatukan hati mereka (orang-orang yang beriman) . Walaupun kamu membelanjakan semua (kekayaan) yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka, akan tetapi Allah telah mempersatukan hati mereka. Sesungguhnya Dia Maha Gagah lagi Maha Bijaksana.\n","en":"whose hearts He has brought together: [for,] if thou hadst expended all that is on earth, thou couldst not have brought their hearts together [by thyself]: but God did bring them together. Verily, He is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1223","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1223.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1223.mp3"]}},{"no":64,"arab":"يَا أَيُّهَا النَّبِيُّ حَسْبُكَ اللَّهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ","latin":"yaa ayyuhaa alnnabiyyu hasbuka allaahu wamani ittaba'aka mina almu/miniina","translate":{"id":"Hai Nabi, cukuplah Allah (menjadi Pelindung) bagimu dan bagi orang-orang mu'min yang mengikutimu.\n","en":"O Prophet! God is enough for thee and those of the believers who follow thee!"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1224","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1224.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1224.mp3"]}},{"no":65,"arab":"يَا أَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ ۚ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ يَغْلِبُوا أَلْفًا مِنَ الَّذِينَ كَفَرُوا بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ","latin":"yaa ayyuhaa alnnabiyyu harridhi almu/miniina 'alaa alqitaali in yakun minkum 'isyruuna shaabiruuna yaghlibuu mi-atayni wa-in yakun minkum mi-atun yaghlibuu alfan mina alladziina kafaruu bi-annahum qawmun laa yafqahuuna","translate":{"id":"Hai Nabi, kobarkanlah semangat para mu'min untuk berperang. Jika ada dua puluh orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan dua ratus orang musuh. Dan jika ada seratus orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan seribu dari pada orang kafir, disebabkan orang-orang kafir itu kaum yang tidak mengerti. ","en":"O Prophet! Inspire the believers to conquer all fear of death when fighting, [so that,] if there be twenty of you who are patient in adversity, they might overcome two hundred; and [that,] if there be one hundred of you, they might overcome one thousand of those who are bent on denying the truth, because they are people who cannot grasp it."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1225","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1225.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1225.mp3"]}},{"no":66,"arab":"الْآنَ خَفَّفَ اللَّهُ عَنْكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضَعْفًا ۚ فَإِنْ يَكُنْ مِنْكُمْ مِائَةٌ صَابِرَةٌ يَغْلِبُوا مِائَتَيْنِ ۚ وَإِنْ يَكُنْ مِنْكُمْ أَلْفٌ يَغْلِبُوا أَلْفَيْنِ بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ","latin":"al-aana khaffafa allaahu 'ankum wa'alima anna fiikum dha'fan fa-in yakun minkum mi-atun shaabiratun yaghlibuu mi-atayni wa-in yakun minkum alfun yaghlibuu alfayni bi-idzni allaahi waallaahu ma'a alshshaabiriina","translate":{"id":"Sekarang Allah telah meringankan kepadamu dan dia telah mengetahui bahwa padamu ada kelemahan. Maka jika ada diantaramu seratus orang yang sabar, niscaya mereka akan dapat mengalahkan dua ratus orang kafir; dan jika diantaramu ada seribu orang (yang sabar), niscaya mereka akan dapat mengalahkan dua ribu orang, dengan seizin Allah. Dan Allah beserta orang-orang yang sabar.\n","en":"For the time being, [however,] God has lightened your burden. for He knows that you are weak: and so, if there be one hundred of you who are patient in adversity, they should [be able to]' overcome two hundred; and if there be one thousand of you, they should [be able to] overcome two thousand by God's leave: for God is with those who are patient in adversity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1226","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1226.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1226.mp3"]}},{"no":67,"arab":"مَا كَانَ لِنَبِيٍّ أَنْ يَكُونَ لَهُ أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِي الْأَرْضِ ۚ تُرِيدُونَ عَرَضَ الدُّنْيَا وَاللَّهُ يُرِيدُ الْآخِرَةَ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ","latin":"maa kaana linabiyyin an yakuuna lahu asraa hattaa yutskhina fii al-ardhi turiiduuna 'aradha alddunyaa waallaahu yuriidu al-aakhirata waallaahu 'aziizun hakiimun","translate":{"id":"Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi. Kamu menghendaki harta benda duniawiyah sedangkan Allah menghendaki (pahala) akhirat (untukmu). Dan Allah Maha Perkasa lagi Maha Bijaksana.\n","en":"IT DOES NOT behove a prophet to keep captives unless he has battled strenuously on earth. You may desire the fleeting gains of this world-but God desires [for you the good of] the life to come: and God is almighty, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1227","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1227.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1227.mp3"]}},{"no":68,"arab":"لَوْلَا كِتَابٌ مِنَ اللَّهِ سَبَقَ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ عَذَابٌ عَظِيمٌ","latin":"lawlaa kitaabun mina allaahi sabaqa lamassakum fiimaa akhadztum 'adzaabun 'azhiimun","translate":{"id":"Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah, niscaya kamu ditimpa siksaan yang besar karena tebusan yang kamu ambil.\n","en":"Had it not been for a decree from God that had already gone forth, there would indeed have befallen you a tremendous chastisement on account of all [the captives] that you took."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1228","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1228.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1228.mp3"]}},{"no":69,"arab":"فَكُلُوا مِمَّا غَنِمْتُمْ حَلَالًا طَيِّبًا ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","latin":"fakuluu mimmaa ghanimtum halaalan thayyiban waittaquu allaaha inna allaaha ghafuurun rahiimun","translate":{"id":"Maka makanlah dari sebagian rampasan perang yang telah kamu ambil itu, sebagai makanan yang halal lagi baik, dan bertakwalah kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\n","en":"Enjoy, then, all that is lawful and good among the things which you have gained in war, and remain conscious of God: verily, God is much-forgiving, a dispenser of grace."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1229","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1229.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1229.mp3"]}},{"no":70,"arab":"يَا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرَىٰ إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ","latin":"yaa ayyuhaa alnnabiyyu qul liman fii aydiikum mina al-asraa in ya'lami allaahu fii quluubikum khayran yu/tikum khayran mimmaa ukhidza minkum wayaghfir lakum waallaahu ghafuurun rahiimun","translate":{"id":"Hai Nabi, katakanlah kepada tawanan-tawanan yang ada di tanganmu: \"Jika Allah mengetahui ada kebaikan dalam hatimu, niscaya Dia akan memberikan kepadamu yang lebih baik dari apa yang telah diambil daripadamu dan Dia akan mengampuni kamu\". Dan Allah Maha Pengampun lagi Maha Penyayang.\n","en":"[Hence,] O Prophet, say unto the captives who are in your hands: \"If God finds any good in your hearts, He will give you something better than all that has been taken from you, and will forgive you your sins: for God is much-forgiving, a dispenser of grace.\""},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1230","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1230.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1230.mp3"]}},{"no":71,"arab":"وَإِنْ يُرِيدُوا خِيَانَتَكَ فَقَدْ خَانُوا اللَّهَ مِنْ قَبْلُ فَأَمْكَنَ مِنْهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","latin":"wa-in yuriiduu khiyaanataka faqad khaanuu allaaha min qablu fa-amkana minhum waallaahu 'aliimun hakiimun","translate":{"id":"Akan tetapi jika mereka (tawanan-tawanan itu) bermaksud hendak berkhianat kepadamu, maka sesungguhnya mereka telah berkhianat kepada Allah sebelum ini, lalu Allah menjadikan(mu) berkuasa terhadap mereka. Dan ALlah Maha Mengetahui lagi Maha Bijaksana.\n","en":"And should they but seek to play false with thee -well, they were false to God [Himself] ere this: but He gave [the believers] mastery over them. And God is all-knowing, wise."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1231","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1231.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1231.mp3"]}},{"no":72,"arab":"إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا مَا لَكُمْ مِنْ وَلَايَتِهِمْ مِنْ شَيْءٍ حَتَّىٰ يُهَاجِرُوا ۚ وَإِنِ اسْتَنْصَرُوكُمْ فِي الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلَّا عَلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ","latin":"inna alladziina aamanuu wahaajaruu wajaahaduu bi-amwaalihim wa-anfusihim fii sabiili allaahi waalladziina aawaw wanasharuu ulaa-ika ba'dhuhum awliyaau ba'dhin waalladziina aamanuu walam yuhaajiruu maa lakum min walaayatihim min syay-in hattaa yuhaajiruu wa-ini istansharuukum fii alddiini fa'alaykumu alnnashru illaa 'alaa qawmin baynakum wabaynahum miitsaaqun waallaahu bimaa ta'maluuna bashiirun","translate":{"id":"Sesungguhnya orang-orang yang beriman dan berhijrah serta berjihad dengan harta dan jiwanya pada jalan Allah dan orang-orang yang memberikan tempat kediaman dan pertoIongan (kepada orang-orang muhajirin), mereka itu satu sama lain lindung-melindungi . Dan (terhadap) orang-orang yang beriman, tetapi belum berhijrah, maka tidak ada kewajiban sedikitpun atasmu melindungi mereka, sebelum mereka berhijrah. (Akan tetapi) jika mereka meminta pertolongan kepadamu dalam (urusan pembelaan) agama, maka kamu wajib memberikan pertolongan kecuali terhadap kaum yang telah ada perjanjian antara kamu dengan mereka. Dan Allah Maha Melihat apa yang kamu kerjakan.\n","en":"BEHOLD, as for those who have attained to faith, and who have forsaken the domain of evil and are striving hard, with their possessions and their lives, in God's cause, as well as those who shelter and succour [them] - these are [truly] the friends and protectors of one another. But as for those who have come to believe without having migrated [to your country] - you are in no wise responsible for their protection until such a time as they migrate [to you]. Yet, if they ask you for succour against religious persecution, it is your duty to give [them] this succour-except against a people between whom and yourselves there is a covenant: for God sees all that you do."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1232","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1232.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1232.mp3"]}},{"no":73,"arab":"وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ إِلَّا تَفْعَلُوهُ تَكُنْ فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ كَبِيرٌ","latin":"waalladziina kafaruu ba'dhuhum awliyaau ba'dhin illaa taf'aluuhu takun fitnatun fii al-ardhi wafasaadun kabiirun","translate":{"id":"Adapun orang-orang yang kafir, sebagian mereka menjadi pelindung bagi sebagian yang lain. Jika kamu (hai para muslimin) tidak melaksanakan apa yang telah diperintahkan Allah itu , niscaya akan terjadi kekacauan di muka bumi dan kerusakan yang besar.\n","en":"With all this, [remember that] those who are bent on denying the truth are allies of one another; and unless you act likewise [among yourselves], oppression will reign on earth, and great corruption."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1233","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1233.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1233.mp3"]}},{"no":74,"arab":"وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ","latin":"waalladziina aamanuu wahaajaruu wajaahaduu fii sabiili allaahi waalladziina aawaw wanasharuu ulaa-ika humu almu/minuuna haqqan lahum maghfiratun warizqun kariimun","translate":{"id":"Dan orang-orang yang beriman dan berhijrah serta berjihad pada jalan Allah, dan orang-orang yang memberi tempat kediaman dan memberi pertolongan (kepada orang-orang muhajirin), mereka itulah orang-orang yang benar-benar beriman. Mereka memperoleh ampunan dan rezki (ni'mat) yang mulia.\n","en":"And they who have attained to faith, and who have forsaken the domain of evil and are striving hard in God's cause, as well as those who shelter and succour [them]-it is they, they who are truly believers! Forgiveness of sins awaits them, and a most excellent sustenance."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1234","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1234.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1234.mp3"]}},{"no":75,"arab":"وَالَّذِينَ آمَنُوا مِنْ بَعْدُ وَهَاجَرُوا وَجَاهَدُوا مَعَكُمْ فَأُولَٰئِكَ مِنْكُمْ ۚ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ ۗ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","latin":"waalladziina aamanuu min ba'du wahaajaruu wajaahaduu ma'akum faulaa-ika minkum wauluu al-arhaami ba'dhuhum awlaa biba'dhin fii kitaabi allaahi inna allaaha bikulli syay-in 'aliimun","translate":{"id":"Dan orang-orang yang beriman sesudah itu kemudian berhijrah serta berjihad bersamamu maka orang-orang itu termasuk golonganmu (juga). Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) di dalam kitab Allah. Sesungguhnya Allah Maha Mengetahui segala sesuatu.\n","en":"And as for those who henceforth come to believe, and who forsake the domain of evil and strive hard [in God's cause] together with you - these [too] shall belong to you; and they who are [thus] closely related have the highest claim on one another in [accordance with] God's decree. Verily, God has full knowledge of everything."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1235","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/1235.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/1235.mp3"]}}]}