{"alquran":{"no":98,"name":"Al-Bayyina","arab":"البينة","start":6130,"count":8,"rukku":1,"type":"medina","description":"Surat Al Bayyinah terdiri atas 8 ayat, termasuk golongan surat-surat Madaniyyah, diturunkan sesudah surat Ath Thalaq. Dinamai <i>Al Bayyinah</i> (bukti yang nyata) diambil dari perkataan <i>Al Bayyinah</i> yang terdapat pada ayat pertama surat ini."},"surah":[{"no":1,"arab":" لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ","latin":"lam yakuni alladziina kafaruu min ahli alkitaabi waalmusyrikiina munfakkiina hattaa ta/tiyahumu albayyinatu","translate":{"id":"Orang-orang kafir yakni ahli Kitab dan orang-orang musyrik (mengatakan bahwa mereka) tidak akan meninggalkan (agamanya) sebelum datang kepada mereka bukti yang nyata,\n","en":"IT IS NOT [conceivable] that such as are bent on denying the truth - [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God should ever be abandoned [by Him] ere there comes unto them the [full] evidence of the truth:"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6131","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6131.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6131.mp3"]}},{"no":2,"arab":"رَسُولٌ مِنَ اللَّهِ يَتْلُو صُحُفًا مُطَهَّرَةً","latin":"rasuulun mina allaahi yatluu shuhufan muthahharatan","translate":{"id":"(yaitu) seorang Rasul dari Allah (Muhammad) yang membacakan lembaran-lembaran yang disucikan (Al Qur'an),\n","en":"an apostle from God, conveying [unto them] revelations blest with purity,"},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6132","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6132.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6132.mp3"]}},{"no":3,"arab":"فِيهَا كُتُبٌ قَيِّمَةٌ","latin":"fiihaa kutubun qayyimatun","translate":{"id":"di dalamnya terdapat (isi) Kitab-kitab yang lurus .\n","en":"wherein there are ordinances of ever-true soundness and clarity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6133","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6133.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6133.mp3"]}},{"no":4,"arab":"وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ","latin":"wamaa tafarraqa alladziina uutuu alkitaaba illaa min ba'di maa jaa-at-humu albayyinatu","translate":{"id":"Dan tidaklah berpecah belah orang-orang yang didatangkan Al Kitab (kepada mereka) melainkan sesudah datang kepada mereka bukti yang nyata.\n","en":"Now those who have been vouchsafed revelation aforetime did break up their unity [of faith] after such an evidence of the truth had come to them."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6134","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6134.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6134.mp3"]}},{"no":5,"arab":"وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ","latin":"wamaa umiruu illaa liya'buduu allaaha mukhlishiina lahu alddiina hunafaa-a wayuqiimuu alshshalaata wayu/tuu alzzakaata wadzaalika diinu alqayyimati","translate":{"id":"Padahal mereka tidak disuruh kecuali supaya menyembah Allah dengan memurnikan keta'atan kepada-Nya dalam (menjalankan) agama yang lurus , dan supaya mereka mendirikan shalat dan menunaikan zakat; dan yang demikian itulah agama yang lurus.\n","en":"And withal, they were not enjoined aught but that they should worship God, sincere in their faith in Him alone, turning away from all that is false; and that they should be constant in prayer; and that they should spend in charity: for this is a moral law endowed with ever-true soundness and clarity."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6135","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6135.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6135.mp3"]}},{"no":6,"arab":"إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ","latin":"inna alladziina kafaruu min ahli alkitaabi waalmusyrikiina fii naari jahannama khaalidiina fiihaa ulaa-ika hum syarru albariyyati","translate":{"id":"Sesungguhnya orang-orang yang kafir yakni ahli Kitab dan orang-orang yang musyrik (akan masuk) ke neraka Jahannam; mereka kekal di dalamnya. Mereka itu adalah seburuk-buruk makhluk.\n","en":"Verily, those who [despite all evidence] are bent on denying the truth - [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God - will find themselves in the fire of hell, therein to abide: they are the worst of all creatures."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6136","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6136.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6136.mp3"]}},{"no":7,"arab":"إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ","latin":"inna alladziina aamanuu wa'amiluu alshshaalihaati ulaa-ika hum khayru albariyyati","translate":{"id":"Sesungguhnya orang-orang yang beriman dan mengerjakan amal saleh, mereka itu adalah sebaik-baik makhluk.\n","en":"[And,] verily, those who have attained to faith, and do righteous deeds - it is they, they who are the best of all creatures."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6137","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6137.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6137.mp3"]}},{"no":8,"arab":"جَزَاؤُهُمْ عِنْدَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ","latin":"jazaauhum 'inda rabbihim jannaatu 'adnin tajrii min tahtihaa al-anhaaru khaalidiina fiihaa abadan radhiya allaahu 'anhum waradhuu 'anhu dzaalika liman khasyiya rabbahu","translate":{"id":"Balasan mereka di sisi Tuhan mereka ialah syurga 'Adn yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Allah ridha terhadap mereka dan merekapun ridha kepadaNya. Yang demikian itu adalah (balasan) bagi orang yang takut kepada Tuhannya.\n","en":"Their reward [awaits them] with God: gardens of perpetual bliss, through which running waters flow, therein to abide beyond the count of time; well-pleased is God with them, and well-pleased are they with Him: all this awaits him who of his Sustainer stands in awe!."},"audio":{"primary":"https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6138","secondary":["https://cdn.islamic.network/quran/audio/128/ar.alafasy/6138.mp3","https://cdn.islamic.network/quran/audio/64/ar.alafasy/6138.mp3"]}}]}